[
  {
    "source": "https://cs.sfsu.edu/graduate-certificates",
    "category": "graduate",
    "title": "Graduate Certificates | Department of Computer Science",
    "content": "Apply\nRequest Info\nGraduate Certificates\nWe welcome applications from current enrolled SF State graduate students (domestic and international) and non-enrolled post-baccalaureate domestic students interested in Software Engineering and Ethical Artificial Intelligence Graduate Certificates.\nApplications are due by\nFebruary 1, 2025 for Fall\nadmission unless the academic department requires an earlier deadline.\nTwo Graduate Certificates Options\nEthical Artificial Intelligence\nStudents in the Certificate Program will be guided and advised by the Supervisory Committee comprising faculty from SF State’s programs in Computer Science, Business and Philosophy, and these programs’ graduate advisors.\nArtificial Intelligence (AI) is becoming an integral technology in many areas (medicine, health, autonomous driving cars, business, loan approvals, law enforcement, distribution of government and health services, news filtering, etc.) and is often considered the driving force of a 4th technological revolution.\nAcademic Bulletin: AI\nRead more Ethical AI\nThe impact of AI is expanding rapidly, but due to its complexity it offers challenges to ensuring proper, ethical, unbiased and transparent operations. This is evidenced by increasing reporting on the use and misuse of AI in government and media, and calls for greater scrutiny and oversight. Skills related to ethical use of AI will be more and more important for both developers and users of AI technology.\nTo address these needs, SF State’s Computer Science Department, College of Business and Philosophy Department established a multi-College Graduate Certificate in Ethical AI. Our approach to this certificate is unique in its multidisciplinary and multi-College nature, which involves three critical areas necessary to understanding this subject, as outlined below. Students must take one course from each of these three areas (total of 9 units) and also complete a self reflection research paper (1 unit):\nAI Technologies and Applications\n: courses in this core area focus on algorithmic and technical principles of AI and can be selected to fit the background of graduate students from Computer Science, Business or Philosophy.\nEthics and Compliance in Business\n: focus on integrity, understanding and applying managerial ethical decision-making; understanding regulatory compliance as it relates to organizational functions; developing ethics training, and evaluating stakeholder impacts.\nEthics Principles\n: courses on the ethical, political, and social ramifications of current and emerging uses of AI.\nSelf-reflection Research Paper\n: the certificate program requires a culminating research paper to demonstrate student self-reflection on specific issues in AI ethics. Students take a 1-unit independent study in conjunction with this course, to be supervised by one of the faculty advisors (see below for a list of advisors).\nSince the Certificate has multiple overlapping courses with current MS, MBA and MA programs in Computer Science, Management, and Philosophy, our matriculated graduate students can easily complete the Certificate with minimal overhead. This certificate is also designed to fit the needs of professionals from industry who can use it to continue their education and gain an additional credential that will be appealing to employers who are concerned about being good stewards of AI and responsibly managing their business practices as more regulation and public scrutiny of AI comes to pass.\nAI Contacts\nPlease contact one of the following faculty in the AI Certificate Supervisory Committee:\nProfessor Denise Kleinrichert\n, College of Business, SF State. Expertise in business ethics, corporate social responsibility, risk management, and environmental sustainability has been at SF State since 2007.\nProfessor Carlos Montemayor\n,\nPhilosophy Department, SF State. Expertise in philosophy of mind, cognitive science, philosophy of psychology and epistemology has been at SF State since 2009.\nProfessor Dragutin Petkovic\n, CS Department, SF State, IEEE Life fellow. Expertise in AI, Usability and SW Engineering. Twenty years of industry experience has been at SF State since 2003.\nAll are available to respond to inquiries, but it is best to contact the faculty whose field of research most closely aligns with your background and interests.\nSoftware Engineering\nWe are witnessing ever increasing demand for CS graduates in multiple industries worldwide. Successful professionals in computing-related industries must attain and continuously update skills in Software Engineering (SE) in order to have successful careers.\nThe Graduate Certificate in SE is an opportunity to meet the critical needs of matriculated as well as non-matriculated students in attaining and updating highly sought-after skills for their success in their careers as software (SW) engineers.\nAcademic Bulletin: Software Engineering\nRead more Software Engineering\nSince the Certificate has multiple overlapping courses with SF State’s current MS in CS program, students in the program can easily complete the Certificate with minimal overhead, and gain an additional credential to showcase their Software Engineering skills.\nProfessionals from industry can efficiently continue their software education and gain additional credentials by completing the Certificate.\nHere are the basis for the three core areas of our Graduate Certificate in SW Engineering:\nStudents will be able to complete the SE Certificate in 2 to 3 semesters. Courses in each group in the certificate are offered regularly by the CS Department.\nStudents in the certificate program will be guided/advised by the Supervisory Committee, and the Computer Science Department’s graduate advisors.\nBoth matriculated and non-matriculated students can apply for this certificate provided they have adequate qualifications as described in application process.\nOn completion of this certificate, students will attain skills in three categories:\nBasic SW systems and technologies (large SW development, cloud computing, WWW engineering, mobile technologies, distributed and large scale systems etc.)\nSE modern processes covering the full SE lifecycle (Agile, SCRUM, User Centered Design, SE teamwork and organization etc.)\nExposure to modern SE applications and technologies\nThe three core areas covered in this certificate are:\nCore requirements\nfocusing on SE best practices, teamwork and organization (two courses, 6 units)\nCore options\nfocusing on important SE applications and technologies (one course, 3 units)\nElectives\nincluding a number of SE related courses (one course, 3 units)\nSoftware Engineering Contacts\nPlease contact one of the following faculty in the Software Engineering Supervisory Committee:\nProfessor Dragutin Petkovic\nhas industry and startup experience in media content management, SW Engineering and usability. Current research in SW engineering, ML and AI explainability. IEEE Life Fellow.\nProfessor Isabel Hyo Jung Song\nhas a long-term industry-scale software engineering experience. Her research interest includes large-scale software engineering, agile management, software engineering & entrepreneurship.\nProfessor Jozo Dujmovic\nworks in the area of quantitative models of software performance. His research is focused on development of benchmark program generators, workload characterization models, benchmark design, performance measurement, and models for evaluation and comparison of software products.\nAll are available to respond to inquiries, but it is best to contact the faculty whose field of research most closely aligns with your background and interests.\nHow to Apply\nEligibility Processing\nCertificate Award\nApplying for Certificate Award\nIn consultation with your faculty mentor and upon completion of certificate requirements, you must apply for award of the graduate certificate in Software Engineering. To apply for award, you must submit a\nCertificate Approved Program (CAP) form\nto the\nDivision of Graduate Studies\nand submit a $7.00 processing fee to the Bursar's Office.\nVisit the academic bulletin for more information about SF State Certificate programs, including the application process.\nAcademic Bulletin: Certificate Award\nEnrolled Domestic & Intentional Graduate Students\nCurrent enrolled domestic and intentional graduate students at SF State follow these steps:\nDownload the Application Form\nFollow the Instructions on the Form.\nObtain the signature by your chosen Graduate Certificate Coordinator.\nBring the package to the\nSF State Division of Graduate Studies\n(Administration Building, Room 250).\nDomestic Not Enrolled Students\nDomestic not enrolled students process:\nFirst you must have an account with Cal State. Secondly, apply to the graduate certificate.\nOnce you are logged into your account follow these steps.\nVisit your\nextended profile.\nUnder\ndegree goal\n, select\ncertificate.\nChoose the Graduate Certificate you wish to apply for\nClick\nsave\n.\nPlease note, as part of the Cal State Apply application, applicants are required to include:\nUnofficial transcripts\nStatement of Interest\nCurrent CV/Resume\nPreferred Faculty Member whose field of research most closely aligns with your background and interests\nCreate an Account Cal State\nStudent Opportunities\nFunding\nResearch\nResearch Labs\nCS Colloquium",
    "url": "https://cs.sfsu.edu/graduate-certificates"
  },
  {
    "source": "https://cs.sfsu.edu/event/graduate-seminar-iterative-join-graph-propagation",
    "category": "graduate",
    "title": "Graduate Seminar: Iterative Join-Graph Propagation | Department of Computer Science",
    "content": "Graduate Seminar: Iterative Join-Graph Propagation\nMonday, February 12, 2024\nEvent Time\n01:00 p.m.   -  02:00 p.m.\nPT\nCost\nLocation\nZOOM\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nGraphical models are a central research topic in Artificial Intelligence and Machine Learning. We introduce Iterative Join-Graph Propagation (IJGP), a parameterized approximate message-passing scheme. Built upon the principles of bounded inference, notably the mini-clustering algorithm, and Pearl’s belief propagation algorithm (BP), IJGP emerges as a novel approach within the framework of Generalized Belief Propagation algorithms. This framework establishes connections with approximate algorithms from statistical physics, and also facilitates connections to iterative decoding algorithms in information theory. Empirical evaluations demonstrate that IJGP surpasses both mini-clustering and belief propagation, along with several other state-of-the-art algorithms, across various classes of networks. Additionally, we provide insights into the accuracy of iterative BP and IJGP by drawing connections to well-known classes of constraint propagation schemes.\nSpeaker Biography\nRobert Mateescu is a Senior Principal Researcher at Western Digital and an Adjunct Faculty in Computer Science at San Francisco State University, currently teaching Deep Learning. He conducts research in artificial intelligence and machine learning, algorithm design, information theory and distributed systems. He received the B.Sc. in Mathematics and Computer Science from the University of Bucharest, Romania, and the M.S. and Ph.D. degrees in Information and Computer Science from the University of California, Irvine. Dr. Mateescu has extensive academic and industrial research experience, including a postdoc at Caltech, working at Microsoft Research in Cambridge, UK, working in the Research Lab of Hitachi Global Storage Technologies, and in the Research Lab of Western Digital and SanDisk. He is a Senior Member of IEEE, has published over 40 papers and holds 38 US patents. His papers were recognized in journals and conferences, including winning the 2009 IEEE Communications Society best paper award in Signal Processing and Coding for Data Storage, the 2016 IEEE International Conference on Communications best paper award, the 2016-2017 IEEE Data Storage best student paper award, and the 2020 Persistent Impact Prize in the Non-Volatile Memories Workshop. Beyond his professional endeavors, Robert is passionate about the game of Go, has studied as an apprentice professional Go player in Japan, and held the title of European Go Champion.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/graduate-seminar-iterative-join-graph-propagation"
  },
  {
    "source": "https://cs.sfsu.edu/event/graduate-seminar-computational-approaches-understanding-perception-and-brain",
    "category": "graduate",
    "title": "Graduate Seminar: Computational Approaches to Understanding Perception and the Brain | Department of Computer Science",
    "content": "Graduate Seminar: Computational Approaches to Understanding Perception and the Brain\nWednesday, November 15, 2023\nEvent Time\n05:00 p.m.   -  06:00 p.m.\nPT\nCost\nLocation\nHensill Hall 439\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nEvery person carries a data science laboratory in their head. Your brain parses incoming sensory information, discovers meaningful patterns between inputs, and directs purposeful action using its 3-pound, 12-Watt hardware. In this talk, I will cover some introductory topics in the field of cognitive computational neuroscience, in which computational methods intersect with cognitive science, neuroscience, and experimental psychology techniques. Using examples from my own and other labs' work, we will explore a range of methods, including computer vision to analyze movement and multivariate pattern analysis techniques to \"decode\" and interpret brain activity data. Beyond pattern classification, we'll also discuss how artificial neural network models are advancing mechanistic accounts of brain processing and addressing deeper \"why\" questions of neural structure and function.\nSpeaker Biography\nSantani Teng is PI of the Cognition, Action, and Neural Dynamics Laboratory at Smith-Kettlewell Eye Research Institute in San Francisco. Santani received his B.A. in psychology from UC Davis and his Ph.D. in psychology from UC Berkeley, studying the perceptual abilities of blind echolocation practitioners. He conducted postdoctoral work on neural mechanisms of auditory and tactile processing at MIT's Computational Perception and Cognition Laboratory before pursuing a fellowship at SKERI. Established in February 2020, Santani's lab investigates auditory and visual perception, neuroplasticity, haptics, echolocation, and assisted mobility, especially when vision is unavailable. A combination of psychophysical, neurophysiological, engineering, and computational tools are brought to bear on these topics to understand and improve human perception and mobility. Current projects focus on haptic sensing and processing in blind braille readers, as well as the use of reverberation and active echolocation to aid perception and mobility.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/graduate-seminar-computational-approaches-understanding-perception-and-brain"
  },
  {
    "source": "https://cs.sfsu.edu/event/graduate-seminar-graded-logic-ai-applications",
    "category": "graduate",
    "title": "Graduate Seminar: Graded Logic for AI Applications | Department of Computer Science",
    "content": "Graduate Seminar: Graded Logic for AI Applications\nWednesday, November 08, 2023\nEvent Time\n11:00 a.m.   -  12:00 p.m.\nPT\nCost\nLocation\nThornton Hall 331\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nGraded logic is a logic of natural human reasoning and decision-making. It is developed for AI applications in the area of decision-support systems. If we want that machines can make decisions in a way similar to humans, then we must first understand the properties of human natural logic reasoning. That is the goal of Graded logic. Human reasoning is observable, measurable, modellable, and explainable. Based on observations and experiments with human subjects, Graded Logic includes unique mathematical models of graded propositional calculus. That is the essential component of the LSP method for evaluation, optimization, comparison and selection of complex objects and alternatives. Based on this methodology  we present applications in computational intelligence, in several decision-making areas, and discuss opportunities for further research, development, and industrial applications.\nBiography of Speaker\nJozo Dujmović received the Dipl. Ing. degree in electronic and telecommunication engineering, and the M.Sc. and Sc.D. degrees in computer engineering, all from the University of Belgrade, Serbia. Since 1994 he has been Professor of Computer Science at San Francisco State University, where he served as Chair of Computer Science Department from 1998 to 2002. His permanent research interest is in logic foundations of soft computing and in decision support systems. In 1973 he introduced the graded logic concepts of andness and orness and graded logic aggregators based on continuous transition from conjunction to disjunction. He used these concepts to develop the Logic Scoring of Preference (LSP) method for evaluation, selection, and optimization of complex systems, as well as the complete LSP decision support software. He is the author of more than 190 refereed publications, a Life Senior Member of IEEE, and the recipient of NAFIPS, CMG, Informatica, and ETAN best paper awards. His most recent book Soft Computing Evaluation Logic was published by Wiley and IEEE Press in 2018. His industrial experience includes R&D work in the Institute “M. Pupin” in Belgrade, and consulting in the areas of soft computing decision methods, performance evaluation, and software design. He is a founder and principal of SEAS (seas.com), a company specializing in soft computing decision methods and software support for the LSP method.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/graduate-seminar-graded-logic-ai-applications"
  },
  {
    "source": "https://cs.sfsu.edu/event/graduate-seminar-global-investigation-network-connection-tampering",
    "category": "graduate",
    "title": "Graduate Seminar: Global Investigation of Network Connection Tampering | Department of Computer Science",
    "content": "Graduate Seminar: Global Investigation of Network Connection Tampering\nWednesday, February 14, 2024\nEvent Time\n12:30 p.m.   -  01:30 p.m.\nPT\nCost\nLocation\nZOOM\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nAs the Internet's user base and criticality of online services continue to expand daily, powerful adversaries like Internet censors are increasingly monitoring and restricting Internet traffic. These adversaries, powered by advanced network technology, perform large-scale connection tampering attacks seeking to prevent users from accessing specific online content, compromising Internet availability and integrity. In recent years, we have witnessed recurring censorship events affecting Internet users globally, with far-reaching social, financial, and psychological consequences, making them important to study. However, characterizing tampering attacks at the global scale is an extremely challenging problem, given intentionally opaque practices by adversaries, varying tampering mechanisms and policies across networks, evolving environments, sparse ground truth, and safety risks in collecting data.\nIn this talk, I will describe my research on building empirical methods to characterize connection tampering globally and investigate the network technology enabling tampering. First, I will introduce novel network measurement methods for locating and examining network devices that perform censorship. Next, I will describe a modular design for the Censored Planet Observatory that enables it to remotely and sustainably measure Internet censorship longitudinally in more than 200 countries. I will introduce time series analysis methods to detect key censorship events in longitudinal Censored Planet data, and reveal global censorship trends. Finally, I will describe exciting ongoing and future research directions, such as building intelligent measurement platforms.\nSpeaker Biography\nRam Sundara Raman is a PhD candidate in Computer Science and Engineering at the University of Michigan, advised by Prof. Roya Ensafi. His research lies in the intersection of computer security, privacy, and networking, employing empirical methods to study large-scale Internet attacks. Ram has been recognized as a Rising Star at the Workshop on Free and Open Communications on the Internet (FOCI), and was awarded the IRTF Applied Networking Research Prize in 2023. His work has helped produce one of the biggest active censorship measurement platforms, the Censored Planet Observatory, and has helped prevent large-scale attacks on end-to-end encryption.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/graduate-seminar-global-investigation-network-connection-tampering"
  },
  {
    "source": "https://cs.sfsu.edu/grads/graduate-program",
    "category": "graduate",
    "title": "Graduate Program | Department of Computer Science",
    "content": "Graduate Program\nThe Master of Science in Computer Science prepares students for a wide variety of careers in computing or related industries as well as for advanced study toward Ph.D. degrees.\nFaculty will work closely with students to ensure they are successful in the program and they meet their academic goals.\nVisit the academic bulletin to learn more about our programs\nMaster of Science in Computer Science\nMaster of Science in Data Science and AI\nGraduate Certificate in Software Engineering\nGraduate Certificate in Ethical Artificial Intelligence\nInterested in Software Engineering and Ethical Artificial Intelligence Graduate Certificates? Visit the graduate certificate page to learn more about the certificate award program.\nGraduate Certificates\nGraduate Opportunities\nResearch\nStudents work with industry leaders and partnering Universities on research projects.\nLearn More: Research\nCS Colloquium\nStudents get to meet researchers and industry and high tech leaders from all around the bay area.\nLearn More: CS Colloquium\nJob Opportunities\nStudents have many opportunities to work with some of the bay area top innovative leaders.\nLearn More: Jobs\nDive Deeper into Computer Science with Independent Study\nAre you passionate about a specific area of computer science and want to explore more in depth? Our Independent Study program, CSC 899, offers you the unique opportunity to delve into a topic that interests you under the guidance of a faculty mentor.\nWhat is Independent Study?\nAn independent study is a learning course where students conduct research under the guidance of a faculty mentor. It’s designed to delve deeper into a specific topic not typically covered in regular coursework, with a focus on academic research and the goal of gaining a profound understanding of the chosen subject. Students may engage in reading, conducting experiments, writing papers, or completing other assignments that demonstrate their mastery of the material. An Independent Study must be taken for 3 units.\nHow it works:\nFind a Mentor:\nConnect with a faculty member whose research aligns with your interests and discuss your proposed study.\nComplete the Form:\nDownload the\nindependent study form here\nand fill it out with your mentor's approval.\nSubmit for Approval:\nOnce completed, submit the signed form to the CS Department.\nEnroll:\nAsk your mentor to issue you a permit for their CSC 899 course.\n*This course can only be taken once.\nFor current graduate students:\nYou will work with your master’s thesis/project mentor to enroll in CSC 897/899 for background work on your Thesis/Project. Please check Canvas for further instructions on enrolling in 899.\nCSC 899 Information",
    "url": "https://cs.sfsu.edu/grads/graduate-program"
  },
  {
    "source": "https://cs.sfsu.edu/event/graduate-seminar-safe-and-reliable-ai",
    "category": "graduate",
    "title": "Graduate Seminar: Safe and Reliable AI | Department of Computer Science",
    "content": "Graduate Seminar: Safe and Reliable AI\nWednesday, February 21, 2024\nEvent Time\n01:00 p.m.   -  02:00 p.m.\nPT\nCost\nLocation\nZOOM\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nArtificial Intelligence is everywhere around us, bringing convenience and transforming how we interact with the world. As AI technologies become more integrated into our daily lives and critical sectors, from smart healthcare systems to unmanned aerial vehicles (UAVs), the importance of their security, accuracy, and privacy cannot be overstated. In this talk, Dr. Chen will give an overview of her research offering valuable insights into designing AI algorithms that prioritize these aspects, ensuring the safe and reliable deployment of AI across various applications. Through her work, Dr. Chen addresses the challenges of implementing AI in various areas, providing solutions that protect user's sensitive data while maintaining the high performance of AI systems.\nSpeaker Biography\nXuhui (Tracy) Chen is currently an Assistant Professor in the College of Aeronautics and Engineering at Kent State University, while serving as a lead faculty for Computer Engineering Technology and Cybersecurity Engineering programs. Dr. Chen received her Ph.D. degree in Computer Engineering from Case Western Reserve University in 2019 and received her M.S. degree in Electrical and Computer Engineering from Mississippi State University in 2015. She received her B.E. degree in information engineering from Xidian University, Xi'an, China, in 2012. Dr. Chen’s research interests include Artificial Intelligence and Bioinformatics, specifically, addressing the security and privacy in distributed machine learning, with applications in bioinformatics, Blockchain, and cyber-physical systems (UAV, IoT, and power systems), and education research, such as utilizing AI-generated Content (AIGC) tools to address bias and belonging issues. Her research has been funded by federal programs, industry, and universities totaling over $640,000, and her research works resulted in over 25 peer-reviewed articles in leading journals and conferences with over 1,100 citations.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/graduate-seminar-safe-and-reliable-ai"
  }
]