[
  {
    "source": "https://bulletin.sfsu.edu/courses/eths/",
    "category": "courses",
    "title": "Ethnic Studies (ETHS) | San Francisco State University Bulletin",
    "content": "Ethnic Studies (ETHS)\nExplanation of Course Descriptions, Symbols, and Terms\nETHS 100  Introduction to Ethnic Studies (Units: 3)\nHistory, objectives, and philosophy of Ethnic Studies as a political project and academic field. The relational examination of communities of color/indigenous nations and their experiences with structures of power and traditions of resistance. [CSL may be available]\n(This course is offered as\nETHS 100\nand\nRRS 100\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n4: Social/Behavioral Sciences\nD1: Social Sciences\nAm. Ethnic & Racial Minorities\nGlobal Perspectives\nSocial Justice\nETHS 101  First Year Experience in Ethnic Studies (Units: 3)\nFoundations of intellectual, academic, and career preparation for majors and minors in the College of Ethnic Studies.\nETHS 102  Basic Achievement Techniques (Units: 3)\nPrerequisite: Concurrent enrollment in another specified course may be required.\nExamination and application of basic skills development among diverse students. Use of appropriate strategies and methods to support the intellectual and spiritual advancement of the student. May be repeated for a total of 6 units. (ABC/NC grading; CR/NC allowed)\nETHS 110  Critical Thinking and the Ethnic Studies Experience (Units: 3)\nBasic skills involved in understanding, criticizing, and constructing arguments by using materials reflective of experiences of Indigenous and racialized groups in the U.S.\n(This course is offered as\nETHS 110\nand\nRRS 110\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n1B: Critical Thinking\nA3: Critical Thinking\nAm. Ethnic & Racial Minorities\nETHS 115  Introduction to Craft, Activism, and Resistance in Communities of Color (Units: 3)\nIntroduction to craftwork by communities of color that engages with the politics of representation. Engage in hands-on crafting while learning about the histories of activism in communities of color.\nETHS 116  Algebra and Statistics for Social Justice (Units: 4)\nPrerequisite: First-year math advising module.\nUsing topics such as education equity, income inequality, racism, and white supremacy and gender inequality to examine data using statistics. Statistical concepts covered include but are not limited to: organization of data, sample surveys, measures of central tendency and dispersion, probability distributions, normal approximations, and statistical inference. Includes a one-unit algebra supplemental component. [Formerly A U 116]\nCourse Attributes:\n2: MATH/Quantitative Reason\nB4: Math/QR\nSocial Justice\nETHS 117  Statistics for Social Justice (Units: 3)\nPrerequisite: First-Year Math Advising Module. Students who elect to take additional support should concurrently enroll in\nETHS 116\n.\nUsing topics such as education equity, income inequality, racism, and white supremacy and gender inequality to examine data using statistics. Statistical concepts covered include but are not limited to: organization of data, sample surveys, measures of central tendency and dispersion, probability distributions, normal approximations, and statistical inference. [Formerly A U 117]\nCourse Attributes:\n2: MATH/Quantitative Reason\nB4: Math/QR\nSocial Justice\nETHS 120  Educational Justice, Health Equity, and Academic Success (Units: 3)\nFocus on educational justice, public health, and social justice. General education skills -- writing, oral communication, critical thinking, and quantitative reasoning -- will be systematically reinforced. [Formerly PH 120/\nETHS 120\n, H ED 120/A U 120]\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nAm. Ethnic & Racial Minorities\nGlobal Perspectives\nSocial Justice\nETHS 221  Health and Social Justice - Burning Issues, Taking Action (Units: 3)\nSocial and economic injustices as root causes of the uneven distribution of disease. Current health issues, the process for influencing policy, and the skills to effectively advocate for health and social justice.\n(This course is offered as\nPH 221\n[Formerly H ED 221] and\nETHS 221\n[Formerly A U 221]. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n4: Social/Behavioral Sciences\nD1: Social Sciences\nAm. Ethnic & Racial Minorities\nSocial Justice\nETHS 241  Health and Social Movements in the United States in the 20th Century (Units: 3)\nExamination of history during the 20th century with a special emphasis on health and social justice issues. Focus on the main historical periods and events, with a lens of the \"people's history narrative\" that brings out voices historically silenced.\n(This course is offered as\nPH 241\n[Formerly H ED 241] and\nETHS 241\n[Formerly A U 241]. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\nU.S. History\n4: Social/Behavioral Sciences\nD2: Social Sciences: US Hist.\nAm. Ethnic & Racial Minorities\nSocial Justice\nETHS 300GW  Writing in Ethnic Studies - GWAR (Units: 3)\nPrerequisites: Asian American Studies, American Indian Studies, Africana Studies, and Latina/Latino Studies majors; GE Area 1A/A2.\nFoundations of writing in the disciplines of Ethnic Studies: Africana Studies, American Indian Studies, Asian American Studies, and Latina/Latino Studies. Draws on the behavioral and social sciences, the humanities, and the creative arts to prepare students for advanced work in Ethnic Studies, and careers requiring breadth and depth of knowledge. (ABC/NC grading only)\nCourse Attributes:\nGraduation Writing Assessment\nETHS 499  Culminating Experience Continuous Enrollment (Unit: 0)\nETHS 500  Introduction to Race, Ethnicity, and Health (Units: 3)\nPrerequisite: Upper-division standing or permission of the instructor.\nExplore the critical health issues affecting racial and ethnic groups in the US. Examine ways in which the health status of these populations is rooted in the socio-cultural, political, economic, and environmental influences of US society.\nCourse Attributes:\n6: Ethnic Studies\nGE-F: Ethnic Studies\nAm. Ethnic & Racial Minorities\nSocial Justice\nETHS 570  Senior Capstone for Race, Ethnicity, and Health (Units: 3)\nPrerequisite: Restricted to senior Race, Ethnicity, and Health majors.\nSynthesis and integration of coursework in Race, Ethnicity, and Health. Application of concepts through an individual and/or collaborative senior project. Possible projects include research papers, portfolios, or presentations. May include work with community organizations.\nETHS 580  Senior Capstone for Online Degree in Ethnic Studies (Units: 3)\nPrerequisite: Restricted to senior Ethnic Studies online majors.\nSynthesis and integration of coursework in the Ethnic Studies online program. Application of concepts through an individual and/or collaborative senior project. Possible projects can include research papers, portfolios, or presentations. May include work with community organizations.\nETHS 647  Understanding Health Disparities Among Underserved Communities (Units: 3)\nPrerequisite: Restricted to upper-division Race, Ethnicity, and Community Health majors or permission of the instructor.\nAn introduction to understanding health disparities in underserved communities. Emphasis on breast cancer, diabetes, tuberculosis, hepatitis, and hypertension and the socioeconomic, behavioral, biological, environmental, and cultural impact of the disease. Focus on understanding the clinical aspects as well as the psychosocial impact upon patients in communities of color.\nETHS 675  Variable Topics in Ethnic Studies (Units: 3)\nPrerequisite: Upper-division standing or permission of the instructor.\nExamination of variable issues and topic in ethnic studies. Topics to be specified in the Class Schedule. May be repeated when topics vary for a total of 9 units.\nETHS 685  Projects in the Teaching of Ethnic Studies (Units: 1-4)\nPrerequisites: Upper-division standing and permission of the instructor.\nAcademic service-learning practicum/internship experience as an undergraduate instructional aide. Participation in the teaching of a regular instructionally-related class. Limited to undergraduate students only. (Students may earn a maximum of 4 units toward the baccalaureate degree for any course(s) numbered 685 regardless of discipline.)\nETHS 697  Field Research or Internship in Ethnic Studies (Units: 1-3)\nPrerequisite: Permission of the instructor*.\nDevelopment of research methodology of Third World societies in the U.S. Gathering materials through non-written sources such as artifacts, oral evidence, and participation-observation. May be repeated for a total of 6 units with departmental approval. [CSL may be available]\nETHS 699  Independent Study (Units: 1-3)\nPrerequisite: Permission of the adviser, instructor, and program coordinator.\nSupervised individual study of a particular inter-ethnic problem in ethnic studies. May be repeated for a total of 6 units.\nETHS 710  Theories and Issues in Ethnic Studies (Units: 3)\nPrerequisites: Restricted to graduate Ethnic Studies students and permission of the instructor.\nConcepts and theories in ethnic studies. Identifies, analyzes, and critically reviews American history and the experiences of people of color.\nETHS 711  Topics in Ethnic Studies (Units: 3)\nPrerequisite: Restricted to graduate Ethnic Studies students or permission of the instructor.\nExamine major currents and theories in Ethnic Studies. Topics to be specified in the Class Schedule. May be repeated when topics vary.\nTopics:\nArab and Muslim Ethnicities and Diasporas Studies\nCritical Mixed Race Studies\nCritical Pacific Islands and Oceania Studies\nQueer Ethnic Studies\nEthnic Studies Pedagogy\nETHS 720  Research Methods in Ethnic Studies (Units: 3)\nPrerequisites: A basic statistics course and permission of the instructor.\nResearch methods pertaining to African Americans, Asian Americans, Latinos/Latinas, and American Indians in Third World critical perspective: a research proposal, data collection analysis, interpretation, and statistical summarization. Includes examples from the Third World experience.\nETHS 750  Ethnic Studies Community Practicum (Units: 3)\nPrerequisite: Permission of the instructor.\nPhilosophies, strategies, and methods in community studies. Evaluation of alternatives in terms of issues facing Third World communities. Internship in a community-based agency or organization. Seminar, 2 units; activity, 1 unit.\nETHS 820  Advanced Research Seminar in Ethnic Studies (Units: 3)\nPrerequisite:\nETHS 720\nor permission of instructor.\nSeminar on advanced research in ethnic studies. Key elements in developing a research or creative work project.\nETHS 885  Graduate Projects in the Teaching of Ethnic Studies (Units: 3)\nPrerequisites: Restricted to graduate Ethnic Studies students and permission of the instructor.\nAcademic service-learning practicum/internship experience as an undergraduate instructional aide. Participation in the teaching of a regular instructionally related class.\nETHS 895  Field Study (Units: 3)\nPrerequisites: Permission of the instructor and graduate major advisor; approval of Advancement to Candidacy (ATC) and Culminating Experience (CE) forms by Graduate Studies prior to registration.\n(CR/NC, RP grading only)\nETHS 896  Directed Reading in Ethnic Studies (Units: 3)\nPrerequisites: Restricted to graduate Ethnic Studies students and permission of the adviser.\nIntensive directed reading in ethnic studies under the supervision of a faculty member.\nETHS 898  Master's Thesis (Units: 3)\nPrerequisites: Advancement to Candidacy (ATC) and approval of graduate major adviser. ATC and Proposal for Culminating Experience Requirement forms must be approved by the Graduate Division before registration.\n(CR/NC grading only)\nETHS 899  Independent Study (Units: 1-3)\nPrerequisite: Permission of the graduate coordinator and supervising faculty member. Enrollment by petition and limited to graduate students in the program.\nIndividual research into an issue in Ethnic Studies.",
    "url": "https://bulletin.sfsu.edu/courses/eths/"
  },
  {
    "source": "https://bulletin.sfsu.edu/courses/phys/",
    "category": "courses",
    "title": "Physics (PHYS) | San Francisco State University Bulletin",
    "content": "Physics (PHYS)\nExplanation of Course Descriptions, Symbols, and Terms\nPHYS 101  Conceptual Physics (Units: 3)\nPrerequisite: Category I or II placement for QR/Math, or GE Area 2/B4, or\nMATH 197\n.\nConceptual introduction to Newton's Laws of Motion, properties of matter and energy, heat, sound, light, electricity, magnetism, and atoms.\nCourse Attributes:\n5A: Physical Science\nB1: Physical Science\nPHYS 102  Conceptual Physics Laboratory (Unit: 1)\nPrerequisite: Concurrent enrollment in\nPHYS 101\n.\nLaboratory exercises in basic physics.\nCourse Attributes:\n5C: Laboratory\nB3: Lab Science\nPHYS 111  General Physics I (Units: 3)\nPrerequisites:\nMATH 198\nor\nMATH 199\nor equivalent with a grade of C-minus or higher. Concurrent enrollment in\nPHYS 112\nrequired. If pre-calculus was completed in high school, the online Math Preparation for Physics mini-course is required; see the Department of Physics & Astronomy website for details.\nIntroduction to mechanics, waves, sound, fluids, thermodynamics, with applications to biology, life, and health sciences.\nCourse Attributes:\n5A: Physical Science\nB1: Physical Science\nPHYS 112  General Physics I Laboratory (Unit: 1)\nPrerequisite: Concurrent enrollment in\nPHYS 111\n.\nMechanics, heat, and sound. Extra fee required.\nCourse Attributes:\n5C: Laboratory\nB3: Lab Science\nPHYS 121  General Physics II (Units: 3)\nPrerequisites:\nPHYS 111\nwith a grade of C- or better; concurrent enrollment in\nPHYS 122\n.\nIntroduction to electricity, magnetism, light, optics, atoms, and quantum mechanics, with applications to biology, life, and health sciences.\nPHYS 122  General Physics II Laboratory (Unit: 1)\nPrerequisite: Concurrent enrollment in\nPHYS 121\n.\nLight, electricity, magnetism, atoms, and modern physics. Extra fee required.\nPHYS 200  Planning for Success as a Physics & Astronomy Major (Unit: 1)\nPrerequisite: Restricted to Physics & Astronomy majors & minors.\nIntroduction to the resources and opportunities available to Physics & Astronomy majors at SF State.  Discusses resources for research, scholarships and internships, guidelines for professional conduct, programming, scientific writing, academic integrity, advising, and more. Set goals and develop a plan for completing the degree. (CR/NC grading only)\nPHYS 220  General Physics with Calculus I (Units: 3)\nPrerequisites:\nMATH 226\nwith a grade of C or better; concurrent enrollment in\nPHYS 222\n; concurrent enrollment in\nMATH 227\nrecommended.\nIntroduction to classical mechanics, including vectors, kinematics in one & two dimensions, Newton's Laws of Motion, force & acceleration, linear momentum & impulse, work & kinetic energy, potential energy & conservation of energy, elastic & inelastic collisions, torque & angular momentum, static equilibrium, fixed-axis rotational dynamics, oscillatory motion, gravitation & planetary motion.\nCourse Attributes:\n5A: Physical Science\nB1: Physical Science\nPHYS 222  General Physics with Calculus I Laboratory (Unit: 1)\nPrerequisite: Concurrent enrollment in\nPHYS 220\n.\nExperiments in mechanics. Extra fee required.\nCourse Attributes:\n5C: Laboratory\nB3: Lab Science\nPHYS 230  General Physics with Calculus II (Units: 3)\nPrerequisites:\nPHYS 220\nand\nMATH 227\nwith grades of C or better; concurrent enrollment in\nPHYS 232\n; concurrent enrollment in\nMATH 228\nrecommended.\nIntroduction to electricity and magnetism, including electric charge and Coulomb's Law, electric field and Gauss's Law, electric potential and electrical potential energy, capacitance, current and resistance, DC circuits, magnetic force and magnetic field, Biot-Savart Law and Ampere's Law, electromagnetic induction and Faraday's Law, inductance, RLC circuits and AC circuits, electromagnetic waves, and Maxwell's equations.\nPHYS 232  General Physics with Calculus II Laboratory (Unit: 1)\nPrerequisite: Concurrent enrollment in\nPHYS 230\n.\nExperiments in electricity and magnetism. Extra fee required.\nPHYS 240  General Physics with Calculus III (Units: 3)\nPrerequisites:\nPHYS 220\nand\nMATH 227\nwith grades of C or better; concurrent enrollment in\nPHYS 242\n; concurrent enrollment in\nMATH 228\nrecommended.\nIntroduction to thermodynamics & kinetic theory, properties of solids, liquids & gasses, mechanical waves & sound, electromagnetic waves, geometric optics, interference & diffraction, wave-particle duality & quantum mechanics.\nPHYS 242  General Physics with Calculus III Laboratory (Unit: 1)\nPrerequisite: Concurrent enrollment in\nPHYS 240\n.\nExperiments in wave motion, optics, and thermodynamics.\nPHYS 305  Physical and Astronomical Approaches to Climate Change Solutions (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, 2/B4*, and 5A/B1 all with grades of C- or better or permission of the instructor.\nAn investigation of solutions and adaptations to global warming and climate change. Discussions of Earth's energy budget and the interplay between Earth's surface, its atmosphere, the Sun, and human civilization. An introduction to technical solutions related to electricity generation, transportation, heating and cooling, manufacturing, and agriculture. Discussions of geoengineering and the ethical and physical consequences, as well as the impossibility of leaving Earth and traveling to a Planet B to escape climate change. Emphasis on developing personal and community-based action plans for the future. Designed for non-science majors.\nCourse Attributes:\n5UD: Science\nUD-B: Physical Life Science\nEnv. Sustain. & Climate Action\nPHYS 320  Modern Physics I (Units: 3)\nPrerequisites:\nMATH 228\n,\nPHYS 230\n, and\nPHYS 240\nwith grades of C or better;\nMATH 245\nor\nMATH 376\nwith a grade of C or better (may be taken concurrently).\nIntroduction to special relativity and quantum mechanics, including blackbody radiation, photoelectric effect, Compton effect, Bohr model of the hydrogen atom, wave-particle duality, wavefunctions, Heisenberg uncertainty principle, Schrödinger equation, one-dimensional potentials.\nPHYS 321  Modern Physics Laboratory (Units: 2)\nPrerequisite: Concurrent enrollment in\nPHYS 320\n.\nExperiments on quantum physics and other phenomena of modern physics. Methods of data and error analysis. Classwork, 1 unit; laboratory, 1 unit.\nPHYS 325  Modern Physics II (Units: 3)\nPrerequisite:\nPHYS 320\nwith a grade of C- or better.\nPhysics of multi-electron atoms including L and S coupling schemes and optical spectra; elementary concepts of nuclear and elementary particle  physics; use of four-vectors to analyze particle collisions and decays.\nPHYS 330  Analytical Mechanics I (Units: 3)\nPrerequisites:\nPHYS 230\n,\nPHYS 240\n, and\nMATH 228\n, and either\nMATH 245\nor both\nMATH 225\n&\nMATH 376\n, all completed with grades of C or better;\nMATH 376\n(may be taken concurrently).\nIntermediate course in classical mechanics, including kinematics, particle dynamics, work & energy, linear & angular momentum, calculus of variations, Lagrangian dynamics, central force motion.\nPHYS 360  Electricity and Magnetism I (Units: 3)\nPrerequisites:\nMATH 245\nor\nMATH 376\n;\nPHYS 385\n; with grades of C- or better.\nIntermediate course in electricity & magnetism, including electrostatics, electric fields in matter, magnetostatics, magnetic fields in matter.\nPHYS 370  Thermodynamics and Statistical Mechanics (Units: 3)\nPrerequisite:\nPHYS 320\nwith a grade of C- or better.\nClassical thermodynamics, kinetic theory, and elementary statistical mechanics. Applications may include quantum statistics, black-body radiation, paramagnetic spin systems, and low-temperature phenomena.\nPHYS 385  Introduction to Theoretical Physics I (Units: 3)\nPrerequisites:\nPHYS 230\n,\nPHYS 240\n, and\nMATH 228\nwith grades of C or better; and\nMATH 245\nor\nMATH 376\nwith a grade of C or better (may be taken concurrently).\nPrinciples of applied mathematics and theoretical physics, including vectors & vector spaces; matrices, rotations & tensors; Fourier series & Fourier transforms; vector calculus. Applications to classical mechanics, electricity & magnetism, optics, fluid dynamics, heat transfer, relativity, quantum mechanics.\nPHYS 430  Quantum Mechanics I (Units: 3)\nPrerequisites:\nPHYS 320\nand\nPHYS 360\nwith grades of C- or better.\nIntroductory course on quantum theory, including wave-particle duality, Schrödinger equation, Heisenberg Uncertainty Principle, Hilbert spaces & Hermitian operators, one-dimensional potentials, angular momentum, and the hydrogen atom.\nPHYS 431  Quantum Mechanics II (Units: 3)\nPrerequisite:\nPHYS 430\nwith a grade of C- or better.\nProblems in three dimensions, matrix mechanics, spin, application to atomic and molecular physics, perturbation theory, and scattering.\nPHYS 440  Computational Physics (Units: 3)\nPrerequisite for\nPHYS 740\n: Graduate standing or permission of the instructor.\nPrerequisites for\nPHYS 440\n:\nCSC 309\nor\nMATH 209\n;\nMATH 245\nor\nMATH 376\n; and\nPHYS 320\n, all with grades of C- or better; overall GPA of at least 3.0 or permission of the instructor.\nAnalysis and development of numerical algorithms with a focus on computer simulations of physical systems. Topics may include: finite difference methods for nonlinear ordinary differential equations and chaos theory, N-body gravitational systems and molecular dynamics; numerical linear algebra; Fast Fourier Transforms, finite difference and spectral methods for partial differential equations; Monte Carlo methods for integration, Markov chains, statistical mechanics and spin systems; introduction to parallel programming. Lecture, 2 units; laboratory, 1 unit.\n(\nPHYS 740\n/\nPHYS 440\nis a paired course offering. Students who complete the course at one level may not repeat the course at the other level.)\nPHYS 450  Introduction to Solid State Physics (Units: 3)\nPrerequisites:\nPHYS 320\nand\nPHYS 360\nwith grades of C- or better.\nCrystal structure, x-ray diffraction, lattice vibrations, models of electrical conductivity; electron energy bands in crystals; electrons and holes in semiconductors.\nPHYS 457  Introduction to Analog Electronics (Units: 4)\nPrerequisites:\nPHYS 230\nwith a grade of C or better;\nMATH 245\nor\nMATH 376\nrecommended (may be taken concurrently).\nLinear network analysis techniques; phasors; diodes; bipolar junction transistors; field-effect transistors; operational amplifiers. Classwork, 3 units; laboratory, 1 unit.\nPHYS 460  Electricity and Magnetism II (Units: 3)\nPrerequisite:\nPHYS 360\nwith a grade of C- or better.\nIntermediate course in electricity and magnetism, including electrodynamics, conservation laws, electromagnetic waves, potentials and fields, radiation, electrodynamics and relativity.\nPHYS 480  Introduction to Optics & Photonics (Units: 3)\nPrerequisites:\nPHYS 320\nand\nPHYS 360\nwith grades of C- or better.\nAn introduction to optics, including geometric optics and optical instrumentation, wave equations and superposition of waves, properties of lasers, interference of light and optical interferometry, coherence, fiber optics, Fraunhofer diffraction, diffraction gratings, Fresnel diffraction, polarization, Fourier optics, holography, and photonics.\nPHYS 491GW  Advanced Laboratory Techniques I - GWAR (Units: 3)\nPrerequisites: GE Areas 1A/A2, 1B/A3, 1C/A1;\nPHYS 320\nand\nPHYS 321\nwith grades of C- minus or better;\nCSC 309\nstrongly recommended.\nAdvanced laboratory techniques for experimental physics, including measurement & data analysis techniques and computer-based methods for data acquisition & analysis. Experiments include atomic, molecular, and optical physics, solid-state physics, and nuclear physics. Emphasizes learning and practicing the standards and format for writing scientific reports and papers. Seminar, 2 units; Laboratory, 1 unit. (ABC/NC grading only)\nCourse Attributes:\nGraduation Writing Assessment\nPHYS 685  Instructional Methods in Teaching Physics (Unit: 1)\nPrerequisite: Upper-division standing.\nPedagogical strategies and principles of teaching and learning in STEM. Seminar for students in their first Learning Assistant (LA) or Supplemental Instruction (SI) position.\nPHYS 686  Experiences in Teaching Physics (Unit: 1)\nPrerequisite: Upper-division standing.\nActivity practicum for students serving as Learning Assistants (LAs) in STEM courses. LAs will directly assist STEM instructors in facilitating active learning in their classrooms. May be repeated for a total of 6 units.\nPHYS 695  Culminating Experience in Physics (Unit: 1)\nPrerequisite: Final semester of a Physics degree program.\nPreparation of a portfolio of work completed in classes required for the degree. The final examination will be the ETS physics major field test.\nPHYS 697  Senior Project (Units: 1-3)\nPrerequisite: PHYS 491; permission of the faculty adviser.\nParticipation in experimental or theoretical project under the direction of faculty member. Written report of specific observations and calculations required. May be repeated with permission of the advisor.\nPHYS 699  Independent Study (Units: 1-3)\nPrerequisite: Approval of department and permission of the instructor.\nStudy in the laboratory or library under the direction of a member of the department. For students majoring or minoring in physics. Student must present a detailed written report of the work accomplished to the department. May be repeated for a total of 12 units.\nPHYS 701  Classical Mechanics (Units: 3)\nPrerequisite: Graduate standing or permission of the instructor.\nLagrangian and Hamiltonian mechanics; motion in arbitrary central force potentials; canonical transformation theory; Liouville's theorem; computer visualizations of phase space trajectories and topologies; collisionless Boltzmann equation applied to stellar dynamics; Jeans theorems, orbital anisotropy, and phase space distribution functions.\nPHYS 704  Electrodynamics (Units: 3)\nPrerequisites: Graduate standing or permission of the instructor.\nPHYS 785\nstrongly recommended.\nBoundary-value problems in electrostatics; multipoles, electrostatics of macroscopic media, dielectrics; magnetostatics, Faraday's Law, quasi-static fields; Maxwell equations, macroscopic electromagnetism, conservation laws; plane electromagnetic waves and wave propagation.\nPHYS 706  Quantum Mechanics (Units: 3)\nPrerequisites: Graduate standing or permission of the instructor.\nPHYS 785\nstrongly recommended.\nBound states, collision theory, matrix mechanics, symmetry and groups, perturbation theory.\nPHYS 710  Advanced Laboratory Techniques II (Units: 3)\nPrerequisite: Graduate standing or permission of the instructor.\nTechniques of electronic instrumentation, computerized data acquisition, digital signal processing, and data analysis designed to prepare the student for experimental research work in academic and industrial laboratories. Classwork, 2 units; laboratory, 1 unit.\nPHYS 712  Physics of Plasmas (Units: 3)\nPrerequisites: Graduate standing or permission of the instructor.\nFundamental properties of plasmas. Motion of charged particles in electromagnetic fields. Kinetic theory of plasmas, including the Boltzmann and Vlasov equations. Fluid theory of plasmas, including magnetohydrodynamics. Waves",
    "url": "https://bulletin.sfsu.edu/courses/phys/"
  },
  {
    "source": "https://bulletin.sfsu.edu/courses/japn/",
    "category": "courses",
    "title": "Japanese (JAPN) | San Francisco State University Bulletin",
    "content": "Japanese (JAPN)\nExplanation of Course Descriptions, Symbols, and Terms\nJAPN 101  First Semester Japanese (Units: 4)\nUnderstanding, speaking, reading, and writing modern Japanese.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nGlobal Perspectives\nJAPN 102  Second Semester Japanese (Units: 4)\nPrerequisite:\nJAPN 101\nor equivalent.\nContinuation of\nJAPN 101\n. Understanding, speaking, reading, and writing modern Japanese.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nGlobal Perspectives\nJAPN 103  Third Semester Japanese (Units: 4)\nPrerequisite:\nJAPN 102\nor equivalent.\nContinuation of\nJAPN 102\n. Intermediate level modern Japanese.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nGlobal Perspectives\nJAPN 200  Art of Japanese Writing and Calligraphy (Units: 3)\nNature and composition of the two Japanese writing systems, Hiragana and Kanji (Chinese characters), and their aesthetic expression in different styles of calligraphy. Knowledge of Japanese is not required.\n(This course is offered as\nJAPN 200\nand\nMLL 200\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nJAPN 250  Intensive Study of Kanji: Level I (Units: 3)\nPrerequisite:\nJAPN 102\n* or equivalent.\nIntensive study of Kanji. Learn approximately 500 basic Kanji characters. May be repeated for a total of 6 units.\nJAPN 251  Intensive Study of Kanji: Level 2 (Units: 3)\nPrerequisites:\nJAPN 101\n*,\nJAPN 102\n*,\nJAPN 103\n, and\nJAPN 250\n* or equivalents. May not be concurrently enrolled in\nJAPN 510\n.\nIntensive study of approximately 400 advanced Kanji characters, reaching a total of about 900 Kanji or 90% of Japan's Educational Kanji. May be repeated for a total of 6 units.\nJAPN 301  Japanese Conversation (Units: 3)\nPrerequisites:\nJAPN 103\nand\nJAPN 250\nor equivalents.\nDeveloping aural-oral skills for conversations at different social levels and situations.\nJAPN 302  Japanese Reading and Grammar (Units: 3)\nPrerequisites:\nJAPN 103\nand\nJAPN 250\nor equivalents.\nReading modern Japanese. Structural analysis and vocabulary development.\nJAPN 305  Advanced Conversation and Composition - Language and Culture (Units: 3)\nPrerequisites:\nJAPN 301\nand\nJAPN 302\nor equivalents.\nExploration of the culture of Japan using in-depth conversations and intensive writing experiences to develop expertise in rhetorical skills. Discussion and composition topics include the geography of Japan, speech styles, technology, sports, food, religion, and pop culture.\nJAPN 306  Advanced Conversation and Composition - Language and Humanities (Units: 3)\nPrerequisites:\nJAPN 301\nand\nJAPN 302\nor equivalents.\nDevelopment of expertise in oral and written rhetorical skills through an in-depth exploration of humanities in Japan. Discussion and composition topics include traditional performing arts and crafts, education, history of Japan, nature, and politics.\nJAPN 309  Advanced Readings in Japanese I (Units: 3)\nPrerequisites:\nJAPN 301\nand\nJAPN 302\nor equivalents.\nReading modern literary, journalistic, and expository writings.\nCourse Attributes:\nGlobal Perspectives\nJAPN 310  Advanced Readings in Japanese II (Units: 3)\nPrerequisites:\nJAPN 301\n*,\nJAPN 302\n*,\nJAPN 250\n(Level I), or equivalents.\nFurther development of Japanese-as-a-second/foreign-language learners' written Japanese proficiency by focusing on reading skills. Reading materials used in this course address a variety of issues related to Japanese culture, history, and society, so that students will deepen their understanding of the backgrounds of their target language.\nJAPN 325  Practical Linguistics in Japanese (Units: 3)\nPrerequisites:\nJAPN 301\nand\nJAPN 302\nor equivalents.\nApplication of Japanese sound and structural patterns to practical usage.\nJAPN 330  Proverbs and Idiomatic Expressions in Japanese (Units: 3)\nPrerequisites:\nJAPN 301\nand\nJAPN 302\nor equivalents.\nThe most commonly used proverbs and idiomatic expressions in Japanese.\nJAPN 331  A Study of Katakana Words in Japanese (Units: 3)\nPrerequisites:\nJAPN 301\nand\nJAPN 302\n, or permission of the instructor.\nThe study of Japanese katakana words, which include loanwords from Western languages and pseudo-English Japanese words. An examination of how their pronunciation, meaning and/or grammatical structure is altered in a new linguistic and cultural environment. (Fully online course)\nJAPN 390  Business Japanese (Units: 3)\nPrerequisites:\nJAPN 301\nand\nJAPN 302\nor equivalents.\nJapanese business communication skills. Readings in economics, politics, and social issues.\nJAPN 401  Topics in Japanese Culture (Units: 3)\nPrerequisites:\nJAPN 301\n,\nJAPN 302\n, and\nJAPN 305\n,\nJAPN 306\n; or\nJAPN 309\n.\nAcquisition of advanced reading, speaking, writing, and listening skills through the analysis of Japanese culture, history, people's thought, and behavior. Topic to be specified in Class Schedule. May be repeated when topics vary.\nTopics:\nJapanese Identity\nLife and Thought of Medieval Japan\nEdo Culture\nTea Ceremony and Tea Culture\nHeian Culture: Culture of Peace\nJapanese Way of Living\nModern Cultural History of Japan\nJAPN 510  Modern Japanese Literature (Units: 3)\nPrerequisites:\nJAPN 250\n(knowledge of 1000 Educational Kanji or at least a C- on new Level 2),\nJAPN 301\n,\nJAPN 302\n,\nJAPN 305\nor\nJAPN 306\n,\nJAPN 309\n, or equivalents.\nLiterary movements and major works of 20th century Japan.\nCourse Attributes:\nGlobal Perspectives\nJAPN 699  Independent Study (Units: 1-3)\nPrerequisite: Permission of the department chair and instructor.\nWritten projects requiring critical analysis and interpretation of linguistic or literary problems. Material adapted to individual needs and interests. May be repeated for a total of 9 units.\nJAPN 895  Applied Research Project (Units: 3)\nPrerequisites: Permission of the instructor and approval of Advancement to Candidacy (ATC) and Culminating Experience (CE) forms by Graduate Studies. ATC  and Proposal for Culminating Experience forms must be approved by the Graduate Division before registration.\n(CR/NC grading only)\nJAPN 896EXM  Culminating Experience Examination (Units: 0-3)\nPrerequisites: Permission of the instructor, committee chair, and approval of Advancement to Candidacy (ATC) and Culminating Experience (CE) forms by Graduate Studies. ATC and Proposal for Culminating Experience Requirement forms must be approved by the Graduate Division before registration.\nEnrollment in 896EXAM required for students whose culminating experience consists of an examination only.  Not for students enrolled in a culminating experience course numbered\nJAPN 895\nor\nJAPN 898\n(or in some cases, JAPN 890 - see program's graduate advisor for further information). (CR/NC, RP)\nJAPN 898  Master's Thesis (Units: 3)\nPrerequisites: Permission of the instructor and approval of Advancement to Candidacy (ATC) and Culminating Experience (CE) forms by Graduate Studies. ATC and Proposal for Culminating Experience forms must be approved by the Graduate Division before registration.\n(CR/NC grading only)\nJAPN 899  Independent Study (Units: 1-3)\nPrerequisites: Permission of the graduate major adviser and supervising faculty member. Enrollment by petition.\nStudy is planned, developed, and completed under the direction of a member of the faculty. Open only to advanced graduate students who have demonstrated the ability to do independent work. May be repeated for a total of 6 units.",
    "url": "https://bulletin.sfsu.edu/courses/japn/"
  },
  {
    "source": "https://bulletin.sfsu.edu/courses/clas/",
    "category": "courses",
    "title": "Classics (CLAS) | San Francisco State University Bulletin",
    "content": "Classics (CLAS)\nAlso see:\nClassic Archeology\nGreek\nLatin\nExplanation of Course Descriptions, Symbols, and Terms\nCLAS 210  Introduction to Greek and Roman Literature (Units: 3)\nIntroduction to the main genres of Greek and Roman literature (e.g., epic, lyric, historiography, drama, philosophy, letters, pastoral, etc.) through close readings of select examples of each. Emphasis on the social and cultural context of these works of literature.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nC3 or C2: Humanities/Lit.\nCLAS 230  Ancient Epic Tales (Units: 3)\nPrerequisite: GE Area 1A/A2.\nEpic literature of the ancient Mediterranean world. Mythic and heroic themes, narrative techniques, historic and social backgrounds, and cross-cultural influences.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nC3 or C2: Humanities/Lit.\nCLAS 240  Greek and Roman Drama (Units: 3)\nIntroduction to masterpieces of Greek and Roman tragedy and comedy with an emphasis on close reading and appreciation of historical and performative context.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nC3 or C2: Humanities/Lit.\nSocial Justice\nCLAS 260  Greek and Roman Mythology (Units: 3)\nClassical myths that furnish background material for Western literary and cultural traditions; nature, function, and interpretation of myth.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nGlobal Perspectives\nCLAS 280  The Ancient World in Film (Units: 3)\nPrerequisite: GE Area 1A/A2.\nExamination of how ancient Greek and Roman myth and history are represented in film, often as a way of looking critically at modern society and its values.\n(This course is offered as\nCLAS 280\nand\nCINE 180\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nCLAS 410  Ancient Greek Literature (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor.\nIntroduction to ancient Greek literature in its social and historical context.\n(This course is offered as\nCLAS 410\nand\nHUM 401\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3UD: Arts or Humanities\nUD-C: Arts and/or Humanities\nCLAS 415  Ancient Roman Literature (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor.\nIntroduction to ancient Roman literature in its social and historical context.\n(This course is offered as\nCLAS 415\nand\nHUM 402\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3UD: Arts or Humanities\nUD-C: Arts and/or Humanities\nCLAS 420  Classics and the Environment (Units: 3)\nPrerequisite: Upper-division standing or permission of the instructor.\nExamination of the duality of humanity and the natural environment through Classical texts and reception. Development of the ability to analyze the origin and history of human discourses about nature in literary, social, cultural, political, economic contexts; understanding mutual dependency of human perspective and natural environment. (Not for students who have completed CLAS 421.) (Plus-minus letter grade only)\nCourse Attributes:\nEnv. Sustain. & Climate Action\nGlobal Perspectives\nCLAS 430  Ancient Greek and Roman Religion (Units: 3)\nPrerequisites: GE Areas 1A/A2, 1B/A3, 1C/A1, 2/B4 all with grades of C- or better or permission of the instructor.\nExamination of ancient Greek and Roman religions and religious practices, including superstition from the Greek Archaic through the Roman Republic and Imperial periods. Study via primary and secondary texts, art, and material culture.\n(This course is offered as\nCLAS 430\nand\nHIST 312\n. Students may not repeat the course under an alternate prefix.)\nCLAS 450  The Ancient World and Video Games (Units: 3)\nPrerequisites: GE Areas A1, A2, A3, and B4 all with grades of C- or better or permission of the instructor.\nExplore the reception of the ancient world in video games; analysis of modern cultural impact and consideration and comparison to original sources; examination of ancient sources of history, text, and material culture; and modern theory, gaming environments, to explore the role in modern thought, identity, practice, and entertainment.\nCLAS 490  History of Ideas in the Ancient Classical World (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor.\nThe intellectual and cultural history of the ancient classical world of Greece and Rome from its beginnings to the death of Saint Augustine. Evolution of ideas, their origins, interconnections, impact, and influence.\nCourse Attributes:\n3UD: Arts or Humanities\nUD-C: Arts and/or Humanities\nCLAS 510  The Byzantine Empire (Units: 3)\nPrerequisite: GE Area 1A/A2.\nThe political, social, economic, and cultural history of the Byzantine Empire from 7th to 15th centuries A.D. and the relations of Byzantium with its Germanic, Slavic, Arabic, and Turkic speaking neighbors.\n(This course is offered as\nMGS 510\n,\nCLAS 510\n,\nHIST 326\n. Students may not repeat the course under an alternate prefix.)\nCLAS 530  Gender and Sexuality in Ancient Greece and Rome (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor.\nRole of gender and sexuality in the ancient world. Areas of inquiry: women's bodies and social roles; homosexuality; and the socialization of adolescents into adult gender and sex roles.\n(This course is offered as\nCLAS 530\nand\nSXS 530\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3UD: Arts or Humanities\nUD-C: Arts and/or Humanities\nCLAS 582  Tales from Ancient India: Hinduism and Buddhism (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor. or graduate standing or permission of the instructor.\nStudy of ancient Indian (Hindu and Buddhist) culture, religion, and literature. Examination of epics, plays, devotional, and love poetry from Sanskrit and other Indian languages. Examination of family, gender, and patriarchy, kingship and power, heroism, love, war, and ethics, and devotion.\n(This course is offered as\nHIST 370\n,\nHUM 582\n, and\nCLAS 582\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3UD: Arts or Humanities\nUD-C: Arts and/or Humanities\nGlobal Perspectives\nCLAS 690  Editing and Publishing the Classics Journal (Units: 1-3)\nPrerequisite: Classics majors or minors or permission of the department.\nSupervised experience in editing and production of journal of student work. Credit not applicable to major/minor fields in classics. May be repeated for a total of 6 units. (CR/NC grading only.)\nCLAS 699  Independent Study (Units: 1-3)\nPrerequisite: Permission of the major adviser and supervising faculty member.\nStudy is planned, developed, and completed under the direction of a member of the department. Open only to students who have demonstrated ability to do independent work in Classics. May be repeated for a total of 6 units.\nCLAS 701  Greek Language and Literature (Units: 3)\nPrerequisite: Graduate Classics students or permission of the instructor.\nSurvey of the major texts, key themes, and methods at the core of the study of Greek language and literature. Overview of the ways modern scholarship on Greek language and literature has evolved methodologically and theoretically, and how other, related disciplines inform and have been informed by such scholarship. Focus extends from Homer to the authors of the Common Era. Discussion of poetry in a range of meters, prose texts, contexts of composition and performance, and audience reception.\nCLAS 702  Latin Language and Literature (Units: 3)\nPrerequisite: Graduate Classics students or permission of the instructor.\nSurvey of the major texts, key themes, and methods at the core of the study of Latin language and literature. Overview of the ways that modern scholarship on Latin language and literature has evolved methodologically and theoretically, and how other related disciplines inform and have been informed by such scholarship. Focus extends from the Roman Republic in B.C.E to the 3rd Century C.E. Discussion of poetry in a range of meters, prose texts of Late Republic to Empire, contexts of composition and performance, and audience reception.\nCLAS 703  Greek Art and Archaeology (Units: 3)\nPrerequisite: Graduate Classics students or permission of the instructor.\nSurvey of the methods, key themes, and major artifacts at the core of the study of Greek archaeology. Overview of the ways archaeology has been professionally practiced and academically organized, and how field methods have progressed into the digital age. Analysis of material culture both synchronically and diachronically. Discussion of the contributions made by the subject to the study of other disciplines.\nCLAS 704  Roman Art and Archaeology (Units: 3)\nPrerequisite: Graduate Classics students or permission of the instructor.\nGraduate foundational study of the discipline of Roman art and archaeology, including use of primary ancient sources (in original and translation), the historical framework, epigraphy, numismatics, ceramic analysis, major Roman archaeological sites in Italy and throughout the empire, and approaches to the study of artifacts and Roman ceramics. The use of 3D reconstruction, Geographical Information Systems (GIS), typology, and data management are explored. Includes hands-on practice of academic publication and conference presentation skills.\nCLAS 720  Seminar in Classical Languages and Literature (Units: 3)\nPrerequisite: Graduate standing in Classics or permission of the instructor.\nIn-depth exploration of one or more authors of or themes within Ancient Greek and Roman literature. Topics to be specified in the Class Schedule. May be repeated when topics vary.\nTopics:\nExile & Epistolography: Late Republic,Early Empire\nSeneca Philosophical Works\nThe Sophists\nThe Greek Iambic Tradition\nStudies in Greek Society\nArchitecture and Identity in Ancient Rome\nPlato\nReading and Writing the Ancient Greek Symposium\nClassical Linguistics\nOvid Metamorphoses\nThe Tradition of Nature in Greco-Roman Culture\nClassics, Translation, and Translation Theory\nPlato and Greek Sexuality\nCLAS 894  Community Engagement Project (Units: 3)\nPrerequisites: Approval of a graduate advisor and the department chair, and approval of Advancement to Candidacy (ATC) and Culminating Experience (CE) forms by Graduate Studies.\nA field project undertaken in conjunction with a community service organization, resulting in a written paper that discusses the project's significance, objectives, methodology, and conclusions. (CR/NC/RP grading only)\nCLAS 896  Directed Reading in Classics (Units: 3)\nPrerequisite: Approved  Advancement to Candidacy (ATC) and Culminating Experience (CE) forms must be on file in the graduate studies office.\nSupervised study of primary texts and topics in classics, based on the departmental reading list and student's special areas of emphasis, in preparation for the comprehensive oral examination. Not open to M.A. candidates selecting the thesis option. (CR/NC grading only)\nCLAS 896EXM  Culminating Experience Examination (Units: 0-3)\nPrerequisites: Permission of the instructor, committee chair, and approval of Advancement to Candidacy (ATC) and Culminating Experience (CE) forms by Graduate Studies. ATC and Proposal for Culminating Experience Requirement forms must be approved by the Graduate Division before registration.\nEnrollment in 896EXAM required for students whose culminating experience consists of an examination only.  Not for students enrolled in a culminating experience course numbered 892, 893, 894, 895, 898, or 998, (or in some cases, courses numbered 890 - see program's graduate advisor for further information). (CR/NC, RP)\nCLAS 898  Master's Thesis (Units: 3)\nPrerequisites: Permission of the instructor and approval of Advancement to Candidacy (ATC) and Culminating Experience (CE) forms by Graduate Studies. Advancement to Candidacy (ATC) and Proposal for Culminating Experience Requirement forms must be approved by the Graduate Division before registration.\n(CR/NC grading only.)\nCLAS 899  Independent Study (Units: 1-3)\nPrerequisite: Permission of the graduate major adviser and supervising faculty member.\nStudy is planned, developed, and completed under the direction of a member of the department. Open to graduate students who have demonstrated ability to do independent work. Enrollment by petition. May be repeated for a total of 6 units.",
    "url": "https://bulletin.sfsu.edu/courses/clas/"
  },
  {
    "source": "https://bulletin.sfsu.edu/courses/span/",
    "category": "courses",
    "title": "Spanish (SPAN) | San Francisco State University Bulletin",
    "content": "Spanish (SPAN)\nExplanation of Course Descriptions, Symbols, and Terms\nSPAN 101  First Semester Spanish (Units: 4)\nIntroduction to understanding, speaking, reading, and writing Spanish.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nSPAN 102  Second Semester Spanish (Units: 4)\nPrerequisite:\nSPAN 101\nor equivalent.\nUnderstanding, speaking, reading, and writing Spanish.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nSPAN 150  Don Quixote as Self-Made Superhero: Art and Life in an Unjust World (Units: 3)\nPrerequisite: GE Area 1A/A2* or permission of the instructor.\nA writing-intensive course examining Don Quixote through the lens of 21st-century popular culture. Building on the skills acquired in Written English Communication (A2), learn and practice the components of effective arguments: analyzing genre, audience, and purpose, as well as how to draft and give feedback. Reflection on contemporary issues of identity, social justice, well being and the relationship between fiction and life itself through writing and deep reading of the novel.\n(This course is offered as\nSPAN 150\nand\nMLL 150\n. Students may not repeat the course under an alternate prefix.)\nSPAN 205  Intermediate Spanish I (Units: 3)\nPrerequisites:\nSPAN 102\n; placement by an advisor; or permission of the instructor.\nIntermediate course that reinforces and builds on four skills (listening, understanding, reading, and writing) learned in\nSPAN 101\n/\nSPAN 102\n.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nSPAN 206  Intermediate Spanish II (Units: 3)\nPrerequisites:\nSPAN 205\n*; placement by the advisor; or permission of the instructor.\nContinuation of\nSPAN 205\nwhich reinforces and builds on four skills (listening, understanding, reading, and writing) learned in\nSPAN 101\nand\nSPAN 102\n.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nSPAN 215  Spanish for Heritage Speakers (Units: 3)\nPrerequisites: Spanish heritage learner and permission of the instructor.\nDesigned for heritage language learners with an emphasis on conversation, writing styles, and specific grammatical problems. Additional focus on short stories, essays, poems, plays, newspaper articles, and films, all in Spanish.\nCourse Attributes:\n3B: Humanities\nC2: Humanities\nSPAN 217  Spanish for Health Care Professionals (Units: 3)\nPrerequisite: Two semesters of lower-division Spanish or\nSPAN 215\nor equivalent; or permission of the instructor.\nExplore and analyze healthcare disparities affecting Spanish-speaking populations with a focus on socio-economic, linguistic, and cultural factors to develop an awareness of the impact of systemic issues on healthcare access and outcomes for marginalized communities. Develop cultural competence by adapting their language and communication styles to respect diverse backgrounds and perspectives within the Spanish-speaking community, particularly in the context of healthcare practices and beliefs. Learn to advocate for equitable healthcare practices and contribute to addressing disparities.\nCourse Attributes:\n5B: Biological Science\nB2: Life Science\nSocial Justice\nSPAN 223  Bilingual English and Spanish Newswriting (Units: 3)\nPrerequisites: Written and verbal fluency in Spanish. Language assessment test.\nDevelopment of news judgment, basic reporting, and clear writing skills for Spanish-language media, media produced in both English and Spanish, and media focused on Spanish-speaking cultures. A grade of C or better required for Journalism majors and minors. (ABC/NC grading only)\n(This course is offered as\nJOUR 223\nand\nSPAN 223\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\nAm. Ethnic & Racial Minorities\nGlobal Perspectives\nSPAN 224  Newswriting Lab in Spanish (Unit: 1)\nPrerequisites: GE Areas 1A/A2 and 1B/A3.\nBasic grammar, spelling and punctuation in Spanish applied to news writing. A grade of C or better required for Journalism majors and minors. (ABC/NC grading only)\n(This course is offered as\nJOUR 224\nand\nSPAN 224\n. Students may not repeat the course under an alternate prefix.)\nSPAN 301  Advanced Grammar (Units: 3)\nPrerequisite: Four semesters of lower-division Spanish or equivalent.\nProblematic aspects of Spanish grammar; practice in expository writing.\nSPAN 305  Advanced Composition (Units: 3)\nPrerequisite:\nSPAN 301\nor consent of instructor.\nPractice in expository writing: forms, development, and organization of the short essay including the study of style.\nSPAN 306  Advanced Reading and Conversation (Units: 3)\nPrerequisite:\nSPAN 301\nor permission of the instructor.\nOral presentations/group discussions based on readings from novels, plays, and poetry. Not designed for native-level speakers.\nSPAN 323  Translating the News in English and Spanish (Units: 3)\nPrerequisites:\nSPAN 301\n* with a grade of C or permission of the instructor.\nTheoretical and practical aspects of translation applied to news writing. Exercises in translating Spanish to English and vice-versa. Conducted in both Spanish and English. (ABC/NC grading only)\n(This course is offered as\nJOUR 323\nand\nSPAN 323\n. Students may not repeat the course under an alternate prefix.)\nSPAN 326  Applied Spanish Linguistics: Morphology and Syntax (Units: 3)\nPrerequisite:\nSPAN 301\nor equivalent.\nApplication of modern descriptive linguistics to the study of morphology and syntax.\nSPAN 341  Introduction to the Reading of Literary Texts (Units: 3)\nPrerequisite:\nSPAN 301\nor permission of the instructor.\nIntroduction to the reading and analysis of literary texts.\nSPAN 350  Introduction to Translation (Spanish to English) (Units: 3)\nPrerequisites: Native fluency in English and moderate competency in understanding, speaking, and reading Spanish.\nTheoretical and practical aspects of translation. Exercises in translating Spanish to English. Conducted in both Spanish and English.\nSPAN 371GW  History and Development of the Spanish Language - GWAR (Units: 3)\nPrerequisite: GE Area 1A/A2.\nExamination of the historical, social, political, cultural forces that shaped the development of the Spanish language from its Indo-European prehistory to its modern worldwide diffusion. (Plus-minus ABC/NC, CR/NC not allowed) [Formerly SPAN 571]\nCourse Attributes:\nGraduation Writing Assessment\nSPAN 401  Culture and Civilization of Spain (Units: 3)\nPrerequisite:\nSPAN 301\n(may be taken concurrently).\nCulture and civilization of Spain from the Middle Ages to the present. [Formerly SPAN 401GW]\nSPAN 405  Culture and Civilization of Spanish America (Units: 3)\nPrerequisite:\nSPAN 301\nor equivalent.\nBackground for Spanish American literature.\nSPAN 407  Food and Culture in the Spanish-Speaking World (Units: 3)\nPrerequisite:\nSPAN 301\nor permission of the instructor.\nGroup and individual cultural identity is intimately connected with the foods we eat and what we avoid eating. Explore the history, culture, and signifying power of food in the Spanish-speaking world, from medieval and pre-Columbian food practices to the dynamics of food and culture in the contemporary Hispanic world.\nSPAN 521  Spanish Medieval, Renaissance, and Baroque Literature (Units: 3)\nPrerequisite:\nSPAN 341\nor equivalent or permission of the instructor.\nExploration of one or more topics relevant to medieval and early modern Spanish literature. Topics to be specified in the class schedule. May be repeated when topics vary.\nTopics:\nSpanish Medieval Literature\nLiterature of Pilgrimage\nSPAN 523  19th Century Spanish Literature (Units: 3)\nPrerequisite:\nSPAN 341\nor equivalent.\nRomanticism, realism, naturalism, and modernism in Spain.\nSPAN 525  The Contemporary Spanish Novel (Units: 3)\nPrerequisite:\nSPAN 341\nor equivalent.\nThe contemporary Spanish novel through five of its most representative authors in a selection of novels covering the last decade.\nSPAN 531  Creative Writing in Spanish: Poetry, Fiction, and Drama (Units: 3)\nPrerequisite:\nSPAN 301\nor permission of the instructor.\nReading and analysis of literary texts from Spain and Latin America. Practice in writing poetry, fiction, and plays in Spanish. Improve writing skills while practicing creative writing and performing in front of others. (Plus-minus ABC/NC, CR/NC grading allowed)\n(This course is offered as\nSPAN 531\nand\nLTNS 531\n. Students may not repeat the course under an alternate prefix.)\nSPAN 543  Spanish American Literature: Romanticism to Modernism (Units: 3)\nPrerequisite:\nSPAN 341\nor equivalent.\nA study of the most representative works of the leading Spanish American writers of the second part of the 20th century in poetry, essay, short story, and novel.\nSPAN 545  20th Century Spanish American Literature (Units: 3)\nPrerequisite:\nSPAN 341\nor equivalent.\nExploration of one or more topics of 20th century and contemporary Latin American literature. Topics to be specified in the class schedule. May be repeated when topics vary.\nTopics:\nLatin American Narrative\nSpanish American Short Story\nCountryside and City in Latin American Literature\nLiterature and Barbarism\nSPAN 562  Cervantes: The Quijote (Units: 3)\nPrerequisite:\nSPAN 341\nor equivalent.\nReading and analysis of Don Quijote.\nSPAN 580  Hispanic Women Writers (Units: 3)\nPrerequisite:\nSPAN 341\nor equivalent.\nAn exploration of Peninsular and Latin American literature, mainly written by women that focuses on gender and femininity.\nSPAN 595  Senior Survey in Spanish or Spanish American Literature (Units: 3)\nPrerequisite:\nSPAN 341\nor equivalent.\nAdvanced survey of Spanish or Latin American literature. Topics to be specified in the class schedule. May be repeated when topics vary.\nTopics:\nSenior Survey in Spanish American Literature\nSenior Survey in Spanish and Latin American Lit\nSPAN 615  Applied Linguistics: Principles and Methods in Teaching Spanish (Units: 3)\nPrerequisites:\nMLL 325\nand\nSPAN 301\n; or graduate Spanish students; or permission of the instructor.\nDiscussion of both general and Spanish linguistics as well as how native and non-native speakers learn the Spanish language. Examination of past and current trends in language pedagogy to better inform choices in course preparation, lesson planning, and curriculum decisions. Topics include error correction, fluency vs. accuracy, language transfer, and learnability. Examination of commercial textbooks and their assumptions about language learning.\nSPAN 699  Independent Study (Units: 1-3)\nPrerequisite: Permission of the department chair and instructor.\nSpecial topics in Spanish. Written projects requiring critical analysis and interpretation of linguistic or literary problems. May be repeated for a total of 9 units.\nSPAN 821  Seminar in Spanish Literary Genres (Units: 3)\nPrerequisite: Graduate Spanish students or permission of the instructor.\nFocus on a specific literary genre in Spanish or Latin American literature. Topics to be specified in the Class Schedule. May be repeated when topics vary.\nTopics:\nContemporary Spanish American Novel\nSpanish Theater\nSpanish Lyric Poetry\nThe Picaresque\nSpanish American Short Story\nSPAN 831  Seminar in Literary Movements or Periods (Units: 3)\nPrerequisites: Spanish M.A. students; advanced Spanish level; or permission of the instructor.\nFocus on a particular literary movement or period in Spanish or Latin American literature. Topics to be specified in the Class Schedule. May be repeated when topics vary. [CSL may be available]\nTopics:\nLatin American Literature and Identities\nAesthetics in Modern Latin American Fiction\nSpanish Medieval Literature\nSpanish Renaissance Literature\nPolitical Commitment and Poetry in Spain\nHistorical Memory from a Transatlantic Perspective\nSPAN 850  Seminar-Spanish and Latin American Literature (Units: 3)\nPrerequisite: Graduate Spanish students or permission of the instructor.\nFocus on a topic, theme, or problem specific to Spanish or Latin American literature. Topics covered may include, but are not limited to, questions of class, gender, race, national identity, etc. Topics to be specified in Class Schedule.  May be repeated as topics vary.\nTopics:\nModernization & Borders in Mexican Literature\nLatin America Coming of Age Narrative\nLatin American Bestiaries\nMass, Multitudes, Populations in Latin Am. Lit\nRealism & Naturalism: A Transatlantic Perspective\nSPAN 851  Seminar in Medieval, Early Modern Peninsular, and Colonial Literature (Units: 3)\nPrerequisite: Graduate Spanish MA students or permission of the instructor.\nCritical examination of literary texts and other cultural products from the Medieval and Early Modern periods of Spain and the Conquest/Colonial period of Latin America. Topics to be specified in the Class Schedule. May be repeated when topics vary.\nTopics:\nGolden Age Spanish Theater\nMedieval Spanish Narrative\nChronicles of Conquest and Colonial Latin America\nMedieval and Early Modern Spanish Narrative\nSPAN 868  Contemporary Literature from a Transatlantic Approach (Units: 3)\nPrerequisite: Graduate Spanish students or permission of the instructor.\nFocus on topics having to do with contemporary cultural production (Literature, Cinema, Art, and Theater) in Spanish and Latin American literature from a transatlantic perspective. Topics to be specified in the Class Schedule. May be repeated when topics vary.\nTopics:\nHistorical Memory from a Transatlantic Approach\nCommitment & Culture in the Spanish Speaking World\nA Purple Wave: Feminism and Culture\nLGBT Revolution & Culture in Spain & Latin America\nSPAN 880  Seminar in Individual Authors or Works (Units: 3)\nPrerequisite: Graduate Spanish students or permission of the instructor.\nFocus on topics having to do with individual authors and works in Spanish or Latin American literature. Topics to be specified in Class Schedule. May be repeated when topics vary.\nTopics:\nCumbres of Spanish Literature\nCumbres of Spanish American Literature\nSPAN 896EXM  Culminating Experience Examination (Units: 0-3)\nPrerequisites: Permission of the instructor, committee chair, and approval of Advancement to Candidacy (ATC) and Culminating Experience (CE) forms by Graduate Studies. ATC and Proposal for Culminating Experience Requirement forms must be approved by the Graduate Division before registration.\nEnrollment in 896EXAM required for students whose culminating experience consists of an examination only. (CR/NC, RP)\nSPAN 898  Master's Thesis (Units: 3)\nPrerequisites: Permission of the instructor and approval of Advancement to Candidacy (ATC) for the Master of Arts in Spanish and Culminating Experience (CE) forms by Graduate Studies.\nThesis must be written in Spanish. Advancement to Candidacy (ATC) and Proposal for Culminating Experience Requirement forms must be approved by the Graduate Division before registration. (CR/NC, RP grading only)\nSPAN 899  Independent Study (Units: 1-3)\nPrerequisites: Graduate Spanish students; permission of the graduate major adviser and supervising faculty member. Enrollment by petition.\nStudy is planned, developed, and completed under the direction of a member of the department faculty. Open only to graduate students who have demonstrated the ability to do indepen",
    "url": "https://bulletin.sfsu.edu/courses/span/"
  },
  {
    "source": "https://bulletin.sfsu.edu/courses/cst/",
    "category": "courses",
    "title": "Critical Social Thought (CST) | San Francisco State University Bulletin",
    "content": "Critical Social Thought (CST)\nExplanation of Course Descriptions, Symbols, and Terms\nCST 300  Introduction to Critical Social Thought (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor.\nThe tradition and development of critical social thought in interaction with socioeconomic and political conditions in the 19th century to the 21st century from Kant to Hegel, Marx, Nietzsche, Foucault, and other thinkers.\n(This course is offered as\nCST 300\nand\nPLSI 386\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n4UD: Social/Behavioral Science\nUD-D: Social Sciences\nSocial Justice\nCST 320  Racism: Cross-Cultural Analysis (Units: 3)\nPrerequisite: Upper-division standing or consent of the instructor.\nThe cultural history of racism as related to colonialism and imperialism. Racism as an on-going intellectual and political movement. Anti-racism and educational-anthropological methods to defeat racism.\n(This course is offered as\nANTH 320\nand\nCST 320\n. Students may not repeat the course under an alternate prefix.)\nCST 585  Globalization and World Cultures (Units: 3)\nPrerequisite: Upper-division standing or permission of the instructor.\nEffects of globalization and multinational corporations on cultures. Examination of contemporary globalization from combined political-economic and cultural anthropological perspectives. Understandings of social movements, world building and popular culture (video games, music, manga and related new media) to study and imagine different ways of engaging with the world. Explore multimodal platforms to explore critical social thought and anthropological ideas.\n(This course is offered as\nANTH 585\nand\nCST 585\n. Students may not repeat the course under an alternate prefix.)\nCST 590  Feminist Anthropology (Units: 3)\nPrerequisite: GE Area 1A/A2.\nEthnographic, physical, anthropological, and prehistorical topics related to women. Theories on origins of the family, social structuring of sexuality, and changing sex and gender in modern societies.\n(This course is offered as\nANTH 590\n,\nCST 590\n, and\nWGS 595\n. Students may not repeat the course under an alternate prefix.)",
    "url": "https://bulletin.sfsu.edu/courses/cst/"
  },
  {
    "source": "http://bulletin.sfsu.edu/courses/arth/",
    "category": "courses",
    "title": "Art History (ARTH) | San Francisco State University Bulletin",
    "content": "Art History (ARTH)\nExplanation of Course Descriptions, Symbols, and Terms\nARTH 201  Global Art History I (Units: 3)\nIntroductory survey of art produced globally, from the prehistoric period through the 15th century CE with an emphasis on global encounter and exchange, and practices in the digital humanities. Includes art from Asia, Africa, the Middle East, Europe, and the Americas.\nCourse Attributes:\n3A: Arts\nC1: Arts\nARTH 202  Global Art History II (Units: 3)\nIntroductory survey of art produced globally, from 1492 through the present. Includes art from Asia, Africa, the Middle East, Europe, and the Americas with an emphasis on cross-cultural encounters and exchanges.\nCourse Attributes:\n3A: Arts\nC1: Arts\nARTH 203  Global Art History I (Units: 3)\nIntroductory survey of art produced globally, from the prehistoric period through the 15th century CE with an emphasis on global encounter and exchange, and practices in the digital humanities. Includes art from Asia, Africa, the Middle East, Europe, and the Americas. Explores the ways in which art is produced by local cultures and through contact with networks of trade and migration, shaped by the dynamics of power, trade, conquest, and territorial  expansions.\nARTH 204  Global Art History II (Units: 3)\nIntroductory survey of art produced globally, from 1492 through the present, through a postcolonial and decolonial perspective. Includes art from Asia, Africa, the Middle East, Europe, and the Americas with an emphasis on cross-cultural encounters and exchanges. Explores the ways in which art is implicated in networks of trade and migration, and shaped by the dynamics of capitalism, colonialism, science, modernity, ecology, postcolonialism, feminism, and globalization.\nARTH 205  Asian Art History (Units: 3)\nConceptual and technical relationship of visual form to values in the art of China, Korea, Japan, India, Tibet, and South-East Asia.\n(This course is offered as\nARTH 205\nand\nHUM 205\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3A: Arts\nC1: Arts\nGlobal Perspectives\nARTH 250  Archaeology of the Ancient World (Units: 3)\nPrerequisite: GE Area 1A/A2.\nArchaeology of the ancient world. Artistic and cultural achievements of Egypt, the Ancient Near East, Greece and Rome, and interaction of the art with society.\n(This course is offered as\nCLAR 250\nand\nARTH 250\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3A: Arts\nC1: Arts\nGlobal Perspectives\nARTH 301  Latin American and Latino/a/x Art, 1492 to the Present (Units: 3)\nPrerequisites: Restricted to Art majors and minors with sophomore standing or above or\nLTNS 222\n* or permission of the instructor.\nSurvey of Latin American and Latino/a/x artistic practices and architecture from 1492 to the present. Focus on cross-cultural exchange with East and South East Asia, Europe, and West Africa. Emphasis on the impact of socio-political contexts on the production of art and architecture.\n(This course is offered as\nARTH 301\nand\nLTNS 301\n. Students may not repeat the course under an alternate prefix.)\nARTH 306  Modern and Contemporary Art in a North American and European Context, 1945-present (Units: 3)\nPrerequisites: Restricted to Art majors and minors and M.F.A. Art students; sophomore standing or above;\nARTH 202\nor equivalent recommended; or permission of the instructor.\nOverview of modern and contemporary art since 1945 as it has been practiced and exhibited in the North American and Western European art world. Introduction to canonical and non-canonical modern and contemporary works of art. Emphasis on the ways in which art and art history engage with social and political processes. Themes and topics include abstraction, artistic medium, pop art, minimalism, site-specificity, earth art, conceptual art, performance art, video art, queer and feminist practices, politics of identity, appropriation, social practice, activist art, globalization, art and climate change, and art and disability.\nARTH 400GW  Writing About Art - GWAR (Units: 3)\nPrerequisites: Restricted to upper-division Art majors; GE Area 1A/A2; or permission of the instructor.\nIntroduction to basic art historical methodologies with an emphasis on formal analysis and formal description of works of art. (ABC/NC grade only)\nCourse Attributes:\nGraduation Writing Assessment\nARTH 401  Art and Archaeology of Ancient Greece (Units: 3)\nPrerequisite: Upper-division standing.\nSurvey of Greek material culture (art, architecture, city planning, etc.) from the Bronze Age to the second century CE.\n(This course is offered as\nCLAR 420\nand\nARTH 401\n. Students may not repeat the course under an alternate prefix.)\nARTH 402  Art and Archaeology of Ancient Rome (Units: 3)\nPrerequisite: Upper-division standing or permission of the instructor.\nSurvey of Roman material culture (art, architecture, city planning, etc.) from the foundation of Rome to the reign of Justinian.\n(This course is offered as\nCLAR 425\nand\nARTH 402\n. Students may not repeat the course under an alternate prefix.)\nARTH 404  Art and Archaeology of the Mediterranean Bronze Age (Units: 3)\nPrerequisite:\nCLAR 250\nor equivalent; or permission of the instructor.\nIntroduction to the archaeology, architecture, art, society, and scripts of Mediterranean cultures during the Bronze Age with special emphasis on the Minoans and Mycenaeans.\n(This course is offered as\nCLAR 550\nand\nARTH 404\n. Students may not repeat the course under an alternate prefix.)\nARTH 406  Global Renaissance and Baroque Art (Units: 3)\nPrerequisites: Restricted to upper-division Art majors and minors and M.F.A. Art students;\nARTH 201\nor equivalent recommended;or permission of the instructor.\nPainting, sculpture, and architecture of the 14th, 15th, and 16th centuries globally.\nARTH 407  Art and Archaeology of Ancient Egypt (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor.\nAncient Egyptian civilization from Pre-dynastic through Ptolemaic times: art, archaeology, literature, and religion with research use of Sutro Egyptian Collection.\n(This course is offered as\nCLAR 500\nand\nARTH 407\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3UD: Arts or Humanities\nUD-C: Arts and/or Humanities\nARTH 409  Greek Vase Painting (Units: 3)\nPrerequisite:\nCLAR 250\nor\nCLAR 420\nor\nCLAR 425\nor permission of the instructor.\nIntroduction to ancient Greek vase painting.\n(This course is offered as\nCLAR 530\nand\nARTH 409\n. Students may not repeat the course under an alternate prefix.)\nARTH 410  Greek Sculpture (Units: 3)\nPrerequisite: Upper-division standing or permission of the instructor.\nDevelopment of Greek sculpture from the late 8th century through the 2nd century BCE. Emphasis on stylistic analysis, formal development, and interpretation of both free-standing figures and programmatic architectural sculpture as social and political documents.\n(This course is offered as\nCLAR 531\nand\nARTH 410\n. Students may not repeat the course under an alternate prefix.)\nARTH 411  South Asian Art I: Neolithic to Medieval Periods (Units: 3)\nPrerequisites: Restricted to Art majors and minors and M.F.A. Art students; upper-division standing;\nARTH 205\nor equivalent recommended; or permission of the instructor.\nExamination of artistic practices and aesthetics that inform the visual culture of South Asia (Afghanistan, Bangladesh, Bhutan, India, the Maldives, Nepal, Pakistan, and Sri Lanka), from Indus Valley culture to the 10th century. Art will be presented in the contexts of belief systems, trade, and political formations. Among the art historical subjects to be covered are: Buddhist sculptures and painting, Hindu temples, and Islamic built environments.\nARTH 412  South Asian Art II: Early Modern to Contemporary Periods (Units: 3)\nPrerequisites: Restricted to Art majors and minors, M.F.A. Art students, and South Asian Studies minors; upper-division standing;\nARTH 205\nor equivalent recommended; or permission of the instructor.\nExamination of artistic practices and aesthetics that inform the visual culture of South Asia (Afghanistan, Bangladesh, Bhutan, India, the Maldives, Nepal, Pakistan, and Sri Lanka), from the 18th century to the contemporary period. Art will be presented in the contexts of belief systems, trade, and political formations like nation-building and global alliances.\nARTH 421  Special Topics in Art History (Units: 3)\nPrerequisites: Restricted to Art majors and minors and M.F.A. Art students; upper-division standing;\nARTH 201\n,\nARTH 202\n, or\nARTH 205\nor equivalent recommended; or permission of the instructor.\nInvestigation of specific themes, periods, styles, geographical areas, and media in art history. Topics to be specified in the class schedule. May be repeated when topics vary.\nTopics:\nHistory of Photography\nFeminist Art Practices\nVision and Meaning in Art History\nARTH 496  Art, Architecture, and Space in the Islamic World (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor.\nThe built environment of Islam through the critical reading of art, film, and literature. How places take on meaning through use and perception, sensitive to time, place, ethnicity, gender, class, and ideology.\n(This course is offered as\nHUM 496\nand\nARTH 496\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3UD: Arts or Humanities\nUD-C: Arts and/or Humanities\nGlobal Perspectives\nARTH 516  Advanced Topics in Art History (Units: 3)\nPrerequisites: Restricted to upper-division Art majors and minors and M.F.A. Art students; one 300- or 400-level Art History course; or permission of the instructor.\nInvestigation of advanced topics in art history. Topics to be specified in the Class Schedule. May be repeated when topics vary.\nTopics:\nAsian American Art\nArt Outside the White Cube\nMexican Muralism and Its Legacy in the Americas\nContemporary Asian Art\nNew Themes in Art History\nQueer Art Since 1980\nArtists' Publications and Zines\nARTH 602  Art History Seminar (Units: 3)\nPrerequisites: Restricted to upper-division Art majors and minors and M.F.A. Art students; one upper-division Art History course*; or permission of the instructor.\nAdvanced seminar on specific topics, themes, and research methods in Art History. Topics to be specified in the Class Schedule. May be repeated when topics vary. (Plus-minus ABC/NC grading; CR/NC allowed)\nTopics:\nArt and Utopia\nThe Art and History of Monuments: Case Studies\nPostcolonial Encounters in Art History\nNew Themes and Methods in Art History\nArt Worlds: Institutions, Publics, Communities\nLatinx Art and Organizing in the Bay Area, 1960 On\nARTH 700  Seminar in Art History: Theory, Criticism, and Practice (Units: 3)\nPrerequisite: Restricted to graduate Art students; recommended in the first semester of graduate studies.\nSeminar in art history, theory, and criticism as they apply to the creative artist. May be repeated for a total of 9 units. (Plus-minus letter grade only)\nARTH 701  Special Topics in Art History (Units: 3)\nPrerequisite: Graduate standing or permission of the instructor.\nAdvanced research seminar in Art History. Topics to be specified in the Class Schedule. May be repeated when topics vary for a total of 18 units.\nTopics:\nImages and Meaning\nArt in the Era of Posthumanism\nLatino/a/x Art and Institutions\nContemporary Currents\nAlternative Spaces and Media",
    "url": "http://bulletin.sfsu.edu/courses/arth/"
  },
  {
    "source": "https://bulletin.sfsu.edu/courses/danc/",
    "category": "courses",
    "title": "Dance (DANC) | San Francisco State University Bulletin",
    "content": "Dance (DANC)\nExplanation of Course Descriptions, Symbols, and Terms\nDANC 123  Music Fundamentals for Theatre and Dance Artists (Units: 3)\nPrerequisite: Restricted to Theatre Arts and Dance majors and minors.\nTheatre and Dance artists develop the foundational skills to understand and read basic musical notation and rhythms, in addition to the skills needed to follow a score or other more advanced musical compositions. Lecture, 2 units; activity, 1 unit.\n(This course is offered as\nTH A 123\nand\nDANC 123\n. Students may not repeat the course under an alternate prefix.)\nDANC 160  African-Haitian Dance I (Unit: 1)\nBeginning skills in African-Haitian dance. Activity. May be repeated for a total of 2 units.\nDANC 163  Ballet I (Unit: 1)\nBallet I is a beginning classical ballet technique class.  May be repeated for a total of 4 units.\nDANC 170  Integrated Dance Technique I (Units: 3)\nBasic dance skills in ballet, modern, and jazz dance. May be repeated for a total of 6 units. (Plus-minus letter grade only)\nDANC 173  Modern Dance I (Unit: 1)\nBeginning skills in modern dance.\nDANC 176  Jazz Dance I (Unit: 1)\nBeginning skills in jazz dance.\nDANC 207  Dance in Cultural Context (Units: 2)\nMovement vocabulary, performance practice and cultural context of a dance form.  Topic to be specified in Class Schedule. May be repeated for a total of 8 units when topics vary. Activity, 2 units.\nTopics:\nAfro-Brazilian Contemporary\nCapoeira\nRhythm Tap Dance\nBalinese Dance\nDANC 208  Cultural History of Dance (Units: 3)\nStudy of dance traditions in their social and artistic contexts. Lectures on the history and development of dance genres supplemented by workshops in dance technique and performance conventions. Topics to be specified in the Class Schedule. Lecture, 2 units; activity, 1 unit. May be repeated for a total of 9 units only when topics vary.\nCourse Attributes:\n3A: Arts\nC1: Arts\nAm. Ethnic & Racial Minorities\nTopics:\nSurvey of Dance in the Philippine Diaspora\nSurvey of Tap Dance in American Culture\nSurvey of Jazz Dance in American Culture\nDANC 232  Dance Composition: Choreography I (Units: 3)\nPrerequisite:\nDANC 170\n(may be taken concurrently) or permission of the instructor.\nChoreography and creative process in dance: improvisation, exploration, form, and content in the formation of solo works. Lecture, 1 unit; activity, 2 units. May be repeated for up to 6 units.\nDANC 236  Folklore of Dance: African-Haitian (Units: 2)\nDevelopment of African-Haitian dance in connection with ritual and celebration. Practice of African-Haitian dance forms. Lecture, 1 unit; laboratory, 1 unit.\nDANC 263  Ballet II (Units: 2)\nPrerequisite:\nDANC 170\n(may be taken concurrently) or\nDANC 163\nwith permission of the instructor.\nIntermediate level classical ballet technique. May be repeated for a total of 8 units. Activity\nDANC 275  Modern Dance II (Units: 2)\nPrerequisite:\nDANC 170\n(may be taken concurrently) or\nDANC 173\nwith permission of the instructor.\nIntermediate-level modern dance technique. May be repeated for a total of 8 units. Activity\nDANC 276  Jazz Dance II (Units: 2)\nPrerequisite:\nDANC 170\n(may be taken concurrently) or\nDANC 176\nwith permission of the instructor.\nIntermediate-level jazz dance technique. May be repeated for a total of 8 units. Activity.\nDANC 278  Afro-Fusion Dance Technique I/II (Units: 2)\nBeginning to low intermediate level Afro-Fusion dance technique. Contemporary dance grounded in Africanist dance aesthetics that can include traditional, concert, and social dance vocabularies. May be repeated for a total of 4 units. Activity.\nDANC 300GW  Dance Organizational Strategies and Field Topics - GWAR (Units: 3)\nPrerequisite: GE Area 1A/A2.\nSurvey of dance service organizations and professional field topics including grant writing, copyright liabilities, dance documentation, resumes, publicity strategies, and fiscal survivorship. (ABC/NC grading only) [CSL may be available]\nCourse Attributes:\nGraduation Writing Assessment\nDANC 301GW  Dance Research Methods and Theory (Units: 3)\nPrerequisite: GE Area 1A/A2*.\nSurvey of theory and methods used in dance scholarship including movement analysis, ethnography, oral history, archival methods, performance studies, and cultural studies. (ABC/NC grading only)\nCourse Attributes:\nGraduation Writing Assessment\nDANC 304  Issues in Dance Medicine I (Units: 3)\nPrerequisite: Ge Area 5B/B2.\nThe musculoskeletal system: elements of physiology and nutrition as they apply to dance training. Lecture, 2 units; activity, 1 unit.\nDANC 311  Alignment/Pilates Mat (Unit: 1)\nPrerequisite:\nDANC 170\n(may be taken concurrently) or permission of the instructor.\nAn activity course in pilates mat work including core stabilization, mind body centering, and related methods.  May be repeated for a total of 8 units.\nDANC 312  Alignment Study/Pilates Mat II-III (Unit: 1)\nPrerequisite:\nDANC 311\nor permission of the instructor.\nMovement lab for intermediate/advanced experience in theory and practice of Pilates mat and small equipment; core stabilization, alignment; Pilates principles in relation to dance practice. Activity. May be repeated for a total of 4 units.\nDANC 340  Dance Pedagogy (Units: 3)\nPrerequisite: Upper-division standing or permission of the instructor.\nTeaching dance for children and adolescents. The relationship between the physical and mental processes of learning. May be repeated for a total of 6 units. Lecture, 1 unit; activity, 2 units. [CSL may be available]\nDANC 350  Dance Aesthetics: Cultural/Historical Perspectives (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor.\nCultural and historical exploration of dance for the viewer, including dance theatre and folk forms and their place in arts and culture.\nCourse Attributes:\n3UD: Arts or Humanities\nUD-C: Arts and/or Humanities\nGlobal Perspectives\nDANC 352  K-Pop: Performance and Pop Culture (Units: 3)\nPrerequisites: GE Areas 1A/A2, 1B/A3, 1C/A1, and 2/B4, all with grades of C- or better, to enroll in this course.\nExamination of the social-political, cultural, and aesthetic contexts of K-Pop as a transnational performance practice. Topics include K-Pop in the context of Korean history; colonization and empire, militarization, dance, music, and theatre history; globalization and popular culture, transmedia, aesthetic innovations, and major artists.\n(This course is offered as\nDANC 352\n/\nMUS 352\n/\nTH A 352\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\nGlobal Perspectives\nDANC 363  Ballet III (Units: 2)\nPrerequisites:\nDANC 170\n(may be taken concurrently) and\nDANC 263\nor permission of the instructor.\nAdvanced-level classical ballet technique. May be repeated for a total of 8 units. Activity.\nDANC 374  Modern Dance III (Units: 2)\nPrerequisites:\nDANC 170\n(may be taken concurrently) and\nDANC 275\nor permission of the instructor.\nAdvanced modern dance technique. May be repeated for a total of 8 units. Activity.\nDANC 376  Jazz Dance III (Units: 2)\nPrerequisites:\nDANC 170\n(may be taken concurrently) and\nDANC 276\nor permission of the instructor.\nAdvanced-level jazz dance technique. May be repeated up to 8 units. Activity.\nDANC 378  Afro-Fusion Dance Technique III/IV (Units: 2)\nPrerequisite:\nDANC 170\nor\nDANC 278\n; or permission of the instructor.\nHigh intermediate to advanced level Afro-Fusion dance technique. Contemporary dance grounded in Africanist dance aesthetics that can include traditional, concert, and social dance vocabularies. Activity. May be repeated for a total of 4 units.\nDANC 399  University Dance Theatre (Units: 2)\nPrerequisites: Audition; completion of level II or III dance technique classes; concurrent enrollment in two dance technique classes.\nYear-long repertory class in which students build and perform faculty and guest artist choreography. Activity. May be repeated for a total of 12 units. [CSL may be available]\nDANC 400  Workshop in Contemporary Dance (Unit: 1)\nPrerequisite: A lower division technique class or permission of the instructor.\nStudy of new forms: cultural/contemporary fusion, contact improvisation, voice and movement. May be repeated for a total of four units.\nDANC 401  Ballet Pointe and Partnering (Unit: 1)\nPrerequisites:\nDANC 170\n,\nDANC 263\n, or permission of the instructor.\nDevelopment of ballet pointe technique and partnering skills. Intended for strong intermediate-advanced ballet dancers. Emphasis on clarity of footwork, placement of the body in pointe positions, and building strength. Barre designed to lead dancers in pointe combinations and variations in center floor. Classical ballet partnering will include lifts and turns. Activity. May be repeated for a total of 4 units.\nDANC 408  Performance in Asia and the Asian Diaspora (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor.\nAn examination of dance, drama, performance, theatrical aesthetics, and conventions of productions in Asia and/or the Asian diaspora.\n(This course is offered as\nTH A 408\nand\nDANC 408\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3UD: Arts or Humanities\nUD-C: Arts and/or Humanities\nGlobal Perspectives\nDANC 416  Advanced Contemporary Dance Repertory and Skills (Units: 2)\nPrerequisite:\nDANC 170\nor\nDANC 278\nor\nDANC 378\n; or permission of the instructor.\nRepertory works and performance techniques. May be repeated for a total of 8 units.\nDANC 430  Survey of Ballet and Modern Dance History (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor.\nDevelopment of dance as a performing art in the western world, and its relationship to social and cultural changes.\nCourse Attributes:\n3UD: Arts or Humanities\nUD-C: Arts and/or Humanities\nDANC 434  Dance Composition: Choreography II (Units: 3)\nPrerequisites:\nDANC 232\n; and permission of the instructor.\nExperience in literal and non-literal choreography including chance, narrative, and historical forms. Work on duets, trios, and larger group studies culminating in a workshop presentation. Lecture, 1 unit; activity, 2 units.\nDANC 461  Advanced Choreography and Production (Units: 3)\nPrerequisites:\nDANC 232\nand\nDANC 434\n.\nChoreography for the stage in conjunction with production planning and management of New Moves production. Includes publicity, budgeting, rehearsal management, and criticism. May be repeated for a total of 6 units. [CSL may be available]\nDANC 463  Performance in Dance Production (Unit: 1)\nPrerequisites: Intermediate level of dance experience; audition; and concurrent enrollment in dance technique class.\nPerformance experience in choreography for dance production to train dancers for the field. Students are admitted to course by audition during the first week of the semester. May be repeated for a total of 4 units.\nDANC 465  Ballet IV (Units: 2)\nPrerequisites:\nDANC 170\n(may be taken concurrently) and\nDANC 363\nor permission of the instructor.\nAdvanced-level classical ballet technique. May be repeated for a total of 8 units. Activity.\nDANC 474  Modern Dance IV (Units: 2)\nPrerequisite:\nDANC 170\n(may be taken concurrently) and\nDANC 374\nor permission of the instructor.\nAdvanced level modern dance technique. May be repeated for a total of 8 units. Activity.\nDANC 476  Jazz Dance IV (Units: 2)\nPrerequisite:\nDANC 170\n(may be taken concurrently) and\nDANC 376\nor permission of the instructor.\nAdvanced-level jazz dance technique and repertory. May be repeated for a total of 8 units. Activity.\nDANC 490  Dance Theatre Workshop (Units: 1-3)\nPrerequisites: Restricted to Dance and Theatre Arts majors and minors;\nTH A 130\n,\nDANC 170\n; audition.\nCreative laboratory for exploration of expressive continuum of dancing, singing and speaking in contemporary multi-disciplinary performance. Activity. May be repeated for a total of 9 units. (Plus-minus letter grade only)\n(This course is offered as\nDANC 490\nand\nTH A 490\n. Students may not repeat the course under an alternate prefix.)\nDANC 657  Ethnography of Dance (Units: 3)\nPrerequisites: GE Areas 1A/A2*, 1B/A3*, 1C/A1*, and 2/B4* all with grades of C- or better or permission of the instructor.\nThe function of dance in society in the context of anthropological literature.\n(This course is offered as\nDANC 657\nand\nANTH 657\n. Students may not repeat the course under an alternate prefix.)\nCourse Attributes:\n3UD: Arts or Humanities\nUD-C: Arts and/or Humanities\nGlobal Perspectives\nDANC 685  Projects in the Teaching of Dance (Units: 1-3)\nPrerequisites: Restricted to upper-division Dance majors or minors; or permission of the instructor.\nThe teaching practicum provides students with an opportunity to serve as an instructional aide, participate in the teaching of a regular instructionally-related Dance class, and learn about educational dance through fieldwork. (Students may earn a maximum of 4 units toward the baccalaureate degree for any course(s) numbered 685 regardless of discipline.) (CR/NC only)\nDANC 699  Independent Study (Units: 1-3)\nPrerequisite: Permission of the supervising faculty member.\nAn intensive study of a particular problem under the direction of a faculty member in the department. May be repeated for a total of 9 units. [CSL may be available]",
    "url": "https://bulletin.sfsu.edu/courses/danc/"
  }
]