[
  {
    "source": "https://cs.sfsu.edu/news",
    "category": "news_events",
    "title": "News Listing | Department of Computer Science",
    "content": "News Listing\nSeptember 25, 2025\nSFSU is first CSU campus to join IBM Quantum Network\nIBM quantum resources open doors for hands-on learning and workforce readiness\nSan Francisco State University is the first C…\nSeptember 11, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nOn August 20, 2025, the Kumo AI Hackathon took place in San Francisco. The CIDER Lab students Binrong Zhu, Guiran Liu, and Y…\nAugust 28, 2025\nAnnouncement of Two New Grants Awarded From NSF\nGrant 1\nCollaborative Research: CISE Core Small: NeTS: Intelligent Reflecting Surface Assisted Physical Layer Security Enhan…\nAugust 26, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nWe are pleased to announce that CS Professor Jozo Dujmovic’s new AI book -- Graded Logic: Modeling Human Commonsense Reasoni…\nAugust 01, 2025\nNew Undergraduate Certificate in Generative Artificial Intelligence: Technology, Applications, and Ethics\nThe Department of Computer Science is proud to announce the launch of a new Undergraduate Certificate in Generative Artifici…\nFebruary 17, 2025\nProfessor Dragutin Petkovic presented a keynote speech at IEEE CCWC Conference in Las Vegas January 8, 2025 on \"GenAI and Education\"\nProfessor Dragutin Petkovic delivered a keynote speech on January 8, 2025, at the IEEE Computing and Communication Workshop…\nDecember 02, 2024\nNew Department of Defense, Energy grants prepare SFSU students for industry jobs\nThe grants expand research opportunities in engineering, robotics and quantum computing\nTechnology is constantly evolving, w…\nOctober 07, 2024\nInstructor Joseph Hui Featured on CBS News for Commitment to Helping Youth\nJoseph Hui, an instructor here at SFSU has been featured on CBS News for turning his passion for bikes into a mission to sup…\nSeptember 25, 2024\nBethel, Huang Awarded U.S. Department of Energy Research Grant in Quantum Computing\nThe U.S. Department of Energy (DOE) Office of Advanced Scientific Computing Research recently awarded a $250,000, five-year…\nJuly 09, 2024\nSan Francisco State University Lecturer Duc Ta Earns Prestigious Teaching Award\nSFSU Recognizes Excellence in Teaching with Award to CS Lecturer\nSan Francisco State University's Computer Science Departmen…\nJuly 09, 2024\nSan Francisco State Honors Computer Science Graduates at 2024 Ceremony\nSFSU Celebrates its Newest Class of Graduates\nSan Francisco State University's Computer Science Department hosted a Gradua…\nApril 15, 2024\nIn-person hackathon makes triumphant return to campus\nSF Hacks was a nonstop weekend filled with ‘hacking,’ friendly competition, networking, karaoke and Bob Ross\nWhat is a hacka…\nMarch 04, 2024\nKulkarni Lab Receives Grant from Smith-Kettlewell Eye Research Institute\nFebruary 27, 2024\nAI-STAARS Program Awards Scholarships to 20 Computer Science Freshman\nAI-STAARS stands for Artificial Intelligence Scholarships that Improve Academic Achievement, Retention, and Career Success.…\nFebruary 27, 2024\nComputer Science, Biology, and Psychology Faculty Receive a Renewal Award from Genentech Inc.\nAnagha Kulkarni (CS), Ilmi Yoon (CS), Pleuni Pennings (Biology), and Shasta Ihorn (Psychology) have received a renewal award…\nFebruary 19, 2024\nComputer Science Researchers Receive U.S. Department of Energy Grant\nDecember 04, 2023\nSF State program prepares participants to view AI through an ethical lens\nThe Ethical AI certificate provides a foundation in the computer science, philosophy and business of ethical AI\nU.S. Preside…\nNovember 15, 2023\nCISCO @ SFSU\nOver 100 SFSU Computer Science students indicated interest in attending a professional development workshop hosted by CISCO…\nNovember 03, 2023\nCISCO Meraki Campus Visit\n40 SFSU Computer Science students had the opportunity to visit the CISCO Merkai Campus in downtown San Francisco. In collabo…\nSeptember 29, 2023\nFall 2023 Engineering and Computer Science Career Fair\nThis year’s Engineering and Computer Science Career Fair took place on September 29, 2023, in the Annex. This event was host…\nSeptember 26, 2023\nOpen Faculty Position in CS Department\nSan Francisco State University, Department of Computer Science offers an exciting opportunity for two tenure-track Assistant…\nSeptember 22, 2023\nCS Department College Tour\nThe Computer Science Academy at Oakland Technical High School coordinated a campus visit with several of our majors to learn…\nAugust 31, 2023\nInaugural Meeting of SFSU’s ACM CS Research Special Interest Group\nIn conjunction with the CS ACM student chapter and its Treasurer and former president, Mark Kim, Professors Daniel Huang and…\nMay 28, 2023\nCS Department Graduation Celebration 2023\nTo celebrate the achievements of our Computer Science students, the department held a Graduation Celebration for all CS unde…\nMay 28, 2023\nProf. Daniel Huang Recipient 2023 Petkovic Family Teaching Excellence Award\nProf. Daniel Huang of the SFSU Computer Science Department is the recipient of the 2023 Petkovic Family Teaching Excellence…\nMay 15, 2023\nEthical AI Certificate Presentation Awarded at the AAAI Symposium (2023)\nComputer science professor Dragutin Petkovic, alongside philosophy professor Carlos Montemayor and business management profe…\nMay 08, 2023\nLeaping Into the World of Computer Science with the help of Google’s CSRMP\nThe CS Department would like to congratulate SFSUs own Purva Zinjarde, on their acceptance into the Google CS Research Mento…\nJune 01, 2022\nBiotech Certificate Students get Insider Peek into Industry Jobs\nThe gSTAR program is only one year old, but the SF State-Genentech collab is already impacting students, faculty and industr…\nDecember 16, 2020\nSF State Science Coding Programs Boost Biotech Diversity\nGrants impact SF State’s computer science diversity efforts with new certification programs and scholarships\nDespite the San…\nAugust 28, 2018\nBuild the Diverse, Multidisciplinary Computer Science Workforce of the Future\nDeveloping a Computing Application Minor and an Inclusive Learning Environment to Build the Diverse, Multidisciplinary Compu…",
    "url": "https://cs.sfsu.edu/news"
  },
  {
    "source": "https://cs.sfsu.edu/event/intelligent-vocational-storytelling-virtual-reality-system-augmenting-work-performance",
    "category": "news_events",
    "title": "An Intelligent Vocational Storytelling Virtual Reality System for Augmenting Work Performance | Department of Computer Science",
    "content": "An Intelligent Vocational Storytelling Virtual Reality System for Augmenting Work Performance\nWednesday, February 19, 2025\nEvent Time\n02:00 p.m.   -  03:00 p.m.\nPT\nCost\nLocation\nSEC 210\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nLearning thrives on storytelling, visualization, and immersive experiences. Virtual Reality (VR) enhances these cognitive processes, transforming vocational training through dynamic, interactive environments. My research lies at the intersection of Human-Computer Interaction (HCI), artificial intelligence (AI), and immersive technologies, focusing on adaptive learning systems that optimize work performance and memory retention.\nIn this talk, I will present two key projects: OGMA, a VR-based language learning system that significantly improved memory retention, and VISTAS (Vocational Immersive Storytelling Training and Support Framework), which integrates Augmented Reality (AR) and reinforcement learning to personalize skill training. A core aspect of my approach is Storyfication, a narrative-driven framework that gamifies skill acquisition. Additionally, I will share insights from industry collaborations, including my role at Edstutia, a VR startup revolutionizing professional training.\nThis event also marks the launch of RED Lab – Reality Experience Design Lab, where we will explore VR’s impact on human consciousness, learning, and performance. Our research will investigate how immersive experiences enhance engagement, memory, and skill acquisition, collaborating across psychology, kinesiology, theatre, cinema, arts, communication, and business to push the boundaries of interdisciplinary research.\nJoin me as we discuss the evolution of VR/AR technology, its real-world applications, design challenges, and future opportunities—bridging the gap between human cognition and immersive storytelling to shape the future of work and education.\nSpeaker Biography\nHey there! I’m Sanika Doolani—Assistant Professor in the Computer Science Department at SFSU, researcher, designer, and all-around tech enthusiast who believes that creativity, growth, and integrity make the world go round.\nMy journey started in Mumbai, took a deep dive into Computer Science (Ph.D. from UTA, with a few shiny awards along the way), and landed me in the world of HCI, XR, AI, gamification, and storytelling—basically, making tech more fun, engaging, and impactful. Before jumping into academia, I was a Product UX Designer at Salesforce and later Head of Product at Edstutia, a VR training startup. Oh, and I had a dream-come-true moment at The Walt Disney Company, where I worked on the Toy Story 4 AR app!\nNow, I’m beyond excited to lead interdisciplinary research in HCI using XR technologies at RED Lab – Reality Experience Design Lab (Thornton Hall 218). Our mission? Exploring how VR/AR can improve human performance, learning, and training—essentially using immersive tech to help people learn smarter, faster, and better.\nI’m also a relentless self-learner, constantly diving into new fields (architecture, fashion, theatre, investigative journalism—why not?). My biggest tool? Empathy—a skill I even sharpened from an FBI hostage negotiator! Most importantly, I’m passionate about advocating for women and minorities in tech—because we need more diverse voices shaping the future of technology. Let’s shake things up together!\nRED Lab:\nReality Experience Design lab\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/intelligent-vocational-storytelling-virtual-reality-system-augmenting-work-performance"
  },
  {
    "source": "https://cs.sfsu.edu/news/cider-lab-wins-first-prize-kumo-ai-hackathon",
    "category": "news_events",
    "title": "CIDER Lab Wins First Prize at Kumo AI Hackathon | Department of Computer Science",
    "content": "CIDER Lab Wins First Prize at Kumo AI Hackathon\nAuthor:\nQun Wang\nSeptember 11, 2025\nOn August 20, 2025, the Kumo AI Hackathon took place in San Francisco. The CIDER Lab students Binrong Zhu, Guiran Liu, and Yang Liu participated. Competing among many strong teams, the project WildfireRFM – Wildfire Risk Alarm System with KumoRFM won First Prize. Part of this work is also supported by Gilead Innovation Initiative 2025 Summer Research Award and with Professor Zhuwei Qin, an Assistant Professor of Computer Engineering.\nWildfireRFM leverages KumoRFM to combine California-wide forest datasets and historical wildfire records in order to predict the regions at highest risk of wildfire in the coming month. The system also integrates real-time camera detection and edge LLM analysis of weather and environmental signals, enabling timely early-warning reports for fire stations in high-risk zones. This recognition highlights both our students’ dedication — after a summer of intensive research on AI and wireless networks — and the potential for foundation models to tackle urgent real-world challenges such as wildfire prevention.\nRead more about this event here.\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/cider-lab-wins-first-prize-kumo-ai-hackathon"
  },
  {
    "source": "https://cs.sfsu.edu/news/new-undergraduate-certificate-generative-artificial-intelligence-technology-applications-and",
    "category": "news_events",
    "title": "New Undergraduate Certificate in Generative Artificial Intelligence: Technology, Applications, and Ethics | Department of Computer Science",
    "content": "New Undergraduate Certificate in Generative Artificial Intelligence: Technology, Applications, and Ethics\nAuthor:\nArno Puder\nAugust 1, 2025\nThe Department of Computer Science is proud to announce the launch of a new Undergraduate Certificate in Generative Artificial Intelligence: Technology, Applications, and Ethics, beginning in Fall 2026. This innovative program responds to the rapid rise of generative AI (GenAI) and its transformative impact on fields ranging from software development and digital media to education and scientific research.\nGenerative AI refers to a class of technologies that can create content such as text, images, code, and audio using advanced machine learning models. These tools are already reshaping the modern workforce, introducing new paradigms in creativity, automation, and software engineering. San Francisco State University’s new certificate aims to equip students with the technical, practical, and ethical foundations needed to lead in this evolving field.\nThe 12-unit certificate includes two core courses: CSC 698 Generative AI, a newly developed course debuting Fall 2025 and CSC 659 AI Explainability and Ethics. Students will also choose two electives from a set of advanced AI offerings:\nCSC 620 Natural Language Technologies\nCSC 665 Artificial Intelligence\nCSC 671 Deep Learning\nCSC 676 Soft Computing and Decision Support Systems\nThe curriculum emphasizes project-based learning, giving students opportunities to apply GenAI technologies to real-world problems while gaining foundational knowledge in traditional AI, deep learning, and natural language processing. Ethical considerations are ingrained throughout the program, ensuring graduates are prepared to deploy AI technologies responsibly.\nWith over 1,500 declared majors, the Department of Computer Science is one of the largest at SF State and continues to lead with forward-thinking curriculum aligned with industry trends. This certificate marks the first program of its kind among the California State University system.\nMore information regarding the GenAI Certificate will be available on the Department of Computer Science website in the upcoming academic year.\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/new-undergraduate-certificate-generative-artificial-intelligence-technology-applications-and"
  },
  {
    "source": "https://cs.sfsu.edu/news/open-faculty-position-cs-department",
    "category": "news_events",
    "title": "Open Faculty Position in CS Department | Department of Computer Science",
    "content": "Open Faculty Position in CS Department\nAuthor:\nArno Puder\nSeptember 26, 2023\nSan Francisco State University, Department of Computer Science offers an exciting opportunity for two tenure-track Assistant Professor positions in all CS fields beginning August 7, 2024. We seek a colleague whose teaching and research interests in any CS filed as well as those focused on Artificial Intelligence/CS Approaches Against Social Inequities. We are especially interested in qualified candidates who can contribute, through their research, teaching, and/or service, through their commitment to a diverse student population, to the excellence of the academic community.\nThe Department of Computer Science is in a period of expansion and is currently home to 14 tenured/tenure-track faculty members with a strong record of excellence in research and teaching. The department maintains vibrant programs at the undergraduate and graduate levels and a supportive learning environment for a diverse student body. Interdisciplinary collaborations with other departments and the College of Education aim to broaden diversity, equity, and inclusion in computing. The department excels in research and has a significant record of success, with over $6 millions of external grants from various funding agencies, such as NSF and NIH. San Francisco and its proximity to Silicon Valley provides unique opportunities to collaborate with industry and leading high-tech companies in the world. Additional information about the department is available at\nhttp://cs.sfsu.edu\n.\nThe mission of San Francisco State University is to create and maintain an environment for learning that promotes respect for and appreciation of scholarship, freedom, human diversity, and the cultural mosaic of the City of San Francisco and the Bay Area; to promote excellence in instruction and intellectual accomplishment; and to provide broadly accessible higher education for residents of the region and state, as well as the nation and world. To fulfill its mission, the University is committed to the following goals:\nAttracting, retaining and graduating a highly diverse student body Providing disciplinary and interdisciplinary liberal arts and professional education that is academically rigorous and intellectually challenging Providing curricula that reflect all dimensions of human diversity, and that encourage critical thinking and a commitment to social justice Recruiting, retaining and supporting a diverse faculty whose teaching demonstrates an active engagement with their individual fields of study and whose creative and scholarly work is an extension of the classroom, laboratory or studio Employing a staff and administration reflecting the diversity of our student community and the values of the campus; Fostering a collegial and cooperative intellectual environment that includes recognition and appreciation of differing viewpoints and promotes academic freedom within the University community; and Serving the communities with which its students and faculty are engaged.\nResponsiblities: Applicants must demonstrate a high potential for excellence in research and teaching. Successful candidates will develop and maintain an internationally-recognized research program and are expected to effectively supervise students, collaborate with other faculty members, obtain external funding, teach courses at the undergraduate and graduate levels, and contribute to diversity and equal opportunity through their academic careers. Position description available at\nhttps://cs.sfsu.edu/employment\n.\nQualifications\nRequired:\nPh.D. in Computer Science or related field. Terminal degree must be completed by the first day of employment. Record of working and communicating effectively with colleagues and students\nPreferred:\nRecord of teaching contributions in the areas of the candidate’s speciality, as well as core CS courses Active record of research and publications related to specialty area, and evidence of external support or the potential for external funding of these activities. Demonstrated ability to incorporate inclusion, diversity, and educational equity in teaching, and/or scholarship/creative works Experience teaching and working closely with students from historically under-represented communities Record of contributing to collegial, supportive and collaborative work environments\nRank and salary: Assistant Professor. Salary commensurate with qualifications and experience. The California State University (CSU) provides generous health, retirement and other benefits.\nApplication:  Submit letter of intent/interest, a current CV, a statement on how your teaching and scholarship align with the commitment of the CS Department to foster an inclusive and diverse academic community; representative publications; teaching statement; research statement; names and contact information of three references at:\nhttps://careers.pageuppeople.com/873/sf/en-us/job/532315/assistant-professor-computer-science-artificial-intelligencecs-approaches-against-social-inequities\nLetters of recommendation upon request at a later date.\nSan Francisco State is an Equal Opportunity Employer and does not discriminate against persons on the basis of race, religion, color, ancestry, age, disability, genetic information, gender, gender identity, gender expression, marital status, medical condition, National origin, sex, sexual orientation, covered veteran status, or any other protected status.  Reasonable accommodations will be provided for qualified applicants with disabilities who self-disclose by contacting the Senior Human Resources Manager.\nApply on website\nTags\nJobs\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/open-faculty-position-cs-department"
  },
  {
    "source": "https://cs.sfsu.edu/news/bethel-huang-awarded-us-department-energy-research-grant-quantum-computing",
    "category": "news_events",
    "title": "Bethel, Huang Awarded U.S. Department of Energy Research Grant in Quantum Computing | Department of Computer Science",
    "content": "Bethel, Huang Awarded U.S. Department of Energy Research Grant in Quantum Computing\nAuthor:\nKasey Chen\nSeptember 25, 2024\nThe U.S. Department of Energy (DOE) Office of Advanced Scientific Computing Research recently awarded a $250,000, five-year grant to Computer Science faculty members E. Wes Bethel and Daniel E. Huang. They are part of a multi-institutional quantum computing research team that is led by Talita Perciano at Lawrence Berkeley Laboratory and includes Argonne National Laboratory.\nRead More\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/bethel-huang-awarded-us-department-energy-research-grant-quantum-computing"
  },
  {
    "source": "https://cs.sfsu.edu/news/computer-science-biology-and-psychology-faculty-receive-renewal-award-genentech-inc",
    "category": "news_events",
    "title": "Computer Science, Biology, and Psychology Faculty Receive a Renewal Award from Genentech Inc. | Department of Computer Science",
    "content": "Computer Science, Biology, and Psychology Faculty Receive a Renewal Award from Genentech Inc.\nAuthor:\nDr. Anagha Kulkarni\nFebruary 27, 2024\nAnagha Kulkarni (CS), Ilmi Yoon (CS), Pleuni Pennings (Biology), and Shasta Ihorn (Psychology) have received a renewal award of $661,250 from Genentech Inc. to establish and expand a professional certificate program in Data Science and Machine Learning for Biotechnology Professionals. This project aims to provide biotechnology professionals from any backgrounds with the knowledge, skills, and practical experience necessary to excel in the rapidly evolving field of data science and machine learning. The program is designed to align with the technical needs of the biotechnology field and is adapted for professionals in various work-life situations.\nThe first cohort of 24 Genentech employees is on path to earning this certificate in May 2024.\nAdditional information:\nhttps://cpage.sfsu.edu/datascience\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/computer-science-biology-and-psychology-faculty-receive-renewal-award-genentech-inc"
  },
  {
    "source": "https://cs.sfsu.edu/news/san-francisco-state-honors-computer-science-graduates-2024-ceremony",
    "category": "news_events",
    "title": "San Francisco State Honors Computer Science Graduates at 2024 Ceremony | Department of Computer Science",
    "content": "San Francisco State Honors Computer Science Graduates at 2024 Ceremony\nAuthor:\nKasey Chen\nJuly 9, 2024\nPhoto Credit:\nYu-Ming Chen\nSFSU Celebrates its Newest Class of Graduates\nSan Francisco State University's Computer Science Department hosted a Graduation Celebration on May 25th, 2024 to honor students who earned their degrees during the 2023-2024 academic year. The department welcomed three speakers, Dr. Carmen Domingo, Dr. Joshua Miele, and fellow student speaker Giahuy Dang.\nDr. Carmen Domingo, Dean of the College of Science and Engineering, served as an inspiring role model for future generations of scientists and engineers.” Dr. Carmen Domingo, dean of the College of Science & Engineering (CoSE) at San Francisco State University, is the first woman to be appointed to the position. As a Latina scientist, Dean Domingo is part of a select group nationwide: Only 3 percent of U.S. higher education administrators are Hispanic/Latino. She joined SFSU's Department of Biology in 1997 and has been dean since 2017.”\nThe keynote address was delivered by Dr. Joshua Miele, a renowned researcher and advocate in the field of accessibility and visual impairment. Dr. Miele currently holds the position of Principal Accessibility Researcher at Amazon Lab126, a research and development computer hardware company, developing the usability of Amazon's website and devices for visually impaired people. His dedication to accessibility serves as a powerful reminder of the positive impact computer science can have on society.  His dedication to accessibility serves as a powerful reminder of the positive impact computer science can have on society.\nRead more about Dr. Joshua Miele\nGiahuy Dang offered a heartfelt and inspiring speech to his peers. Dang served as President for the Association of Computing Machinery (ACM) Student Chapter at San Francisco State during the Spring 2024 semester.The ceremony marked a momentous occasion for graduates, faculty, and families alike. We extend a heartfelt congratulations to our graduating class, and wish them the best on their future endeavors.\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/san-francisco-state-honors-computer-science-graduates-2024-ceremony"
  },
  {
    "source": "https://cs.sfsu.edu/event/compression-transformation-efficient-deep-learning-mobile-devices-and-llms-education",
    "category": "news_events",
    "title": "From Compression to Transformation: Efficient Deep Learning on Mobile Devices and LLMs in Education | Department of Computer Science",
    "content": "From Compression to Transformation: Efficient Deep Learning on Mobile Devices and LLMs in Education\nTuesday, October 15, 2024\nEvent Time\n04:00 p.m.   -  05:00 p.m.\nPT\nCost\nLocation\nSEC 210\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nDriven by advancements in artificial intelligence (AI), an increasing number of intelligent applications are emerging on mobile devices. As one of the most representative AI technologies, Deep learning has been successfully applied in various domains such as computer vision, speech recognition, natural language processing, and audio recognition, achieving performance on par with, and sometimes surpassing, that of human experts. However, the high computational, memory, and energy requirements of deep learning models present significant challenges for deployment on resource-limited mobile devices. This seminar will explore cutting-edge research on efficient deep learning algorithms for on-device machine learning through deep learning compression. We will address the challenges of deploying deep learning models on mobile devices, and investigate strategies to optimize computational efficiency, memory usage, and energy consumption, while still achieving high-performance results. In addition, the seminar will delve into the transformative role of Large Language Models (LLMs) in education, highlighting their potential to reshape content generation, personalized tutoring, and student engagement. By integrating LLMs with traditional educational models, the seminar will demonstrate how these technologies can overcome existing challenges in content creation, accessibility, and scalability, offering a forward-looking perspective on how AI and LLMs can drive both technological innovation and educational transformation.\nSpeaker Biography\nDr. Zhuwei Qin is an assistant professor in Computer Engineering and the Director of the Mobile and Intelligent Computing Laboratory (MIC Lab) at SFSU. He has broad research experience in efficient deep learning computing, and edge computing specifically, in researching computational optimization for accelerating deep learning on low-power mobile and edge devices. His research has been funded by multiple state-wide academic and industrial programs such as the CSU STEM-NET Faculty Interdisciplinary Collaborative Research SEED Grant Program and the Sony Sensing Solution University Collaboration Program (SSUP). He is also a co-PI on an NSF IUSE project focused on AI-driven support for neurodiverse teamwork. Dr. Qin teaches both undergraduate and graduate courses in AI, including “On-Device Machine Learning” and “AI in Engineering” at SFSU.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/compression-transformation-efficient-deep-learning-mobile-devices-and-llms-education"
  },
  {
    "source": "https://cs.sfsu.edu/news/sfsu-first-csu-campus-join-ibm-quantum-network",
    "category": "news_events",
    "title": "SFSU is first CSU campus to join IBM Quantum Network | Department of Computer Science",
    "content": "SFSU is first CSU campus to join IBM Quantum Network\nAuthor:\nKanaga Rajan\nSeptember 25, 2025\nPhoto Credit:\nJuan Montes\nIBM quantum resources open doors for hands-on learning and workforce readiness\nSan Francisco State University is the first California State University (CSU) campus to join the IBM Quantum Network, expanding opportunities for SFSU students and researchers to participate in quantum computing research and deepening classroom experiences.\nStudent researchers working with Computer Science Professor Wes Bethel — who leads the Department of Computer Science’s quantum computing work — can gain access to IBM quantum computing systems through two key Department of Energy (DOE)-supported initiatives at Oak Ridge National Laboratory (ORNL) and Lawrence Berkeley National Laboratory (LBNL). ORNL and LBNL are IBM Quantum Innovation Centers within the IBM Quantum Network. By having access to the IBM Quantum Network, Bethel hopes to provide some of his engaged students a new pathway to delve deeper into this field.\nIn addition to working with students on DOE-supported research projects, Bethel also teaches “CSC 647/747: Introduction to Quantum Computing and Quantum Information Science” where he uses various freely available resources to introduce quantum computing.\nFormer SFSU student and current LBNL computer systems engineer Chris Pestano (M.S., ’25) explained that he pursued a career in quantum computing because “within the next 10 to 15 years, you should be expecting a lot of major breakthroughs. I thought that’d be interesting to be a part of. That also provides a decent amount of job security.”\nBethel hopes to help more students join the quantum computing pipeline.\n“What we’re doing is workforce development for quantum computing,” Bethel said. “We need people who are capable and know what quantum computing is, how do you write codes for it, how is quantum computing different from classical computing, what are the challenges and software ideas.”\nHaving access to quantum computing resources through these DOE projects gives SFSU computer scientists, researchers and other students hands-on experience to contribute to the rapid progress to the nascent technology and emerging industy.\n“The trick is you need access to real quantum computing hardware. These are not things you can buy off the shelf,” Bethel explained.\nHe was able to apply and receive access to the IBM Quantum Network due to a DOE grant he received last year that funds his quantum computing research. It is part of a multi-institutional grant led by Talita Perciano at LBNL, that includes Bethel at SFSU and researchers at Argonne National Laboratory and is sponsored by DOE’s Office of Advanced Scientific Computing Research.\nDOE facilitates agreements so supercomputing centers (ORNL’s Quantum Computing User Program and LBNL’s National Energy Research Scientific Computing Center’s Quantum Computing Application Network) have access to high-end IBM quantum hardware. To apply for access, researchers like Bethel must be DOE-funded.\nOver the past few years, Bethel has led efforts in the Computer Science department to develop and expand their quantum computing offerings. He’s already had a few graduate students like Pestano who pursued quantum computing-related work or studies after graduation.\n“One of the things he pointed out was that quantum computing is at the stage that’s comparable to modern-day computers post-World War II. He essentially said you’d be going in at the [field’s] infancy.” Pestano said. This idea was exciting to him.\nWhen Pestano started at SFSU, he wasn’t settled on a specific computer science career path. After enjoying Bethel’s graduate-level high-performance computing class, Pestano signed up for his quantum computing class. This naturally led to doing a master’s thesis with Bethel, he explains, noting that this was his first formal research experience. The project allowed Pestano to collaborate with and impress LBNL researchers. He was offered a job to continue his quantum computing work at the national lab.\n“I think it’s not only important to have these connections but also have the proactivity and will to bring that for the students. I think that’s why I liked Dr. Bethel’s class so much,” Pestano added. “He was able to bring in speakers that are currently in industry or in research that he knows. One of the members on my current team actually stopped by as a speaker in the quantum class.”\nBethel previously worked at LBNL as a computer scientist and is still an LBNL research affiliate. His interest in quantum computing began long before he was at SFSU, so he’s determined to help develop SFSU’s footprint in this space and prepare more students like Pestano.\n“From a student perspective, the program we have at San Francisco State is an entry point to a whole universe of technology and jobs and opportunities that have not been present before,” he said.\nLearn more about SFSU’s Department of Computer Science.\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/sfsu-first-csu-campus-join-ibm-quantum-network"
  },
  {
    "source": "https://cs.sfsu.edu/news/sf-state-program-prepares-participants-view-ai-through-ethical-lens",
    "category": "news_events",
    "title": "SF State program prepares participants to view AI through an ethical lens | Department of Computer Science",
    "content": "SF State program prepares participants to view AI through an ethical lens\nAuthor:\nKanaga Rajan\nDecember 4, 2023\nThe Ethical AI certificate provides a foundation in the computer science, philosophy and business of ethical AI\nU.S. President Joe Biden recently issued an\nexecutive order\non managing the risks of artificial intelligence (AI), and the European Union is discussing AI laws abroad. While the news has been flooded with stories of self-driving cars, Chat GPT and how AI will affect jobs, a group of San Francisco State University faculty has been concerned by the ethical implications of AI for years.\nThat’s why they developed San Francisco State’s\nGraduate Certificate in Ethical Artificial Intelligence\nin\n2019\n. The program was created by Computer Science Professor Dragutin Petkovic, Lam Family College of Business Professor Denise Kleinrichert, and Philosophy Professor Carlos Montemayor. They’ve seen the impact of this program on students and think this type of education is as important as ever. Any SF State graduate student and anyone with a bachelor’s degree (non-matriculated post-baccalaureates) can apply for the program.\nRead the full story at SF State News.\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/sf-state-program-prepares-participants-view-ai-through-ethical-lens"
  },
  {
    "source": "https://cs.sfsu.edu/news/fall-2023-engineering-and-computer-science-career-fair",
    "category": "news_events",
    "title": "Fall 2023 Engineering and Computer Science Career Fair | Department of Computer Science",
    "content": "Fall 2023 Engineering and Computer Science Career Fair\nAuthor:\nBriana Miranda\nSeptember 29, 2023\nPhoto Credit:\nMaxwell Owens\nThis year’s Engineering and Computer Science Career Fair took place on September 29, 2023, in the Annex. This event was hosted by the eleven student organizations in the Engineering Student’s Advisory Board. Shriya Dandin, president of the Engineering Student’s Advisory Board, shared that this event was their organizations most successful career fair to date.\nThere was a total of 43 companies participating and over 500 SFSU students in attendance. A couple note-worthy companies in attendance were Google, Intel, and Glassdoor.\nThe Department looks forward to seeing next years Career Fair!\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/fall-2023-engineering-and-computer-science-career-fair"
  },
  {
    "source": "https://cs.sfsu.edu/event/deploy-ai-edge-bridge-information-gap-efficiency-and-security",
    "category": "news_events",
    "title": "Deploy AI at the Edge to Bridge the Information Gap: Efficiency and Security | Department of Computer Science",
    "content": "Deploy AI at the Edge to Bridge the Information Gap: Efficiency and Security\nMonday, March 03, 2025\nEvent Time\n02:00 p.m.   -  03:00 p.m.\nPT\nCost\nLocation\nSEC 210\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nArtificial Intelligence (AI) has significantly transformed various industries and will continue to deepen its integration into daily life. The increasing deployment of IoT devices and large-scale data collection present critical challenges in ensuring efficient AI model integration while maintaining security and user privacy. At the CIDER Lab, we are addressing these issues by exploring how AI can be effectively deployed at the edge to optimize both efficiency and security. Our research spans multiple domains, including wireless communication, cybersecurity, and real-world applications. In wireless networks, we enhance Physical Layer Security (PLS) using Graph Neural Networks (GNNs) and improve spectrum sensing with deep learning techniques. In the realm of security, we focus on phishing detection and explore how Large Language Models (LLMs) can mitigate DDoS attacks when deployed on edge devices. Beyond network security, we also investigate practical applications of Edge AI, such as using machine learning for waste classification, audio analysis with Edge LLMs, and leveraging AI-driven solutions for carbon reduction. By deploying AI at the edge, we aim to bridge the information gap, enabling real-time intelligence while overcoming resource constraints and safeguarding privacy. This seminar will provide insights into our latest research efforts and discuss the challenges and opportunities in developing secure and efficient Edge AI solutions.\nSpeaker Biography\nDr. Qun Wang is an Assistant Professor in the Department of Computer Science at San Francisco State University and leads the CIDER Lab. His research focuses on Edge AI, wireless security, and intelligent network optimization, with applications in cybersecurity, IoT, and sustainable computing. He has worked extensively on deploying AI-driven solutions for secure and efficient communication, spectrum sensing, and resource-constrained edge computing. Dr. Wang has collaborated with industry and academic partners to advance AI-powered security and network intelligence.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/deploy-ai-edge-bridge-information-gap-efficiency-and-security"
  },
  {
    "source": "https://cs.sfsu.edu/event/san-francisco-state-university-graduate-certificate-ethical-ai-overview-and-early-experiences",
    "category": "news_events",
    "title": "San Francisco State University Graduate Certificate in Ethical AI – Overview and Early Experiences | Department of Computer Science",
    "content": "San Francisco State University Graduate Certificate in Ethical AI – Overview and Early Experiences\nThursday, October 10, 2024\nEvent Time\n05:01 p.m.   -  06:00 p.m.\nPT\nCost\nLocation\nSEC 210\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nThis talk first overviews San Francisco State University’s (SFSU) Graduate Certificate in Ethical Artificial Intelligence launched in Fall 2019 by combined efforts of the Computer Science department, department of Philosophy, and the College of Business. It is designed to offer both professionals and graduate students (matriculated or non-matriculated, AI experts or not) the opportunity to acquire a deeper grasp of the ethical, legal, policy, and technical issues of AI, thus enabling them to effectively participate in the development or auditing of ethical and trustworthy AI systems and applications across a spectrum of employment sectors. The talk then gives a bit more details on CSC 859 AI Explainability and Ethics class created and taught by Prof. Petkovic which is also a core class in the certificate. More on SFSU Graduate Certificate in Ethical AI can be found here\nhttps://bulletin.sfsu.edu/colleges/science-engineering/computer-science/certificate-ethical-artificial-intelligence/\nSpeaker Biography\nDragutin Petkovic (IEEE Life Fellow since 2018, IEEE Fellow since 1998) received Ph.D. degree in electrical engineering from UC Irvine in 1983 in the area of biomedical image analysis, and B.S. and M.S. degrees in electrical engineering and multidisciplinary studies respectively from University of Belgrade, Serbia with emphasis on image and signal analysis. He is currently a professor of computer science at San Francisco State University (SFSU) since 2003 where he was computer science department chair from 2003 to 2015. In 2019, he founded and co-leads the multidisciplinary SFSU Graduate Certificate in Ethical Artificial Intelligence together with SFSU Department of Philosophy and School of Business. He was a founder and Director of SFSU Center for Computing for Life Sciences from 2005 till 2018 and collaborated on multiple NIH grants with Stamford University in the areas of Artificial Intelligence (AI) for bioinformatics. He held positions at VMware as a Senior Director, Applications, and as senior manager and researcher at IBM Almaden Research center, San Jose (1983-2000). His research focus included content based retrieval (he was founder of trend-setting IBM Query by Image Content QBIC project). For last 10 years his work combines AI and ease of use and has a goal to bring technology closer to people and users. Due to his concerns about the state of the ethics and trustworthiness of AI systems and their possibly negative implications to society, his recent focus is on explainable and trustworthy AI to which he contributes by papers, books, workshops, talks and importantly by education of broader community via SFSU Certificate of Ethical AI.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/san-francisco-state-university-graduate-certificate-ethical-ai-overview-and-early-experiences"
  },
  {
    "source": "https://cs.sfsu.edu/event/stanford-cybersecurity-cert-clinics-and-competitions",
    "category": "news_events",
    "title": "Stanford Cybersecurity: CERT, Clinics, and Competitions | Department of Computer Science",
    "content": "Stanford Cybersecurity: CERT, Clinics, and Competitions\nWednesday, April 09, 2025\nEvent Time\n02:00 p.m.   -  03:00 p.m.\nPT\nCost\nLocation\nSEC 210\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nThis talk will provide an overview of cybersecurity activities at Stanford, including the Stanford CERT (Computer Emergency Response Team), Stanford Security Clinic (providing\npro bono\ndigital security and safety consultations for the Stanford community), Stanford Bug Bounty program, and our Applied Cyber Collegiate Competition Team.\nSpeaker Biography\nAlex Keller worked as a systems administrator at San Francisco State University for 15 years before moving to Stanford‘s School of Engineering in 2012 where he now serves as a Sr. Systems Security Engineer with responsibilities for security, research technical support, datacenter operations, networking, storage, and virtualization. Advisor to the Stanford Applied Cybersecurity student group and team coach since 2015, Alex is tirelessly passionate about cybersecurity education and outreach.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/stanford-cybersecurity-cert-clinics-and-competitions"
  },
  {
    "source": "https://cs.sfsu.edu/news/prof-daniel-huang-recipient-2023-petkovic-family-teaching-excellence-award",
    "category": "news_events",
    "title": "Prof. Daniel Huang Recipient 2023 Petkovic Family Teaching Excellence Award | Department of Computer Science",
    "content": "Prof. Daniel Huang Recipient 2023 Petkovic Family Teaching Excellence Award\nAuthor:\nDr. Wes Bethel\nMay 28, 2023\nProf. Daniel Huang of the SFSU Computer Science Department is the recipient of the 2023 Petkovic Family Teaching Excellence Award. Dr. Arno Puder, CS Department Chair, presented the award certificate at the 2023 CS Graduation Ceremony.\nThe award criteria includes consideration of feedback from students. Some of the feedback from over 1,400 votes includes comments like:\n\"Not only does the instructor get you excited about the subject, but was easily approachable for questions/comments throughout the semester.\"\n\"Through humor and experience, information was well communicated to the class, which is hard to do for teachers in the cs major. More lively and up-to-date on what a programmer feels than any other CS professor I have met.\"\n\"[He] Really wanted everyone to learn the material and he did that by giving multiple ways of teaching a particular subject and making sure everybody understood the subject.\"\nAbout the award: its purpose is to recognize achievements in teaching effectiveness, in creating an academic environment that fosters student learning, that makes use of high-impact and inclusive active learning techniques, and that contributes to improvement of CS instruction and curriculum. The award is generously provided by the Family of CS Professor Dragutin Petkovic, who has been a champion of the effort that faculty put into teaching.\nCongratulations Prof. Huang! Thanks to the CS students for providing such amazing feedback, and thanks to Prof. Petkovic for creating this award to recognize teaching excellence.\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/prof-daniel-huang-recipient-2023-petkovic-family-teaching-excellence-award"
  }
]