[
  {
    "source": "https://cs.sfsu.edu/",
    "category": "general",
    "title": "Welcome | Department of Computer Science",
    "content": "Welcome\nResearch\nOur faculty and students are engaged in projects and research in many areas of Computer Science. Major areas of focus include Computing for Life Sciences, Soft Computing and Decision Support Systems, Software Engineering and Systems, Human Computer Interaction and more.\nExplore CS Research\nGraduate Program\nCS Department offers a Master of Science (MS) degree. Faculty and students are engaged in innovative research projects, many funded by grants from government or industry such as NSF and NIH, IBM Research, Microsoft, Amazon Web Services, Emulex, Claritics.\nExplore CS Graduate Programs\nUndergraduate Program\nWe are committed to providing the opportunity to master the Computer Science discipline to students from all backgrounds. Our program combines strong fundamentals, project- and team- oriented activities, and soft skills, leading to a well-rounded professional education.\nExplore CS Undergraduate Programs\nCS @ SF State Highlights\nWe Are Hiring!\nSan Francisco State University's Computer Science Department in the College of Science and Engineering offers an exciting opportunity for a tenure-track Assistant Professor position beginning August 2026. We seek a colleague whose teaching and research interests include Cybersecurity, Machine Learning/Generative AI, and/or Quantum Computing although candidates with research interests in other areas are also welcome to apply. We are especially interested in qualified candidates with a demonstrated commitment -- through their research, teaching, and service -- to the excellence of our academic program and community.\nFor best consideration, please apply by 1/31/2026.\nApply Here.\nStudent Spotlight - Diversity and Equity\nSF State Science Coding Programs Boost Biotech Diversity\nGrants impact SF State’s computer science diversity efforts with new certification programs and scholarships. The importance of diversity and equity in computer science is important to the CS Department and faculty members' efforts have recently received recognition from both academia and the biotech industry.\nReview Diversity Grant Efforts\nStudent Spotlight - Graduate Certificates Options\nEthical Artificial Intelligence & Software Engineering\nCS Department announces two new Graduate Certificates in Ethical Artificial Intelligence and Software Engineering. Learn about the certificates, the eligibility processing and how to apply.\nView Grad Certificates Options\nNews\nSFSU is first CSU campus to join IBM Quantum Network\nIBM quantum resources open doors for hands-on learning and workforce readiness\nSan Francisco State University is the first C…\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nOn August 20, 2025, the Kumo AI Hackathon took place in San Francisco. The CIDER Lab students Binrong Zhu, Guiran Liu, and Y…\nAnnouncement of Two New Grants Awarded From NSF\nGrant 1\nCollaborative Research: CISE Core Small: NeTS: Intelligent Reflecting Surface Assisted Physical Layer Security Enhan…\nMore News\nMore events coming soon!\nMore Upcoming Events",
    "url": "https://cs.sfsu.edu/"
  },
  {
    "source": "https://cs.sfsu.edu/artificial-intelligencemachine-learning",
    "category": "general",
    "title": "Artificial Intelligence/Machine Learning | Department of Computer Science",
    "content": "Artificial Intelligence/Machine Learning\nOur AI research program delves into the intersection of methods, applications, and ethics of AI. Researchers develop novel methods to enhance capabilities, transparency, and interpretability of AI models.  Simultaneously, the program applies these techniques to real-world challenges, including usability of computer systems by people with disabilities and to science problems, ensuring that AI technology benefits society responsibly and justly.\nAcademics and Coursework\nStudents may specialize their education around Artificial Intelligence/Machine Learning topics via these undergraduate and graduate level courses, as well as in a\nGraduate Certificate in Ethical Artificial Intelligence\nUndergraduate Courses\nCSC 308\nIntroduction to Machine Learning for Interdisciplinary Data Scientists\nCSC 508\nMachine Learning and Data Science for Personalized Medicine\nCSC 509\nData Science and Machine Learning for Medical Image Analysis\nCSC 601\nData Science and Machine Learning for Biotechnology Seminar Series\nCSC 602\nInterview Preparation for Data Science and Machine Learning for Biotechnology Opportunities\nCSC 621\nNatural Language Technologies\nCSC 665\nBiomedical Imaging and Analysis\nCSC 671\nDeep Learning\nCSC 676\nSoft Computing and Decision Support Systems\nGraduate Courses\nCSC 820\nNatural Language Technologies\nCSC 821\nBiomedical Imaging and Analysis\nCSC 859\nAI Explainability and Ethics\nCSC 865\nArtificial Intelligence\nCSC 871\nDeep Learning\nCSC 872\nPattern Analysis and Machine Intelligence\nCSC 874\nTopics in Big Data Analysis\nCSC 876\nSoft Computing and Decision Support Systems\nCSC 878\nBig Data Platforms and Systems\nCSC 890\nGraduate Seminar - Advanced Artificial Intelligence\nFaculty and Focus Areas\nWes Bethel\nHigh performance computing, quantum computing, scientific computing, computer graphics, scientific visualization, artificial intelligence/machine learning, computer vision/image analysis, computer organization and architecture\newbethel@sfsu.edu\nAnagha Kulkarni\nNatural language processing, information retrieval, machine learning\nak@sfsu.edu\nKaz Okada\nMachine learning, computer vision, biomedical imaging\nkazokada@sfsu.edu\nDragutin Petkovic\nEthical artificial intelligence\npetkovic@sfsu.edu\nHui Yang\nData mining & machine learning, with a current focus on educational data mining/machine learning\nhuiyang@sfsu.edu\nJozo Dujmovic\nComputational intelligence: soft computing, graded logic, decision support systems\njozo@sfsu.edu\nPublications and Reports\nSánchez-Villar, Á., Bai, Z., Bertelli, N., Bethel, E. W., Hillairet, J., Perciano, T., Shiraiwa, S., Wallace, G. M., & Wright, J. C. (2025). Machine learning enhanced predictions of ICRF heating: Overcoming numerical limitations via data curation.\nPhysics of Plasmas\n,\n32\n(6), 062504.\nhttps://pubs.aip.org/aip/pop/article/32/6/062504/3349116/Machine-learning-enhanced-predictions-of-ICRF\nVerma, S., Wang, Q., & Bethel, E. W. (2025, April). Intelligent IoT Attack Detection Design via ODLLM with Feature Ranking-based Knowledge Base.\nGenAI@Edge: Empowering Generative AI at the Edge, AAAI 2025 Spring Symposium\n.\nhttps://ojs.aaai.org/index.php/AAAI-SS/article/view/35587\nSánchez-Villar, Á., Bai, Z., Bertelli, N., Bethel, E. W., Hillairet, J., Perciano, T., Pyeon, G., Shiraiwa, S., Wallace, G. M., & Wright, J. C. (2025, October). Enabling Real-Time ICRF Heating Predictions via an Automated Surrogate Model Generator Suite.\n30th IAEA Fusion Energy Conference (IAEA FEC 2025)\n.\nhttps://conferences.iaea.org/event/392/contributions/35985/\nDujmović, J. Graded Logic -- Modeling Human Commonsense Reasoning in Decision-Making and AI. Springer, 2025.\nhttps://link.springer.com/book/9783031885570\nBethel, EW, Cramer, V., del Rio, A., Narins, L., Pestano, C., Verma, S., Arias, E., Bertelli, N., Perciano, T., Shiraiwa, S., Sanchez-Villar, A., S., Wallace, G., & Wright, JC (2024). Case Study: Leveraging GenAI to Build AI-based Surrogates and Regressors for Modeling Radio Frequency Heating in Fusion Energy Science. Lawrence Berkeley National Laboratory, LBNL-2001609.\nhttps://arxiv.org/abs/2409.06122\nSanchez-Villar, A., Bai, Z., Bertelli, N., Bethel, EW, Hillairet, J., Perciano, T., Shiraiwa, S., Wallace, GM, & Wright, J. (2024). Real-time capable modeling of ICRF heating on NSTX and WEST via machine learning approaches. Nuclear Fusion.\nhttps://doi.org/10.1088/1741-4326/ad645d\nL. D. Narins, A. Scott, A. Gautam, A. Kulkarni, M. Castanon, B. Kao, S. Ihorn, Y. T. Siu, J. M. Mason, A. M. Blum, I. Yoon. Validated Image description Rating Dataset”  NeurlIPS, Neural Information Processing Systems Datasets and Benchmarks Track, 2023. [Online]. Available:\nhttps://neurips.cc/virtual/2023/poster/73420\nA. Stangl, S. Ihorn, Y. T. Siu, A. Bodi, M. Castanon, L. Narines, I. Yoon, “The potential of a visual dialogue agent in a tandem automated audio description system for videos,” in\nASSETS\n, New York, NY, 2023. [Online]. Available:\nhttps://assets23.sigaccess.org/accepted-papers.html\nScott, A., Narins, L., Kulkarni, A., Castanon, J., Kao, B., Ihorn, S., Siu, Y. & Yoon, I. (2023). Improved Image Caption Rating - Datasets, Game, and Model. In Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing Systems (CHI EA ’23), April 23–28, 2023, Hamburg, Germany. ACM, New York, NY, USA.\nhttps://doi.org/10.1145/3544549.3585632\nC. Pitcher-Cooper, M. Seth, B. Kao, J. M. Coughlan, and I. Yoon, “You Described, We Archived: A Rich Audio Description Dataset,”\nJ. Technol. Pers. Disabil.\n, vol. 11, 2023, [Online]. Available:\nhttps://www.zotero.org/google-docs/?IF7cWk\nÁ. Sánchez-Villar, Z. Bai, N. Bertelli, E. W. Bethel, J. Hillairet, T. Perciano, S. Shiraiwa, G. Wallace, and J. C. Wright. Methodology for surrogate modeling implementation: application to the ICRF wave absorption forward problem. In 65th Annual Meeting of the APS Division of Plasma Physics, Denver, CO, USA, November 2023. Abstract: BO05.00015.\nChong Teng, Daniel Huang, Elizabeth Donahue, and Junwei Lucas Bao. Exploring Torsional Conformer Space with Physical Prior Mean Function-Driven Meta-Gaussian Processes. Journal of Chemical Physics, 2023.\nChong Teng, Daniel Huang, and Junwei Lucas Bao. A Spur to Molecular Geometry Optimization: Gradient-Enhanced Universal Kriging with On-the-Fly Adaptive Ab Initio Prior Mean Functions in Curvilinear Coordinates. Journal of Chemical Physics, Emerging Investigators Special Collection, 2023.\nHui-Ming Deanna Wang，Yinxing Li，and Hui Yang, “Content Diffusion on Social Media:The Roles of Emerging Ties and Users”. In Proceedings of the 13th International Conference on Information Integration and Innovation (ICIII 2022), Taiwan. December 2022.\nG.M. Wallace, Z. Bai, R. Sadre, T. Perciano, N. Bertelli, S. Shiraiwa, E.W. Bethel, and J.C. Wright. Towards fast and accurate predictions of radio frequency power deposition and current profile via data-driven modelling: applications to lower hybrid current drive. Journal of Plasma Physics, 88(4):895880401, August 2022.\nhttps://www.doi.org/10.1017/S0022377822000708\n.\nShuai Zhang, Robbie Sadre, Benjamin A. Legg, Harley Pyles, Talita Perciano, E. Wes Bethel, David Baker, Oliver Rübel, and James J. De Yoreo. Rotational dynamics and transition mechanisms of surface-adsorbed proteins. Proceedings of the National Academy of Sciences, 119(16):e2020242119, April 2022.\nhttps://www.pnas.org/doi/abs/10.1073/pnas.2020242119\n.\nChong Teng, Yang Wang, Daniel Huang, Katherine Martin, Jean-Baptiste Tristan, and Junwei Lucas Bao. Dual-Level Training of Gaussian Processes with Physically Inspired Priors for Geometry Optimizations. Journal of Chemical Theory and Computation, 2022.\nDaniel Huang, Junwei Lucas Bao, and Jean-Baptiste Tristan. Geometry Meta-Optimization. Journal of Chemical Physics, 2022.\nDaniel Huang, Chong Teng, Junwei Lucas Bao, and Jean-Baptiste Tristan. mad-GP: Automatic Differentiation of Gaussian Processes for Molecules and Materials. Journal of Mathematical Chemistry, 2022.\nJohn Wright, Greg Wallace, E. Wes Bethel, Zhe Bai, Talita Perciano, Robbie Sadre, Nicola Bertelli, and Syun’ichi Shiraiwa. Overview and status of the FES Scientific Machine Learning Project \"Accelerating Radio Frequency Modeling Using Machine Learning\". In Proceedings of the 63rd Annual Meeting of the APS Division of Plasma Physics, volume 66, Pittsburgh, PA, USA, November 2021. TM10.00002s\nHui Yang, Thomas W. Olson*, and Arno Puder, Analyzing Computer Science Students' Performance Data to Identify Impactful Curricular Changes. In the proceedings of IEEE Frontiers in Education 2021, Lincoln, Nebraska, USA, October 2021.\nHui Yang, Apurva Pimparkar*,Celia Graterol, Rama Ali Kased, and Mary Beth Love, Analyzing college students’ interaction records to improve retention and graduation outcome. In the proceedings of IEEE Frontiers in Education 2021, Lincoln, Nebraska, USA, October 2021.\nAditya Bodi, Pooya Fazli, Shasta Ihorn, Yue-Ting Siu, Andrew Scott, Lothar Narins, Yash Kant, Abhishek Das, and Ilmi Yoon,\n“\nAutomated Video Description for Blind and Low Vision Users”. In Proceedings of the ACM SIGCHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI), 2021.\nGovindu S, Guttula R, Swati Kohli, Poonam Patil, Kulkarni A, Yoon I. “Towards Intelligent Reading through Multimodal and Contextualized Word LookUp”. ICMLA. 2021.\nWong, M., Previde, P., Cole, J., Thomas, B., Laxmeshwar, N., Mallory, E., Lever, J., Petkovic, D., Altman, R.B. and Kulkarni, A., 2021. Search and visualization of gene-drug-disease interactions for pharmacogenomics and precision medicine research using GeneDive.\nJournal of biomedical informatics\n,\n117\n, p.103732.\nhttps://doi.org/10.1016/j.jbi.2021.103732\nGovindu, S., Guttula, R. V., Kohli, S., Patil, P., Kulkarni, A., & Yoon, I. (2021). Towards Intelligent Reading through Multimodal and Contextualized Word LookUp. In\n2021 20th IEEE International Conference on Machine Learning and Applications (ICMLA)\n(pp. 1249-1252). IEEE.\nWong, M., Ghahghaei, S., Chandna, A. and Kulkarni, A. (2021) August. Scalable non-invasive pediatric cerebral visual impairment screening with the higher visual function question inventory (HVFQI). In\nProceedings of the 12th ACM Conference on Bioinformatics, Computational Biology, and Health Informatics\n(pp. 1-1). (Poster presentation).\nWong, M., Laxmeshwar, N., Joshi, R. and Kulkarni, A. (2021) August. Browsing weighted interactome models using GeneDive. In\nProceedings of the 12th ACM Conference on Bioinformatics, Computational Biology, and Health Informatics\n(pp. 1-1). (Poster presentation).\nT. Touati, K. Okada, I. Song,\nWhat makes a person obese?: An individual-level analysis of obesity\n, Accepted as 1-page extended abstract at IEEE International Conference on Biomedical and Health Informatics, (2021)\nDujmović, J., Soft Computing Evaluation Logic: The LSP Decision Method and Its Applications. Wiley, 2018.\nhttps://onlinelibrary.wiley.com/doi/book/10.1002/9781119256489\nGrants and Awards\nUS Department of Energy, Office of Fusion Energy Sciences. Automated ML Model Development and Testing for Fusion Tokamak Devices Subaward from Massachusetts Institute of Technology. Nov. 2023. Sep. 2025. (PI: W. Bethel)\nU. S. Department of Energy, Office of Fusion Energy Sciences. Accelerating Radio Frequency Modeling Using Machine Learning. Subaward from Lawrence Berkeley National Laboratory. Oct. 2022 – Sep. 2024. (PI: W. Bethel)\nGoogle Research, Democratizing Artificial Intelligence: Fairness, Accountability, Transparency, and Ethics. August 2021.   (PIs: P. Fazli, A. Gautam, D. Huang, and H. Yang)\nFoundation for California Community Colleges, Enhancing Program Pathways Mapper with Large Language Models to Further Assist Transfer Students. January 2023–December 2023. (PIs: H. Yang and A. Puder)\nGenentech Inc. Grant Renewal Award. Expansion of the gSTAR Professional Certificate Program “Data Science and Machine Learning for Biotechnology Professionals.”  August 2023 – July 2026. (PI: A. Kulkarni, Co-PIs: I. Yoon, P. Pennings, and S. Ihorn)\nGenentech Foundation Grant Renewal. Gen-PINC Scholarships Program. June 2024 – May 2029. (PI: A. Kulkarni, Co-PIs: I. Yoon, P. Pennings, and S. Ihorn)\nSmith Kettlewell Eye Research Institute. Computational Solutions for the Study of Higher Visual Function Deficits. Sept 2022 – Aug 2027. (PI: A. Kulkarni)\nGenentech Foundation Grant Award. Gen-PINC Scholarships Program. September 2020 – May 2024. (PI: A. Kulkarni, Co-PIs: I. Yoon, P. Pennings, and S. Ihorn)\nGenentech Inc. Grant Award. gSTAR: New Certificate Program “Data Science and Machine Learning for Biotechnology.”  August 2020 – July 2023. (PI: A. Kulkarni, Co-PIs: I. Yoon, P. Pennings, and S. Ihorn)\nNSF S-STEM (Award # 2030581). Scholarships To Improve Undergraduate Students' Academic Achievement, Retention, and Career Success in Computer Science and Artificial Intelligence (AI-STAARS Program).  March 2021 – February 2025. (PI: A. Kulkarni, Co-PIs: I. Yoon, P. and S. Ihorn)",
    "url": "https://cs.sfsu.edu/artificial-intelligencemachine-learning"
  },
  {
    "source": "https://cs.sfsu.edu/grads/sequence-of-study",
    "category": "general",
    "title": "Sequence of Study | Department of Computer Science",
    "content": "Sequence of Study\nThe curriculums of both CS master’s degree programs are carefully designed to span over four terms. We recommend that our graduate students follow the term-by-term roadmap described below.  Students are also encouraged to meet with a Graduate Advisor at least once every  term for advice and guidance.\nFirst and foremost, you want to gain a clear understanding of your respective program’s degree requirements:\nM.Sc. in Computer Science\n,\nM.Sc. in Data Science & AI\n. Keep in mind the following requirements to maintain your graduate student status:\nGraduate students are required to maintain a 3.0 grade point average (B or above) each and every semester.\nFor a given course, the minimum allowable grade is B- if you plan to use this course to satisfy one of the degree requirements.\nInternational students are required to enroll in a minimum of 8 units per semester. You will be eligible to take fewer than 8 units after you are enrolled in CSC 897 or CSC 899, a course directly related to your Master’s thesis project.  See\nhere\nfor more details on this requirement.\nSecond, you are required to complete a total of 30 units (or 10 3-unit graduate-level courses). You are recommended to distribute these 30 units as follows:\nTerm 1:   9 units (3 courses)\nTerm 2: 12 units (4 courses)\nTerm 3:   6 units (2 courses: 1 lecture-based course; CSC 897 or CSC 899 supervised by your Master’s thesis/project mentor)\nTerm 4:   3 units (1 course: CSC 895 or CSC 898, supervised by your Master’s thesis/project mentor)\nFinally, if you are a current graduate student in Computer Science, log into\nthis internal website\nfor more specifics.\nFirst Semester\nEnroll in 9 units (or 3 3-unit courses) in your first semester.\nFor students admitted with conditional undergraduate courses (which are listed on your official admission letter), you are required to complete these courses with a letter grade of B or above by the due date stated on your admission letter.\nFor the\nEnglish Level I\nrequirement, the preferred course is SCI 614. If SCI 614 is not offered, you can enroll in ENG 670 instead.\nFor those with fewer conditional courses, it is okay to enroll in graduate-level courses together with your conditional course(s) in your first term.\nStart attending the\nCS Graduate Seminars\nduring your first semester. Each Semester, approximately eight seminars will be offered.\nYou are required to attend the first graduate seminar that overviews the two graduate programs.\nYou are required to complete a total of 10 seminars by the end of the  term prior to enrolling in the Master’s thesis/project course, i.e., CSC 895 or CSC 898.\nStart thinking about your areas of interest, looking into the CS faculty team’s\nresearch areas\n, and identifying a few Master’s thesis project ideas. You are highly recommended to meet and discuss your project ideas with relevant faculty members.\nNote that only the faculty members listed under the\nFaculty\ncategory and the department chairpersons are eligible to chair a student’s Master’s thesis project committee. We commonly refer to them as faculty mentors, in contrast with regular graduate advisors.\nIt is\ncritical\nto plan to take graduate-level electives with possible culminating experience with faculty mentors during your first year of study\nSecond Semester\nIf you have not done so, it is time to make a term-by-term course-taking plan for your graduate studies by referring to the degree requirements (\nM.Sc. in Computer Science\n,\nM.Sc. in Data Science & AI\n). Use the\nAdvanced Class Search\ninterface to get a rough idea on the courses that had been routinely offered in the past Spring or Fall semesters. Many graduate-level courses are typically offered in either the Spring or Fall semester.\nShare your course plan with your graduate advisor to proactively seek their feedback.\nHave identified at least a couple of Master’s thesis/project ideas and the corresponding faculty mentors.\nEnroll in at least three courses.At least one of the courses should be taught by your prospective thesis/project mentor. Communicate your intent with your prospective  mentors in advance and start to foster a professional mentor-mentee relationship.\nBy the end of this term, you are expected to have selected your culminating experience (a.k.a. Master’s thesis/project) mentor and obtain this mentor’s permission to work under their supervision.\nSemester Break\nInvestigate culminating experience topics and work with your mentor on obtaining background knowledge/skills.\nPossibly do an external internship to get practical experience in CSC 893. This typically happens during the summer break.  Note that you are not required to enroll in CSC 893, but it is nice to include it in your transcript.  Check the\n“Fall/Spring CPT”\nsection for the CSC 893 enrollment process.\nThird Semester\nAdjust your course planner made during the second term. You are highly recommended to meet with your graduate advisor for advice and guidance\nWork with your master’s thesis/project mentor to enroll in CSC 897/899 for background work on Thesis/Project.  Enroll in other courses as needed to meet other degree requirements.\nIf you are an international student and enrolled in less than 8 units this semester, contact your master’s thesis/project mentor to prepare and submit to the SFSU Office of International Programs (OIP) a letter of support on your behalf.\nComplete and submit the Advancement To Candidacy (ATC) form prior to university deadlines (November 1 or April 1). All courses included in the ATC form must be at or above B-.\nComplete and submit the Proposal for Culminating Experience (PCE) form prior to university deadlines (November 1 or April 1).  Note that if Human or Animal Subjects Protocols are required, these must also be approved by your mentor and submitted by this deadline.\nSubmit the long project/thesis proposal to the CS department.\nFor current graduate students,\nclick\nhere\nto read about the specific criteria and procedures to enroll in CSC 897/899, CSC 895/898. It also includes procedures on preparing and submitting the ATC and PCE forms, and the long proposal.\nFourth (and final) Semester\nEnroll in your mentor’s CSC 895/898 for your Master’s project/thesis.\nComplete your Master’s project/thesis project by closely working with your mentor and your other committee member(s).\nReady to graduate?  Click\nhere\nto view more details about the following steps.\nApply for graduation.\nWork on your written thesis/report.\nSchedule thesis/project Oral Defense.\nDefend your Master’s thesis/project.\nFinalize all thesis/project materials and submit them to the Computer Science department and/or SFSU.\nThe “Grace” Semester\nThe Spring or Fall semester following the semester of your CSC 895/898 enrollment is often referred to as the “grace” semester. Every graduate student is granted this grace semester to complete their CSC 895/898 project. Students are not required to enroll in any courses during their grace semester.\nBeyond the “Grace” Semester\nStudents who do not complete their CSC 895/898 after the grace semester must enroll in a 0-unit\nCulminating Experience Continuous Enrollment\ncourse (i.e.,\nSCI 499\n) with the College of Professional & Global Education (CPaGL) and every subsequent semester until CSC 895/898 is completed.\nEnrollment in SCI 499 provides you access to SFSU libraries, discipline-associated laboratories and facilities, and Culminating Experience advisors.\nStudents are automatically withdrawn from their degree program if they fail to maintain continuous enrollment status after the grace semester.\nStudents who do not maintain continuous enrollment in their Culminating Experience course and subsequently return to complete their Culminating Experience within the 7-year time limit to complete requirements for graduate degrees must be reinstated in their degree program and may have to file a new Proposal for Culminating Experience.\nStudents who are past the 7-year limit must formally reapply for admission to the program in which they were completing their Culminating Experience. There is no guarantee of readmission.",
    "url": "https://cs.sfsu.edu/grads/sequence-of-study"
  },
  {
    "source": "https://cs.sfsu.edu/undergrads/prerequisite-chart",
    "category": "general",
    "title": "Prerequisite Chart | Department of Computer Science",
    "content": "Prerequisite Chart\nEnforcement\nCS Department\nstrictly\nenforces prerequisites for all courses. Prerequisites are checked by CS faculty at the beginning of each course. The final decision about whether a student is ready to take a course is made by the instructor who teaches the course.\nBulletin Rights\nStudents who start the study of CS under a program that is published in the Bulletin have the right to graduate with the same program in a specific time interval. However, this right\ndoes not\nhold for course prerequisites. The CS Department regularly improves its curriculum and as a result the prerequisites may change. Because the Bulletin is printed early (before the start of the academic year), it may not completely reflect the most recent changes to prerequisites.",
    "url": "https://cs.sfsu.edu/undergrads/prerequisite-chart"
  },
  {
    "source": "https://cs.sfsu.edu/undergrads/student-policies",
    "category": "general",
    "title": "Student Policies | Department of Computer Science",
    "content": "Student Policies\nThe university is committed to maintaining a safe and healthy living and learning environment for students, faculty, and staff. Each campus community member should choose behaviors that contribute toward this end. Therefore, students are expected to be good citizens and to engage in responsible behaviors that reflect well upon their university, be civil to one another and others in the campus community, and contribute positively to student and university life.\nPrerequisite Policy\nCS Department strictly enforces prerequisites for all courses.\nPrerequisites are checked by CS faculty at the beginning of each course.\nA grade of\nC or better is required\nto be accepted as a prerequisite.\nThe final decision about whether a student is ready to take a course is made by the instructor who teaches the course.\nCheating and Plagiarism Policy\nBy academic cheating and plagiarism we mean presenting, as your own work, material produced by or in collaboration with others, or permitting or assisting others to present your work as their own without proper acknowledgment.\nThe policies of San Francisco State University, with respect to cheating and plagiarism, are stated in SF State's Bulletin. Courses involving computer programming require special consideration because use of the computer permits easy copying and trivial modification of programs. In addition, our polices also address availability of content and services on the Internet which can be used for plagiarism and cheating. The following guidelines are provided to help in determining if an incident of cheating or plagiarism has occurred.\nThe instructor may suspect a student of program plagiarism if the student submits a program that is so similar to the program submitted by a present or past student in the course that the solutions may be converted to one another by a simple mechanical transformation.\nThe instructor may suspect a student of cheating, whether on a program or an examination, if the student cannot explain both the intricacies of his or her solution and the techniques and principles used to generate that solution.\nIt should be clear that there is latitude for difference among individual instructors, particularly on the matter of when working with other students or adapting material from a textbook is permissible. The following general policy on cooperation on homework assignments holds:\nIn all circumstances it is acceptable to discuss the meaning of assignments and general approaches and strategies for handling those assignments with other members of the Academic Community. Any cooperation beyond that point, including shared pseudocode or flowcharts, shared code, or shared documentation, is only acceptable if specifically so permitted by the class instructor in written guidelines distributed to the entire class.\nThe Penalty\nIn cases of academic cheating or plagiarism, no credit will be given for the assignment in question and a record will be kept in the Computer Science department office. If a second or further incident is reported for an individual, or if the circumstances of a first incident so warrant, a letter describing the incident(s) will be forwarded to the Student Discipline Officer for possible disciplinary action, which may include expulsion, suspension, or probation; as well as lesser sanctions. Please refer to the Supplemental Regulations and Procedures section of SF State's Bulletin for details.\nAny student using Rentacoder or similar WWW service in any relation to schoolwork will be dealt with most seriously, including possible expulsion from the university.\nExamples\nWhen a student turns in the work of another student and represents it as his or her own work.\nWhen a student knowingly permits another to turn in his or her work.\nWhen a student copies code from the work of another student.\nWhen a student deliberately transforms borrowed sections of code in order to disguise their origin.\nWhen several students collaborate on a project and fail to inform the instructor of this.\nWhen a student steals or obtains examinations, answer keys, or program samples from the instructors files or computer directories.\nWhen a student modifies or deletes another student's or an instructor's computer files.\nWhen a student uses content from other sources like Internet and includes it in his/her work or projects without proper attribution.\nWhen a student uses Internet or other services to post assignments and seek solutions.\nWhen Internet resources are used verbatim and/or \"cut and pasted\" into students work regardless whether they are acknowledged or not.\nWhen Does It Not Occur?\nWhen students have permission to collaborate on a project, and list all collaborators.\nWhen students receive advice from instructors, teaching assistants, or staff members involved in the course.\nWhen students share knowledge about syntax errors, coding tricks, or other language-specific information that makes programming easier.\nWhen students engage in a general discussion of the nature of an assignment, the requirements for an assignment, or general implementation strategies.\nWhen students compare independent solutions to an assignment in order to better understand the nature of the assignment.\nWhen students engage in discussion of course concepts or programming strategies in preparation for an assignment or examination.\nWhen students copy code and cite its source on assignments for which the instructor allows inclusion of code other than the student's own.\nHow to Check for Plagiarism\nPlease consult with your course instructor if you have any questions regarding whether or not your work with other students and/or materials prepared for submission are appropriate. The following examples illustrate situations when Academic Cheating and/or Plagiarism has and has not occurred. Please note these lists are not comprehensive!\nSee also the reference materials posted by SF State's Center for Teaching and Faculty Development on Academic Integrity & Plagiarism:\n(SF State's Plagirarism Policy Page)\nDistribution of this Policy\nCopies of this policy will be available in the department office and posted on bulletin boards within the department. The policy will also be attached to, or included, in the undergraduate and graduate information bulletins.\nAn announcement of the existence of the policy will be made by the instructor at the first meeting each semester of every Computer Science class, at which time any course specific guidelines on cooperation and use of published programs can also be stated. For lower division courses, reference to this policy and statement of any course specific guidelines will be included in the course syllabus distributed to all students.\nPolicy on Observance of Religious Holidays\nThe San Francisco State University faculty shall make reasonable accommodations for students to observe religious holidays when such observances require students to be absent from class activities.\nIt is the responsibility of the student to inform the instructor, in writing, about such holidays during the first two weeks of the class each semester. If such holidays occur during the first two weeks of the semester, the student must notify the instructor, in writing, at least three days before the date that they will be absent.\nIt is the instructor's responsibility to make every reasonable effort to honor the student's request without penalty and for the student to make up the work missed.\nStudent Disclosures on Sexual Violence\nSF State fosters a campus free of sexual violence including sexual harassment, domestic violence, dating violence, stalking, and/or any form of sex or gender discrimination.\nIf you disclose a personal experience as an SF State student, the course instructor is required to notify the Dean of Students.\nTo disclose any such violence confidentially, please contact:\nThe SAFE Place:\n(415) 338-2208\nhttp://www.sfsu.edu/~safe_plc/\nCounseling and Psychological Services Center:\n(415) 338-2208\nhttp://psyservs.sfsu.edu/\nFor more information on your rights and available resources:\nhttp://titleix.sfsu.edu\nDisability Access\nStudents with disabilities who need reasonable accommodations are encouraged to contact the instructor.\nThe Disability Programs and Resource Center (DPRC) is available to facilitate the reasonable accommodations process. The DPRC is located in the Student Services Building and can be reached by telephone (voice/TTY 415-338-2472) or by email\ndprc@sfsu.edu\n.\nFor more information, please visit their homepage:\nhttp://www.sfsu.edu/~dprc",
    "url": "https://cs.sfsu.edu/undergrads/student-policies"
  },
  {
    "source": "https://cs.sfsu.edu/cybersecurity-research",
    "category": "general",
    "title": "Cybersecurity Research | Department of Computer Science",
    "content": "Cybersecurity Research\nOur cybersecurity research program is dedicated to advancing techniques, algorithms, and knowledge essential for protecting systems and data against threats. It delves into emerging threats such as data/model poisoning, eavesdropping, and privacy leakage while also bolstering intrusion detection systems. Through collaborative efforts, our researchers strive to develop robust cybersecurity solutions that protect privacy and ensure the integrity of digital assets.  This program aims to strengthen cyber defenses in an ever-evolving technological landscape.\nAcademics and Coursework\nIn addition to broader requirements for a CS undergraduate or graduate degree, students may specialize their education around Cybersecurity research topics via these undergraduate and graduate level courses:\nUndergraduate Courses\nCSC 415\nOperating System Principles\nCSC 645\nComputer Networks\nCSC 652\nIntroduction to Security and Data Privacy\nCSC 653\nNetwork Security\nCSC 675\nIntroduction to Database Systems\nGraduate Courses\nCSC 845\nAdvanced Computer Networks\nCSC 852\nIntroduction to Security and Data Privacy\nCSC 853\nNetwork Security\nCSC 890\nGraduate Seminar - Machine Learning for Cybersecurity\nCSC 895\nApplied Research Project\nCSC 897\nResearch\nCSC 898\nMaster's Thesis\nFaculty and Focus Areas\nHao Yue\nComputer network and system security\nhaoyue@sfsu.edu\nJingyi Wang\nCybersecurity and big data privacy\njingyiwang@sfsu.edu\nQun Wang\nCybersecurity, security for machine learning, wireless security\nqunwang@sfsu.edu\nPublications and Reports\nS. Jiang, J. Li, X. Zhang, H. Yue, H. Wu and Y. Zhou, \"Secure and Privacy-Preserving Energy Trading with Demand Response Assistance Based on Blockchain,\" in IEEE Transactions on Network Science and Engineering, doi: 10.1109/TNSE.2023.3321754. (2023)\nX. Zhang, J. Wang, H. Zhang, L. Li, M. Pan and Z. Han, \"Data-Driven Transportation Network Company Vehicle Scheduling With Users’ Location Differential Privacy Preservation,\" in IEEE Transactions on Mobile Computing, vol. 22, no. 2, pp. 813-823, 1 Feb. 2023, doi: 10.1109/TMC.2021.3091148.\nL. Li et al., \"Privacy Preserving Participant Recruitment for Coverage Maximization in Location Aware Mobile Crowdsensing,\" in IEEE Transactions on Mobile Computing, vol. 21, no. 9, pp. 3250-3262, 1 Sept. 2022, doi: 10.1109/TMC.2021.3050147.\nQ. Wang, H. Sun, R. Q. Hu and A. Bhuyan, \"When Machine Learning Meets Spectrum Sharing Security: Methodologies and Challenges,\" in IEEE Open Journal of the Communications Society, vol. 3, pp. 176-208, 2022, doi: 10.1109/OJCOMS.2022.3146364.\nX. Zhang et al., \"Data-Driven Caching With Users’ Content Preference Privacy in Information-Centric Networks,\" in IEEE Transactions on Wireless Communications, vol. 20, no. 9, pp. 5744-5753, Sept. 2021, doi: 10.1109/TWC.2021.3069763.\nQ. Wang, F. Zhou, R. Q. Hu and Y. Qian, \"Energy Efficient Robust Beamforming and Cooperative Jamming Design for IRS-Assisted MISO Networks,\" in IEEE Transactions on Wireless Communications, vol. 20, no. 4, pp. 2592-2607, April 2021, doi: 10.1109/TWC.2020.3043325.\nS. Jiang, X. Zhang, J. Li, H. Yue and Y. Zhou, \"Secure and Privacy-preserving Energy Trading Scheme based on Blockchain,\" GLOBECOM 2020 - 2020 IEEE Global Communications Conference, Taipei, Taiwan, 2020, pp. 1-6, doi: 10.1109/GLOBECOM42002.2020.9348246.\nDing, Jiahao, et al. \"Towards plausible differentially private ADMM based distributed machine learning.\"\nProceedings of the 29th ACM International Conference on Information & Knowledge Management\n. 2020.\nR. Chen, X. Zhang, J. Wang, Q. Cui, W. Xu and M. Pan, \"Data-Driven Small Cell Planning for Traffic Offloading with Users’ Differential Privacy,\" ICC 2020 - 2020 IEEE International Conference on Communications (ICC), Dublin, Ireland, 2020, pp. 1-6, doi: 10.1109/ICC40277.2020.9149254.\nQ. Wang, H. Hu, H. sun and R. Q. Hu, \"Secure and Energy-Efficient Offloading and Resource Allocation in a NOMA-Based MEC Network,\" 2020 IEEE/ACM Symposium on Edge Computing (SEC), San Jose, CA, USA, 2020, pp. 420-424, doi: 10.1109/SEC50012.2020.00063.\nGrants and Awards\nUncover the Ghost: Deep Learning based Spammer Detection on Twitter, Principal Investigator (Hao Yue), $10,000, SFSU ORSP Small Grant, 08/16/2018-08/15/2019.\nPrivacy-Preserving Medical Data Access in Future eHealth Systems, Principal Investigator (Hao Yue), $5,000, SFSU Center for Computing in Life Sciences (CCLS), 02/01/2016-01/31/2017.",
    "url": "https://cs.sfsu.edu/cybersecurity-research"
  },
  {
    "source": "https://cs.sfsu.edu/employment",
    "category": "general",
    "title": "Employment | Department of Computer Science",
    "content": "Employment\nFaculty Hiring\nHiring Assistant Professor, Computer Science\nJob no:\n551685\nWork type:\nInstructional Faculty – Tenured/Tenure-Track\nLocation:\nSan Francisco\nCategories:\nUnit 3 - CFA - California Faculty Association, Tenured/Tenure-Track, Full Time, Faculty - Computer Science, On-site (work in-person at business location)\nApplications close:\nOpen Until Filled\nView Job Opportunity",
    "url": "https://cs.sfsu.edu/employment"
  },
  {
    "source": "https://cs.sfsu.edu/cs-colloquium",
    "category": "general",
    "title": "CS Graduate Seminars | Department of Computer Science",
    "content": "CS Graduate Seminars\nSpring 2025 Schedule\nDate\nTopic\nPresenter\n5/7/2025\nRevealing Hidden Stories: Co-Designing the Thámien Ohlone Augmented Reality Tour\nKai Lukoff\n4/9/2025\nStanford Cybersecurity: CERT, Clinics, and Competitions\nAlex Keller\n4/1/2025\nThe Elusive Quest for AGI: Science or Speculation?\nKerrie Holley\n3/11/2025\nClimate Change: From Hot Air to Environmental Justice\nMichael Wehner\n3/7/2025\nAI Entrepreneurship\nJiajun (Feynman) Xu\n3/3/2025\nDeploy AI at the Edge to Bridge the Information Gap: Efficiency and Security\nQun Wang\n02/26/2025\nGamification and Playful Design: Exploring the Design Space for Business, Teaching, and Sports\nOliver Korn\n02/19/2025\nAn Intelligent Vocational Storytelling Virtual Reality System for Augmenting Work Performance\nSanika Doolani\n02/12/2025\nHow can we Decarbonize the Power Grid and meet AI’s Exploding Power Demands?\nAndrew A. Chien\n02/05/2025\nAn Introduction to Programming Quantum Computers\nWes Bethel\nFall 2024 Schedule\nDate\nTopic\nPresenter\n12/04/2024\nByzantine-Resilient Reinforcement Learning for Multi-UAV Systems\nTracy Chen\n11/21/2024\nBeyond the Lens: Detecting Bias through Eye-Tracking Measurements and Computer Vision Techniques\nNada Attar\n11/19/2024\nMachine Learning and Artificial Intelligence in Healthcare: Infectious Diseases Case Study and Broader Implications\nLjubomir Buturovic\n11/18/2024\nHuman-Centered Assistive Robots: From Understanding Commands to Detecting Cognitive Fatigue\nMaria Kyrarini\n11/13/2024\nProfessional Decision Support Systems Based on Graded Logic\nJozo Dujmovic\n10/29/2024\nGenomics and Deep-Sea Microbiology: Computational Innovations in Biological Research\nSean Jungbluth\n10/15/2024\nFrom Compression to Transformation: Efficient Deep Learning on Mobile Devices and LLMs in Education\nZhuwei Qin\n10/10/2024\nSan Francisco State University Graduate Certificate in Ethical AI – Overview and Early Experiences\nDragutin Petkovic\n09/19/2024\nQuantum Computing: What is it, exactly?\nE. Wes Bethel\n09/11/2024\nOverview of the Computer Science Graduate Program\nArno Puder, Timothy Sun, Qun Wang\nSpring 2024 Schedule\nDate\nTopic\nPresenter\n02/22/2024\nSecure Distributed Machine Learning with Multi Aggregators in Edge Computing\nXiao Li\n02/21/2024\nSafe and Reliable AI\nXuhui Chen\n02/20/2024\nDeveloping Robots for Dynamic, Safety-Critical Environments\nSachiko Matsumoto\n02/15/2024\nTowards Analyzing Online Communities of Problematic Information: A Computational Approach\nShruti Phadke\n02/14/2024\nGlobal Investigation of Network Connection Tampering\nRam Sundara Raman\n02/12/2024\nIterative Join-Graph Propagation\nRobert Mateescu\n02/08/2024\nBeyond Reality: Crafting the Future of Workforce Training with AI-Driven Immersive Storytelling\nSanika Doolani\nFall 2023 Schedule\nDate\nTopic\nPresenter\n11/29/2023\nSWIG: Modern Applications\nAaron Cruz\n11/15/2023\nComputational Approaches to Understanding Perception and the Brain\nSantani Teng\n11/8/2023\nGraded Logic for AI Applicatons\nJozo Dujmovic\n11/2/2023\nAI-Driven Advancements in Battery Materials and Alzheimer's Biomarker Detection\nDani Ushizima\n11/1/2023\nMaking Physical Models of Maps on Surfaces\nTimothy Sun\n10/31/2023\nApplication of Mathematical Modeling and Machine Learning for Optimizing Network Design and Operation\nSara El Alaoui\n10/25/2023\nLearning After Graduation\nRobert Mateescu\n10/19/2020\nCoders Wanted: Computational Opportunities in the Aquatic and Biological Sciences\nSean Jungbluth\n10/11/2023\nTowards On-Device Intelligence Through Deep Learning Compression\nZhuwei Qin\n09/14/2023\nWhat is Quantum Computing and Why Would you care?\nWes Bethel\nSpring 2023 Schedule\nDate\nTopic\nPresenter\n05/22/2023\nMachine Learning for Flow Visualization\nAkila de Silva\n02/27/2023\nGeometric algorithms for robot motion planning and biomedical imaging applications\nKa Yaw Teo\n02/24/2023\nRobot Behavior Adaptation for Personalized Longitudinal Interaction\nAlyssa Kubota\n02/23/2023\nTowards Understanding and Defending Against Algorithmically Curated Misinformation\nPrerna Juneja\n02/21/2023\nIntelligent Assistive Technologies for People with Visual Impairments\nHae-Na Lee\n02/20/2023\nEnabling Urban Intelligence by Harnessing Human-Generated Spatial-Temporal Data\nXin Zhang\n02/14/2023\nAccelerating the Discovery of Advanced Materials Using Data-driven AI Techniques\nYuqi Song\n02/13/2023\nRobust and Interpretable Graph Models\nBo Hui\n02/10/2023\nDesigning AI-Based Applications to Benefit Deaf and Hard-of-Hearing Individuals and Sign-Language Users\nSaad Hassan\n02/09/2023\nDemystifying Deep Network Architectures: from Theory to Applications\nWuyang Chen\nFall 2022 Schedule\nDate\nTopic\nPresenter\n11/30/2022\nUser-centric Visual Analytics towards Data Exploration and Analysis\nShah Rukh Humayoun\n11/16/2022\nGood Drawings of Graphs in Surfaces\nTimothy Sun\n11/10/2022\nBig Data Differential Privacy Preservation\nJingyi Wang\n09/28/2022\nCommunity-Engaged Technology for Social Good\nAakash Gautam",
    "url": "https://cs.sfsu.edu/cs-colloquium"
  },
  {
    "source": "https://cs.sfsu.edu/undergrads/prospective-undergraduates",
    "category": "general",
    "title": "Prospective Undergraduates | Department of Computer Science",
    "content": "Apply\nRequest Info\nProspective Undergraduates\nComputer science is one of the fastest-growing, most prolific industries. Having the right skillset from SF State equips you to embrace opportunities in the Bay Area, US, or the world. The applications are virtually unlimited. Make a career in fields like:\nSee More: Job Opportunities\nApplication analyst\nApplications developer\nCyber security analyst\nData analyst\nDatabase administrator\nForensic computer analyst\nInformation systems manager\nHardware engineer\nIT consultant\nIT sales professional\nIT trainer\nNanotechnologist\nNetwork engineer\nProfessor\nResearcher\nSecurity analyst\nSoftware engineer\nSystems analyst\nSupply chain manager\nTelecommunications researcher\nUX designer\nVideo game designer\nVideo game developer\nWeb designer\nWeb developer\nAerospace and defense\nEducation\nFinancial services\nHealthcare\nManufacturing\nRetail\nOur Partnerships Provide Students With Opportunities\nAlumni Testimonial\nTherese Demers, B.S. Graduate\nThe experience that came from working on challenging projects with great faculty has helped me tremendously later in my professional life. My work at UCSF and now at the University of Toronto is a testament to the excellent faculty at SF State. The projects that we did at SF State are very different from the CS programs at other schools and really set my profile apart.\nGet Ready for Your Future at SF State\nAcademic Advising\nAcademic Bulletin\nFunding/Scholarships\nTour Campus\nApply Now\nRequest Info",
    "url": "https://cs.sfsu.edu/undergrads/prospective-undergraduates"
  },
  {
    "source": "https://cs.sfsu.edu/prospective-undergraduates",
    "category": "general",
    "title": "Prospective Undergraduates | Department of Computer Science",
    "content": "Apply\nRequest Info\nProspective Undergraduates\nComputer science is one of the fastest-growing, most prolific industries. Having the right skillset from SF State equips you to embrace opportunities in the Bay Area, US, or the world. The applications are virtually unlimited. Make a career in fields like:\nSee More: Job Opportunities\nApplication analyst\nApplications developer\nCyber security analyst\nData analyst\nDatabase administrator\nForensic computer analyst\nInformation systems manager\nHardware engineer\nIT consultant\nIT sales professional\nIT trainer\nNanotechnologist\nNetwork engineer\nProfessor\nResearcher\nSecurity analyst\nSoftware engineer\nSystems analyst\nSupply chain manager\nTelecommunications researcher\nUX designer\nVideo game designer\nVideo game developer\nWeb designer\nWeb developer\nAerospace and defense\nEducation\nFinancial services\nHealthcare\nManufacturing\nRetail\nOur Partnerships Provide Students With Opportunities\nAlumni Testimonial\nTherese Demers, B.S. Graduate\nThe experience that came from working on challenging projects with great faculty has helped me tremendously later in my professional life. My work at UCSF and now at the University of Toronto is a testament to the excellent faculty at SF State. The projects that we did at SF State are very different from the CS programs at other schools and really set my profile apart.\nGet Ready for Your Future at SF State\nAcademic Advising\nAcademic Bulletin\nFunding/Scholarships\nTour Campus\nApply Now\nRequest Info",
    "url": "https://cs.sfsu.edu/prospective-undergraduates"
  },
  {
    "source": "https://cs.sfsu.edu/grads/advising",
    "category": "general",
    "title": "Graduate Advising | Department of Computer Science",
    "content": "Graduate Advising\nNew Student Orientation and Computer Science Advising Day\nGraduate Advising begins on Advising Day typically scheduled during the week before classes begin. On Advising Day, Graduate Advisors will be available to meet with students for Academic advising.\nIf you are a current or newly admitted graduate student seeking for advice, please email the department during the Summer/Winter at\ncsgrad@sfsu.edu\n.\nAdvising Schedules\nGraduate Advising\nNew Students\nSchedule meetings with advisors on the Computer Science Master's Programs Canvas page. All new students\nmust\nattend the first Graduate Seminar during their first term. Seminar information will be sent to your SFSU email and posted on the\nGraduate Seminar Schedule\n. All new students are strongly encouraged to attend an Advising Day Session before the start of the Fall/Spring semester and attend the first meeting of the Graduate Seminar. Subsequently, students should meet with an advisor at least once per term.\nContinuing Students\nYou should schedule a meeting with a graduate advisor at least once per term. For Graduate students furthering to the Ph. D. program, please see the Department Chair for additional advising and assistance.\nProbation Advising\nStudents who need probation advising are advised to see the Graduate Advisor first. There is no need to see CS Chair unless there is some additional issue or advising needed. For more information please visit\nUniversity Probation and Mandatory Advising webpage\n.\nUse Navigator to Schedule your appointment.\nSee Navigator Appointment Scheduler Quick Reference Guide on how to schedule your appointment.\nPlease email\ncs-dept@sfsu.edu\nif you are unable to access Navigator.\nKeep Track of the Following\nCourse Prerequisite\nEnforcement\nCS Department\nstrictly\nenforces prerequisites for all courses. Prerequisites are checked by CS faculty at the beginning of each course. The final decision about whether a student is ready to take a course is made by the instructor who teaches the course.\nBulletin Rights\nStudents who start the study of CS under a program that is published in the Bulletin have the right to graduate with the same program in a specific time interval. However, this right\ndoes not\nhold for course prerequisites. The CS Department regularly improves its curriculum and as a result the prerequisites may change. Because the Bulletin is printed early (before the start of the academic year), it may not completely reflect the most recent changes to prerequisites.\nWhere to Check the Current Prerequisites\nStudents are advised to check prerequisites with the CS faculty, CS office and Web.\nEnglish Level Requirements\nComputer Science students admitted to the M.S. program are required by the university to satisfy English Level I prior to the end of their first year of study at SF State, or by the date set within your admission letter. English Level I is satisfied by obtaining either a) a score of 4 or better on the GRE Analytical Writing Exam or b) a passing grade in SCI 614 or CHS 514 (Graduate Writing Skills classes offered through the College of Extended Learning (CEL), follow this link for more information:\nCollege of Extended Learning website\n. Students may enroll in CHS 514 if all sections of SCI 614 are full. SCI 614 is strongly recommended for all students who wish to develop their skills in professional writing.\nProgram Requirements\nThe Computer Science MS Degree requirements are posted in SF State's Bulletin:\nUniversity Computer Science Graduate Program Bulletin web page\n.\nNote: Course descriptions of Graduate courses are posted in SF State Bulletin as well.\nGraduate Seminar Series\nAll new students must attend the first Graduate Seminar during their\nfirst\nterm. Seminar information will be sent to your SFSU email and posted on the\nGraduate Seminar Schedule\n.\nRegistering for Classes Conditionally Classified\nIf you are a Conditionally Classified student with specific prerequisite courses assigned,\nyou should sign up for those classes first\nbefore registering for the graduate level core courses. The online registration system may prevent you from enrolling in lower level undergraduate classes during your assigned registration period. When this happens, simply pay your fees before the deadline, and attend the first class meeting of the class in which you are hoping to enroll, let the instructor know you need a permit number to add the class because you were unable to register for the class ahead of time. Our instructors are aware of this problem and will save seats for our conditionally classified graduate students who must enroll in these lower level courses.\nRegistering for Classes Classified Student\nIf you are a Classified student unsure of which classes to enroll, you can either:\nCheck the CS website and follow the recommended sequence of study and sign up for core courses. Please be aware of the Bursar's office refund schedule and the ADD and DROP deadlines. For more information see\nBursar's office website\n.\nWait until you arrive on campus and register for courses after advising; however please be aware of the university fee payment schedule.\nForms\nGraduate Forms\nCS Course Equivalency Form.docx\n26.63 KB\nChecklist for Students Enrolling in CSC 895-898.pdf\n65.04 KB\nCS Graduate Four Unit Exemption.docx\n12.53 KB\nComputer Science Department Transfer Equivalency Evaluation.pdf\n429.15 KB\nLetter of Recommendation Release Form.pdf\n405.54 KB\nPetition for Course By Independent Study.pdf\n219.23 KB\nCSC 893-694 Industrial Research.pdf\n71.42 KB\nCS Prerequisite Approval Form .pdf\n287.6 KB\nAcademic Bulletin Quick Links\nPrerequisite Courses\nRoadmap\nTransfer",
    "url": "https://cs.sfsu.edu/grads/advising"
  },
  {
    "source": "https://cs.sfsu.edu/overview",
    "category": "general",
    "title": "Overview | Department of Computer Science",
    "content": "Overview\nComputer Science Education\nOur Computer Science Education program prioritizes inclusivity and diversity aiming to provide equitable access to computer science learning for students from various backgrounds. It offers a comprehensive curriculum, teacher training, and resources that cater to diverse populations, emphasizing the importance of digital literacy and computational thinking. The program encourages underrepresented groups to engage in coding, problem-solving, and technology exploration, fostering a more inclusive and empowered generation of young learners in the field of computer science.\nMore Information\nAdvanced Computational Technology\nIn Advanced Computational Technology research our dual-focused program explores High-Performance Computing (HPC) and Quantum Computing. In HPC, it optimizes algorithms and architectures to enable complex simulations and scientific breakthroughs. Simultaneously, in quantum computing, it investigates quantum algorithms, programming languages, and system performance to push the boundaries of computation for cryptography, optimization, and the sciences.\nMore Information\nCyber Security\nOur Cybersecurity research program is dedicated to advancing techniques, algorithms, and knowledge essential for protecting systems and data against threats. It delves into emerging threats such as data/model poisoning, eavesdropping, and privacy leakage while also bolstering intrusion detection systems. Through collaborative efforts, our researchers strive to develop robust cybersecurity solutions that protect privacy and ensure the integrity of digital assets.  This program aims to strengthen cyber defenses in an ever-evolving technological landscape.\nMore Information\nArtificial Intelligence/Machine Learning\nOur AI research program delves into the intersection of methods, applications, and ethics of AI. Researchers develop novel methods to enhance capabilities, transparency, and interpretability of AI models.  Simultaneously, the program applies these techniques to real-world challenges, including usability of computer systems by people with disabilities and to science problems, ensuring that AI technology benefits society responsibly and justly.\nMore Information\nData Perceptualization and User Experience\nData Perceptualization and Human-Computer Interface. A cutting-edge computer science research program in data perceptualization, human interface, and computer graphics focuses on advancing the equitable and accessible representations of and interaction with complex data sets. It explores innovative techniques for rendering data in intuitive and aesthetically pleasing ways, enhancing user experiences through interactive interfaces. By leveraging state-of-the-art computational technologies, this program aims to bridge the gap between data analytics and human cognition, enabling more effective data-driven decision-making and communication.\nMore Information",
    "url": "https://cs.sfsu.edu/overview"
  },
  {
    "source": "https://cs.sfsu.edu/grads/student-policies",
    "category": "general",
    "title": "Student Policies | Department of Computer Science",
    "content": "Student Policies\nThe university is committed to maintaining a safe and healthy living and learning environment for students, faculty, and staff. Each campus community member should choose behaviors that contribute toward this end. Therefore, students are expected to be good citizens and to engage in responsible behaviors that reflect well upon their university, be civil to one another and others in the campus community, and contribute positively to student and university life.\nPrerequisite Policy\nCS Department strictly enforces prerequisites for all courses.\nPrerequisites are checked by CS faculty at the beginning of each course.\nA grade of\nC or better is required\nto be accepted as a prerequisite.\nThe final decision about whether a student is ready to take a course is made by the instructor who teaches the course.\nCheating and Plagiarism Policy\nBy academic cheating and plagiarism we mean presenting, as your own work, material produced by or in collaboration with others, or permitting or assisting others to present your work as their own without proper acknowledgment.\nThe policies of San Francisco State University, with respect to cheating and plagiarism, are stated in SF State's Bulletin. Courses involving computer programming require special consideration because use of the computer permits easy copying and trivial modification of programs. In addition, our polices also address availability of content and services on the Internet which can be used for plagiarism and cheating. The following guidelines are provided to help in determining if an incident of cheating or plagiarism has occurred.\nThe instructor may suspect a student of program plagiarism if the student submits a program that is so similar to the program submitted by a present or past student in the course that the solutions may be converted to one another by a simple mechanical transformation.\nThe instructor may suspect a student of cheating, whether on a program or an examination, if the student cannot explain both the intricacies of his or her solution and the techniques and principles used to generate that solution.\nIt should be clear that there is latitude for difference among individual instructors, particularly on the matter of when working with other students or adapting material from a textbook is permissible. The following general policy on cooperation on homework assignments holds:\nIn all circumstances it is acceptable to discuss the meaning of assignments and general approaches and strategies for handling those assignments with other members of the Academic Community. Any cooperation beyond that point, including shared pseudocode or flowcharts, shared code, or shared documentation, is only acceptable if specifically so permitted by the class instructor in written guidelines distributed to the entire class.\nThe Penalty\nIn cases of academic cheating or plagiarism, no credit will be given for the assignment in question and a record will be kept in the Computer Science department office. If a second or further incident is reported for an individual, or if the circumstances of a first incident so warrant, a letter describing the incident(s) will be forwarded to the Student Discipline Officer for possible disciplinary action, which may include expulsion, suspension, or probation; as well as lesser sanctions. Please refer to the Supplemental Regulations and Procedures section of SF State's Bulletin for details.\nAny student using Rentacoder or similar WWW service in any relation to schoolwork will be dealt with most seriously, including possible expulsion from the university.\nExamples\nWhen a student turns in the work of another student and represents it as his or her own work.\nWhen a student knowingly permits another to turn in his or her work.\nWhen a student copies code from the work of another student.\nWhen a student deliberately transforms borrowed sections of code in order to disguise their origin.\nWhen several students collaborate on a project and fail to inform the instructor of this.\nWhen a student steals or obtains examinations, answer keys, or program samples from the instructors files or computer directories.\nWhen a student modifies or deletes another student's or an instructor's computer files.\nWhen a student uses content from other sources like Internet and includes it in his/her work or projects without proper attribution.\nWhen a student uses Internet or other services to post assignments and seek solutions.\nWhen Internet resources are used verbatim and/or \"cut and pasted\" into students work regardless whether they are acknowledged or not.\nWhen Does It Not Occur?\nWhen students have permission to collaborate on a project, and list all collaborators.\nWhen students receive advice from instructors, teaching assistants, or staff members involved in the course.\nWhen students share knowledge about syntax errors, coding tricks, or other language-specific information that makes programming easier.\nWhen students engage in a general discussion of the nature of an assignment, the requirements for an assignment, or general implementation strategies.\nWhen students compare independent solutions to an assignment in order to better understand the nature of the assignment.\nWhen students engage in discussion of course concepts or programming strategies in preparation for an assignment or examination.\nWhen students copy code and cite its source on assignments for which the instructor allows inclusion of code other than the student's own.\nHow to Check for Plagiarism\nPlease consult with your course instructor if you have any questions regarding whether or not your work with other students and/or materials prepared for submission are appropriate. The following examples illustrate situations when Academic Cheating and/or Plagiarism has and has not occurred. Please note these lists are not comprehensive!\nSee also the reference materials posted by SF State's Center for Teaching and Faculty Development on Academic Integrity & Plagiarism:\n(SF State's Plagirarism Policy Page)\nDistribution of this Policy\nCopies of this policy will be available in the department office and posted on bulletin boards within the department. The policy will also be attached to, or included, in the undergraduate and graduate information bulletins.\nAn announcement of the existence of the policy will be made by the instructor at the first meeting each semester of every Computer Science class, at which time any course specific guidelines on cooperation and use of published programs can also be stated. For lower division courses, reference to this policy and statement of any course specific guidelines will be included in the course syllabus distributed to all students.\nPolicy on Observance of Religious Holidays\nThe San Francisco State University faculty shall make reasonable accommodations for students to observe religious holidays when such observances require students to be absent from class activities.\nIt is the responsibility of the student to inform the instructor, in writing, about such holidays during the first two weeks of the class each semester. If such holidays occur during the first two weeks of the semester, the student must notify the instructor, in writing, at least three days before the date that they will be absent.\nIt is the instructor's responsibility to make every reasonable effort to honor the student's request without penalty and for the student to make up the work missed.\nStudent Disclosures on Sexual Violence\nSF State fosters a campus free of sexual violence including sexual harassment, domestic violence, dating violence, stalking, and/or any form of sex or gender discrimination.\nIf you disclose a personal experience as an SF State student, the course instructor is required to notify the Dean of Students.\nTo disclose any such violence confidentially, please contact:\nThe SAFE Place:\n(415) 338-2208\nhttp://www.sfsu.edu/~safe_plc/\nCounseling and Psychological Services Center:\n(415) 338-2208\nhttp://psyservs.sfsu.edu/\nFor more information on your rights and available resources:\nhttp://titleix.sfsu.edu\nDisability Access\nStudents with disabilities who need reasonable accommodations are encouraged to contact the instructor.\nThe Disability Programs and Resource Center (DPRC) is available to facilitate the reasonable accommodations process. The DPRC is located in the Student Services Building and can be reached by telephone (voice/TTY 415-338-2472) or by email\ndprc@sfsu.edu\n.\nFor more information, please visit their homepage:\nhttp://www.sfsu.edu/~dprc",
    "url": "https://cs.sfsu.edu/grads/student-policies"
  },
  {
    "source": "https://cs.sfsu.edu/data-perceptualization-and-user-experience",
    "category": "general",
    "title": "Data Perceptualization and User Experience | Department of Computer Science",
    "content": "Data Perceptualization and User Experience\nA cutting-edge computer science research program in data perceptualization, visual analytics, human interface, and computer graphics focuses on advancing the equitable and accessible representations of and interaction with large and complex data sets. The program explores innovative techniques for rendering and visually representing data in intuitive and aesthetically pleasing ways, enables users to interactively explore and analyze data through use of visual representations to gain insight, identify patterns and make data-driven decisions, and enhances user experiences through interactive interfaces. By leveraging state-of-the-art computational technologies, this program aims to bridge the gap between data analytics and human cognition, enabling more effective data-driven decision-making and communication.\nAcademics and Coursework\nIn addition to broader requirements for a CS undergraduate or graduate degree, students may specialize their education around Data Perceptualization and User Experience topics via these undergraduate and graduate level courses:\nUndergraduate Courses\nCSC 630\nComputer Graphics Systems Design\nCSC 642\nHuman-Computer Interaction\nCSC 698\nTopics in Computing - Information Visualization\nCSC 699\nIndependent Study\nGraduate Courses\nCSC 805\nData Visualization: Concepts, Tools, Techniques, and Paradigms\nCSC 842\nHuman-Computer Interaction\nCSC 895\nApplied Research Project\nCSC 897\nResearch\nCSC 898\nMaster's Thesis\nCSC 899\nIndependent Study\nFaculty and Focus Areas\nWes Bethel\nHigh performance computing, scientific visualization, computer graphics\newbethel@sfsu.edu\nShah Rukh Humayoun\nInformation visualization, visual analytics, human-computer interaction, virtual reality, software engineering\nhumayoun@sfsu.edu\nIlmi Yoon\nComputer graphics, virtual reality, augmented reality, gamification\nilmi@sfsu.edu\nZainab Agha\nHuman-computer interaction, online safety, privacy, social computing\nzainabagha@sfsu.edu\nSanika Doolani\nHuman Computer Interaction, User Experience, XR/VR/AR, Immersive Media\nsanikadoolani@sfsu.edu\nPublications and Reports\nZainab Agha, Naima Ali Samreen, Jinkyung Park, Pamela Wisniewski. A systematic review on design-based nudges for adolescent online safety. International Journal of Child-Computer Interaction (2025).\nJanghee, Cho, Inhwa Song, Zainab Agha, Bengisu Cagiltay, Veena Calambur, Minjin MJ Rheu, and Jina Huh-Yoo. Mobile Technology and Teens: Understanding the Changing Needs of Sociocultural and Technical Landscape. Workshop at the Conference on Human Factors in Computing Systems (2025), Yokohama, Japan.\nJenna Wong, Shah Rukh Humayoun, M. Seto, Khanh Nguyen and S. Win. Interactive Rapid Earthquake Evaluation Training for Structural Engineering. In proceedings of the 18th World Conference on Earthquake Engineering (WCEE 2024), Milan, Italy, June 30 to July 05, 2024.\nIlya Nemtsov, MST Jasmine Jahan, Chuting Yan, and Shah Rukh Humayoun: Visual Exploration of Emotion Feelings Comparison in Tweet Data. In Proceedings of Eurographics Conference on Visualization (EuroVis 2024 – Posters), The Eurographics Association, May 27 – 31, 2024, Odense, Denmark\nShah Rukh Humayoun, Jenna Wong, Khanh Nguyen, Purva Zinjarde, and Prathiba Ramesh: VR-Engine: Training Post-Earthquake Damages in Building Structure. 2024 IEEE Conference on Virtual Reality and 3D User Interfaces, Abstracts and Workshops (VRW) proceedings, Orlando, FL, USA, 2024, pp. 931-932, doi: 10.1109/VRW62533.2024.00262.\nSyed Ahsan Ali Dilawer and Shah Rukh Humayoun: A Visual Analytics Tool to Explore Multi-Classification Model with High Number of Classes The 16th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS Companion '24), June 24–28, 2024, Cagliari, Italy,\nhttps://doi.org/10.1145/3660515.3662835\nJarrett Zapata, Syed Farhan Haider, Ragaad AlTarawneh, and Shah Rukh Humayoun: GraDVis: A Visualization Tool for a Visual Data Management System. The 16th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS Companion '24), June 24–28, 2024, Cagliari, Italy,\nhttps://doi.org/10.1145/3660515.3662833\nNina Mir, Ragaad AlTarawneh, and Shah Rukh Humayoun: “Circles: Inter-Model Comparison of Multi-Classification Problems with High Number of Classes”. IEEE VIS 2023: Visualization and Visual Analytics. Melbourne, Australia, 22-27 October, 2023.\nhttps://arxiv.org/abs/2309.05672\nSyed Ahsan Ali Dilawer and Shah Rukh Humayoun: “MultiCaM-Vis: Visual Exploration of Multi-Classification Model with High Number of Classes”. IEEE VIS 2023: Visualization and Visual Analytics. Melbourne, Australia, 22-27 October, 2023.\nhttps://arxiv.org/abs/2309.05676\nIlya Nemtsov, MST Jasmine Jahan, Chuting Yan, and Shah Rukh Humayoun: “TECVis: A Visual Analytics Tool to Compare People's Emotion Feelings”. IEEE VIS 2023: Visualization and Visual Analytics. Melbourne, Australia, 22-27 October, 2023.\nhttps://arxiv.org/abs/2309.04722\nSnehal Patil and Shah Rukh Humayoun: “A Visual Analytic Environment to Co-locate Peoples' Tweets with City Factual Data”. IEEE VIS 2023: Visualization and Visual Analytics. Melbourne, Australia, 22-27 October, 2023.\nhttps://arxiv.org/abs/2309.04724\nShimizu M.* and Kulkarni A. (2023) Quantitative Measures of Online Health Information (QMOHI): Broadening the impact through improved usability, applicability, and effectiveness. Appears in\n2023 IEEE 11th International Conference on Healthcare Informatics (ICHI)\n. IEEE\nShah Rukh Humayoun, Salman Zaidi, and Ragaad AlTarawneh: “SamS-Vis: A Tool to Visualize Summary View Using Sampled Data”. 19th IFIP TC13 International Conference on Human-Computer Interaction (INTERACT 2023), York, UK, August 28 – September 1, 2023, Lecture Notes in Computer Science book series (LNCS, volume 14145), Springer, 557-562\nShah Rukh Humayoun, Yael Dubinsky, Kerri Kariti, Moshe Kariti: “Where Do All Stakeholders Find the Software Product Blueprint?” 19th IFIP TC13 International Conference on Human-Computer Interaction (INTERACT 2023), York, UK, August 28 – September 1, 2023, Lecture Notes in Computer Science book series (LNCS, volume 14145), Springer, 590-594\nJenna Wong, Shah Rukh Humayoun, Khanh Nguyen, and Yongjian Pan: “Reinforcing Human-Technology Interaction Theory through a Virtual Reality Engineering Training Application”. In the American Society for Engineering Education Annual Conference (ASEE 2023), Balyimore Convention Center, MD, USA, June 25-28, 2023.\nZihao Wang and Shah Rukh Humayoun: “Vertex2Image: Construct Human Figure Based On A Monocular Video”. In Companion Proceedings of the 28th International Conference on Intelligent User Interfaces (IUI '23 Companion). Association for Computing Machinery, New York, NY, USA, 108–111.\nRené Reinhard, Erinchan Telatar, and Shah Rukh Humayoun: “Comparison of Object Detection in Head-Mounted and Desktop Displays for Congruent and Incongruent Environments”. Big Data and Cognitive Computing Journal, 6(1): 28 (2022).\nJenna Wong and Shah Rukh Humayoun. “Expanding Structural Engineering Education through Virtual Reality”. In American Society for Engineering Education Annual Conference (ASEE 2022), Minneapolis, Minnesota, USA, June 26-29, 2022.\nShah Rukh Humayoun and Likhitha Brahmadevara: “Chord2DS: An Extension to Chord Diagram to Show Data Elements from Two Heterogeneous Data Sources”. In 24th EG/VGTC Conference on Visualization (EuroVis 2022), Rome, June 13-17, 2022.\nKulkarni A, Wong M, Belsare T*, Shah R*, Yu Yu D**, Coskun B**, Holschuh C, Kakar V, Modrek S, Smirnova A. (2022) Quantifying the Quality of Web-Based Health Information on Student Health Center Websites Using a Software Tool: Design and Development Study.\nJMIR Form Res 2022;6(2):e32360.\nhttps://doi.org/10.2196/32360\nShah Rukh Humayoun and Siddhita Chimote: “An Interactive Visualization Tool to Explore People's Tweets towards COVID-19”. In International Conference on Advanced Visual Interfaces (AVI 2022), Rome, June 06-10, 2022.\nShah Rukh Humayoun, Ghazanfar Abbas, and Ragaad AlTarawneh: “Touch-behavioral Authentication on Smartphones using Machine Learning”. In ACM 27th International Conference on Intelligent User Interfaces (IUI ’22 Companion), March 22–25, 2022, Helsinki, Finland. ACM, New York, NY, USA, 6 pages.\nhttps://doi.org/10.1145/3490100.3516456\nKakar V, Kulkarni A, Holschuh C, Smirnova A, Modrek S. (2022) Contraception information on the websites of student health centers in the United States.\nContraception. 2022 Jan 25:S0010-7824(22)00011-7\n.\nhttps://doi.org/10.1016/j.contraception.2022.01.007\n.\nModrek, S., Wong, M., Kulkarni, A., Holschuh, C., & Kakar, V. (2022). Medication abortion: State of information on Student Health Center websites.\nJournal of American College Health\n, 1-5.\nhttps://doi.org/10.1080/07448481.2022.2155472\nPeer-Timo Bremer, Georgia Tourassi, Wes Bethel, Kelly Gaither, Valerio Pascucci, and Wei Xu. Visualization for Scientific Discovery, Decision-Making, and Communication. Summary Report from the ASCR Workshop on Visualization for Scientific Discovery, Decision-Making, and Communication, United States, January 2022.\nhttps://www.osti.gov/biblio/1845708\nDoolani, Sanika. VISTAS: Vocational Immersive Storytelling Training and Support Framework for Augmenting Work Performance. The University of Texas at Arlington, 2021.\nDoolani, Sanika, Callen Wessels, and Fillia Makedon. \"vIIIS: A Vocational Intelligent Interactive Immersive Storytelling Framework to Support Task Performance.\" In The 14th PErvasive Technologies Related to Assistive Environments Conference, pp. 527-533. 2021.\nDoolani, Sanika, Callen Wessels, and Fillia Makedon. \"Designing a Vocational Immersive Storytelling Training and Support System to Evaluate Impact on Working and Episodic Memory.\" In The 14th PErvasive Technologies Related to Assistive Environments Conference, pp. 268-269. 2021.\nShah Rukh Humayoun, Ibrahim Mansour, Ragaad AlTarawneh: “TEVisE: An Interactive Visual Analytics Tool to Explore Evolution of Keywords' Relations in Tweet Data”. The IFIP Technical Committee 13 18th International Conference on Human–Computer Interaction (INTERACT ’21), 579-599, August 30 – September 03, 2021.\nDylan Cashman, Shenyu Xu, Subhajit Das, Florian Heimerl, Cong Liu, Shah Rukh Humayoun, Michael Gleicher, Alex Endert, and Remco Chang: “CAVA: A Visual Analytics System for Exploratory Columnar Data Augmentation Using Knowledge Graphs”. IEEE Transactions on Visualization & Computer Graphics (TVCG), 27(2): 1731-1741, Feb. 2021.\nDoolani, Sanika, Callen Wessels, Varun Kanal, Christos Sevastopoulos, Ashish Jaiswal, Harish Nambiappan, and Fillia Makedon. \"A review of extended reality (xr) technologies for manufacturing training.\" Technologies 8, no. 4 (2020): 77.\nDoolani, Sanika, Luke Owens, Callen Wessels, and Fillia Makedon. \"vIS: An immersive virtual storytelling system for vocational training.\" Applied sciences 10, no. 22 (2020): 8143.\nShah Rukh Humayoun, Muhammad Faizan, Zuhair Zafar and Karsten Berns: “Space-free Gesture Interaction with Humanoid Robot”. International Conference on Advanced Visual Interfaces (AVI 2020), Island of Ischia, Italy September 28 - October 2, 2020.\nGupta, Sanika, Luke Owens, Konstantinos Tsiakas, and Fillia Makedon. \"vIIS: a vocational interactive immersive storytelling framework for skill training and performance assessment.\" In Proceedings of the 12th ACM International Conference on PErvasive Technologies Related to Assistive Environments, pp. 411-415. 2019.\nGrants and Awards\nNational Science Foundation (NSF). Equipment: VRMaS: VR Maker Space. PI: Shahrukh Humayoun (Department of Computer Science), Co-PI: Jenna Wong (School of Engineering), December 01, 2024 – November 30, 2026, Award: $200K.\nFoundation for California Community Colleges: California Education Learning Lab. E-GAISE: Ethical Generative AI in Undergraduate Computer Science Education. PI: Shahrukh Humayoun, Co-PIs: Hui Yang, Isabel Hyo Jung Song, and Akila de Silva. January 2025 – June 2026, Award: $150K\nStructural Engineers Association of Northern California (SEAONC). SAP Evaluator Training/SEAONC.). PI: Jenna Wong (School of Engineering), Co-PI: Shahrukh Humayoun (Department of Computer Science), $10,000,  Feb. – June 2022.",
    "url": "https://cs.sfsu.edu/data-perceptualization-and-user-experience"
  },
  {
    "source": "https://cs.sfsu.edu/sf-state-science-coding-programs-boost-biotech-diversity",
    "category": "general",
    "title": "SF State Science Coding Programs Boost Biotech Diversity | Department of Computer Science",
    "content": "SF State Science Coding Programs Boost Biotech Diversity\nAuthor:\nKate High\nDecember 16, 2020\nPhoto Credit:\nSF State News (Strategic Marketing and Communications)\nGrants impact SF State’s computer science diversity efforts with new certification programs and scholarships\nDespite the San Francisco Bay Area being one of the most diverse regions in the country, the technology industries that call it home still lack diversity. Faculty members in the\nPromoting Inclusivity and Computing (PINC)\nprogram at San Francisco State University aim to change this. Their efforts have recently received recognition from both academia and the biotech industry, including two recent grants from the Genentech Foundation and Genentech, Inc. totaling over $1.2 million.\nAssociate Professor of Computer Science Anagha Kulkarni, one of the leaders of PINC, says faculty members and their collaborators at Genentech share a motivation to make tech more diverse. “It’s really highly skewed right now,” she explained. “It’s very male driven — gender diversity is very low, and ethnic and racial diversity are also very low.”\nPINC provides opportunities for non-Computer Science majors to learn coding skills in a supportive environment. In the program’s three years of existence, more than three-quarters of the program’s graduates have been women, and more than half of the students have come from underrepresented minority groups.\nOne of the two grants, for $621,000 provided by Genentech, Inc., will support the development of a new Data Science and Artificial Intelligence certificate program for undergraduates. Researchers at Genentech are also developing curricula alongside San Francisco State faculty members to ensure that students are prepared for success in the biotech industry.\n“As we met over the course of a semester, we all agreed that we need to create a curriculum that is not just designed by us academics but also informed by what practitioners want in the industry,” Kulkarni said. SF State faculty will bring their own expertise in training students, providing undergraduates with graduate-level skillsets, professional development and mentorship.\nThe second grant, $580,750 provided by The Genentech Foundation, will fund scholarships for 10 undergraduates in the PINC minor program each year. One barrier many students face is the need to financially support themselves throughout their undergraduate career, which makes it difficult to take advantage of research opportunities. The funding will allow students in the minor, who are learning a new and complex skillset in order to enter a highly competitive field, the opportunity to focus on their coursework and research without having to take on other jobs. At the same time, they’ll gain access to a network of researchers and mentors from other universities and companies around the Bay Area.\nTech diversity efforts at SF State haven’t just caught the notice of local industry — they’ve turned heads in academia, too. A team of faculty members recently\npublished an article in the journal PLOS Computational Biology\ndescribing an innovative summer program that teaches students to apply coding to their science disciplines.\n“It’s unique in the sense that students are given an opportunity not only to learn coding skills but also in the context of their discipline with a real research project,” said Assistant Professor of Chemistry and Biochemistry Nicole Adelstein, a faculty organizer and advisor for the PINC summer program. Students in this nine-week program learn coding skills while applying them towards topics of their interest and supporting one another in cohorts throughout the summer.\nAnd at the helm of that program are faculty members who are committed to making the computer science and biotech fields more diverse — and whose backgrounds are similar to the students they teach. “Many of the SF State faculty involved in organizing the program, I think, are mostly self-taught programmers,” Adelstein explained. “We’re very motivated to give these students opportunities to explore coding within their own field, in part because we all wish we had started earlier.”\nTags\nGrant\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/sf-state-science-coding-programs-boost-biotech-diversity"
  },
  {
    "source": "https://cs.sfsu.edu/grads/prospective-graduates",
    "category": "general",
    "title": "Prospective Graduates | Department of Computer Science",
    "content": "Apply\nRequest Info\nProspective Graduates\nThe Master of Science in Computer Science prepares students for a wide variety of careers in computing or related industries as well as for advanced study toward Ph.D. degrees.\nOur graduate programs offer opportunities to engage in:\nHands-on research or MS project through required credited research courses mentored by one of our faculty members.\nMigration into the exciting CS practices and research activities from non-CS fields by allowing you to catch up on missing or out-of-date CS knowledge via our undergraduate course offerings.\nUpdating your currency across a broad set of topics by attending seminar talks by our invited speakers as a part of our program requirements.\nSituated in the hot-bed of tech industries, you will enjoy access to various opportunities in the greater computing communities outside our campus, while our programs prepare you for a wide variety of careers in computing or related industries as well as for advanced study toward Ph.D. degrees.\nDeadline for Upcoming Application cycle\nSpring 2026 Intake: October 1st, 2025\n*All application materials must be received by CalApply before the deadline for admission consideration. Evaluation begins after the deadline.\nAdmission Requirements\nThe following are\nmandatory\nrequirements:\nSF State's Online Application Form:\nCal State Apply(link is external)\nUndergraduate minimum GPA:\n3.0 or higher\nTOEFL/IELTS Scores for (prospective) holders of a non-US Bachelor’s degree\n4-year Bachelors Degree\nCurrent general GRE (taken within last 3 years, submitted both electronically from ETS and uploaded as a PDF to Cal State Apply)\n2 Letters of Recommendation (Uploaded by your recommender in Cal State Apply)\nStatement of Purpose\nNote: Simply meeting the minimum application requirements does not guarantee admission\nTOEFL Institution Code: 4683\nGRE School Code: 4684\nThe Graduate Admission Process\nThoroughly read through the\nDivision of Graduate Studies Cal State Apply FAQ/TIP pages\n.\nApply for admission to SF State through\nCal State Apply\n.\nUpload all required documents via Cal State Apply.\nArrange to have your letters of recommendation uploaded by your recommender directly to Cal State Apply.\nIf applicant meets the preliminary admissions criteria then the application is forwarded to the Computer Science Department for final review.\nMore Information\nGuidelines for Letters of Recommendation\nUse the Evaluations tab on Cal State Apply to manage submission of letters of recommendation. Letter writer email addresses should be from professional or academic organizations (ex. @sfsu.edu, @CA.gov or @ibm.com), not personal email addresses.\nLetters of recommendation should be uploaded by your recommender to your Cal State Apply application.\nLetters of recommendation should come from an academic or professional reference and should include information to help us determine if you are a serious and qualified candidate.\nYour letters of recommendation\nmust\ninclude your full name used on your application.\nNote: We do not accept photocopies or letters of recommendation that have been opened or sent by the applicant.\nApplicants with a Bachelor’s Degree in Computer Science\nThe prospective student submits an online application and all required documents via\nCal State Apply\n. The GRE scores are acceptable if taken within three years of application to the program.\nAll documents, including transcripts, official TOEFL and GRE scores and Letters of Recommendation, along with the application, must be submitted by the application deadline, or the application will not be reviewed. So please plan ahead to submit ALL your documents before the deadline. (We may accept Letters of Recommendations within two weeks of the application deadline.)\nAlthough there are no minimum score requirements for the GRE, many of our successful applicants score in the 75th percentile or higher for the quantitative section. Verbal GRE scores may be lower than this, however a score of 4.0 or higher on the analytical writing portion of the GRE clears English Level I requirements.\nThe Graduate Division will check the application materials to ensure that the applicant has satisfied general SF State requirements such as minimum grade point average, receipt of official transcripts from all prior institutions attended, completed Bachelor’s degree from a 4 year program (or, equivalent) and requisite TOEFL scores where applicable. In addition, the Computer Science Department will check the preparedness of the student to successfully participate in the Computer Science Masters Program.\nApplicants should direct questions to the Graduate Division office to obtain information on the status of materials sent to the Graduate Division (e.g., transcripts, TOEFL scores).\nStudents who have obtained, or will shortly obtain, a Bachelor’s degree in Computer Science from SF State or other CSU campuses are urged to consult with the Department Chair as early as possible for assistance in applying to the graduate program.\nOnce all application materials have been received, the application will be reviewed, with the decisions forwarded to the applicant shortly thereafter.\nApplicants with a Bachelor’s Degree in other Majors\nThese students may be admitted on condition that they achieve the requisite grade point average in specified prerequisite courses in the minimum possible time. Therefore,\nwe strongly encourage students who have completed a bachelor's (or postgraduate) degree in other disciplines, such as Biology, Mathematics or Physics, or who have significant practical experience in a computer related field to apply to our masters program.\nThese students should upload a completed Course Equivalency Form (CEF) to their online applications when applying using Cal State Apply\n. The CEF will be used to determine the necessary conditional courses to be completed after admission to the program.\nPlease click here for CEF:\nDepartment Course Equivalency Form (Word)\nThe Conditions for admission will be clearly stated in the admission documents. Students\nmust\nsatisfy those conditions in order to continue in their graduate program.\nProspective students are welcome to send any questions after thoroughly reviewing all posted materials by emailing the graduate advising assistant at\ncsgrad@sfsu.edu\n.\nAlumni Testimonial\nMarc Sosnick-Perez, M.S. Alumni\nI chose SF State's computer science department for my graduate work for its small class size, easy access to professors, and the important research work in which the department is engaged. I was impressed by the program's ability to provide a strong theoretical base, while also providing preparation and skills necessary for future industry and academic work.\nWork with Research Giants\nCollaboration with Top Research Universities and Funding Provided by the Government and Industry Giants\nOur faculty maintain active publication records, with significant funding from government agencies (NSF, NIH, Department of Labor, etc.) and industry (Genentech, Microsoft, IBM, Arista Networks, Mozilla, etc.). Students actively engage in research projects, write papers, attend conferences, and participate in funding proposals.\nStanford\nUCSF\nGenentech\nIBM Almaden Research\nMicrosoft Corporation\nNational Institutes of Health (NIH)\nNational Science Foundation (NSF)\nAmazon Web Services\nQuick Links\nAcademic Advising\nMaster's Theses and Projects\nCS Colloquium",
    "url": "https://cs.sfsu.edu/grads/prospective-graduates"
  },
  {
    "source": "https://cs.sfsu.edu/prospective-graduates",
    "category": "general",
    "title": "Prospective Graduates | Department of Computer Science",
    "content": "Apply\nRequest Info\nProspective Graduates\nThe Master of Science in Computer Science prepares students for a wide variety of careers in computing or related industries as well as for advanced study toward Ph.D. degrees.\nOur graduate programs offer opportunities to engage in:\nHands-on research or MS project through required credited research courses mentored by one of our faculty members.\nMigration into the exciting CS practices and research activities from non-CS fields by allowing you to catch up on missing or out-of-date CS knowledge via our undergraduate course offerings.\nUpdating your currency across a broad set of topics by attending seminar talks by our invited speakers as a part of our program requirements.\nSituated in the hot-bed of tech industries, you will enjoy access to various opportunities in the greater computing communities outside our campus, while our programs prepare you for a wide variety of careers in computing or related industries as well as for advanced study toward Ph.D. degrees.\nDeadline for Upcoming Application cycle\nSpring 2026 Intake: October 1st, 2025\n*All application materials must be received by CalApply before the deadline for admission consideration. Evaluation begins after the deadline.\nAdmission Requirements\nThe following are\nmandatory\nrequirements:\nSF State's Online Application Form:\nCal State Apply(link is external)\nUndergraduate minimum GPA:\n3.0 or higher\nTOEFL/IELTS Scores for (prospective) holders of a non-US Bachelor’s degree\n4-year Bachelors Degree\nCurrent general GRE (taken within last 3 years, submitted both electronically from ETS and uploaded as a PDF to Cal State Apply)\n2 Letters of Recommendation (Uploaded by your recommender in Cal State Apply)\nStatement of Purpose\nNote: Simply meeting the minimum application requirements does not guarantee admission\nTOEFL Institution Code: 4683\nGRE School Code: 4684\nThe Graduate Admission Process\nThoroughly read through the\nDivision of Graduate Studies Cal State Apply FAQ/TIP pages\n.\nApply for admission to SF State through\nCal State Apply\n.\nUpload all required documents via Cal State Apply.\nArrange to have your letters of recommendation uploaded by your recommender directly to Cal State Apply.\nIf applicant meets the preliminary admissions criteria then the application is forwarded to the Computer Science Department for final review.\nMore Information\nGuidelines for Letters of Recommendation\nUse the Evaluations tab on Cal State Apply to manage submission of letters of recommendation. Letter writer email addresses should be from professional or academic organizations (ex. @sfsu.edu, @CA.gov or @ibm.com), not personal email addresses.\nLetters of recommendation should be uploaded by your recommender to your Cal State Apply application.\nLetters of recommendation should come from an academic or professional reference and should include information to help us determine if you are a serious and qualified candidate.\nYour letters of recommendation\nmust\ninclude your full name used on your application.\nNote: We do not accept photocopies or letters of recommendation that have been opened or sent by the applicant.\nApplicants with a Bachelor’s Degree in Computer Science\nThe prospective student submits an online application and all required documents via\nCal State Apply\n. The GRE scores are acceptable if taken within three years of application to the program.\nAll documents, including transcripts, official TOEFL and GRE scores and Letters of Recommendation, along with the application, must be submitted by the application deadline, or the application will not be reviewed. So please plan ahead to submit ALL your documents before the deadline. (We may accept Letters of Recommendations within two weeks of the application deadline.)\nAlthough there are no minimum score requirements for the GRE, many of our successful applicants score in the 75th percentile or higher for the quantitative section. Verbal GRE scores may be lower than this, however a score of 4.0 or higher on the analytical writing portion of the GRE clears English Level I requirements.\nThe Graduate Division will check the application materials to ensure that the applicant has satisfied general SF State requirements such as minimum grade point average, receipt of official transcripts from all prior institutions attended, completed Bachelor’s degree from a 4 year program (or, equivalent) and requisite TOEFL scores where applicable. In addition, the Computer Science Department will check the preparedness of the student to successfully participate in the Computer Science Masters Program.\nApplicants should direct questions to the Graduate Division office to obtain information on the status of materials sent to the Graduate Division (e.g., transcripts, TOEFL scores).\nStudents who have obtained, or will shortly obtain, a Bachelor’s degree in Computer Science from SF State or other CSU campuses are urged to consult with the Department Chair as early as possible for assistance in applying to the graduate program.\nOnce all application materials have been received, the application will be reviewed, with the decisions forwarded to the applicant shortly thereafter.\nApplicants with a Bachelor’s Degree in other Majors\nThese students may be admitted on condition that they achieve the requisite grade point average in specified prerequisite courses in the minimum possible time. Therefore,\nwe strongly encourage students who have completed a bachelor's (or postgraduate) degree in other disciplines, such as Biology, Mathematics or Physics, or who have significant practical experience in a computer related field to apply to our masters program.\nThese students should upload a completed Course Equivalency Form (CEF) to their online applications when applying using Cal State Apply\n. The CEF will be used to determine the necessary conditional courses to be completed after admission to the program.\nPlease click here for CEF:\nDepartment Course Equivalency Form (Word)\nThe Conditions for admission will be clearly stated in the admission documents. Students\nmust\nsatisfy those conditions in order to continue in their graduate program.\nProspective students are welcome to send any questions after thoroughly reviewing all posted materials by emailing the graduate advising assistant at\ncsgrad@sfsu.edu\n.\nAlumni Testimonial\nMarc Sosnick-Perez, M.S. Alumni\nI chose SF State's computer science department for my graduate work for its small class size, easy access to professors, and the important research work in which the department is engaged. I was impressed by the program's ability to provide a strong theoretical base, while also providing preparation and skills necessary for future industry and academic work.\nWork with Research Giants\nCollaboration with Top Research Universities and Funding Provided by the Government and Industry Giants\nOur faculty maintain active publication records, with significant funding from government agencies (NSF, NIH, Department of Labor, etc.) and industry (Genentech, Microsoft, IBM, Arista Networks, Mozilla, etc.). Students actively engage in research projects, write papers, attend conferences, and participate in funding proposals.\nStanford\nUCSF\nGenentech\nIBM Almaden Research\nMicrosoft Corporation\nNational Institutes of Health (NIH)\nNational Science Foundation (NSF)\nAmazon Web Services\nQuick Links\nAcademic Advising\nMaster's Theses and Projects\nCS Colloquium",
    "url": "https://cs.sfsu.edu/prospective-graduates"
  },
  {
    "source": "https://cs.sfsu.edu/advanced-computational-technology-research",
    "category": "general",
    "title": "Advanced Computational Technology Research | Department of Computer Science",
    "content": "Advanced Computational Technology Research\nIn advanced computational technology research our program explores High-Performance Computing (HPC) and Quantum Computing. In HPC, it optimizes algorithms and architectures to enable complex simulations and scientific breakthroughs. Simultaneously, in quantum computing, it investigates quantum algorithms, programming languages, and system performance to push the boundaries of computation for cryptography, optimization, and the sciences. This dual-focused program aims to harness both classical HPC and emerging quantum capabilities, accelerating scientific progress and solving computationally intensive problems at unprecedented speeds.\nAcademics and Coursework\nIn addition to broader requirements for a CS undergraduate or graduate degree, students may specialize their education around Advanced Computational Technology research topics via these undergraduate and graduate level courses:\nUndergraduate Courses\nCSC 630\nComputer Graphics Systems Design\nCSC 641\nComputer Performance Evaluation\nCSC 647\nIntroduction to Quantum Computing and Quantum Information Science\nCSC 656\nComputer Organization\nGraduate Courses\nCSC 746\nHigh Performance Computing\nCSC 747\nIntroduction to Quantum Computing and Quantum Information Science\nCSC 841\nComputer Performance Evaluation\nCSC 847\nCloud and Distributed Computing: Concepts and Applications\nCSC 878\nBig Data Platforms and Systems\nCSC 890\nGraduate Seminar – Quantum Computing\nCSC 895\nApplied Research Project\nCSC 897\nResearch\nCSC 898\nMaster's Thesis\nFaculty and Focus Areas\nWes Bethel\nHigh performance computing, quantum computing, scientific computing, computer graphics, scientific visualization, artificial intelligence/machine learning, computer vision/image analysis, computer organization and architecture\newbethel@sfsu.edu\nDaniel Huang\nProgramming languages, quantum computing, artificial intelligence/machine learning, computational chemistry\ndanehuang@sfsu.edu\nPublications and Reports\nSudhanshu Kulkarni and E. Wes Bethel. From Bits to Qubits: Challenges in Classical-Quantum Integration. 2024 IEEE 31th International Conference on High Performance Computing, Data, and Analytics (HiPC), Bangalore India, Dec. 2024.\nBalewski, J., Amankwah, MG, Beeumen, RV, Bethel, EW, Perciano, T., and Camps, D. (2024). Quantum-parallel vectorized data encodings and computations on trapped-ions and transmons QPUs. Nature Scientific Reports, 14(1).\nhttps://doi.org/10.1038/s41598-024-53720-x\nBurlen Loring, E. Wes Bethel, and Gunther Weber. Extensions to the SENSEI In situ Framework for Heterogeneous Architectures. In ISAV 2023: In Situ Infrastructures for Enabling Extreme-scale Analysis and Visualization, Denver, CO, USA, November 2023.\nDaniel Huang, E. Wes Bethel, Talita Perciano, Roel van Beeumen, and Daan Camps. Towards High- Level Quantum Programming Languages. In ASCR Basic Research Needs in Quantum Computing and Networking, 2023.\nTalita Perciano, Jan Balewski, Roel van Beeumen, E. Wes Bethel, Daan Camps, and Daniel Huang. A Quantum Approach for Efficient Biomedical Data Analysis. In ASCR Basic Research Needs in Quantum Computing and Networking, 2023.\nMercy Amankwah, Daan Camps, E. Wes Bethel, Roel Van Beeumen, and Talita Perciano. Quantum pixel representations and compression for N -dimensional images. Nature Scientific Reports, May 2022.\nE. Wes Bethel, Burlen Loring, Utkarsh Ayatchit, David Camp, Earl P. N. Duque, Nicola Ferrier, Joseph Insley, Junmin Gu, James Kress, Patrick O’Leary, David Pugmire, Silvio Rizzi, David Thompson, Gunther H. Weber, Brad Whitlock, Matthew Wolf, and Kesheng Wu. The SENSEI Generic In Situ Interface: Tool and Processing Portability at Scale. In Hank Childs, Janine Bennett, and Christoph Garth, editors, In Situ Visualization for Computational Science. Springer, 2022.\nE. Wes Bethel, Burlen Loring, Utkarsh Ayatchit, David Camp, Earl P. N. Duque, Nicola Ferrier, Joseph Insley, Junmin Gu, James Kress, Patrick O’Leary, David Pugmire, Silvio Rizzi, David Thompson, Gunther Weber, Brad Whitlock, Matthew Wolf, and Kesheng Wu. Proximity Portability and In Transit, M-to-N Data Partitioning and Movement in SENSEI. In Hank Childs, Janine Bennett, and Christoph Garth, editors, In Situ Visualization for Computational Science. Springer, 2022.\nPeer-Temo Bremer, Georgia Tourassi, E. Wes Bethel, Kelly Gaither, Valerio Pascucci, and Wei Xu.Visualization for Scientific Discovery, Decision-Making, and Communication. In Summary Report from the ASCR Workshop on Visualization for Scientific Discovery, Decision-Making, and Communication, United States, January 2022.\nB. Loring, E.W. Bethel, and K.J. Wu. Interfaces Supporting Data Management in Complex In transit Processing Workflows on Heterogeneous Systems with Deep Memory Hierarchies. In ASCR Workshop on the Management and Storage of Scientific Data, January 2022.\nE. W. Bethel, B. Loring, O. Rübel, G. Weber, N. Ferrier, J. Insley, V. Mateevitsi, S. Rizzi, P. O’Leary, U. Ayachit, C. Wetterer-Nelson, E. Duque, and B. Whitlock. A Well-Designed Interface is a Trojan Horse for New Capabilities in Data Management and Data-intensive Processing. In ASCR Workshop on the Management and Storage of Scientific Data, January 2022.\nG. H. Weber, E. W. Bethel, A. Butko, and John Shalf. Data Analysis on Heterogeneous Architectures at the “Edge” and Beyond. In ASCR Workshop on Visualization for Science, January 2022.\nE. Wes Bethel, Colleen Heinemann, and Talita Perciano. Performance Tradeoffs in Shared-memory Platform Portable Implementations of a Stencil Kernel. In Matthew Larsen and Filip Sadlo, editors, Eurographics Symposium on Parallel Graphics and Visualization, Zürich, Switzerland, June 2021.\nE. W. Bethel, B. Loring, O. Rübel, G. Weber, N. Ferrier, J. Insley, V. Mateevitsi, S. Rizzi, P. O’Leary, U. Ayachit, C. Wetterer-Nelson, E. Duque, and B. Whitlock. Fostering Interoperability and Increasing Scientific Productivity in Environments of Heterogeneous Software and Computational Platforms. In ASCR Workshop on the Science of Scientific-Software Development and Use, October 2021.\nH. Childs, S. Ahern, J. Ahrens, A. C. Bauer, J. Bennett, E. W. Bethel, et al.. A Terminology for In Situ Visualization and Analysis Systems. International Journal of High Performance Computing Applications,  August 2020.\nT. Perciano, C. Heinemann, D. Camp, B. Lessley, and E. W. Bethel. Shared-memory Parallel Probabilistic Graphical Modeling Optimization: Comparison of Threads, OpenMP, and Data-Parallel Primitives. In Proceedings of ISC High Performance 2020, Frankfurt, Germany, June 2020.\nBurlen Loring, Mathew Wolf, James Kress, Sergei Shudler, Junmin Gu, Silvio Rizzi, Jeremy Logan, Nicola Ferrier, and E. Wes Bethel. Improving Performance of M-to-N Processing and Data Redistribution in In Transit Analysis and Visualization. In Steffen Frey, Jian Huang, and Filip Sadlo, editors, Eurographics Symposium on Parallel Graphics and Visualization (EGPGV), Norrköping, Sweden, May 2020.\nGrants and Awards\nFrom Bits to Qubits: Challenges in Classical-Quantum Integration. 2024 IEEE 31th International Conference on High Performance Computing, Data, and Analytics (HiPC), Bangalore India, Dec. 2024.\nUS Department of Energy, Office of Advanced Scientific Computing Research. AQuA-DATA: Advanced Quantum Algorithms for Diverse Applications and Theoretical Advancements in Science. Oct 2024 -- Sep 2029. (SFSU PI: Bethel, SFSU Co-PI: Huang)\nU. S. Department of Energy, Office of Advanced Scientific Computing Research. Scalable Analysis Methods and In Situ Infrastructure for Extreme Scale Knowledge Discovery (SENSEI). Subaward from Lawrence Berkeley National Laboratory. Oct. 2022 – Sep. 2024. (PI: Bethel)",
    "url": "https://cs.sfsu.edu/advanced-computational-technology-research"
  }
]