[
  {
    "source": "https://sped.sfsu.edu/content/forms-0",
    "category": "general",
    "title": "Forms and Waivers | Department of Special Education",
    "content": "Forms and Waivers\nThese petitions and forms help students progress through each stage of their Special Education degree and credential programs.\nSpecial Education Department & SF State Forms\nSubject Matter Competency Requirement (SMR) Waiver\nSubject Matter Competency\nApplicant Document Extension Notice\nPreliminary Education Specialist & CRS Credentials\nCredential Course Substitution Form\nSubstitution Course Form\n218.49 KB\nHealth Education (HED) Substitution List\nHED Course Substitutions 2024\n124.43 KB\nCredential Approved Program (CAP) & Student Teaching Forms:\nECSE CAP Form and Student Teaching Application\n447.85 KB\nESN CAP Form and Student Teaching Application\n447.57 KB\nMMSN CAP AY 25-26\n448.06 KB\nO&M CAP AY 25-26\n448.88 KB\nVI CAP AY 25-26\n447.38 KB\nDivision of Graduate Studies Forms, Waivers, ATC & PCE\nDivision of Graduate Studies Forms, Waivers, and Petitions\nRegistrar's Office Forms\nRegistrar's Office Forms and Petitions",
    "url": "https://sped.sfsu.edu/content/forms-0",
    "domain": "sped.sfsu.edu"
  },
  {
    "source": "https://sped.sfsu.edu/content/student-teaching-guidlines",
    "category": "general",
    "title": "Student Teaching Guidelines | Department of Special Education",
    "content": "Student Teaching Guidelines\nStudent Teaching Application Deadline\nF\nebruary 13\n(Fall semester)\nSeptember 13\n(Spring semester)\nStudents should plan on completing their student teaching during their last semester in the credential program. Students must have completed all their credential coursework and have no incompletes. Students must be enrolled full-time for a minimum of 12 units during the semester of student teaching. Students must apply for student teaching\none semester prior\nto the semester when they intend to student teach. * Interns must also submit a student teaching application.\nSpecial Education (SPED)\n: The Student Teaching Application and program CAP forms can be obtained from the\nForms\npage. Each CAP form must have the faculty advisor signature and each semester or proposed semester should be filled in. Additional requirements are listed below and on the Student Teaching Application.\n**\nEmail complete packets\nin one email\nto Steve Macaris at\nsmacaris@sfsu.edu\nby the due date listed above.\nImportant Information\n* If you hold a credential or permit issued by the California Commission on Teacher Credentialing (CTC) make a copy and submit it along with your Student Teaching Application and CAP form in lieu of the documentation below. Valid Multiple-Subject, Single Subject, Education Specialist, and Intern credentials cover all preconditions listed below. Valid Emergency Credentials or Permits cover only the COC and TB requirements.\nStudent Teaching Backup Documentation\nPlease provide copies of the following material with your Student Teaching Packet. All items need to be completed or met prior to conducting your student teaching experience.\nBasic Skills Requirement (BSR\n):\n*\n(a bachelor's or higher degree from a regionally accredited institution, will automatically satisfy this requirement)\nSubject Matter Requirement (SMR\n):\nStudents may take the appropriate California Subject Examination for Teachers (CSET) exam to meet this requirement. Make certain to take all the applicable subsets in the category you choose. For more information on the tests, go to\nthe CSET website\n. Students may also be eligible for a\nSMR\nwaiver\n.\nNote: ECSE and O&M are exempt from the SMR.\nCertificate of Clearance (COC)\n: Fingerprint Clearance via Live Scan and Commission on Teacher Credentialing\nonline application.\nTuberculin Test (TB)\n. Must be done within the two past years. Available at SFSU Health Center.\nSFSU Unofficial Transcripts",
    "url": "https://sped.sfsu.edu/content/student-teaching-guidlines",
    "domain": "sped.sfsu.edu"
  },
  {
    "source": "https://sped.sfsu.edu/",
    "category": "general",
    "title": "The Department of Special Education | San Francisco State",
    "content": "Apply Now\nContact Us\nWelcome\nWelcome to the Department of Special Education at San Francisco State University! We are a comprehensive department that offers programs/classes for undergraduate and graduate students. As a department we are committed to actively lead in research, teaching and service that promotes and advocates for the inclusion, belonging and equity of disabled individuals within schools, communities and society as a whole.\nBe a part of our community, gaining expertise in leading and advocating for inclusion and equity for all!\nOffice Hours\nMonday - Thursday\n9:00 a.m. - 5:00 p.m.\nFriday\n– office staff works remotely\nLunch Hour:  12:00 p.m. to 1:00 p.m.\nContact Information\nEmail\n:\nsped@sfsu.edu\nTelephone\n: (415) 338-1161\nLocation\n: Burk Hall 156\nPrograms\nPrograms in Special Education\nChoose from our Master's, Credentials, Graduate Certificates, Joint Doctoral, and Undergraduate programs:\nUndergraduate Programs\n(\nMinor & SF Scholars\n)\nMaster of Arts in Special Education\nPreliminary Education Specialist Credentials and CRS Credentials\nCertificates\nJoint Doctoral Program\nIntern Credential\nSpecial Education Spotlight\nWhy Choose Our Department\nThe Department of Special Education at SF State is one of the most comprehensive departments of special education in California.\nWhy should you choose our program?\nScholarships for Educators\nThe scholarships offered by the Graduate College of Education are open to all students in the graduate college.\nApplication period: September 1 - November 11, 2025\nScholarships & Funding\nNews\nESN Professor, Mayumi Hagiwara awarded 2 Grants!\nJulie Paulson, Professor, English Department and Mayumi Hagiwara, Department of Special Education, have been awarded both a…\nA Summer of Impactful Collaboration\nThis summer, Peter C. DeHaas, a veteran San Francisco State lecturer in American Sign La…\nCalifornia Deaf Blind Services (CDBS) at risk of being defunded!\nThe California Deafblind Services (CDBS) is a discretionary grant that is funded through the U.S. Department of Education, O…\nMore News\nEvents\nNov\n05\nSpecial Education (SPED) Information Session\nWed, November 05, 04:00 pm\nZoom (online)\nDec\n03\nSpecial Education (SPED) Information Session\nWed, December 03, 04:00 pm\nZoom (online)\nMore Upcoming Events",
    "url": "https://sped.sfsu.edu/",
    "domain": "sped.sfsu.edu"
  },
  {
    "source": "https://sped.sfsu.edu/message-chair",
    "category": "general",
    "title": "Message from the Chair | Department of Special Education",
    "content": "Message from the Chair\nWelcome to the Department of Special Education at San Francisco State!\nOur Department’s mission is to actively engage in research, teaching and service that advocates for the inclusion and equity of individuals with disabilities* within schools, communities, and society. Fundamental to this mission is that all individuals have the right to be acknowledged and valued as full members of our communities, honoring the diverse, intersecting identities that we all hold. In turn, our work is focused on ensuring special education supports and services are individualized, asset-based, culturally-sustaining, collaborative, and interdisciplinary.\nWe are proud to be the largest provider of special educators and related service providers in the Bay Area including 8 programs at the undergraduate, masters, doctoral, and five post baccalaureate teaching credentials. Through these paths, we are committed to curricula that promote and prioritize access to general education and inclusive learning environments for all. Further, our students will develop specialized expertise in supporting the development and learning goals of disabled individuals across their lifespan.\nOn behalf our faculty and stuff, we welcome you to join our community.\nAmber Friesen, Ph.D.\nChairperson and Professor, Department of Special Education\n*Both identify-first and person-first language are used interchangeably with the awareness that language use regarding identity should be chosen by an individual.",
    "url": "https://sped.sfsu.edu/message-chair",
    "domain": "sped.sfsu.edu"
  },
  {
    "source": "https://sped.sfsu.edu/lecturer-faculty",
    "category": "general",
    "title": "Lecturer Faculty | Department of Special Education",
    "content": "Lecturer Faculty\nAnderson, Krystal\nEmail:\nkanders2@sfsu.edu\nAnton, Jacqueline\nEmail:\njanton@sfsu.edu\nAtkinson, Gemma\nEmail:\ngatkinson1@mail.sfsu.edu\nAramburo, Corrine\nEmail:\ncarambur@sfsu.edu\nArbit, Hadas\nEmail:\nharbit@mail.sfsu.edu\nBarclay, Lizbeth\nEmail:\nlbarclay@mail.sfsu.edu\nBarraco, Jeanette\nEmail:\njebarraco@sfsu.edu\nCastellano-Ortega, Nataly\nEmail:\nnatalyc@sfsu.edu\nCoble, Mikayla\nEmail:\nmikaylac@sfsu.edu\nDavis, Cyndi\nEmail:\ncsdavis@sfsu.edu\nDeHaas, Peter\nEmail:\npdehaas@sfsu.edu\nDevos, Marijke\nEmail:\nmxdevos@sfsu.edu\nEdmonds, Leslie\nEmail:\nledmondstvi@sfsu.edu\nEdwards, Kayle\nEmail:\nedwards@sfsu.edu\nEstanislao, Prince\nEmail:\npestanislao@mail.sfsu.edu\nFoley, Erin\nEmail:\neiufoley@sfsu.edu\nGerminaro, Sandra\nEmail:\nsandgerm@sfsu.edu\nGreenberg, Maya\nEmail:\nmayadg@sfsu.edu\nGomez, Mary\nEmail:\nmarygomez@sfsu.edu\nJacobson, Jetta\nEmail:\njettaj1@sfsu.edu\nLeader, Patricia\nEmail:\npleader@sfsu.edu\nNaftalin-Kelman, Elana\nEmail:\nenaftalinkelman@sfsu.edu\nO'Mahony, Melissa\nEmail:\nmomahony@sfsu.edu\nOrozco, Roberto\nEmail:\nrorozco@mail.sfsu.edu\nRodriguez, Jeanne\nEmail:\njrodriguez29@sfsu.edu\nSacks, Sharon\nEmail:\nssacks1351@sfsu.edu\nSeang, Saveth\nEmail:\nsavethseang@sfsu.edu\nStewart-Henry, Kristan\nEmail:\nkristans@sfsu.edu\nVigh, Alyson Lyn\nEmail:\navigh1@sfsu.edu\nWagner, Sarah\nEmail:\nswagner3@mail.sfsu.edu\nWhitelaw, Jenna\nEmail:\nwhitelaw@sfsu.edu\nWolf, Marijude\nEmail:\njudewolf@sfsu.edu\nYang, Dia\nEmail:\ndyang5@sfsu.edu\nZabitz, Stephanie\nEmail:\nsmzabitz@sfsu.edu",
    "url": "https://sped.sfsu.edu/lecturer-faculty",
    "domain": "sped.sfsu.edu"
  },
  {
    "source": "https://sped.sfsu.edu/event/special-education-sped-information-session-1",
    "category": "general",
    "title": "Special Education (SPED) Information Session | Department of Special Education",
    "content": "Special Education (SPED) Information Session\nWednesday, November 05, 2025\nEvent Time\n04:00 p.m.   -  05:00 p.m.\nPT\nCost\nFree\nLocation\nZoom (online)\nContact Email\nsped@sfsu.edu\nRegister\nOverview\nPlease Join us for our monthly Special Education (SPED) Information Session to learn more about the application process, our program offerings, our Teaching Credentials and master’s program!\nUpcoming Events\nSpecial Education (SPED) Information Session\nWednesday, November 05, 2025\nSpecial Education (SPED) Information Session\nWednesday, December 03, 2025",
    "url": "https://sped.sfsu.edu/event/special-education-sped-information-session-1",
    "domain": "sped.sfsu.edu"
  },
  {
    "source": "https://sped.sfsu.edu/student-resources",
    "category": "general",
    "title": "Student Resources | Department of Special Education",
    "content": "Student Resources\nProgram Handbooks\nStudent Handbooks provide important tools to guide candidates through the university and department policies with detailed explanations of program requirements, curriculum, and competencies.\nMore SPED Handbooks\nForms and Waivers\nThese petitions, forms, and applications for waivers help students progress through each stage of their MA in Special Education degree and credential program.\nMore Forms\nStudent Teaching Guidelines\nAll of the SPED programs incorporate a student teaching placement(s) as part of the curriculum of each credential area, in compliance with the California Commission on Teaching Credentialing (CTC) standards.\nMore on Student Teaching Procedures\nApplying for the Award of the Credential\nStudents may apply for the award of the credential upon completion of all the coursework, student teaching placement, and any additional testing requirements.\nMore on Applying for the Award of the Credential\nSPED Master’s Exam\nThe SPED MA exam (SPED 896EXM) is one of the options to fulfill the culminating experience requirement for the master’s degree. The exam is held remotely once in the fall and once in the spring semesters.\nMore on the SPED master’s Exam\nSteps to Master's Graduation\nUpon successful completion of all program coursework, completion of culminating experience and filing appropriate forms, students may apply for graduation with the Division of Graduate Studies.\n-\nReport of Completion\n-\nMore Steps to Graduation",
    "url": "https://sped.sfsu.edu/student-resources",
    "domain": "sped.sfsu.edu"
  },
  {
    "source": "https://sped.sfsu.edu/news-list",
    "category": "general",
    "title": "News Listing | Department of Special Education",
    "content": "News Listing\nOctober 03, 2025\nESN Professor, Mayumi Hagiwara awarded 2 Grants!\nJulie Paulson, Professor, English Department and Mayumi Hagiwara, Department of Special Education, have been awarded both a…\nSeptember 19, 2025\nA Summer of Impactful Collaboration\nThis summer, Peter C. DeHaas, a veteran San Francisco State lecturer in American Sign La…\nJune 29, 2025\nCalifornia Deaf Blind Services (CDBS) at risk of being defunded!\nThe California Deafblind Services (CDBS) is a discretionary grant that is funded through the U.S. Department of Education, O…\nApril 29, 2025\nInclusion Pilot Project is hiring Peer Mentors for Fall 2025!\nTo Apply: email Inclusion@sfsu.edu\nJob Summary:\nYou will provide person-centered in-class support, one-one academic tutoring…\nMarch 17, 2025\nThe Council for Exceptional Children is offering free memberships to all between March 17 - 31\nThe Council for Exceptional Children is offering free memberships to all between March 17 - 31.\nPlease share the attached fl…\nDecember 05, 2024\nPeter DeHaas hosts the 2024 Bay Area Disability Entrepreneurship Event\nExecutive Director Peter DeHaas kicked off the event with a powerful message, highlighting the SFDBA’s year of growth and de…\nOctober 14, 2024\nJD candidates present at the Annual International Division for Early Childhood Conference in New Orleans, LA in September 2024.\nAlong with family member, Danielle Grayson, joint doctoral program students, Karina Du and Krystal Anderson, presented \"Hono…\nSeptember 18, 2024\nDr. Yvonne Bui has been appointed as the Faculty Associate Director of Asian American Collective Action for Racial Equity and Solidarity (AA CARES)\nDr. Yvonne Bui (Department of Special Education) has been appointed as the Faculty Associate Director of Asian American Coll…\nSeptember 03, 2024\nProfessors Amber Friesen and Maryssa Mitsch collaborate on White Paper entitled, \"The What, Who and How of Early Childhood Special Education Personnel Preparation in California.\"\nDrs. Amber Friesen and Maryssa Mitsch collaborated with Dr. Janice Myck-Wayne from CSU Fullerton to write a White Paper enti…\nSeptember 02, 2024\nJD Candidate, Krystal Anderson, presents at Ghana ASCD's International Educator's Summit\nJD candidate, Krystal Anderson, had the opportunity of attending the Ghana ASCD's International Educator's Summit  to facili…\nAugust 19, 2024\nProfessor Mary Requa awarded prestigious 3-year NSF Grant!\nDr. Mary Requa has been awarded a National Science Foundation grant as a co- PI with her two colleagues entitled, Supporting…\nJuly 19, 2024\n\"Advancing Equity and Inclusion in Early Childhood\" Published!\nThe Department of Special Education is delighted to announce the publication of a co-edited book by our Department Chair, Am…\nJuly 15, 2024\nJoint Doctoral Student, Sara Ucar, Publishes first position paper in a California Council on Teacher Education Journal!\nThe Department of Education is  proud to share that one of our amazing Joint Doctoral students, Sara Ucar, has published her…\nApril 02, 2024\nChair and Professor, Amber Friesen has article published! Titled, \"Promoting EI/ECSE Practitioners' Professional Growth Through a Reflective Practice Framework\"\nThe Chair and Professor, Amber Frieden has had an article published, \"Promoting EI/ECSE Practitioners' Professional Growth T…\nMarch 14, 2024\nECSE Faculty, Maryssa Mitsch has article published! Titled: \"Family practices in educator licensure: a content analysis of U.S. state requirements\"\nSpecial Education faculty, Maryssa Mitsch in Early Childhood Special Education has had an article published titled \"Family p…\nDecember 06, 2023\nSF State master's degree programs join the Western Regional Graduate Program (WRGP)\nThe provost has authorized the expansion of SF State’s participation in the Western Regional Graduate Program (WRGP) to all…\nNovember 29, 2023\nSPED Faculty, Mary Requa awarded 2023 Faculty Research Grant!\nCongratulations to Special Education Mild Moderate Support Needs Faculty member, Mary Requa. Dr. Requa has been  been awarde…\nNovember 28, 2023\nSF State Disability Minor featured in the LA Times\nThis fall, San Francisco State became just the second CSU school to inaugurate a disability studies minor. The Los Angeles T…\nNovember 27, 2023\nSan Francisco Disability Business Alliance hosts 3rd Annual Bay Area Disability Entrepreneurship Event\nOn Thursday November 9th 2023 the San Francisco Disability Business Alliance hosted its 3rd annual Bay Area Disability Entre…\nSeptember 12, 2023\nSPED & SLHS Faculty receive Spencer Foundation Grant!\nDr. Gloria Soto from the Department of Special Education and Dr. Mike Clarke from the Department of Speech, Language and Hea…\nApril 15, 2023\nCCTE Spring 2023 Research Monograph Just Published!\nCCTE Spring 2023 Research Monograph\nApril 07, 2023\nSara Burton (ESCE Alumni, Joint Doctoral Student) will represent SFSU at the 37th Annual CSU Student Research Competition\nSara Burton (ESCE Alumni, Joint Doctoral Student) will represent SFSU at the 37th Annual CSU Student Research Competition on…\nFebruary 03, 2023\nEarly Childhood Special Education, School of Social Work receive federal grant for Project ARISE proposal\nWe are now recruiting for a fall 2023 cohort for Project ARISE! Project ARSIE (Adversity and Resiliency Interventions for So…\nJanuary 31, 2023\nSan Francisco Disability Business Alliance chosen for 2023 Community Partnership Award for Campus Collaboration\nThe Institute for Civic & Community Engagement (ICCE) has selected the San Francisco Disability Business Alliance as rec…\nOctober 07, 2022\nSeeking a Tenure Track Assistant Professor in Visual Impairments, Special Education\nInstructional Faculty (VI) – Tenured/Tenure-Track\nApplications will be reviewed starting on October 1, 2022.\n…\nMay 12, 2022\nDr. Sandra Rosen receives the San Francisco State University 2022 Distinguished Faculty Award for her Excellence in Service\nCongratulations to Dr. Sandra Rosen for receiving the San Francisco State University 2022 Distinguished Faculty Award for he…\nApril 28, 2022\nOpening the classroom doors wider in SF State Inclusion Pilot Project\nOpening the classroom doors wider in SF State Inclusion Pilot Project. College of Extended Learning program opens learning o…\nFebruary 10, 2022\nCurrent and former SPED students combine ASL training and law enforcement\nStudent Rayleen Perez graduated from San Francisco State University in 2019 with a Bachelor of Arts in Criminal Justice. Ray…\nMay 26, 2021\n2021 Graduate Award for Distinguished Achievement Recipients\n5 SPED students are part of the 2021 Graduate Awards for Distinguished Achievements!\nApril 28, 2021\nSPED Faculty Kathleen Mortier and Mayumi Hagiwara Launch SF Sate Inclusion Project\nThe Inclusion Pilot Project is for students with intellectual and developmental disabilities who are interested in being inc…\nFebruary 03, 2021\nFour SF State students selected as participants for the National Federation of the Blind's Teachers of Tomorrow program\nMeet Our 2021 Teachers of Tomorrow\nThe National Federation of the Blind is excited to announce the class of 2021 Teachers of…\nOctober 05, 2020\nLibrary circulating collections and CSU+/ILLiad online requests now available\nThe J. Paul Leonard Library is now providing multiple options for the SF State community to get access to print books and ot…\nSPED Students Awarded Fall Scholarships\nCongratulations to our SPED students who were recently awarded scholarships this fall!\nDominic C. Nosenzo Special Education…\nIn Memoriam: Pam Hunt\nIt is with great sadness that we share the news that Pam Hunt passed away on Oct. 9. Hunt was a cherished faculty member in…\nCharles Beavis awarded Second Prize in the CSU Research Competition\nSPED student, Charles Beavis awarded Second Prize in the 35th Annual California State University Student Research Competitio…\nGrace San Miguel accepted into the Ohlone College Deaf-Centered Interpreting Preparation Program\nGrace San Miguel, former American Sign Language (ASL) student of Peter DeHaas, was accepted into the Ohlone College Deaf-Cen…\nSPED Faculty, Mayumi Hagiwara and Mary Requa, featured in CEETL April Newsletter\nhttps://ceetl.sfsu.edu/newsletter-spring-2021",
    "url": "https://sped.sfsu.edu/news-list",
    "domain": "sped.sfsu.edu"
  },
  {
    "source": "https://sped.sfsu.edu/news/esn-professor-mayumi-hagiwara-awarded-2-grants",
    "category": "general",
    "title": "ESN Professor, Mayumi Hagiwara awarded 2 Grants! | Department of Special Education",
    "content": "ESN Professor, Mayumi Hagiwara awarded 2 Grants!\nAuthor:\nsmacaaris@sfsu.edu\nOctober 3, 2025\nJulie Paulson, Professor, English Department and\nMayumi Hagiwara, Department of Special Education\n, have been awarded both a federal Transition and Postsecondary Programs for Students with Disabilities (TPSID) grant (in partnership with CSUN) and a grant from the California Center for Inclusive College (CCIC) to help support the SF State Inclusion Pilot Project. SF State’s IPP will receive $190K for 5 years from the TPSID grant (for a total of 950K); the CCIC grant is a one-year grant for 75K.\nTransition and Postsecondary Programs for Students with Disabilities (\nTPSID\n):\nThe project brings together two pioneering CSU programs—CSUN Explorers at California State University, Northridge, and the Inclusion Pilot Project at San Francisco State University—into a collaborative model. Together, these programs will demonstrate a scalable, sustainable, cross-campus approach to IPSE, expanding access to integrated academic, career, and community experiences. Grounded in evidence-based practices and aligned with TPSID priorities, the model embeds person-centered planning, peer mentorship,\nUniversal Design for Learning (UDL), career development, and CSU-recognized credentials into institutional structures. It also expands inclusive housing and supported living options reflective of typical CSU student experiences.\nCalifornia Center for Inclusive College\n:\nIPP will expand our capacity to serve students with IDD through the development of new courses dedicated to inclusive and embedded academic and career training in three key areas: (1) work-based learning specifically targeting IPP students, (2) career design and skill development integrated into the general curriculum, and (3) Universal Design for Learning (UDL) training for faculty to support all students’ learning. We will also strengthen outreach to K–12 students with IDD, their families, educators, and community stakeholders by hosting showcases and speaking events that highlight the achievements of IPP students as well as provide opportunities for other students with IDD to envision themselves being college students.\nRelated News\nESN Professor, Mayumi Hagiwara awarded 2 Grants!\nOctober 3, 2025\nA Summer of Impactful Collaboration\nSeptember 19, 2025\nCalifornia Deaf Blind Services (CDBS) at risk of being defunded!\nJune 29, 2025\nInclusion Pilot Project is hiring Peer Mentors for Fall 2025!\nApril 29, 2025",
    "url": "https://sped.sfsu.edu/news/esn-professor-mayumi-hagiwara-awarded-2-grants",
    "domain": "sped.sfsu.edu"
  },
  {
    "source": "https://sped.sfsu.edu/content/apply-fingerprint-clearance-california-ctc",
    "category": "general",
    "title": "Fingerprint Clearance with California CTC | Department of Special Education",
    "content": "Fingerprint Clearance with California CTC\nDirections: Follow the application instruction below to apply for the Certificate of Clearance (COC) with the Commission for Teacher Credentialing. Upload a copy of your COC with the application documents in the “Other” section. Applicants will not be admitted into the special education credential program without proof of COC.\nIn accordance with California state law and Education code, all teaching credential applicants must go through a background check. All applicants must apply for a Certificate of Clearance (COC) with the Commission on Teacher Credentialing (CTC)\nOR\nsubmit proof of prior completion of the same clearance.\nAcceptable documentation in lieu of a Certificate of Clearance:\nValid credentials or permits issued by the CTC, including substitute, pre-intern permits, short-term staff permits, clear or preliminary, or Child Development permits. Submit a printout from the CTC website. District or other job related clearance isnot acceptable; however for student teaching purposes districts may require additional fingerprint clearance.\nCertificate of Clearance application instructions\nHave your fingerprints taken via Livescan\n•Complete the\nCTC-specific 41-LS LiveScan form\n. Take two copies to a LiveScan Station for your fingerprints to be taken. To get your fingerprints taken at San Francisco State University Police Department, please call 415/338-6043 to make a LiveScan appointment.\n•If you already have a Certificate of Clearance OR a CTC credential (i.e., Substitute Permit, Child Development Permit, Multiple Subject Credential, etc.) you DO NOT need to complete the below process.\n•Note: If you had your fingerprints taken at a district or for another type of job, these WILL NOT be electronically submitted to the CTC.\nComplete the online application at the CTC website\n•Apply for the Certificate of Clearance (COC) using the Web Application Process at the\nCTC website\nA. Click the\nCredentialing Information\nnavigation button\nB. Select the\nEducator Login\nbutton to begin your application.\nC. Create/log in to your personal profile on the secure Educator Page using your SSN and date of birth. If this is your first application and you are creating a new profile, you will be prompted to enter this information twice.\nD. When your personal profile iscomplete, click\nNext\nE. Click on the\nCreate New\nbutton under Web Applicationsto start your application for the Certificate of Clearance\nF. Select the Certificate of Clearance from the drop-down menu; review the checklist verifying you meet all requirements forthe document, print it, and then click Next\nG. Read the Discloser Page for the Professional Fitness questions and click\nNext\nH. Answer each of the Professional Fitness questions, complete the Oath and Affidavit, and click\nSubmit Payment\nI. On the next page, clickthe\nProcess Payment\nbutton to move forward\nJ. The display shows the document applied for and the amount to pay. Click\nContinue\nK. Complete the billing verification information for LexisNexis. Choose to pay with credit card (can also use debit card with Visa or MasterCard logo). Click\nContinue\nL. Verify all the payment information is correct, including email address. Click\nComplete Payment\n. a. Do not click the Complete Payment button more than once\nM. Use the link provided to obtain a printable receipt for your reference and personal records\n•NOTE: If you answered “yes” to any of the Personal and Professional Fitness questions, you must send required supporting materials to the Commission as per instructions.\n•Once your COC is processed it can be printed from the Internet. After two weeks, log into the Education’s Page on the\nCTC website\nto check your application status.\n•Upload acopy of theCertificate of Clearance with your application documents.\nThe printed document must have your name, document number, and the issuance date listed.",
    "url": "https://sped.sfsu.edu/content/apply-fingerprint-clearance-california-ctc",
    "domain": "sped.sfsu.edu"
  }
]