[
  {
    "source": "https://cob.sfsu.edu/career-services",
    "category": "student_career",
    "title": "Career Services & Professional Development Center | Lam Family College of Business",
    "content": "Career Services & Professional Development Center\nThe Lam Family College of Business Career Services & Professional Development Center (CSPD) is a dynamic space supporting students' career development. Our mission is to demystify the career planning process and help students and alumni strategize their career pathways toward the places and spaces they will occupy while students and beyond. We offer:\nOne-on-one advising (on resumes, LinkedIn, job-hunting strategy, interview preparation, and more) for current students and alumni\nPanel Talks with industry professionals\nWorkshops that develop tangible and in-demand skills\nJob/internship opportunities\nCommercial Real Estate Fellows Program (see the Student Fellowship Programs section on this page)\nCareer Advising\nTo Sign Up For Advising:\n1. Log in to your\nNavigator account\n(or select the \"Advising\" button below)\n2. There should be a blue button to \"Schedule an Appointment\"\n3. For your type of appointment select \"career services\"\n4. You will now be given a variety of options for your appointment (resume, LinkedIn, etc.);\nbe sure to select the options with \"LFCoB\"\nin parenthesis to use the Lam Family College of Business's career services!\nFor any issues, please email Paul Glanting at\npbg@sfsu.edu\nAdvising (for Resumes, LinkedIn, Job Search Strategy, Interview Skills, etc. for current students)\nProfessional Headshots on Campus\nHiration: LinkedIn, resume, cover letter, job interview preparation\nEvents, Workshops, and Panels\nThe Commercial Real Estate Fellows Program\nAlumni Career Advising (for recent graduates)\nCareer Resources\nJobs and Internships\nEvents, Workshops, Panels for Career Services & Professional Development\nEach semester we offer an abundance of panels and workshops! Learn from alumni and sharpen your job-readiness skills!\nSee the events calendar here!\nStudent Fellowship Programs\nAdvising Resources\nVisit\nCSPD Jobs & Internships\nfor internship opportunities.\nTap into\nour career resources\nfor advice on:\nbuilding a professional portfolio\nwriting your résumé and cover letter\nhow to prepare for interviews\njob and internship search strategies\nBook an Appointment\nAs a Lam Family College of Business Student, you can access our advising services. We can help you polish your resume or build your LinkedIn profile. We offer advising both via Zoom and in person.\nIncugator (a startup incubator for SF State students)\nThe San Francisco State University IncuGator (SFSU Gator + Incubator) is a startup incubator designed to develop and accelerate the innovative ideas and entrepreneurial visions of SF State students of all majors and levels. Applications are accepted on a rolling basis until the annual cohort is full. Visit the\nIncugator\nwebpage to learn more and apply.\nFinTech Fellows Program\nA new financial system is being built on the Internet and many of the companies leading the way are located in San Francisco. The FinTech industry is at an early stage of development and needs professionals who understand FinTech in order to help accelerate and expand adoption of these innovations.\nVisit the Fintech Fellows Program.\nThe President's Leadership Fellows Program\nThe\nPresident’s Leadership Fellows Program\nprovides students with tools and resources to assist them in their preparation and transition to job-readiness.\nGator Leadership Circle (GLC)\nDesigned for first- and second-year students at SF State, the\nGator Leadership Circle (GLC)\naims to support your academic, career and leadership development through a series of workshops and other activities.\nCommercial Real Estate Fellows Program\nThis is your opportunity to enter the field of commercial real estate, an industry that is rapidly changing due to factors such as shifts in demographics and advances in technology.\nLearn more and apply for the Commercial Real Estate Fellows Program.\nOther Career Preparation Opportunities\nBooking Career Services and Professional Development Advising Appointments.pdf\n726.12 KB\nBusiness Student Organizations\nStudent organizations play a critical role in preparing students for the world of work. The LFCoB is home to more than 15 registered business student organizations, all created and led by students.\nFind a student organization that interests you and get involved today!\nLeadership EDGE Program\nThe\nLeadership EDGE Program\nis a co-curricular engagement program designed to help you find and participate in college activities and experiences to help you grow to your full potential. By downloading the Suitable app, you earn points for activities, event attendance, and accomplishments at varying levels, and are prepared to become a contributor or leader in your future work environment.\nMentorship Program\nThe\nMentorship Program\nhelps you realize your potential and prepares you for career success through one-on-one mentoring from successful professionals who are SF State alumni. The program also provides opportunities to expand your professional network.\nSF State's Career Services & Leadership Development Office\nSF State's Career Services & Leadership Development\nis a valuable resource open to all SF State students.\nOf Related Interest\nTutoring and Academic Support Center\nThe\nTutoring and Academic Support Center\nis a great resource for support on writing résumés and cover letters.\nSpotlight on Career Success\nThe value of an SF State education when combined with strong engagement in Lam Family College of Business programs and offerings has helped these alumni in their career paths.\nWe proudly share their stories of career success.\nFor Employers\nPartnering with the Lam Family College of Business gives you access to some of the best and brightest talent, so we look forward to helping you successfully fill your available positions and internships. We work with you to ensure success, and our students count on us to facilitate their success.\nPosting Paid Opportunities\nIf you are posting a paid role, we invite you to review\nSF State's Policy and Guidelines regarding professional recruiting announcements and activities.\nPosting Unpaid Opportunities\nWhile the university and the CSPD Center strongly feel it is critical to compensate students for internships, IF you are posting an unpaid professional opportunity, we invite you to read the\nNational Association of Colleges and Employers (NACE) Position Statement on U.S. Internships\n. This position statement is an accurate source you can use to help determine if your opportunity is appropriate for posting with us.\nThe Jobs and Internships Request Form\nAfter reading our guidelines and policies, complete the\nJobs and Internship Announcement Form.\nWe will review your request and get back to you within 24 to 48 hours.\nFinally, If you feel your job is not within the scope of programs and majors offered within the Lam Family College of Business, we encourage you to post your announcement using\nSan Francisco State University's Handshake platform.\nContact Us\nBook an Appointment\nBook your appointment using Navigate\nPhone\n(415) 338-2509\nEmail\ncobcareer@sfsu.edu\nLocation\nBUS 137\nLam Family College of Business\nSan Francisco State University\n1600 Holloway Avenue\nSan Francisco, CA 94132\nAdvising Hours (Fall 2025)\nBy Appointment:\nMonday 2-5 p.m.\nTuesday 9 a.m. – 1 p.m.\nWednesday 1-4 p.m.\nThursday 9 a.m. – 1 p.m.\nCSPD Staff\nEmail is the quickest and preferred method of communication.*\nPaul Glanting\nDirector of Career Services and Professional Development\npbg@sfsu.edu\n(415) 338-1\n272\nRachel Chen\nCommercial Real Estate Fellows Program Coordinator\nrchen7@sfsu.edu\n(415) 338-2509\nJenny Xing\nCareer Advisor\njxing@sfsu.edu\n(415) 338-2509\nBrandi See\nCareer Advisor\nbsee@sfsu.edu\n(415) 338-2509\nTo view PDF files, you may\ndownload Adobe Reader\nTo view Word, Excel & PowerPoint files, you may\ndownload LibreOffice",
    "url": "https://cob.sfsu.edu/career-services",
    "domain": "cob.sfsu.edu"
  },
  {
    "source": "https://cob.sfsu.edu/marketing/",
    "category": "general",
    "title": "Marketing Department | San Francisco State University",
    "content": "Donate\nMarketing Department\nOur\nMarketing program was ranked 12th among public universities\nfor salary outcomes in the\nWall Street Journal's\n(WSJ)\n2023 “Best College for Your Dream Career in Marketing” ranking\nlist.\nMarketing is a\ndynamic and fast-growing field with a wide variety of careers\n. Located in the global business hub of San Francisco, the Department of Marketing in the Lam Family College of Business strives to be a leading academic force in training future marketers in the digital age. With a focus on innovation, diversity, and community engagement, our program is committed to providing a state-of-the-art curriculum that equips students with future-proof skills and capabilities.\nWe have a strong team of faculty members devoted to teaching excellence and engaged pedagogy that emphasizes experiential learning, critical thinking, and ethical decision-making.\nOur vibrant student organizations facilitate professional networking and create a sense of community. Graduates of our programs enjoy successful careers in diverse domains, such as social media, advertising, marketing, consulting, retailing, personal selling, and more.\nThe innovative curriculum and the exciting job opportunities in the San Francisco Bay Area make marketing one of\nthe\nmost popular\nconcentrations at San Francisco State University.\nDegree Programs and Certificates\nUndergraduate Program\nLearn More\nGraduate Program\nLearn More\nGraduate Certificate in Marketing in the Digital Economy\nGraduate Certificate in Sustainable Business\nGraduate Certificate in Business Principles\nStudent Spotlight\nQiwen Cai\nFrom SFSU to the University of Washington's M.S. in Business Analytics (MSBA) program: Qiwen Cai (MSBA candidate, '25) is turning dreams into reality. As she prepares to graduate with a double major in Marketing and Information Systems, she reflects on how SFSU helped her launch her e-commerce brand and secure admission to the competitive MSBA program at UW.\nQiwen’s entrepreneurial journey began in her Social Media Marketing class, where she ran a full campaign. “Seeing real engagement from my posts was exciting,” she shares. “It made me realize how powerful digital marketing can be.” Inspired by her love for animals, she co-founded\nPawRise\n, a pet supplement brand, in May 2024. “Studying Marketing and Information Systems gave me a unique perspective,” she explains. “I learned not just how to promote a product but also how to analyze customer data.” This experience strengthened her MSBA application, where she will deepen her expertise in business analytics.\nAs she looks ahead, Qiwen is eager to apply her analytical skills in tech as a data analyst while growing her business. Her advice? “For grad school, focus on what makes you unique—your GPA, projects, or experience. For business, expect challenges. Things rarely go as planned, but persistence is key.”\nFaculty Spotlights\nMinu Kumar\nMinu Kumar is a Professor of Marketing at San Francisco State University (SFSU) and is the Founder-Director of the\nResponsible Innovation and Entrepreneurship (RI&E) Research Initiatives\n.\nHe also serves as the Co-Editor-in-Chief of the\nJournal of Product Innovation Management\n(ABS 4, A* ABDC Journal with two year impact factor of 10.5).\nProfessor Kumar has published in journals such as the\nJournal of the Academy of Marketing Science, Journal of Consumer Psychology, International Journal of Research in Marketing, Journal of Product Innovation Management\namong others. He has won several awards such as the Best Overall Conference Paper award at the Summer AMA conference (2011) and the University President’s Award for Research. His work has directly helped the university raise several millions of dollars for I&E programs\nhttps://www.sfchronicle.com/bayarea/article/SFSU-says-25M-crypto-gift-i…\n).\nGoogle Scholar Profile\n|\nORCID ID: 0000-0003-2913-2325\nProfile\nYiwen Chen\n, Assistant Professor of Marketing at San Francisco State University, is a digital marketing scholar specializing in platform-based strategies and social media influencers. With academic training spanning China, the United Kingdom, and the United States, she brings a global perspective to her research on the evolving dynamics of online consumer behavior. Her work has appeared in leading journals such as\nEuropean Journal of Marketing\n,\nJournal of Marketing Management\n, and\nInternational Journal of Electronic Commerce\n. At SFSU, she developed two new courses—Social Media Marketing and Content Marketing—and was honored with the 2024 CEETL Exemplary Teaching Award. She also serves as the Principal Investigator for the AI Fast Challenge Grant,\nCustomizable AI Integration in Higher Education: Marketing Example\n, funded by the California Education Learning Lab ($200,000, 2025), which explores scalable applications of generative AI in marketing education.\nGoogle Scholar Profle\nProfile\nAlumni Spotlight\nJohn Gumas\nJohn Gumas is the founder and CEO of Gumas, an advertising and branding agency based here in San Francisco. Having graduated from SF State with a Bachelor of Science in Business, with concentrations in Marketing and Advertising, in 1984, John went on to run his company for 39 years and counting. By equipping brands with marketing strategies to challenge industry giants, John has changed the way people think about marketing. He currently serves on many boards, including the San Francisco Giants Community Fund, the San Francisco Chamber of Commerce and the Elios Society. If you’re interested in learning more about John, his company, and what advice he has for students, click “Learn More” to watch his on-campus interview.\nLearn More\nNews\nMay 09, 2023\nAdvice for aspiring marketers from alum John Gumas, CEO of Gumas ad agency\nDuring a recorded interview, alum John Gumas, founder and CEO of Gumas, a San Francisco-based advertising and branding agenc…\nMore News",
    "url": "https://cob.sfsu.edu/marketing/",
    "domain": "cob.sfsu.edu"
  },
  {
    "source": "https://cob.sfsu.edu/labor-studies/",
    "category": "general",
    "title": "Labor and Employment Studies | San Francisco State University",
    "content": "Donate\nLabor and Employment Studies Program\nThe Labor and Employment Studies program provides students with an introduction to and understanding of the study of labor and employment relations, broadly defined. Over the past few decades, the study of labor and employment relations has expanded significantly to include new topics that did not previously exist as areas of academic inquiry: globalization and employment relations, international labor standards, human rights and labor standards, corporate social responsibility and corporate codes of conduct, monitoring and accountability frameworks, global supply and value chains, corporate governance and employment relations, “decent work,” equality and diversity at work, labor and “global cities,” employment relations in emerging economies, high-performance work systems, global corporations, and global unions.\nDegree and Minor\nBachelor of Arts in Labor and Employment Studies\nMinor in Labor and Employment Studies",
    "url": "https://cob.sfsu.edu/labor-studies/",
    "domain": "cob.sfsu.edu"
  },
  {
    "source": "https://cob.sfsu.edu/node/257",
    "category": "general",
    "title": "Career Resources | Lam Family College of Business",
    "content": "Career Resources\nTake a look around at the online career resources available to you. Feel free to reach out to us for questions about information found in this section.\nWhat Can I Do with My Major?\nDownloadable Resources:\nWhat Can I Do with a Career in Accounting?\n312.87 KB\nWhat Can I Do with a Career in Decision Sciences?\n51.89 KB\nWhat Can I Do with a Career in Economics?\n77.69 KB\nWhat Can I Do with a Career in Finance?\n51.73 KB\nWhat Can I Do with a Career in Hospitality and Tourism Management?\n55.53 KB\nWhat Can I Do with a Career in Information Systems?\n53.65 KB\nWhat Can I Do with a Career in International Business?\n52 KB\nWhat Can I Do with a Career in Labor and Employment Studies?\n54.47 KB\nWhat Can I Do with a Career in Management?\n304.37 KB\nWhat Can I Do with a Career in Marketing?\n75.71 KB\nFor other ways to explore, please visit\nWhat can I do with this Major\n?\nFind Jobs and Internships\nHandshake\n- The San Francisco State University platform for jobs and internships\nIndeed\nLinkedIn\nHow to Optimize Your LinkedIn Profile\nExplore Careers with Disney\nFind Freelance Work to Build Your Professional Experiences\nLanding Internships for credit: Are you interested in seeking internships with employers registered with the University? Please visit the\nInstitute of Civic and Community Engagement (ICCE)\nfor more information. You can also reference the\nULINK & Site Placement Student User Guide: Summer & Fall 2021\nCareer Planning Checklist\nDownloadable Resources:\nCollege of Business Career Services Checklist\n37.24 KB\nResume Resources Support\nRésumé Resources:\nFree Resume Review\n: This site offers free assistance with your resume, in addition to our services.\nDownloadable Resources:\nResume and Cover Letter Guide.pdf\n368.55 KB\nEntry Level Graduate Resume Sample.pdf\n41.88 KB\nExperienced Graduate Student Sample.pdf\n22.38 KB\nEMBA Resume Sample.pdf\n23.93 KB\nFreshman Resume Sample.pdf\n46.6 KB\nCollege Student with Some Experience Sample.pdf\n49.77 KB\nRecent Grad Sample.pdf\n73.63 KB\nCover Letter Assistance\nDownloadable Resources:\nCover Letter Internship Sample.pdf\n63.5 KB\nCover Letter Full Time Role Sample.pdf\n82.27 KB\nInterview Support\nInterview Tips & Resources\n75 Behavorial Interview Questions\n:\nLearn how to answer some of the most challenging interview questions\nLegal and Illegal Interview Questions:\nFamiliarize yourself with questions you may encounter in interviews\nUsing the STAR Interview Method:\nLearn an easy strategy to ensure you are responding to interview questions in the best way possible\nQuestions to ask YOUR interviewer at the end of the interview:\nYou should always be prepared to ask questions at the end of your meeting. This helps you learn about the position, your future team, and the company or employer. Here are some sites with great tips.\n39 of the Best Questions to ask at the end of an interview- Indeed\nTop 20 Best Questions to Ask in an Interview- BigInterview\nBest Questions to Ask in an Interview- the balance careers\n45 Great Questions to Ask an Interviewer To Land Your Job- Science of People\n35+ Interview Questions and Answers\nLinkedIn Tips and Job Hunting Handbook\nZipRecruiter\nGeneral Career Resources\nSan Francisco State University Career Services and Leadership Development (CSLD)\nThe Muse: Career Guidance\nZippia: Zippia helps you find and pursue the job that's right for your career.\nAre you wondering what are\nSoft Skills\n?\nCompany Research\nAngelList (Startups)\nCrunchbase\nGlassdoor\nForbes Lists\nSF Business Times Book of Lists\n(\nSF State Library)\nZipRecruiter Industry Insights\nSalary Research\nGlassdoor Salary\nLinkedIn Salary\nPayscale\nZipRecruiter Salary Calculator\nSkills Development\nSFSU College of Extended Learning\nJVS Skills Training\nBusiness Insider List of Free Online Courses\nedX: Free Online courses for professional development\nSan Francisco Public Library Online Career Resources\nCareer Advice\n:\nExplore articles about how to approach job searching and what is happening or trending in the World of Work\nTo view PDF files, you may\ndownload Adobe Reader\n.\nTo view Word, Excel & PowerPoint files, you may\ndownload LibreOffice\n.",
    "url": "https://cob.sfsu.edu/node/257",
    "domain": "cob.sfsu.edu"
  }
]