[
  {
    "source": "http://beca.sfsu.edu",
    "category": "general",
    "title": "Broadcast and Electronic Communication Arts| College of Liberal & Creative Arts",
    "content": "Broadcast and Electronic Communication Arts\nThe Department of Broadcast and Electronic Communication Arts (BECA) at SFSU is a premier destination for learning in the media arts. Our professors bring real-world expertise in the theory and practice of television, video, audio, radio, digital production and content delivery, multimedia, scriptwriting and media business.\nWhy Study BECA at San Francisco State University?\nSpotlights\nWhat's happening in Marcus Hall\nKSFS Radio\nBECA Alumni LinkedIn\nBachelor of Arts\nMaster of Arts\nMaster of Fine Arts\nMinor in Media Literacy\nMusic Recording Industry Certificate\nStudy Abroad\nAnnouncements\nNews\nAugust 22, 2025\nRajeev Naidu, Ed.D honored at BEA Faculty Competition\nLecturer Faculty Dr. Rajeev Naidu was honored in the BEA Faculty Competition with both the Best of Show and the Award of Exc…\nAugust 22, 2025\nProf Jeff Jacoby's Podcast comes to SF State\nProfessor Jeff Jacoby has been traveling throughout California State University campuses. Here's his podcast at SF State.\nTr…\nAugust 22, 2025\nProf Andrew Hongo's Documentary accepted\nProfessor Andrew Hongo's documentary was accepted for a film festival at Loyola Marymount University in Los Angeles, October…\nMore News\nMore events coming soon!\nMore Upcoming Events\nAdvising\nOur dedicated and knowledgable faculty will act as your advisors to ensure your success while focusin on your education in BECA.\nLearn more about Advising\nScholarships\nWe offer many scholarships within BECA, the College of Liberal & Creative Arts and the University.\nLearn more about Scholarships\nStudent Work\nBECA student work is a collection of content created by BECA students in classes, including video and audio field and studio production, screenwriting and other BECA-oriented content.\nLearn more about Student Work\nBECA TV\nThe BECA Department produces several television shows, including\nState of Events\nand\nUnder SF\n.\nLearn more about BECA TV\nInternships\nBECA works with many companies, including Disney, Audacy/AudacyInc, and Ripples Edge Media, to provide students internship opportunities.\nLearn more about Internships\nGet Involved and Build Success\nBECA TV\nState of Events and Under SF\nare just two of our student-produced television programs. We also create Sports, Comedy, Documentary and Awards shows. Students produce, write, direct and perform these programs in BECA classes such as BECA 415, BECA 515, BECA 651, BECA 660 and BECA 640, among others. Check out some of our shows at\nBECA TV\n.\nLearn more about BECA TV\nKSFS Radio: Embrace the Chaos\nOur students run a radio station, KSFS Radio: Embrace the Chaos, which is broadcast live from our new studio space in Marcus Hall. Listen to the live broadcast!\nListen to KSFS Radio\nSubscribe to BECA Blast\nEmail Address:",
    "url": "http://beca.sfsu.edu",
    "domain": "beca.sfsu.edu"
  },
  {
    "source": "http://beca.sfsu.edu/campus-resources",
    "category": "general",
    "title": "Campus Resources | Department of Broadcast and Electronic Communication Arts (BECA)",
    "content": "Campus Resources\nHere is a compilation of campus resources related to advising, programs, petitions, basic needs and more.\nAcademic Resources (Advising and Tutoring)\nUndergraduate Advising Center (UAC)\n: Advising services for all undergraduate students\nAdvising Hub\n: If you are looking for a resource center, information about probation or advising for your first semester\nTutoring and Academic Support Center (TASC)\n: Wide array of tutoring services\nEducational Opportunity & Pathway Programs (EOPP)\n: Admissions, academic, financial and personal support; on-going advising, tutoring, peer mentoring and developmental workshops\nGator Smart Start\n: Partners with local high schools, incoming students, and current SF State Gators to ensure students excel in their English composition (writing) and quantitative reasoning (math) courses\nBasic Needs Initiative\nFood+Shelter+Success\n: Housing, food and other basic needs resources for all students\nGator Groceries\n: Resources intended to address food insecurity needs for students\nProviding Assistance To Housing Solutions (PATHS)\n: Assists SF State students work towards housing stabilization\nCommonly Used Petitions and Forms\nThe following forms and petitions, and more, can be found on the\nRegistrar's website\n.\nPlease follow all instructions as shown on the specific form.\nAcademic Probation Hold Clearance Form – For removal of academic probation hold, once GPA has been brought to a minimum 2.0\nExceed Max Units – To enroll in 20 units or more during the fall and spring semester\nIndependent Study (699/899) – For eligible students to receive approval for independent study\nWaiver of College Regulations – Waivers for various issues such as adding a course already repeated, late add of course for current semester and late graduation application\nChange of Grade – Request to change letter grade or incomplete grade\nChange of Major or Minor\n– Submit online requests to change your major or minor for fast and convenient service\nWithdrawals\n– Current-semester withdrawals are handled electronically and only after the last day to drop has passed. Click the link to see the acceptable and non-acceptable reasons for current-semester withdrawal\nHealth & Safety\nCounseling and Psychological Services\n: Support services, crisis intervention resources, faculty training, etc.\nHealth Promotion and Wellness\n: Campus health initiatives and programming\nThe SAFE Place\n: Crisis intervention, advocacy and confidential Title IX support for survivors dealing with past or recent incidents of sexual assault, dating or domestic violence, sexual harassment and/or stalking\nSafe Zone\n: Campus network of LGBTQ allies\nUniversity Police Department (UPD)\n: Call 911 in any emergency. Visit website for non-emergency details and resources\nStudent Health Services\n: Provides accessible and low–cost quality health care to all SF State students\nCampus Recreation\n: Access to the Mashouf Wellness Center is included in student fees\nAdditional Resources\nSF State Mobile App\n: Check grades, register for classes, access course information, check the food truck schedule and much more\nClubs and Groups\n: View a list of student clubs and groups within the college\nTitle IX\n: Promoting gender equity and preventing sexual harassment/sexual violence\nDisability Programs and Resource Center (DPRC)\n: Resources and services for students with disabilities and other needs\nJ. Paul Leonard Library\n: Computer labs with printers, study rooms, laptop rentals and more\nSF State Experimental College\n: Promoting student-run, co-learning environments\nOneCard/Gator Pass\n: Functions as your identification card, public transportation discounts, etc.\nVeteran Services\n: Veteran benefits and services\nOffice of Student Financial Aid\n: Estimated tuition rates\nDream Resource Center\n: Support services for undocumented students\nGator Connect\n: Networking and professional mentorship\nStudent Employment\n: On-Campus student employment & federal work study\nStudent Resources at SF State\nMany of the resources available to students at SF State are listed on this resource site.\nAll Campus Resources\nSubscribe to BECA Blast\nEmail Address:",
    "url": "http://beca.sfsu.edu/campus-resources",
    "domain": "beca.sfsu.edu"
  }
]