[
  {
    "source": "http://wgsdept.sfsu.edu/",
    "category": "general",
    "title": "Department of Women & Gender Studies | College of Liberal & Creative Arts",
    "content": "Where Activism Meets Scholarship\nThe Department of Women and Gender Studies examines the power relationships between gender formations and political economies, cultural productions and embodiments. Understanding gender as co-constituted with race, class, sexuality and nation, the department deploys an interdisciplinary and transnational methodology to build feminist archives, conversations and tools for social justice.\nOur students engage in challenging academics, work closely with professors and lead community initiatives.\nWhy Women and Gender Studies at San Francisco State?\nGroundbreaking Spirit\nCollaborative Environment\nEngaged Faculty\nSan Francisco State University has offered classes relating to women's studies since 1971. In 1976 the Department of Women and Gender Studies was founded, becoming one of the first such departments in the United States.\nLearn more about our department.\nWe encourage intellectual collaborations within the department, as well as across the profession, and also support applications for internal and external funding to support research productivity.\nLearn about our WGS Emergency Scholarship.\nFaculty typically teach three courses per semester, maintain an active research and publishing profile, and advise undergraduate and graduate students in the department.\nMeet our faculty\nor\nfind advising\n.\nExplore Our Programs\nDonate to WGS\nHonoring Marjorie Stern\nOur department honors Marjorie Stern, a single mother who worked to provide for her four children while also attending San Francisco State University at the age of 36. She put her ambitions on hold after high school to become a homemaker after being discouraged from attending college by her family. However, this did not stop Marjorie from pursuing her dreams despite her circumstances. She received her bachelor's from SF State and graduated 4th in her class in 1958.\nAfter college, Marjorie became a teacher and taught at Galileo High School for 22 years. She also taught about women and unions/labor force for 5 years at CCSF and 1 year at SFSU. She was a strong advocate for women’s rights, especially in education. Marjorie was a founding member for both the American Federation of Teacher’s (AFT’s) Women’s Rights Committee, where she served as the Chairwoman from 1971 – 1974, and Coalition of Labor Union Women (CLUW). Marjorie established her own Scholarship at SF State and bestowed it upon our very own Women and Gender Studies Department. She wanted to give back and provide students the same opportunity she had at SF State where she was not discriminated against for her age or her gender. In recognition of Marjorie’s achievements, she was inducted into SF State’s Alumni Hall of Fame in 1995. Her photo still hangs in the first-floor lobby of the Administration Building.\nThe Marjorie H. Stern Scholarship supports women’s rights and social justice by helping Women and Gender Studies (WGS) students in immediate financial need remain in school.\nSince 2014 when it was first established, the scholarship has supported a great number of students, and has been instrumental to their academic success.\n“Receiving the Marjorie Stern Scholarship was an honor. This scholarship helped me focus more on my studies and worry less about my medical expenses. I had a huge medical bill that I was not sure how to cover. Because of this scholarship, I was able to both pursue my studies and pay off everything I owed.”\n— Samukezi Ngubane, M.A. 2016, Recipient of Marjorie Stern Graduate Scholarship\n“I am so happy and grateful to be a recipient of this scholarship and I am confident of the positive impact it will make in not just my life, but also my family’s health and wellbeing.”\n— Clair Satuito, Undergraduate Student, 2023 Recipient of Marjorie Stern Undergraduate Scholarship\nThis Giving Tuesday consider donating to Women and Gender Studies at San Francisco State University, and make a difference in the lives of our students.\nSupport inspiring students who will make a difference in the world, like Marjorie Stern!\nDonate to the Women & Gender Studies Department\nAnnouncements\nNews\nProfessors Julietta Hua and Kasturi Ray release new book\nExploring professional passenger driving and the gig economy through feminist theories of labor\nBringing together sociologic…\nTime Bomb\nCongratulations to the talented students of WGS 690, who created this vibrant zine, showcasing the creative, political, and…\nCSU WGS Programs Call for Reinstatement of SSU WGS. Our department in support and solidarity of Sonoma State University WGS\nDear CSU Chancellor Garcia, Governor Newsom, members of the California State Legislature, SSU Interim President Cutrer, and…\nMore News\nEvents\nMay\n30\nWGS Graduation Reception\nFri, May 30, 03:00 pm\nHUM 316\nMay\n06\nWomen and Gender Studies Alumni Panel\nTue, May 06, 11:00 am\nHUM 122*\nMar\n10\nShowcase Class: WGS 582 - Gaming From The Margins\nMon, March 10, 12:30 pm\nMH 217\nMar\n04\nKathryn Kenley-Johnson Memorial Lecture: Unwellness in the University: A Conversation with Mimi Khúc on dear elia\nTue, March 04, 04:00 pm\nLIB 121\nFeb\n19\nSally!\nWed, February 19, 05:00 pm\nCoppola Theatre, School of Cinema, Fine Arts Building\nMore Events",
    "url": "http://wgsdept.sfsu.edu/",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/news-list",
    "category": "general",
    "title": "News Listing | Department of Women and Gender Studies",
    "content": "News Listing\nJune 11, 2025\nTime Bomb\nCongratulations to the talented students of WGS 690, who created this vibrant zine, showcasing the creative, political, and…\nFebruary 14, 2025\nCSU WGS Programs Call for Reinstatement of SSU WGS. Our department in support and solidarity of Sonoma State University WGS\nDear CSU Chancellor Garcia, Governor Newsom, members of the California State Legislature, SSU Interim President Cutrer, and…\nJanuary 27, 2025\nWill Clark Teaching WGS 712 - Queer Theories this Spring\nThe Women and Gender Studies department is thrilled to welcome Professor Will Clark  from the English Department, who will b…\nJune 05, 2024\nFifty Shades of Brown\nCongratulations to the talented students of the Senior Seminar. Their creativity has culminated in a stunning zine titled \"F…\nNovember 17, 2023\nWGS Faculty Response to the Ongoing Nakba in Palestine\nThe Faculty of Women and Gender Studies Department answers the call to uplift the Palestinian right to resist and exist. In…\nNovember 08, 2023\nCongratulations!\nOur department congratulates MA student Azayla Rodriguez and BA student Claire Sauito on being awarded the Marjorie H Stern…\nOctober 31, 2023\nWinter Courses at WGS\nWe are excited to announce that our department is offering 2 winter courses!\nWGS 200 - Introduction to Women and Gender S…\nMay 23, 2023\nWGS Student Donna Pham's Essay featured in the Spring Sutro Review\nIt started with an essay at the WGS 200 course, and ended with a publication at the Sutro Review.\nRead the article.…\nApril 01, 2023\nGraduating WGS Student and SF State women’s basketball player Jolene Armendariz breaks single game and season record for most 3-point shots\nThe basketball player’s academic performance rivals the one she brings to the court\nMarch 07, 2023\nPolitical Notebook: SF supervisors reject mayoral historic panel nominee\nProfessor of Women and Gender Studies Nan Alamilla Boyd and History Lecturer Sue Englander were identified as potential nomi…\nNovember 10, 2022\nNo Justice, No Peace of Mind and Body: The Health Impacts of Housing Insecurity for Black Women\nWomen & Gender Studies student, Maile Chand, writes about the impacts of housing insecurity for Black women\nRead the art…\nMay 02, 2022\nPublic Universities Need More Democracy, Not More Administrators\nOn May 2, 2022, Truthout, a non-profit news organization dedicated to providing independent reporting and commentary on a di…\nMarch 15, 2022\nProfessors Julietta Hua and Kasturi Ray release new book\nExploring professional passenger driving and the gig economy through feminist theories of labor\nBringing together sociologic…\nMarch 02, 2022\nWGS Response to University of Wyoming\nWe hear that a senator couldn’t sleep after reading some of the goals of the University of Wyoming’s Gender and Women Studie…\nSeptember 02, 2021\nWGS Alumna named Executive Director of TransCanWork\nLexi Adsit is a 2013-2014 WGS Alumna, with an emphasis in Lesbian, Gay, Bisexual, and Transgender Studies\nMore information c…\nApril 01, 2021\nDocumentary Explores Life of Professor Emerita Sally Gearhart\n48 Hills describes retired Communication Studies professor as “unsung radical lesbian hero” who helped create Women and Gend…\nMarch 22, 2021\nWGS Response to Asian-American Violence\nWorking-class Asian Americans have long been consigned to working in gendered survival and service jobs.  U.S. military, civ…\nFebruary 16, 2021\nMarcus Early Career Research Award Winners\nIn its second year, the College of Liberal & Creative Arts’ Marcus Early Career Research Award will help five faculty me…\nOctober 15, 2020\nAssistant Professor Christoph Hanssmann contributed to the recent study, “Stop the Revolving Door”.\nTransgender people are more likely than other populations to experience homelessness because of family rejection, housing di…\nSeptember 16, 2020\nInternship Opening: Research Assistant\nJoin a research project that seeks to ensure that home-care workers and other long-term Care workers are treated fairly.\nInt…\nWGS Professor and Chair Martha Kenney Recognized for Pioneering Course on Intersectional Game Design\nProfessor and WGS Chair Martha Kenney (pictured in the centre) was honored for her visionary course, Gaming from the Margins…\nMarjorie H. Stern Scholarship\nThe Marjorie H. Stern Scholarship supports women's rights and social justice by helping Women and Gender Studies (WGS) stud…\nWGS Alumna Receives Prestigious Fellowship\nAndrea Reyes '22 Receives Prestigious Skadden Fellowship\nThe Skadden Foundation has selected Andrea Reyes ’22 as a 202…",
    "url": "http://wgsdept.sfsu.edu/news-list",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/index.php/graduation",
    "category": "general",
    "title": "Graduation | Department of Women and Gender Studies",
    "content": "Graduation\nHave you recently graduated from San Francisco State? Congratulations!\nThe Department of Women and Gender Studies strives to always be our best and give our best to our students.  We ask that our undergraduate and graduate students take a short survey to tell us about your time in the WGS Department so we can continue to provide an excellent learning experience for our future students.  Thank you!\nUndergraduate Exit Survey\nGraduate Exit Survey",
    "url": "http://wgsdept.sfsu.edu/index.php/graduation",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/news/no-justice-no-peace-mind-and-body-health-impacts-housing-insecurity-black-women",
    "category": "student_housing",
    "title": "No Justice, No Peace of Mind and Body: The Health Impacts of Housing Insecurity for Black Women | Department of Women and Gender Studies",
    "content": "No Justice, No Peace of Mind and Body: The Health Impacts of Housing Insecurity for Black Women\nAuthor:\nNonprofit Quarterly\nNovember 10, 2022\nWomen & Gender Studies student, Maile Chand, writes about the impacts of housing insecurity for Black women\nRead the article\nTags\nStudent\nRelated News\nTime Bomb\nJune 11, 2025\nCSU WGS Programs Call for Reinstatement of SSU WGS. Our department in support and solidarity of Sonoma State University WGS\nFebruary 14, 2025\nWill Clark Teaching WGS 712 - Queer Theories this Spring\nJanuary 27, 2025\nFifty Shades of Brown\nJune 5, 2024",
    "url": "http://wgsdept.sfsu.edu/news/no-justice-no-peace-mind-and-body-health-impacts-housing-insecurity-black-women",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/about",
    "category": "general",
    "title": "About | Department of Women & Gender Studies",
    "content": "About Women and Gender Studies\nAs a department, we seek—in our research, teaching and community building—to explore both gender’s embeddedness in current forms of injustice as well as its past and emergent potential for transformative politics. Both Bachelor of Arts and Master of Arts programs are offered, as well as courses for general electives and for those minoring in Women and Gender Studies.\nAlthough San Francisco State University (SFSU) has offered classes relating to women's studies since 1971, it wasn't until 1976 that the Department of Women and Gender Studies (WGS) was founded, becoming one of the first such departments in the United States. Forged out of transformative activism and scholarship, the department centers transnational and intersectional analyses of gender, race, sexuality, nation, labor and ability. Our students engage in challenging academics, work closely with professors, and lead community initiatives.\nIn developing and communicating its understanding of gender and power, the department pays particular attention to insights from critical race and postcolonial studies. Viewing the production of knowledge about gender as itself political, the department seeks --in its research, teaching and community building-- to explore both gender’s embeddedness in current forms of injustice as well as its past and emergent potential for transformative politics.\nDepartment of Women and Gender Studies Mission Statement\nStudents and faculty in the Department of Women and Gender Studies study the power relationships between gender and politics, particularly the politics of knowledge, culture, economy, medicine, science, citizenship, immigration, militarization and the body. We take up interdisciplinary and transnational methodologies to examine how gender is co-constituted with race, sexuality and nation. We explore gender’s embeddedness in current forms of inequity and oppression as well as its potential for a transformative politics. Our goal is to collectively build feminist conversations, archives and tools for social justice.\nEmail us today at\nwgsdept@sfsu.edu\nso we can answer any questions you may have!\nWGS Resource Room\nLocated in Humanities 316, this space is usually available for study and small social gatherings, Monday-Friday 9-5. It is currently closed due to COVID-19 restriction.\nThe resource room also has a refreshed (non-circulating) library, with many current course texts and books of interest to WGS students.\nBrowse the WGS Library\nHistory of WGS\nFor more information about the history of our department, view these historical and celebratory documents.\nPoster of Women Studies Topics\n(PDF)\nWomen Studies B.A. Degree Program\n, (Spring 1977) (PDF)\n40th Anniversary Celebration\n, (October 28, 2011) (PDF)",
    "url": "http://wgsdept.sfsu.edu/about",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/bachelor-arts",
    "category": "general",
    "title": "Bachelor of Arts in Women and Gender Studies",
    "content": "Bachelor of Arts in Women and Gender Studies\nWomen and Gender Studies examines the importance of gender and feminism in relation to issues such as race, class, sexuality, labor, colonialism, multiculturalism and globalization. Students study how bodies, families, communities and nations are gendered in specific cultural, political and historical locations, and investigate connections to their own lives, roles and contributions.\nProspective Undergraduates: Request Information\nOverview\nBachelor of Arts in Women and Gender Studies (30 Units)\nStudents wishing to declare Women and Gender Studies as their major can now do so online, via Campus Solutions. A follow-up email will be sent from the department chair. Students can also make an appointment with one of the undergraduate advisors and fill out an advising form before the appointment. View our\nadvising page\nto find the form you need.\nStudents majoring in Women and Gender Studies may enroll in WGS courses and courses focusing on women, gender and sexuality, in any other department. The choice of electives is flexible, and your advisor will assist you in devising a program appropriate to your own needs and interests. With the consent of your academic advisor, you may also use courses with a focus on women taken at other colleges and universities as part of the Women and Gender Studies major.\nWomen and Gender Studies majors who have completed WGS 300GW will have satisfied the University Graduation Writing Assessment Requirement (GWAR).\nCore (12 Units)\nSelect Two:\nWGS 200: Introduction to Women and Gender Studies (3)\nWGS 210: Introduction to Feminism and the State (3)\nWGS 220: Introduction to Feminist Disability Studies (3)\nWGS 280: Introduction to Feminist Science Studies (3)\nWGS 300GW: Gender, Race, and Nation (3)\nWGS 690: Senior Seminar (3)\nPraxis (3 Units)\nSelect One:\nWGS 105: Feminism and Self-Care: Perspectives and Practices (1)\nWGS 303: Women as Creative Agents (3)\nWGS 305: Women and Gender Studies Lecture Series (3)\nWGS 400: That's Not What I Said: Feminism, Oral History, and Research Methods in Women and Gender Studies (3)\nWGS 602: Feminist Cultural Activism (3)\nWGS 698: Feminist Praxis and the Non-Profit Industrial Complex (3)\nBody Politics (3 Units)\nSelect One:\nWGS 554: Gender and Global Migration (3)\nWGS 563 Gender, Sexuality, and the Politics of Disability (3)\nWGS 591 Critical Approaches to Transgender Health, Science, and Medicine (3)\nWGS 593: Gender, Health, and the Environment (3)\nWGS 612: Queer Theories (3)\nPower and Violence (3 Units)\nSelect One:\nWGS 160: Gender, Politics, and Citizenship (3)\nWGS 511: Women and Violence (3)\nWGS 513: Gender, War, and Militarism (3)\nWGS 514: Women and the Prison Industrial Complex (3)\nWGS 536: Gender, Globalization, and Women's Human Rights (3)\nCulture, Media, and Art (3 units)\nSelect One:\nWGS 304: Gender and Popular Culture (3)\nWGS 542: Gender and Popular Music (3)\nWGS/SXS 551: Queer Literatures and Media (3)\nWGS 580: Feminism and the Speculative: Another World is Possible (3)\nSocial Movements (3 units)\nSelect One:\nWGS 515: Gender, Race, and Reproductive Justice (3)\nWGS 541: Women Writers and Social Change (3)\nWGS 561: Women, Ethnicity, and Social Movements (3)\nWGS 562: History of African American Women (3)\nWGS 565: Muslim Feminisms (3)\nWGS 578: Women, Globalization, and Ecology (3)\nWGS 621: Feminist Theories (3)\nElective (3 units)\nSelect One:\nWGS 150: Women and Gender in U.S. History and Society (3)\nWGS355/HIST 355/ LTNS: History of Women in Latin America (3)\nWGS/AIS 420: Native Genders and Feminism (3)\nWGS/GEOG 423: Geographic Perspectives on Gender (3)\nWGS/AIS/SXS 440: Native Sexualities and Queer Discourse (3)\nWGS/LTNS 445: Gendered Borders: Latinas and Globalization (3)\nWGS /SXS/ PLSI 470: The Politics of Sex and Reproduction (3)\nWGS / BECA 485: Women and Media (3)\nWGS / LTNS 505: Gender, Sexuality, and Latino Communities (3)\nWGS / ENG/ JS 546: 20th Century American Jewish Women Writers (3)\nWGS/ RRS 566: Gender and Modernity in the Muslim and Arab Worlds (3)\nWGS 595/ANTH 590/ CST 590: Feminist Anthropology (3)\nWGS/RRS/SXS 640: Race and Sexual Migration (3)\nWGS/RRS/SXS 645: Sex, Race, Lies, and Love in San Francisco (3)",
    "url": "http://wgsdept.sfsu.edu/bachelor-arts",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/event/sally",
    "category": "general",
    "title": "Sally! | Department of Women and Gender Studies",
    "content": "Sally!\nWednesday, February 19, 2025\nEvent Time\n05:00 p.m.   -  07:00 p.m.\nPT\nCost\nFree\nLocation\nCoppola Theatre, School of Cinema, Fine Arts Building\nContact Email\neirinic@sfsu.edu\nOverview\nSally Gearhart was a charismatic radical activist and academic who spearheaded the 1970s and 80s lesbian feminist movement. She also co-founded the San Francisco State Women Studies program in the 1970s, wrote cult-classic utopian fantasy novels (complete with flying lesbians!), helped establish a women’s land community in Northern California, and more. But although she worked shoulder-to-shoulder with Harvey Milk to defeat the anti-gay Brigg’s initiative in 1978, most people don’t know her name. The documentary about Sally hopes to change that.\nOn February 19, Deborah Craig from the Public Health Department will present her documentary about Sally Gearhart’s long and rich life. The evening will begin with a prescreening reception, followed by the film screening.\nAlthough the film begins as a relatively straightforward biography of an overlooked heroine, it becomes a meditation on the symbiotic relationship between leaders like Sally and movements for social change. Finally, at the end of Sally’s life, despite the challenges of aging, her gift for reaching across the aisle sustain her in the end and should inspire our current urgent struggles for social justice and equality.\nDate:\nFebruary 19, 2025\nTime:\n5:00 pm (prescreening reception)\n6:00 pm (screening)\nLocation:\nCoppola Theatre, School of Cinema, Fine Arts Building\nThis event is free and open to the public.\nIf you plan to attend the pre-screening reception, please RSVP to ensure that we have enough drinks and snacks for everyone.\nRSVP\nUpcoming Events\nMore events coming soon!",
    "url": "http://wgsdept.sfsu.edu/event/sally",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/event/kathryn-kenley-johnson-memorial-lecture-unwellness-university-conversation-mimi-khuc-dear",
    "category": "general",
    "title": "Kathryn Kenley-Johnson Memorial Lecture: Unwellness in the University: A Conversation with Mimi Khúc on dear elia | Department of Women and Gender Studies",
    "content": "Kathryn Kenley-Johnson Memorial Lecture: Unwellness in the University: A Conversation with Mimi Khúc on dear elia\nTuesday, March 04, 2025\nEvent Time\n04:00 p.m.   -  05:30 p.m.\nPT\nCost\nLocation\nLIB 121\nContact Email\nwgsdept@sfsu.edu\nOverview\nJoin us for the Annual Kathryn Kenley-Johnson Memorial Lecture, co-hosted by the\nLongmore Institute on Disability\n, the\nDepartment of Communication Studies\n, and the\nSTS Hub\n.\nWe are thrilled to host renowned author and scholar Mimi Khúc, whose work explores Asian American identity, gender, and disability studies.\nMimi Khúc, PhD, is a writer, scholar, and teacher of things unwell. She is the creator of the mental health projects\nOpen in Emergency\nand the Asian American Tarot, and the author of d\near elia: Letters from the Asian American Abyss\n, a deep dive into the depths of Asian American unwellness at the intersections of ableism, model minoritization, and the university, and an exploration of new approaches to building collective care.\nRead more about the guest speaker\nhere\n.\nPlease note:\nThe venue will have ample seating for wheelchairs and is in an accessible building. For any other access questions, email Emily Beitiks at\nbeitiks@sfsu.edu\n)\nThis event is hybrid; please indicate in your RSVP if you plan to attend in-person or virtually.\nClick here to RSVP\n.\nUpcoming Events\nMore events coming soon!",
    "url": "http://wgsdept.sfsu.edu/event/kathryn-kenley-johnson-memorial-lecture-unwellness-university-conversation-mimi-khuc-dear",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/internship-opening-research-assistant",
    "category": "general",
    "title": "Internship Opening: Research Assistant | Department of Women and Gender Studies",
    "content": "Internship Opening: Research Assistant\nAuthor:\nSeptember 16, 2020\nJoin a research project that seeks to ensure that home-care workers and other long-term Care workers are treated fairly.\nInternship Opening: Research Assistant Start\nDate: September 21 or until the position is filled\nEnd Date: December 31, 2020\nWork Location: Remote\nJoin a research project that seeks to ensure that homecare workers and other Long-term Care workers are treated fairly.\nAbout the project: California will need an estimated 600,000 additional caregivers by 2030 to support our state’s seniors and people with disabilities. (CA Future Health Workforce Commission). In order to meet the growing need, we need to understand the ways long-term care in California does and does not work for consumers and workers.\nTo do this, we’re conducting a study of the industry by surveying workers, employers of caregivers and personal attendants, long-term care facility residents, and their families all across the state. We want to understand how Californians are making decisions about long-term care and support services for themselves and their loved ones.\nThis project is a collaboration with National Domestic Workers Alliance,The UCLA Labor Center, the California Domestic Workers Coalition, the Pilipino Workers Center and the Golden Gate University’s Women’s Employment Rights Clinic. Learn more about the research project on our website.\nAbout Hand in Hand: Hand in Hand is a national network of individuals and families who depend on domestic workers and believe that dignified and respectful working conditions benefit worker and employer alike. We honor the care work that happens in homes across our country, and seek to ensure that care is accessible and affordable for all families and that the jobs we create bring fairness and dignity to the workers.\nAbout the Internship: This is a 10 hour/week unpaid internship that will provide the student with experience with survey-based research as well as research for social justice movement work.\nSpecific duties may include:\nOutreach to survey participants & verification of survey responses\nOpportunity to conduct interviews with workers, seniors, and people with disabilities employing homecare workers\nSupport on transcription of interviews\nWeekly check ins with supervisor\nOther benefits: access to research team meetings, connections to Bay Area and LA based social justice organizations focused on domestic worker rights and rights for elders and people with disabilities.\nRequired Skills and Qualifications:\nInterest in learning about research\nInterest in supporting elder, disability and worker rights\nAbility to work well with others and communicate effectively\nWell organized\nHave access to one own’s computer and phone\nCompensation, Benefits and Work Schedule: None. Hours are flexible- based upon student’s availability. Letter of recommendation furnished upon request or completion of internship.\nTo apply: Please write a paragraph about why you are interested in the position and submit a recent resume or short work history to\nkayla@domesticemployers.org\nby September 21st.\nHand in Hand: The Domestic Employers Network is a project of and fiscally sponsored by Bend the Arc: A Jewish Partnership for Justice.\nBend the Arc and Hand in Hand: The Domestic Employers Network value a diverse workforce and an inclusive culture. Bend the Arc provides equal employment opportunities to all applicants and employees without regard to race, color, religion, gender, sexual orientation, gender identity or expression, age, national origin, marital status, citizenship, disability, veteran status, record of arrest or conviction, or any other legally protected status. Women, people of color, differently abled people, and lesbian, gay, bisexual, transgender and gender non-conforming individuals are strongly encouraged to apply.\nThis job description is intended to convey information essential to understand the scope of the position. It is not intended to be an exhaustive list of skills, efforts, duties, or responsibilities associated with the position.\nRelated News\nTime Bomb\nJune 11, 2025\nCSU WGS Programs Call for Reinstatement of SSU WGS. Our department in support and solidarity of Sonoma State University WGS\nFebruary 14, 2025\nWill Clark Teaching WGS 712 - Queer Theories this Spring\nJanuary 27, 2025\nFifty Shades of Brown\nJune 5, 2024",
    "url": "http://wgsdept.sfsu.edu/internship-opening-research-assistant",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/index.php/additional-resources-0",
    "category": "general",
    "title": "Additional Resources | Department of Women and Gender Studies",
    "content": "Additional Resources\nAcademic Resources (Advising and Tutoring)\nUndergraduate Advising Center (UAC)\n: Advising services for all undergraduate students\nAdvising Hub\n: If you are looking for a resource center, information about probation or advising for your first semester\nTutoring and Academic Support Center (TASC)\n: Wide array of tutoring services\nEducational Opportunity & Pathway Programs (EOPP)\n: Admissions, academic, financial and personal support; on-going advising, tutoring, peer mentoring and developmental workshops\nGator Smart Start\n: Partners with local high schools, incoming students, and current SF State Gators to ensure students excel in their English composition (writing) and quantitative reasoning (math) courses\nBasic Needs Initiative\nFood+Shelter+Success\n: Housing, food and other basic needs resources for all students\nGator Groceries\n: Resources intended to address food insecurity needs for students\nProviding Assistance To Housing Solutions (PATHS)\n: Assists SF State students work towards housing stabilization\nCommonly Used Petitions and Forms\nThe following forms and petitions, and more, can be found on the\nRegistrar's website\n.\nPlease follow all instructions as shown on the specific form.\nAcademic Probation Hold Clearance Form – For removal of academic probation hold, once GPA has been brought to a minimum 2.0\nExceed Max Units – To enroll in 20 units or more during the fall and spring semester\nIndependent Study (699/899) – For eligible students to receive approval for independent study\nWaiver of College Regulations – Waivers for various issues such as adding a course already repeated, late add of course for current semester and late graduation application\nChange of Grade – Request to change letter grade or incomplete grade\nChange of Major or Minor\n– Submit online requests to change your major or minor for fast and convenient service\nWithdrawals\n– Current-semester withdrawals are handled electronically and only after the last day to drop has passed. Click the link to see the acceptable and non-acceptable reasons for current-semester withdrawal\nHealth and Safety\nCounseling and Psychological Services\n: Support services, crisis intervention resources, faculty training, etc.\nHealth Promotion and Wellness\n: Campus health initiatives and programming\nThe SAFE Place\n: Crisis intervention, advocacy and confidential Title IX support for survivors dealing with past or recent incidents of sexual assault, dating or domestic violence, sexual harassment and/or stalking\nSafe Zone\n: Campus network of LGBTQ allies\nUniversity Police Department (UPD)\n: Call 911 in any emergency. Visit website for non-emergency details and resources\nStudent Health Services\n: Provides accessible and low–cost quality health care to all SF State students\nCampus Recreation\n: Access to the Mashouf Wellness Center is included in student fees\nAdditional Resources\nSF State Mobile App\n: Check grades, register for classes, access course information, check the food truck schedule and much more\nClubs and Groups\n: View a list of student clubs and groups within the college\nTitle IX\n: Promoting gender equity and preventing sexual harassment/sexual violence\nDisability Programs and Resource Center (DPRC)\n: Resources and services for students with disabilities and other needs\nJ. Paul Leonard Library\n: Computer labs with printers, study rooms, laptop rentals and more\nSF State Experimental College\n: Promoting student-run, co-learning environments\nOneCard/Gator Pass\n: Functions as your identification card, public transportation discounts, etc.\nVeteran Services\n: Veteran benefits and services\nOffice of Student Financial Aid\n: Estimated tuition rates\nDream Resource Center\n: Support services for undocumented students\nGator Connect\n: Networking and professional mentorship\nStudent Employment\n: On-Campus student employment & federal work study\nStudent Resources at SF State\nMany of the resources available to students at SF State are listed on this resource site.\nAll Campus Resources",
    "url": "http://wgsdept.sfsu.edu/index.php/additional-resources-0",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/event/showcase-class-wgs-582-gaming-margins",
    "category": "general",
    "title": "Showcase Class: WGS 582 - Gaming From The Margins | Department of Women and Gender Studies",
    "content": "Showcase Class: WGS 582 - Gaming From The Margins\nMonday, March 10, 2025\nEvent Time\n12:30 p.m.   -  01:45 p.m.\nPT\nCost\nLocation\nMH 217\nContact Email\neirinic@sfsu.edu\nOverview\nJoin us for an engaging Video Game Studies showcase class and explore how video games shape experiences of identity, belonging, inclusion, and exclusion. This interactive session is open to high school and community college students, as well as anyone interested in the academic and cultural impact of video games.\nSecure your spot\nhere\n.\nUpcoming Events\nMore events coming soon!",
    "url": "http://wgsdept.sfsu.edu/event/showcase-class-wgs-582-gaming-margins",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/index.php/student-publications",
    "category": "general",
    "title": "Student Publications | Department of Women and Gender Studies",
    "content": "Student Publications\nPublications are created each semester by the students in\nWGS 690: Senior Seminar,\nthe capstone for majors in Women and Gender Studies.\nWGS 690 focuses on enabling students to evaluate their learning progress by creating a portfolio which includes writing a paper analyzing their work. Students then collaborate to produce a publication.\nTime Bomb\nSpring, 2025\nView Time Bomb\nFifty Shades of Brown\nSpring, 2024\nView Fifty Shades of Brown\nThank You\nSpring, 2023\nView Thank You\nThe Resistant 11\nSpring, 2020\nView The Resistant 11\nRoom 16\nFall, 2019\nView Room 16\nMonstro-city\nSpring, 2019\nView the Monstro-city\nIncognitx\nFall, 2018\nView Incognitx\nWGS690 Spring. 2018\nSpring, 2018\nView WGS690 Spring, 2018\nThe Future Is...\nFall, 2017\nView The Future Is...\nBranching Out\nSpring, 2017\nView Branching Out\nMy Body, My Rules\nFall, 2016\nView My Body, My Rules\nResist and Revolt\nSpring, 2015\nView Resist and Revolt\nThick Skin\nFall, 2014\nView Thick Skin\nThe Feminist Killjoy Cookbook\nSpring, 2014\nView the Cookbook\nReconstruct This (2013)\nFall, 2013\nView Reconstruct This (2013)\nWGS690 Spring, 2013\nSpring, 2013\nView WGS690 Spring, 2013\n(Un)Phased\nSpring, 2012\nView (Un)Phased\nDeconstruct This (2011)\nSpring, 2011\nView Deconstruct This (2011)\nDeconstruct This (2010)\nSpring, 2010\nView Deconstruct This (2010)\nDeconstruct This (2009)\nSpring, 2009\nView Deconstruct This (2009)\nDeconstruct This (2008)\nSpring, 2008\nView Deconstruct This (2008)\nDeconstruct This (2007)\nSpring, 2007\nView Deconstruct This (2007)\nDeconstruct This (2006)\nSpring, 2006\nView Deconstruct This (2006)",
    "url": "http://wgsdept.sfsu.edu/index.php/student-publications",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/news/marjorie-h-stern-scholarship",
    "category": "financial_aid",
    "title": "Marjorie H. Stern Scholarship | Department of Women and Gender Studies",
    "content": "Marjorie H. Stern Scholarship\nAuthor:\nThe Marjorie H. Stern Scholarship supports women's rights and social justice by helping Women and Gender Studies (WGS) students in immediate financial need to remain in school.  Two scholarships will be awarded each year to students who demonstrate a commitment to social justice and articulate how the scholarship would help them to continue their education.\nApplicants must be Women and Gender Studies majors or minors of junior or senior status, or MA students.\nApply\nhere\n!\nRelated News\nTime Bomb\nJune 11, 2025\nCSU WGS Programs Call for Reinstatement of SSU WGS. Our department in support and solidarity of Sonoma State University WGS\nFebruary 14, 2025\nWill Clark Teaching WGS 712 - Queer Theories this Spring\nJanuary 27, 2025\nFifty Shades of Brown\nJune 5, 2024",
    "url": "http://wgsdept.sfsu.edu/news/marjorie-h-stern-scholarship",
    "domain": "wgsdept.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/minor",
    "category": "general",
    "title": "Minor in Women and Gender Studies",
    "content": "Minors\nMinor in Women and Gender Studies\nThe minor in Disabilities Studies provides students with fifteen units from courses in a wide range of disciplines that are connected to each other through their attention to disabilities. Students will acquire knowledge about critical theories, historical and contemporary events, and accessible principles. They will apply their knowledge to identify and resist structural and interpersonal ableism, while simultaneously contributing to a more just and inclusive society.\nOverview\nRequirements\nA minor in Women and Gender Studies can be useful in conjunction with many majors (e.g. Journalism, Human Sexuality, Counseling, Anthropology, Health Education, Nursing, Sociology).\nStudents will be able to define and describe contesting theories, methods, histories, and representations of women, gender, and feminism.\nStudents will identify the politics of knowledge production across multiple disciplines in relation to Women and Gender Studies.\nStudents will be able to examine women and gender in relation of race, class, sexuality, colonialism, multiculturalism, and/or globalization.\nStudents will be able to conceptualize and analyze gender and feminism in a transnational framework and from an interdisciplinary perspective, using a range of methodological tools while also demonstrating writing proficiency.\nStudents wishing to declare Women and Gender Studies as their minor need to:\ncomplete a\nRequest for Declaration of Undergraduate Minor\n(PDF)\nsubmit that form along with a copy of their SF State unofficial transcript to the undergraduate advisor via email (must use SFSU email)\nIt is recommended that students also check in with the WGS advisor once per semester for academic advising.\nA minimum of 6 upper-division units are required to complete the minor.\nAll coursework used to satisfy the requirements of the minor must be completed with a minimum grade point average of 2.0.\nCore (6 Units)\nSelect One (3)\nWGS 300GW: Gender, Race, and Nation\nWGS 200: Introduction to Women and Gender Studies\nWGS 210: Introduction to Feminism and the State\nWGS 220: Introduction to Feminist Disability Studies\nWGS 280: Introduction to Feminist Science Studies\nWGS 300GW: Gender, Race, and Nation (3)\nElectives (9 units)\nSelect one course from any three of the following areas for a total of three courses. Students may not select multiple courses in the same area.\nPraxis\nWGS 105: Feminism and Self-Care: Perspectives and Practices (1)\nWGS 303: Women as Creative Agents (3)\nWGS 305: Women and Gender Studies Lecture Series (3)\nWGS 400: That's Not What I Said: Feminism, Oral History, and Research Methods in Women and Gender Studies (3)\nWGS 602: Feminist Cultural Activism (3)\nWGS 698: Feminist Praxis and the Non-Profit Industrial Complex (3)\nBody Politics\nWGS 554: Gender and Global Migration (3)\nWGS 563: Gender, Sexuality, and the Politics of Disability (3)\nWGS 591: Critical Approaches to Transgender Health, Science, and Medicine (3)\nWGS 593: Gender, Health, and the Environment (3)\nWGS 612: Queer Theories (3)\nPower and Violence\nWGS 160: Gender, Politics, and Citizenship (3)\nWGS 511: Women and Violence (3)\nWGS 513: Gender, War, and Militarism (3)\nWGS 514: Women and the Prison Industrial Complex (3)\nWGS 536: Gender, Globalization, and Women's Human Rights (3)\nCulture, Media, and Art\nWGS 304: Gender and Popular Culture (3)\nWGS 542: Gender and Popular Music (3)\nWGS/SXS 551: Queer Literatures and Media (3)\nWGS 580: Feminism and the Speculative: Another World is Possible (3)\nSocial Movements\nWGS 515: Gender, Race, and Reproductive Justice (3)\nWGS 541: Women Writers and Social Change (3)\nWGS 561: Women, Ethnicity, and Social Movements (3)\nWGS 562: History of African American Women (3)\nWGS 565: Muslim Feminisms (3)\nWGS 578: Women, Globalization, and Ecology (3)\nWGS 621: Feminist Theories (3)\nMinor in Disability Studies\nThe minor in Disabilities Studies provides students with twelve units from courses in a wide range of disciplines that are connected to each other through their attention to disabilities. Students will acquire knowledge about critical theories, historical and contemporary events, and accessible principles. They will apply their knowledge to identify and resist structural and interpersonal ableism, while simultaneously contributing to a more just and inclusive society.\nDisability intersects with all aspects of life, and that translates into all academic fields: architecture, technology, engineering, economics, art, recreation, history, literature, philosophy, social work, public health, intersections with race, gender, nation, language, and many others.  The Minor in Disability Studies will produce mindful learners who can increase accessibility for everyone, disabled and non, while also uprooting the institutions and ideologies that disempower disabled people. Students in the minor identify how ableism is entrenched within American society, and at the same time, they have opportunities to celebrate disabled joy and community while promoting social justice.\nOverview\nRequirements\nDisability intersects with all aspects of life, and that translates into all academic fields: architecture, technology, engineering, economics, art, recreation, history, literature, philosophy, social work, public health, intersections with race, gender, nation, language, and many others.\nThe Minor in Disability Studies will produce mindful learners who can increase accessibility for everyone, disabled and non, while also uprooting the institutions and ideologies that disempower disabled people. Students in the minor identify how ableism is entrenched within American society, and at the same time, they have opportunities to celebrate disabled joy and community while promoting social justice.\nProgram Learning Outcomes\nUse critical theories in the history of disabilities and the field of Disabilities Studies to identify and resist ableism.\nLearn principles of accessibility and other skills to build leadership, advocacy, and social engagement in creating a more just and inclusive society.\nExamine ways in which systems inhibit and promote full participation of people with disabilities.\nGain knowledge and skills necessary to promote change among individuals, communities, and organizations.\nThe minor require 12 units, with a minimum of 6 upper-division units are required to complete the minor.\nAll coursework used to satisfy the requirements of the minor must be completed with a minimum grade point average of 2.0.\nLower-Division Courses (6 units)\nSelect Two:\nENG 256: Disability and Literature (3 units)\nRRS 220: Race and Dis/Ability (3 units)\nWGS 220: Introduction to Feminist Disability Studies (3 units)\nUpper-Division Courses (6 units)\nSelect Two:\nCMX 504: From Superman to the Supercrip: Comics and Disability (3 units)\nHIST 484: Disability and Culture in the U.S. (3 units)\nKIN 537: Movement for Individuals with Severe Disabilities (3 units)\nPHIL 383: Ethics in Medicine (3 units)\nRPT 410: Therapeutic and Inclusive Recreation (3 units)\nSPED 630: Inclusive Education: Empowerment and Equity in Diverse Schools (3 units)\nSPED 662: Education of Deaf/Hard of Hearing Children (3 units)\nSPED 675: Working with Families of Young Children with Disabilities (3 units)\nWGS 563: Gender, Sexuality, and the Politics of Disability (3 units)\nMinor in Feminist Health Justice\nThe 15-unit Minor in Feminist Health Justice is a complement to a variety of campus undergraduate majors such as public health, women & gender studies, sexuality studies, nursing, ethnic studies, biology, geography, social work, political science, counseling, psychology, or other health sciences, social sciences or policy-driven majors.\nOverview\nRequirements\nWithin the Minor in Feminist Health Justice, the program offers three areas of focus:\nSocial determinants feminist theory and implications for health\nHealth equity and social justice praxis\nPolitics and policy – analysis, and strategies for changing policies relevant to health, gender, and equity.\nStudents take a core course in each of these areas, then choose two electives. Electives from related fields will be considered on advisement as related to student's needs and interests. Advisor approval is required for courses not listed below.\nAll coursework used to satisfy the requirements of the minor must be completed with a minimum grade point average of 2.0.\nProgram Learning Outcomes\nAnalyze the effects of power inequities by engaging and synthesizing feminist theory and theories of health and health equity.\nIdentify and analyze how oppression and marginalization take shape within health outcomes, health care organizations, and public health, and how social movements approach and confront these dynamics.\nDiscuss the implications of gender, race, sexuality, ability, and other forms of difference to public health policy and praxis.\nDemonstrate the ability to integrate knowledge about power and social difference to research projects across disciplines.\nThe minor require 15 units, with a minimum of 6 upper-division units are required to complete the minor.\nAll coursework used to satisfy the requirements of the minor must be completed with a minimum grade point average of 2.0.\nCore Courses (9 units)\nSelect one course from each category.\nSocial Determinants and Feminist Theories\nClass Number\nTitle\nUnits\nPH 210\nPersonal and Social Determinants of Health\n3\nWGS 200\nIntroduction to Women and Gender Studies\n3\nWGS 220\nIntroduction to Feminist Disability Studies\n3\nWGS 280\nIntroduction to Feminist Science Studies\n3\nHealth Equity and Social Justice\nClass Number\nTitle\nUnits\nETHS 500\nIntroduction to Race, Ethnicity, and Health\n3\nPH 414\nWomen's Health\n3\nPH 520\nStructural Oppression and Social Foundations of Health\n3\nWGS 593\nGender, Health, and the Environment\n3\nPolitics and Policy\nClass Number\nTitle\nUnits\nPH 450\nPublic Health Policy\n3\nRRS 571\nWomen, Race, and Class\n3\nWGS 511\nWomen and Violence\n3\nWGS 515\nGender, Race, and Reproductive Justice\n3\nElectives (6 units)\nSelect two courses in consultation with an advisor. Courses listed above not used to fulfill core requirements can be used as electives.\nClass Number\nTitle\nUnits\nAA S 591\nAsian American Community Health Issues\n3\nAFRS 370\nHealth, Medicine, and Nutrition in the Black Community\n3\nAIS/WGS 420\nNative Genders and Feminism\n3\nGEOG/PH 434\nGeographies of Health and Health Care\n3\nLTNS 210\nLatina/o/x Health Care Perspectives\n3\nLTNS 500\nLatina/o Community Mental Health\n3\nPH 210\nPersonal and Social Determinants of Health\n3\nPH 410\nPublic Health Systems\n3\nPH 520\nStructural Oppression and Social Foundations of Health\n3\nPHIL 383\nEthics in Medicine\n3\nPLSI/SXS/WGS 470\nThe Politics of Sex and Reproduction\n4\nPLSI/USP 480\nIntroduction to Urban Policy and Analysis\n4\nPLSI 614\nSeminar: Politics of Abortion in the United States\n3\nRRS 304\nDecolonize Your Diet: Food Justice and Gendered Labor in Communities of Color\n3\nRRS 460/COUN 450/SXS 460\nHIV and AIDS Impacts and Resistance Among Communities of Color\n3\nSOC 469\nGender and Society\n4\nSOC 476\nMedical Sociology\n3\nSXS/SOC 601\nSexuality, Ethnicity, and Health\n3\nUSP/LABR/PLSI 570\nUrban Health Policy\n3\nWGS 300GW\nGender, Race, and Nation - GWAR\n3\nWGS 514\nWomen and the Prison Industrial Complex\n3\nWGS 578\nFeminist Environmental and Climate Justice\n3",
    "url": "http://wgsdept.sfsu.edu/minor",
    "domain": "wgsdept.sfsu.edu"
  }
]