[
  {
    "source": "http://foreign.sfsu.edu/",
    "category": "general",
    "title": "Modern Languages & Literatures | College of Liberal & Creative Arts",
    "content": "Department of Modern Languages and Literatures\nOur department offers a comprehensive curriculum designed to help students develop the linguistic and cultural knowledge and skills necessary to contribute to a multilingual, international society.\nProficiency in another language gives students access to parts of the human experience closed off to those who are monolingual, and provides vitally important skills that will aid them in their further academic endeavors and in virtually any career path they choose.\nThe study of a foreign language gives students the interpersonal, interpretive and presentational tools to communicate effectively with people of diverse backgrounds, and to thrive in international occupations; the study of linguistics exposes them to the deeper structures of language and their role in the construction of reality; the study of culture and society allows them to understand and appreciate other ways of life; and intensive analysis of literary texts in languages other than English helps them develop critical thinking skills. As they challenge themselves with new structures and ideas, our students develop an international perspective that will serve them and help them serve others at home and around the world.\nOur Programs\nArabic\nChinese\nFrench\nGerman\nItalian\nJapanese\nPersian\nRussian\nSpanish\nLanguage Teaching & Learning\nMultilingual & Int'l Tourism\nMultilingual & Int'l Business\nWhy Study Modern Languages & Literatures at SF State?\nCommunicate Effectively\nInternational Perspective\nEngaged Faculty\nThe study of a foreign language gives students the interpersonal, interpretive and presentational tools to communicate effectively with people of diverse backgrounds, and to thrive in international occupations.\nAs our students challenge themselves with new structures and ideas, they develop an international perspective that will serve them and help them serve others at home and around the world.\nWe have a robust faculty dedicated to their field in Arabic, Chinese, French, German, Italian, Japanese, Persian, Russian and Spanish languages and literatures.\nAnnouncements\nNews\nSeptember 16, 2025\nEl Miami Review\nhttps://elmiamireview.com/mi-bien-esquivo-la-memoria-como-territorio-de-deseo-y-perdida/\nMay 21, 2025\nMLL Reception for Class of 2025\nThe Modern Languages & Literatures department reception for the Class of 2025 was held in the Graduate Reading Room on W…\nMay 16, 2025\nProfessor Frederik Green delivers Study Abroad keynote\nMLL Chair and Professor Frederik Green delivered the keynote speech at S.F. State's official Study Abroad Ceremony on FRI 5/…\nMore News\nMore events coming soon!\nMore Upcoming Events",
    "url": "http://foreign.sfsu.edu/",
    "domain": "foreign.sfsu.edu"
  }
]