[
  {
    "source": "http://cls.sfsu.edu",
    "category": "general",
    "title": "Clinical Lab Sciences (CLS) Program | CLS Internships | San Francisco State University | College of Professional & Global Education | Bay Area, California​",
    "content": "Apply Now\nApply by November 16 to start in fall.\n►\nApply\nSend Me Updates\nClinical Laboratory Science\nLaunch your career in medical diagnostics with SFSU's Clinical Laboratory Science (CLS) post-baccalaureate certificate program. You’ll gain the hands-on skills and professional experience to work in hospital labs, public health labs and biotech settings across California. The CLS program has been preparing students for licensure and careers in clinical laboratory science since 1977.\nClinical Lab Science Curriculum\nCLS program classes\nCLS Curriculum\nAdvising\nGuidance for prospective students\nAdvising\nApply\nHow to apply\nHow to Apply\nPre-CLS Courses\nPrepare for the Clinical Lab Science Program\nGet ready to apply to the Clinical Lab Science program by completing the required prerequisites. You don’t need to be an admitted SFSU student to take Pre-CLS courses.\nPre-CLS Courses\nAbout the Clinical Laboratory Science Program\nOverview\nWhy Choose SFSU?\nMission and Goals\nCLS Careers\nCost and Length\nLicensure and Accreditation\nWhat You’ll Learn in the CLS Program\nThe SFSU Clinical Laboratory Science (CLS) post-baccalaureate certificate and internship program is a 14-month, full-time program. You’ll begin with 16 weeks of lectures and lab work on campus, followed by a 40-week internship at one of our affiliated clinical lab sites.\nAfter completing the program, you’ll be eligible to take national certification exams and apply for a California CLS license.\nYou’ll gain hands-on skills to work in hospitals, clinics and research labs. CLS professionals also find careers in public health, private industry, education and lab management. Along the way, you’ll build critical thinking and decision-making skills for clinical and administrative roles in today’s healthcare field.\nWhy Choose the SFSU CLS Program?\nThe SFSU Clinical Laboratory Science program gives you a strong foundation and real-world experience to launch your healthcare career.\nComprehensive 14-month program\nStart with four months of in-person coursework focused on core lab science skills, followed by a 10-month clinical internship.\nHands-on training with advanced equipment\nLearn using the latest biomedical instruments, so you're ready for today’s lab environments.\nReal-world lab skills\nBuild the practical skills employers look for. You’ll be prepared to work in clinical labs as soon as you graduate.\nSmooth transition to clinical work\nEnter your internship with confidence, backed by a strong foundation in lab science and hands-on experience.\nYou’ll graduate ready to take the state and national licensure exams and start your career as a clinical laboratory scientist.\nMission and Goals\nSince 1977, the SFSU Clinical Laboratory Science (CLS) program has prepared students with the academic and hands-on training needed for entry-level careers in the field. The program blends a strong academic foundation with intensive technical development. You’ll also build skills in problem solving, evaluation, communication, research and leadership.\nOur faculty take seriously the role CLS students play in patient testing and outcomes. To support this, the program has minimum technical standards you must meet, with or without documented accommodations, to participate and graduate.\nThe CLS program is committed to equal opportunity. We do not discriminate based on race, color, religion, national origin, gender, sexual orientation, age, marital status, disability or veteran status.\nProgram Goals\nOur goal is to prepare you to become a knowledgeable, skilled and respected clinical laboratory scientist. We also aim to support your growth as a lifelong learner with the potential to lead as a supervisor, manager or educator in the field.\nClinical Laboratory Scientist Careers\nClinical laboratory scientists (CLS) are vital members of the healthcare team. You’ll perform lab tests on blood, body fluids and tissue samples to help doctors diagnose, treat and monitor disease. Your work supports patient care in areas like cancer detection, infection identification and chronic disease management.\nAs a CLS, you’ll use advanced lab instruments, microscopes and computer systems. You’ll work in fields like:\nClinical chemistry\nHematology\nImmunology\nMicrobiology\nMolecular biology\nYou’ll need strong problem-solving and communication skills, attention to detail and the ability to work both independently and as part of a team.\nTo succeed in the program, you must meet essential requirements, such as:\nStrong reading, writing and communication skills\nGood hand-eye coordination and motor skills\nVisual ability to analyze samples and data\nThe ability to manage time, think critically and maintain emotional stability\nIf you have a disability, reasonable accommodations may be available. Contact us to learn more.\nFor more information, visit:\nU.S. Bureau of Labor Statistics – Clinical Laboratory Technologists and Technicians\nCalifornia Occupational Guide – Medical and Clinical Laboratory Technologists\nAmerican Society for Clinical Laboratory Science (ASCLS)\nAmerican Society for Clinical Pathology (ASCP)\nAmerican Association for Clinical Chemistry (AACC)\nCost and Length\nCost\n$22,800, 38 units at $600 per unit\nGator Pass\n: Receive a free transit pass while enrolled. (Fall and spring only. $130 value per term.)\nLength\n14 months\nWhen to Apply\nSpring: May 1 to July 11\nFall: October 1 to November 16\nFinancial Aid\nThe CLS certificate program does not lead to a graduate degree, so graduate-level aid (like Grad PLUS loans) is not available. You may qualify for\nundergraduate-level aid\nif you enroll in at least 6 units during the semester you're requesting assistance.\nFinancial Aid\nLicensure Requirement before Admission\nYou must hold or have applied for a CLS Trainee License from California Laboratory Field Services (LFS) to be admitted to the program.\nPre-CLS courses\nmeet California Department of Public Health requirements for CLS and Limited CLS Trainee Licenses.\nLaboratory Field Services\nThe program meets California’s education standards for CLS licensure through the California Department of Public Health, Center For Laboratory Sciences,\nLaboratory Field Services (LFS)\n.\nNational Accrediting Agency for Clinical Laboratory Sciences Accreditation\nThe CLS program is fully accredited by the\nNational Accrediting Agency for Clinical Laboratory Sciences (NAACLS)\n.\nCLS by the Numbers\n$130,040\nAverage CLS Salary in SF\n40 Weeks\nInternship Experience\n14 Months\nTo Complete the Program\nSource:\nSalary.com: Average Clinical Laboratory Scientist salary in San Francisco, CA\nas of May 2025.\nNews and Events\nOct\n22\nClinical Laboratory Science Advising Session\nWed, October 22, 11:00 am\nOnline\nNov\n05\nClinical Laboratory Science Advising Session\nWed, November 05, 11:00 am\nOnline\nClinical Laboratory Science - Apply by November 16\nApply Now to Start in Fall 2026\nInterested in a career in clinical lab science? The Clinical Laboratory Science (CLS) progra…\nSFSU Closed for Veterans Day, Nov. 11\nSFSU will be closed for Veterans Day, Tuesday, November 11, 2025.\nInternships and Outcomes\nClinical Affiliate Laboratories\nFaculty and Staff\nMake a Gift\nContact Us\nDocument Readers\nare required to view documents.",
    "url": "http://cls.sfsu.edu",
    "domain": "cls.sfsu.edu"
  }
]