[
  {
    "source": "https://basicneeds.sfsu.edu/money-management-budgeting",
    "category": "general",
    "title": "Money Management & Budgeting | Food+Shelter+Success | SFSU",
    "content": "Money Management & Budgeting\nMoney management is an important aspect of stabilizing food, housing and basic needs. Check out these resources to learn more about maximizing your financial assets!\nMost of all, check out\nhttps://sfsu.igrad.com/\n! This is a financial wellness tool for students to learn more about inflation, taxes, retirement, debt, credit score, and other financial literacy topics. There are also tools to search for employment opportunities, scholarships, and managing your debt. Register now for a chance to win airpod pros during the 22-23 school year!\nRegister for iGrad\nTrack Your Money with Your Phone\nKeeping track of your money and setting budget goals can be easier when you have technology lending a helping hand. Check out  these\n9 Budgeting Apps for College Students\nor these\n5 Budget Apps for College Students\nfor information about budgeting apps.\nOrganize Expenses with Budget Worksheets\nSometime having an old fashion budget worksheet can help keep you on track with spending. Check out these templates:\nSimple Budget Template\nNerd Wallet:\nFree Budget Spreadsheets and Budget Templates\nYouTube Your Way to Budget Success\nBudget tracking is not a one size fits all system. Check out these YouTubers spins on creative budgeting using the\nCash Envelope System\nand\nCalendar Budgeting\n.\nTake a Financial Planning Class\nSometimes getting a grip on your finances takes more than just a budget excel. Check out this article that outlines\n13 Free Classes to Help You Manage Your Personal Finances\n.\nCredit and College\nCredit can be intimidating, but practicing credit building techniques throughout your college career can help you graduate with better credit. Check out this\narticle about building credit in college\n.\nMaximize Your Resources\nLet’s be real, learning to budget is a great skill but if you are struggling to cover your monthly expenses, it may not feel helpful. That’s where Food+Shelter+Success can help!\nCheck out these resources that can help you maximize your resources and alleviate funds in your budget:\nVisit AS Gator Groceries\nfor a FREE box of food every week!\nApply for CalFresh\nwhich provides grocery money each month for qualified applicants\nRequest emergency meals\non campus if your food budget is stretched thin\nApply for Basic Need Emergency Funds\nto buy food and other basic necessities\nPick up FREE laundry kits & personal care\nitems from the HPW office\nUse iGrad\n, a money management tool for SF State students",
    "url": "https://basicneeds.sfsu.edu/money-management-budgeting",
    "domain": "basicneeds.sfsu.edu"
  }
]