[
  {
    "source": "https://president.sfsu.edu/",
    "category": "general",
    "title": "Office of the President | San Francisco State University",
    "content": "Office of the President\nWelcome to San Francisco State where we pride ourselves on providing all students access to a premier public education. San Francisco State students are committed to their communities, to social change, and to academic excellence.\nOur staff are dedicated to the success of our students. Our faculty represent the best in their fields as model teacher-scholars. And all share a profound commitment to hands-on student learning and degree completion.\nTogether, we embrace our role as a source of upward mobility for students, as a site of cultural and scholarly engagement, and in the potential of the university as the source for transformative change.\nLynn Mahoney, Ph.D.\nPresident, San Francisco State University\nPresident Lynn Mahoney is the 14th president of San Francisco State University. Her term began in July 2019 after she served as provost and vice president for Academic Affairs for California State University, Los Angeles.\nRead more about President Mahoney\nStrategic Planning\nStudent Success & Academics\nSFSU revises graduation requirement to incorporate climate justice\nSocial work student earns top CSU award\nUniversity imaging center trains 1,000th student\nSF State pilot program trains students to handle art\nEquity & Community Inclusion\nWorks by Marcelo Potosí honor the Indigenous peoples of the San Francisco Peninsula\nSFSU earns prestigious Seal of Excelencia\nBlack Student Success Initiative\nSF State graduate founded America’s longest-running Juneteenth celebration\nPartnerships & Philanthropy\nUniversity Giving\nAlumna funds major expansion of Presidential Scholars Program\nHope Crisis Fund\nSFSU and San Francisco Federal Credit Union team up to enhance student programming and campus life",
    "url": "https://president.sfsu.edu/",
    "domain": "president.sfsu.edu"
  },
  {
    "source": "https://president.sfsu.edu/presidents-messages",
    "category": "general",
    "title": "President's Messages | Office of the President",
    "content": "President's Messages\nWelcome to Fall 25\nAugust 25, 2025\nDear students,\nWelcome to Fall 2025. Our campus is once again buzzing with the energy of more than 21,000 of you. It is a pleasure to welcome you all back. I offer a particularly warm welcome to 5500 new Gators. I know I speak for all when I say how happy we are that you have chosen SF State.\nWhether you are a new student or approaching graduation, you are on a journey that will impact your life, your family’s life and your communities. At SFSU, we take our responsibility to serve you very seriously. From Orientation to Commencement, we work hard to create the best possible opportunities for you to study and grow here. I encourage you to make the most of your\nGator experience\n–\njoin a club\n, engage with our world-class faculty, watch\nGator athletes\ncompete,\nstudy abroad\n, do an\ninternship\n, and experience all our\ncampus\nand our city have to offer. And know that all our faculty, staff and administrators are here to support you.\nSF State is, like many universities across the nation this year, grappling with a challenging and rapidly changing landscape for higher education. But our goal is to help you maximize this experience – the knowledge and skills you gain, the friends you make, and the career path you begin to chart all matter to us. A degree is a critical step to a brighter future for you and your family.\nAt last week’s Opening Convocation, I shared some thoughts on the challenges and opportunities facing SFSU and higher ed at this moment. SFSU has long been a leader in providing students access to upward mobility and we must and will remain so. I urged those in attendance to work together to confront the changing educational and economic landscapes and strengthen how we serve students and the region well. You can\nreview the full text\nfor more details on the changing landscape and ways we can navigate it successfully.\nThis does not mean we become a different university. We will lean into what makes SFSU distinct in ways that the purpose-driven students of today and tomorrow can relate to. A university that embraces its responsibility for post-collegiate outcomes. A university that transforms lives and promises upward mobility. A university where equity, innovation, and community meet.\nI know that I write this at a very uncertain time for many in the Gator community. Many of us are deeply concerned about current events – especially about federal actions which directly affect higher education and our students. Among those areas of concern is anxiety about the potential for immigration activities. We have sent out multiple messages over the past year with essential information and will again this week. Please look for these emails, and as you walk the Quad this week, grab one of the red cards located on many tables across campus. Knowing your rights and understanding university protocols will help us navigate this painfully uncertain time. And also know that there is a wealth of resources available to you at SF State. The\nDean on Call\nprogram is a great starting point for those looking for support.\nWe are a university famous for its inclusivity, its compassion, and its commitment to educational equity. As you walk across campus, you will see banners celebrating the SFSU experience. The one that always catches my eye is “SFSU: We see the world in a more positive light.” I see this reflected in our commitment to changing the world—a reflection of our very high standards for inclusion and for equity. As we embark on another academic year, even amidst much uncertainty, let’s embrace these values and continue to show one another the compassion and support that makes us a special place.\nWonderful to see you all back on campus! Please be sure to stop and say hi when you see me on campus! Wishing all a great semester!\nBest,\nLynn Mahoney, Ph.D.\nPresident\nPresident's Messages - 2025\nWelcome to Fall 25 (Faculty and Staff)\nAugust 25, 2025\nDear colleagues,\nWelcome to the fall 2025 semester! This semester, we welcome 5500 new students, and our campus is now once again buzzing with the energy of more than 21,000 students. I welcome all with great excitement as we begin the new academic year!\nI start with thanks. Last year was a challenging one in so many ways, but we worked together and start the year strong. Together, we advocated passionately for the value of the CSU and SFSU and were spared a catastrophic eight percent state cut. We prioritized compassion and supported one another as we navigated threats to members of our community due to rapidly shifting federal policies. And we worked even harder to reduce costs in alignment with our revenues. Just a few years ago, we had a staggering $36 million structural deficit in our budget. This year we are projecting a $7 million deficit. While any deficit is a cause for concern, our progress toward financial stability is impressive.\nI cannot begin to express how grateful I am to each and every member of the Gator Family. I want to thank, in particular, members of the\nUniversity Budget Committee\n(UBC), the Institutional Review Committee (IRC), the Athletics Review Committee, college and departmental leaders, our vice presidents, and all faculty, staff and administrators who have worked – and are working – hard to make really difficult decisions and prioritize our students. My thanks to everyone involved in this work.\nOur challenges are far from over as uncertainty about the state budget and federal actions loom. While we avoided a dire eight percent state reduction, we did receive a three percent reduction in our recurring state funds. The budget language is confusing and includes the offer of a one-year loan in hopes that the state allocation will be restored in future budget years. One-time monies, as I have noted before, are not funds the CSU can allocate to recurring costs. The Chancellor’s Office is currently discussing this with the state to gain more clarity. Additionally, we must continue to reduce costs to close our own remaining budget deficit as well as to prepare for an anticipated reduction in our CSU allocation next year totaling as much as $18.5 million. The work of the UBC and the IRC remain critical and I look forward to working together to implement recommendations. I encourage all to attend UBC meetings or review the materials on the committee’s website.\nAt last week’s Convocation, I shared some thoughts on the challenges and opportunities facing SFSU and higher ed at this moment. SFSU has long been a leader in providing students access to upward mobility and we must remain so. I urged those in attendance to work together to confront changing educational and economic landscapes and rethink what we do to continue to serve students and the region well. You can\nreview the full text\nfor more details on the changing landscape and ways we can navigate it successfully.\nWe continue to make enrollment a top priority—both by identifying new potential student audiences for SF State and by strengthening our commitment to retaining the students we already serve. We have some opportunities to stabilize and maybe even grow enrollment a bit—but only if we work together in new ways to attract and retain students.\nThriving in the current enrollment landscape requires that we better articulate or even reimagine ourselves as a launchpad for the AI-powered workforce that takes advantage of our location in San Francisco, the city now identified as the capital of the AI revolution, and by growing our industry partnerships and hands-on learning for students in every major. We must clearly demonstrate how an SF State degree addresses the key concerns of students from affordability to purpose-driven innovative educational experiences to rewarding careers.\nI am not suggesting we become a different university. We can lean into what makes SFSU distinct in ways that the purpose-driven young people of today and tomorrow can relate to—a university that embraces its responsibility for post-collegiate outcomes. A university that transforms lives and promises upward mobility. A university where equity, innovation, and community meet.\nAnd we will do this together. I encourage every single member of the Gator Family to embrace their role as an ambassador for the University, knowing that the work each of you does contributes to student retention and success, and we need you to tell our story loudly and proudly.\nI know, though, that I write this at a very uncertain time for many in the Gator community. Many of us are deeply concerned about current events – especially about federal actions which directly affect higher education and our students. Among those areas of concern is anxiety about the potential for immigration activities. We have sent out multiple messages over the past year with essential information and will again this week. Please look for these emails, and as you walk the Quad this week, grab one of the red cards located on many tables across campus. Knowing your rights and understanding university protocols will help our students navigate this painfully uncertain time. As we start the semester with much uncertainty, I encourage all to show compassion for one another and continue the support we always show to all members of the Gator family.\nI conclude as I always do—with deep appreciation for all you do. Wishing all a great semester!\nBest,\nLynn Mahoney, Ph.D.\nPresident\nJuly 2025 State Budget Update\nJuly 11, 2025\nDear campus community,\nAs many of you likely know, the final state budget has been approved and signed by Governor Newsom. You can\nread the CSU’s special message to employees here\n.  While any cut in CSU funding is never good news, especially as mandatory costs continue to increase, we are relieved that the deeper, proposed 7.95% cut to the system’s budget did not come to pass. We are grateful to our many advocates in state government and supporters across the state who recognize the value of the CSU to our economy, students, alumni and communities.\nSome may find this year’s budget particularly confusing. While clearly reducing base funding to the CSU, the state budget offers the CSU a short-term loan of $144 million to cover the funding for one year in hopes that the state’s budget in future years will allow for the restoration of the base funding reduction. One-time funding, particularly during a period of state and federal economic uncertainty, requires careful review. The Chancellor’s Office is reviewing the loan offer and other implications to the CSU budget. The state budget also includes one-time funding for Sonoma State to assist with their work of reorganizing in the face of the changing higher education landscape. A detailed report will be presented at\nthe next Board of Trustee’s meeting, July 21-23\n.\nThanks to the smaller than initially planned reduction in state funding and to our continued efforts to align our expenses with our enrollments, we start the year well-prepared. I am grateful for the work of the University Budget Committee (UBC) and all those who have worked hard to reduce costs while prioritizing students. With careful planning, we have reduced our deficit and have the economic uncertainty funds to address the remaining 2025-26 deficit. As always, details will be shared at the UBC when\nits meetings\nresume on August 28, 2025.\nThe CSU’s budget challenges continue. The CSU simply does not receive adequate funding for the number of students we serve. But thanks to the hard work of many, we have avoided the worst. I offer my deepest thanks to all who advocated so effectively on behalf of the CSU and to the SFSU family for all you do on behalf of our students and University.\nWishing all a good summer.\nBest,\nLynn Mahoney, Ph.D.\nPresident\nCelebrating the Class of 2025\nJune 3, 2025\nDear campus community,\nI write today in celebration of the more than 7,000 students who graduated from SF State this year and to congratulate you all for the many accomplishments achieved this academic year. It was not the easiest of years as SFSU, and higher education in general faced threats on many fronts. I have urged us to remain to committed to our mission and do the work even while challenges abound. And there are so many signs that we are succeeding, from the number of graduates in the Class of 2025 to the successful advocacy that to date has the CSU avoiding catastrophic cuts. We have done this together, and I remain as always deeply grateful to all for the work they do to make SFSU special.\nThe\n2025 Commencement\nwas, as always, a joyous celebration. Thousands of students received their degrees, cheered on by their SF State family and 30,000 loved ones. As has been my tradition, I share a sampling of our graduates’ successes and words with you.\nWe celebrated students like Chevon Jordan who is headed to John Hopkins University to begin her doctoral studies in Biochemistry, and Stephanie Uzordinma Awuzie who completed a master’s in Cell & Molecular Biology and served as President of the Black Excellence in STEM club.\nWe celebrated students who distinguished themselves in Moot Court competitions like Mayuu Kashimura and Chloe Henning. And we celebrated students who succeeded on a very different court--the volleyball court! Congratulations to the SFSU Women’s Volleyball team, led by team captain Kimberly DeBoer, on their historic season as runners up in the NCAA Division II National Championship.\nWe celebrated students for their commitments to SFSU values of inclusion and social justice like Grace Thwin, a first-generation college student who devoted countless hours to supporting immigrant communities, and Nysen Maride, who completed an internship with the Service Employees International Union focused on immigration rights and also volunteers with the Bay Area Lesbian archives.\nWe celebrated the\n12 hood recipients\nselected by their colleges. These students succeeded academically and made significant contributions to their disciplines, to their communities, and to SF State. And we celebrated the legacy of Dawn Bohulano Mabalon, a pioneering historian of Filipino American studies and member the SF State family, whose impact on our students, our campus, and our community was transformative.\nThis year’s speakers were deeply inspiring, particularly in the context of today’s challenges. Associated Students President Bradon Foley, inspired by Martin Luther King, challenged graduates to be the light that drives out darkness, to be love that drives out hate. Cal State Student Association President Iese Esera, graduating with a master’s in Public Administration, reminded his fellow graduates that “Our climate is worth saving. Our democracy is worth protecting. Social justice is worth pursuing. Our stories are worth telling. Our pain is worth healing. Public higher education is worth investing in. Our future…is worth fighting for. “\nKeynote speaker California Attorney General Rob Bonta acknowledged the breadth of the crises facing the U.S. and higher education and encouraged graduates to ask themselves “what role can you play?” He urged the Class of 2025 “to do something—something that makes our shared society fairer and stronger. Something that helps fix a broken part of the world. Something that heals pain.”\nAs I looked out upon the thousands of graduates and their loved ones, I felt deeply reassured that no graduates are better prepared to meet these times than SF State graduates. The Class of 2025, and all our students, are beacons of hope and catalysts of change. Thank you and congratulations.\nWishing all a good summer!\nBest,\nLynn Mahoney, Ph.D.\nPresident\nUpdate on San Francisco Bay Region Network\nMay 7, 2025\nDear Campus Community,\nAs I shared with you in March, I will present at the May meeting of the CSU Board of Trustees along with Cal State East Bay President Cathy Sandeen and Sonoma State Interim President Emily Cutrer a plan outlining the next steps in creating the San Francisco Bay Region Network. This Network will create a single infrastructure for transactional activities and services typically located in Administration and Finance. It represents a creative and innovative collective response to the current landscape where urgent budget conditions and persistent demographic declines similarly and negatively impact the three campuses. It is important to remember that the three remain individually accredited, distinct and unique universities.\nOutlined in the\nBoard Item (Committee on Finance, Discussion Item 7\n) is the rationale for the creation a single effective and cost-efficient organization for some transactional activities within four functional operations (Human Resources, Procurement, Financial Aid, and IT) to be completed by January 2026.  It names SF State’s VP for Administration and Finance Jeff Wilson to serve as project lead.  He will convene appropriate groups of campus experts and a communications team to begin work this summer. The communications team in addition to regular email will also develop a website to ensure stakeholders at all three campuses will have synchronous access to information. Our goal is to ensure, just as we have with this email, that information is shared consistently across all three universities.\nWe expect the creation of the Network to achieve significant administrative cost savings and preserve services that would otherwise be damaged by budget cuts and associated cost-savings measures.  Each president will ensure strict compliance with all existing policies, regulations and collective bargaining agreements. Design and implementation decisions will be made in consultation with campus experts and stakeholders with the explicit goal of developing uniform practices across all three universities based on data and national best practices.\nSeparately, and prior to the creation of the Network, the CSU launched the Multi-University Collaboration Initiative. This broader systemwide effort aims to reduce or avoid costs, streamline and simplify processes, enhance the quality and efficiency of customer. The Initiative is currently focused on benefits administration, information security, and procurement. SF State is represented on the Initiative by Michael Scott, Interim Vice Provost for Academic Resources\n,\nand\nJesús Garcia, Executive Director for Administration.\nWhile the Network and the Initiative are distinct efforts, they are also interrelated. For example, the Initiative’s work on CSU Buy, the systemwide procurement system, will serve as a foundation for the Network’s efforts to integrate procurement functions across the three campuses.\nThe San Francisco Bay Region University Network is a bold, creative, proactive and necessary strategy to address the economic and demographic realities we face. Importantly, the aim of the Network is to ensure Cal State East Bay, San Francisco State and Sonoma State maintain their distinct characteristics and strengths, accreditation standards, and service to their surrounding communities.   The Network has great promise to serve as a collaborative model – for other regional networks within the CSU, as well as for challenged regional public universities throughout the nation.\nThanks for your patience and support as we work through the process.\nBest,\nLynn Mahoney, Ph.D.\nPresident\nAn Exhilarating Time of the Year\nApril 24, 2025\nDear campus community,\nThis time of the year is both overwhelming and exhilarating. Students and faculty are preparing for final exams and projects. Staff and administrators are planning for myriad spring events and making our grounds beautiful as we all prepare to welcome visitors to campus for end-of-year celebrations, graduation photos and ultimately Commencement on May 23.\nI encourage you all to attend some of the incredible things happening on campus this time of year.  This past week, I enjoyed speaking with colleagues and students at the\nClimate HQ’s\nClimate and Environmental Justice Jobs Mixer in the Quad. Tonight and next Thursda",
    "url": "https://president.sfsu.edu/presidents-messages",
    "domain": "president.sfsu.edu"
  },
  {
    "source": "https://president.sfsu.edu/presidents-messages-2023",
    "category": "general",
    "title": "President's Messages - 2023 | Office of the President",
    "content": "President's Messages - 2023\nA Personal Note of Thanks to the Gator Family\nDecember 18, 2023\nDear campus community,\nWith the fall semester concluded and the holiday season in full swing, it has been my custom to send a holiday message. Typically, I send a message highlighting our accomplishments, sometimes those of individual members of the University community, other times institutional gains. This year I am taking a different tack and sending a message of personal gratitude.\nThe fall semester was a difficult one for many and for myriad reasons. Amidst the tension and pain, I experienced many kindnesses from the Gator family – kindnesses that demonstrated the remarkable community we are, even at the hardest of times. As I endured an unexpectedly long and painful recovery from foot surgery, I was sustained by the kind wishes I received from so many students, faculty, staff and administrators. I enjoyed a gift of jam made by a faculty colleague and home-grown lemons gifted by another. I appreciated text and email messages from Associated Students leaders and many colleagues. I was grateful for the gifts of scones, dinner, children’s drawings, and plants and the many cards I received. I am particularly grateful to the three Gators who helped me at a shoe store in the Sunset and my SF State-trained physical therapist who have ultimately helped me get back on my feet.\nI am experiencing – personally – the care that the SF State community provides to so many. Your kindnesses remind us of all of who we are and what we can be despite our moments of tension and difference. As 2023 winds to a close, please know how deeply I appreciative all of you.\nWishing you happy holidays and a happy and healthy 2024.\nBest,\nLynn Mahoney, Ph.D.\nPresident\nWhat Makes SF State Special\nNovember 20, 2023\nDear campus community,\nI am sadly aware that far too often I write to share bad news. While acutely mindful of ongoing challenges at the CSU and at SF State and the pain generated by national and international tragedies, I write today in a spirit of celebration to remind us of all the incredible things happening every day at SF State.\nA year or so ago, the CSU Board of Trustees asked each CSU campus to prepare a video highlighting what makes their campus special. The focus of our video was immediately clear—our incredible students. Our students take advantage of the best we offer—inclusivity, innovation, hands on learning—to create educational experiences that we alone can provide. SF State faculty, staff, and administrators create an incredible canvas upon which our students craft their experiences. I share today\nthe video\nwhich was shown at the November Board meeting—a testament to the value of what we do despite, or maybe in spite of, the always present challenges.\nI have mentioned before that U.S. News and World Report rated us #8 in the nation for the upward mobility of our graduates. Behind that rating are thousands and thousands of successful alumni, among them George and Judy Marcus. Last week’s Marcus Research Showcase provided us an opportunity to celebrate our accomplished alumni and the faculty research and creative activities they have generously supported. Governor Gavin Newsom shared his thanks with the Marcuses via video and touted the unique contributions that SF State makes to the region.\nFrom humble origins, the Marcuses have become leading philanthropists locally, nationally, and internationally. In 2018 they made a transformative gift to SF State of $25 million. These funds are supporting, among other things, faculty and student research in the College of Creative and Liberal Arts. Like our students, SF State faculty take advantage of our unique space to create and innovate. At the Marcus Research Showcase, faculty from disciplines across the college shared their boundary-breaking work in cinema, dance history, journalism, history, humanities, and liberal studies—work that many said could only be done here at SF State.\nWhile this moment may be difficult, at SF State we are also surrounded by the great joy of watching our students succeed and by distinguished colleagues. The commitment our faculty, staff, and administrators show to our mission and our students distinguishes us and is reflected in our national standings for upward mobility.\nIn that spirit, I express as always, my deep gratitude to you all and my wishes for a Happy Thanksgiving.\nBest,\nLynn Mahoney, Ph.D.\nPresident\nCSU Labor Negotiation Update\nNovember 8, 2023\nDear Campus Community:\nLast week, I had an opportunity to enjoy a conversation with students at the Black Unity Center. The students I met with were smart, engaged, enthusiastic about SF State, and assertive about their desire to make sure that we offer them the best educational experience. The first question I was asked centered on the possibility of a faculty strike. I answered as I always do by affirming my support for the labor rights of faculty and all employees and by assuring students that we will work to prioritize their academic progress despite any disruptions that may come, just as we did in March 2020 when we turned this campus upside down almost overnight.\nI share today, that, while the CSU has successfully settled contract negotiations with several unions, it remains at impasse with two unions, the Teamsters Local 2010, who represent the Skilled Trades, and the California Faculty Association. While I remain hopeful that the CSU and these unions will reach a successful conclusion, I write today to let all know that we may experience labor disruptions this month and to assure you that we will continue to keep student success and campus safety as our primary goals.\nWe learned this week that the Teamsters have announced plans for a potential strike as early as next week. I assure you that should a Teamsters strike take place, our university will remain open to students, faculty, staff and the public. Classes and events will continue as scheduled. Employees will receive further details from Human Resources. Campus Safety and University Police will be serving the campus to ensure a safe environment for all.\nI know that news of any disruption is jarring in the midst of a very hard semester for many. Students are concerned about affordability and their academic progress. Our colleagues are concerned about fair compensation and the consequences of decreased enrollment. Beyond our campus, the U.S. remains politically polarized, evidence of climate change abounds, and the world is plagued by wars and tragedy. I can offer little in the way of solutions. But I can say that in my four-and-a-half years here, I have seen us rally time and time again to support one another. We will continue to do so, even in the face of campus disruptions. Please know that the safety of our community and the academic progress of our students remain my top priorities. We will weather this as we have so many other things.\nBest,\nLynn Mahoney, Ph.D.\nPresident\nCSU Commitment to its Employees and Students\nSeptember 21, 2023\nDear colleagues,\nLast week’s CSU Board of Trustees meeting was a challenging one. The Board discussed, and ultimately approved, a tuition increase. With only two sources of revenue available to the CSU (state funding and tuition), the Board, while expressing regret, voted to increase tuition based on a clear need for additional revenues. Studies have demonstrated a\nfunding deficit for the CSU\nand\nthe critical need to better compensate\nCSU faculty and staff. Investing in our employees is an investment in our students and their future.\nWe have an equally strong responsibility to our students to make sure cost does not impede their access or progress. A third of the additional tuition raised will be channeled back into financial aid as State University Grants (SUG). Undergraduate tuition will increase $342 next year, and graduate tuition will increase by $402. This will generate approximately $9M in extra tuition for SF State—$3M of which will automatically be allocated to SUG and will provide more SF State students with more financial aid.\nAs the student stories shared with the Board of Trustees attest, the total cost of attendance—especially housing—can make a degree prohibitively expensive. This is an area in which we must do better by increasing available aid and making it easier to access it. Last year, we allocated $300,000 to grants designed to help students with unpaid balances stay at SF State, augmenting the existing HOPE Crisis grant program. Our successful advocacy for a state-supported residence hall will reduce the cost of on-campus housing by 25% for low-income students. And, just last week, the SF State Foundation Board discussed plans to focus their philanthropic efforts on funding that reduces the total cost for students. All know that students are struggling with the total cost of attendance. While there are no quick or easy fixes, this a key priority for the University.\n“…the future of California depends on our students and graduates.”\nAs you work with students, particularly those with concerns about being able to pay the additional amount next academic year, please encourage those facing financial challenges to contact\nFinancial Aid\n. Students experiencing sudden or acute need should contact\nthe Dean on Call\n, apply to\nthe HOPE Crisis Fund\n, or reach out to the\nBasic Needs\nteam. There are resources available to assist students. Please encourage them to ask for assistance.\nI assure you that the remaining $6M raised for SF State by the tuition increase will directly support employee compensation. At SF State, 91% of our base operating budget (a combination of state support and tuition) directly supports wages and benefits for employees, 90% of whom are faculty and staff. I remain deeply committed to supporting fair and adequate compensation for SF State employees.\nThe discussion at the Board last week affirmed what we all know—state funding for the CSU has lagged behind our need. I am grateful to be in a state in which the Governor and legislature have made a compact with public higher education to provide additional funding despite a serious state budget shortfall. But it is simply not enough.\nI conclude by paraphrasing CSU Trustee and SF State alumnus Jose Antonio Vargas who implored the state to look at the funding inequities in California’s higher education system and demanded that the state do better for the CSU. We must continue to work together to advocate for adequate funding for the transformative education that we provide students. As Trustee Vargas noted, the future of California depends on our students and graduates.\nBest,\nLynn Mahoney, Ph.D.\nPresident\nWelcome to Fall 2023\nAugust 21, 2023\nDear campus community,\nWelcome to Fall 2023! It has been wonderful the last week or two to catch up with colleagues and students as fall activities began. Many of you have shared stories of long-delayed family reunions and travel, of camping trips and summer concerts, and progress on projects and work. I hope all achieved the difficult balance of having productive and restful summers.\nFall semester opened with a\nnearly full house at Convocation thanks in large part to our special guest—Speaker Emerita Nancy Pelosi\n. S.F. Supervisors Rafael Mandelman and Shamann Walton also joined us. All spoke to the importance of higher education and of SF State’s mission to provide access, degree attainment, and upward mobility to California’s diverse population. Supervisor Walton, an alumnus and a Gator parent, shared how a SF State education helped him and his family. Associated Students President Ersa elegantly summarized our role as “a beacon of knowledge, a place where dreams take flight and where students from diverse backgrounds come together in pursuit of a brighter future.\"\nIt was a wonderful way to start the semester.\nLike Ersa, I appreciate the remarkable diversity that characterizes SF State. It is a hallmark of the educational experience we offer. Much higher education news this summer was consumed by the Supreme Court decision to declare affirmative action in college admissions unconstitutional—an action that undoes decades of work to improve access and diversity. I was more than disappointed by the decision as it ignores the reality that race matters, that centuries of systemic racism need systemic redressing. But I was also frustrated by the obsession with admissions to elite universities. They have never been engines of equity enrolling small percentages of low-income and Black and Latinx students.  The work of educating America’s diverse population has been done by SF State, the California State University (CSU), and other comprehensive regional universities.\nIt was refreshing in late July to see the\nSF Chronicle\nacknowledge our mission and role\n. Half of California’s undergraduates attend the CSU, 25% attend UC campuses, and less than one percent enroll at Stanford. The CSU, without question, drives the state’s economy and is the largest driver of the upward mobility of its diverse peoples. The CSU enrolls 41% of the state’s Asian and Asian American students, 50% of its Black students, and 64% of its Latinx students. No education system in the U.S. comes close to this kind of impact.\n“We have so much to be proud of… As we begin the academic year, I encourage all to look for ways to engage and participate in our community…”\nSF State shines within the CSU for its student diversity. As\nthe\nSF Chronicle\nnoted\n, out of the almost 200 institutions offering bachelor’s degrees in California, SF State ranks fourth for Black student enrollment and 12th for Asian and Asian American and Latinx student enrollment. This is something to cherish and celebrate, as are our recent college rankings.\nMoney\nawarded SF State 4.5 out of five stars in their “Best Colleges in America 2023” and\nU.S. News and World Report\nranked us number 15 for “Top Performers on Social Mobility” –  a ranking I value more than I do most other rankings. I share with you all deep pride in our mission to serve students and in our successes, but we must all embrace the need to do far better.\nA\nrecent report by the Campaign for College Opportunity\ndemonstrated that we still have much to do to close equity and opportunity gaps in student outcomes. While lauding us for gains in our graduation rates, the Campaign noted that SF State, and the CSU, will fall short of the goals we set for ourselves for 2025. As I have said before, the greatest demonstration of our commitment to social justice starts here by increasing the success of our students, especially our Black, Latinx, and first gen students.\nAs I look forward to this academic year, I am energized by our work with\nExcelencia in Education\nto become more intentional in our work to support Latinx students and our joint effort with the CSU and USC’s Race and Equity Center to\nelevate Black Excellence\n. Our attention to consistent advising, better completion rates in courses, holistic support for the student experience, and an intentional focus on belongingness will yield results and improve our enrollment. Retaining and graduating our students is our number one priority.\nWe have so much to be proud of. The accomplishments of our students, faculty and staff are amazing, as I detailed in\nmy Convocation remarks\n. As we begin the academic year, I encourage all to look for ways to engage and participate in our community:\nCheck out\nGatorFest!\nLots of opportunities to greet students and say hello to colleagues!\nAttend a Gator athletics game, visit an exhibition, watch a performance, attend a lecture—including a reading by the poet Jessica Care Moore in October.\nJoin us for the second annual Discover SF State for prospective students on October 21st, an opportunity to share your enthusiasm for SF State with prospective students.\nOr just enjoy our beautiful campus in community with one another—gather a group of colleagues or students for lunch at Cesar Chavez or a picnic on the Quad.\nAs always, I thank you for all you do to make SF State a world-class university and a great campus. I wish you all a wonderful academic year.\nBest,\nLynn Mahoney, Ph.D.\nPresident\nTitle IX and DHR update\nJuly 17, 2023\nWith appreciation for your candid feedback and ongoing engagement, I am pleased to update you on our continued efforts to nurture and strengthen a culture of caring, safety, belonging and respect at San Francisco State University and across the California State University (CSU).\nCozen O’Connor law firm has completed its assessment of how the CSU and its campuses respond to reports and incidents of discrimination and harassment. Through a series of interviews, campus visits, survey results and email feedback, they have identified core observations for improvements at both the system and campus levels. The recommendations from this assessment will guide and help us improve our Title IX and Discrimination, Harassment and Retaliation (DHR) training, awareness, prevention, intervention, compliance and support systems.\nThe full report of the systemwide Cozen assessment, including a summary report and a San Francisco State-specific report, can now be found on the\nCSU’s Commitment to Change\nand\nSF State Title IX\nwebsites.\nAs I mentioned in a previous email, Cozen presented an initial\noverview\nof their assessment to the Board of Trustees on May 24, 2023. (You can view a recording of the presentation on\nYouTube\n. The Cozen presentation begins at 23:15.) The state audit of the CSU and four other CSU campuses will also be released shortly. We expect its findings to concur with those iterated by Cozen.\nAs I have also detailed in an earlier email, we assembled SF State’s Cozen Implementation Task Force in Spring 2023 which includes representation from across campus, including faculty, staff and students, to review the findings and advance Cozen’s recommendations. We have a lot of work ahead of us which I am deeply committed to accomplishing. With these important findings and recommendations now in hand, the Cozen Implementation Task Force will commence work at the start of the Fall 2023 semester.\nKey areas of focus and action over the months to come will include:\nCreating processes that foster a welcoming environment and protect academic freedom;\nCreating a culture of care that both complies with legal requirements and fosters an environment in which all behaviors of concern are addressed;\nBuilding trust in our processes and offices;\nReviewing staffing needs;\nImproving data collection in alignment with other CSUs to facilitate consistency and transparency;\nImproving communications, including the website.\nI am grateful to VP Jamillah Moore for her leadership over this work and am pleased to introduce Lori Makin-Byrd to the community. Lori will serve as Acting Title IX Coordinator and DHR Administrator and will serve as co-chair with Jamillah of the Cozen Implementation Task Force. Lori has extensive experience working in the equity and compliance field including as the Senior Advisor to the President for Civil Rights and Title IX Coordinator at the College of Wooster. I am confident that her extensive experience in the field will help to support the work that we’re all dedicated to.\nI am also pleased to announce that we hired a\nSAFE Place\nAdvocate, Nour Loren, who will start August 1, 2023. We will share her contact information with the campus community once she starts. As a reminder, here are current resources for those experiencing harassment and discrimination:\nTo make a report (all students, faculty, staff and/or public) complete this\nonline form\nTo report a crime and to receive emergency assistance: SF State University Police Department, (415) 338-7200,\nupd@sfsu.edu\nFor students:\nCounseling and Psychological Services\n, Student Services Building Room 205, 415-338-2208,\ncaps@sfsu.edu\nFor employees:\nEmployee Assistance Program\n, 1-800-367-7474\nOff-campus:\nSFWar\n(San Francisco Women Against Rape): 3543 18th Street, Suite 7, 415",
    "url": "https://president.sfsu.edu/presidents-messages-2023",
    "domain": "president.sfsu.edu"
  }
]