[
  {
    "source": "https://diva.sfsu.edu/collections/sfbatv",
    "category": "general",
    "title": "Welcome - Bay Area Television Archive",
    "content": "Established in 1981, the TV Archive preserves 6000 hours of newsfilm, documentaries and other TV media produced in the Bay Area and Northern California between 1950-2000. We are a part of the J. Paul Leonard Library's Department of Special Collections and oversee material owned by local TV stations\nKPIX-TV\n,\nKRON-TV\n,\nKQED\nand\nKTVU\n. The Bay Area TV Archive’s digitization projects are supported in whole or in part by the U.S. Institute of Museum and Library Services under the provisions of the\nLibrary Services and Technology Act\n, administered in California by the State Librarian.\n(\nmore\n)\nTotal number of items\n2,993\nTotal number of views\n13,472,279\nKRON-TV news footage from August 22, 1975 with reporter Mike Mills featuring scenes from a press conference by\nJoan Little\nin Oakland, sponsored by the Black Panther Party.\nCastro Valley artist on robot painting\nKen Kesey interviewed at Winterland\nFBI assault team makes arrests at EL Salvador consulate\nWanderer sets sail for Tahiti (June 1960)\nMarin City Collection\nLocal television newsfilm and broadcast video relating to Marin City, an unincorporated community in Marin County about 4 miles north of San Francisco over Golden Gate Bridge.\nLos Siete de la Raza\nLocal newsfilm reports relating to the arrest, trial and release of Los Siete de la Raza in San Francisco, from 1969-1970\nSan Francisco State Strike Collection\nLocal newsfilm covering events relating to the San Francisco State College Strike, from the late 1960s.\nDavid N. Caldwell Collection\nDocumentary films and special video programming produced by KPIX-TV in the 1960s and 1970s, preserved by former Ch.5 director David N. Caldwell.\nOccupation of Alcatraz Collection\nLocal newsfilm and documentaries relating to the Native American occupation of Alcatraz Island (1969-71).\nBlack Panther Party Collection\nLocal newsfilm and privately produced footage relating mainly - but not exclusively - to the Black Panther Party's Oakland Chapter, from the 1960s & 70s.\nIranian Diaspora Collection\nLocal newsfilm reports from the 1950s-1970s featuring events, issues and culture relating to the Bay Area's Iranian diaspora.\nBay Area Nurses Strike, 1966\nLocal TV newsfilm relating to the Bay Area nurses salary dispute and strike action of 1966.\nJames M. Fortier Collection\nRaw footage originally shot on BetaCam SP videotape by James M. Fortier for the PBS documentary 'Alcatraz is Not An Island', which was kindly donated to the TV Archive by Fortier in 2020.\nSynanon Collection\nLocal TV newsfilm reports featuring the Synanon organization in the Bay Area, from the 1960s and 1970s.\nSausalito Houseboat Collection\nLocal TV newsfilm and media productions featuring the lifestyle and social impact of Sausalito's houseboat dwellers in the 1960s and 1970s.\nJoan Baez Collection\nLocal TV newsfilm material featuring musician and activist Joan Baez in the 1960s, 1970s and early 1980s.\nJimmy Lester (aka the Bayview Blaster) Collection\nLocal newsfilm clips featuring interviews with and footage of middleweight boxer Jimmy Lester (aka the Bayview Blaster), from 1965-1970.\nSirhan Sirhan Collection\nLocal newsfilm and a documentary special relating to Sirhan Sirhan, who was convicted of assassinating New York Senator Robert F. Kennedy in 1968. This footage mostly relates to Sirhan's incarceration in the late 1960s and 1970s in California's prison system.\nAfrican American Art Exhibitions, 1968-1973\nNewsfilm reports featuring African American art exhibitions, artists and organizers in San Francisco and Oakland, covering the period 1968-1973.\nHip Hop Culture\nLocal television coverage of music, fashion, art and social issues relating to hip hop culture from the 1980s and 1990s .\nRonald Reagan Collection\nLocal TV news and documentary film featuring Ronald Reagan from 1965-1979.\nMuhammad Ali Collection\nLocal newsfilm relating to former boxing heavyweight champion of the world and cultural icon Muhammad Ali, produced between 1965-79.\nThe Ray Balberan Mission MediaArts Archive\nFilms produced by the Mission Film Workshop in the 1970s, focussing on the Mission District in San Francisco.\nRobert F. Kennedy Collection\nLocal newsfilm and documentary material relating to the political career of Robert F. Kennedy, including visits to the Bay Area as a U.S. Senator working with the Poverty Program in 1967 and run for the Democratic Presidential nomination in 1968.\nRenaissance Pleasure Faire & Great Dickens Christmas Fair\nLocal newsfilm from the 1960s and 1970s, featuring the Northern California Renaissance Pleasure Faire and the Great Dickens Christmas Fair, both co-created by Phyllis and Ron Patterson.\nBelva Davis Collection\nNews and special interest reports produced for local TV stations by pioneering Bay Area TV journalist Belva Davis, between 1976-2004.\nBay Sunday Show\nCo-created in 1989 and hosted by Barbara Rodgers, Bay Sunday was an award winning public affairs program, produced by Ch.5 KPIX-TV.\nMovie Stars Collection\nLocal TV newsfilm featuring movie stars working, relaxing and speaking in the Bay Area.\nKRON-TV's Assignment Four\nKRON-TV's Peabody Award winning documentary series from the 1960s and 1970s, which covered issues on a weekly basis that affected Bay Area communities.\nHorton Collection\nLocal news, special interest reports and current affairs material, produced in the 1980s and 1990s by KPIX-TV/Group W and KTVU. Videotape copies loaned to the archive for transfer and preservation by John Horton.\nJuan Corona Murders Collection\nLocal newsfilm relating to the investigation and trials of serial killer Juan Corona, who was convicted of murdering 25 migrant farm workers in Sutter County.\nEdmund Kemper Murders Collection\nLocal newsfilm relating to the investigation and trial of serial killer Edmund Kemper from 1973.\nZodiac Killer Collection\nLocal TV newsfilm footage relating to the serial killer known as Zodiac, who operated in Northern California during the 1960s and 70s. This case has remained open in several counties since 1969.\nHerbert Mullin Murders Collection\nLocal newsfilm relating to the investigation and trial of serial killer Herbert Mullin from 1972-73.\nJohn Linley Frazier Murders Collection\nLocal newsfilm featuring the mass murders committed by John Linley Frazier (aka The Killer Prophet) in Soquel California, on October 19th 1970. Includes footage covering the discovery of the killings, the subsequent investigation and the trial of Frazier.\nZebra Murders Collection\nLocal newsfilm reports featuring press conferences, interviews, protests and crime scenes relating to a series of killings in San Francisco that happened between 1973-4, which came to be known as the Zebra murders.\nPeople Are Talking Collection\nSelected episodes of KPIX-TV's long running chat show 'People Are Talking' and also 'The Afternoon Show', with hosts Ann Fraser and Ross McGowan.\nEarliest KPIX-TV Clips (1948-1952)\nOur earliest surviving footage featuring Ch.5 KPIX-TV, San Francisco's first television station to go on the air. Covering 1948-1952.\n1966 Bayview Hunters Point Uprising\nLocal TV news footage and news bulletins relating to the Bayview Hunters Point social uprising, from late September and early October of 1966. As residents around San Francisco's Third Street vented their frustration over living conditions and the fatal shooting of Matthew 'Peanut' Johnson, the National Guard was called out.\nKwame Ture (Stokely Carmichael) Collection\nLocal TV newsfilm and documentary footage relating to civil rights activist and organizer Kwame Ture (born Stokely Carmichael), from 1966-1977.\nDr. Maya Angelou's Blacks, Blues, Black!\nA 10-part TV series made by Dr. Maya Angelou for KQED in 1968 called Blacks, Blues, Black!, which examines the influence of African American culture on modern American society.\nWillie L. Brown Jr. Collection\nArchival film and video featuring the life and work of politician Willie Brown, covering the 1960s-90s.\nSuzie Larsen Collection\n8mm silent films produced by SF State alum Karl Griepenburg in San Francisco, featuring the fire which destroyed Sutro Baths in 1966 and a rock concert at Golden Gate Park, c1970. This collection was donated to the TV Archive by another SF State alum Suzie Larsen (Griepenburg’s daughter) and transferred by Movette Film Transfer.\nAnton LaVey Collection\nLocal newsfilm reports from the 1960s relating to author and occultist Anton LaVey, who practiced sorcery from his home at 6114 California Street, in San Francisco.\nAdult Entertainment Industry\nLocal newsfilm reports featuring the adult entertainment industry from the 1960s to the 1980s, including topless dancing, erotic movies and legal disputes.\nJohnny Barnes Selvin Collection\nDocumentary and special interest programs produced for KTVU in the Bay Area between 1976-1991, by Johnny Barnes Selvin.\nDavid Ludwig Collection\nDocumentary films and interviews produced and directed in the 1970s and 1980s by Bay Area filmmaker David Ludwig.\nKQED Film Unit\nDocumentary films produced by the KQED Film Unit between 1963-73.\nGlide Collection\nNewsfilm, documentaries and footage relating to the work of Rev. Cecil Williams and the Glide Memorial Church, covering the 1970s-90s.\nKPIX Collection\nNewsfilm, documentaries and programs produced by KPIX-TV, covering the 1950s-1990s.\nVideowest Collection\nSelected TV programs produced by independent studio Videowest, from the 1980s.\nKRON-TV's Bay Area History Series\nExperience San Francisco's rich history throughout the Twentieth Century in KRON-TV's Emmy award winning Bay Area History series.\nDorothy Goldner Collection\nStunning Kodchrome color footage shot at the Golden Gate International Exposition on San Francisco's Treasure Island (1939/40), produced by Orville C. Goldner.\nJapanese American Collection\nLocal newsfilm and programs relating to the Bay Area's Japanese American community, covering the 1950s-1990s.\nLocal Emmy Awards\nLocal Emmy Awards winning programs produced in the Bay Area, from the 1980s & 90s.\nTV Archive Related\nShort films about the TV Archive, it's collections and work.\nKTVU Collection\nNewsfilm and other  reports and programs produced by KTVU from the 1960s through to the 1990s.\nKRON Collection\nNewsfilm, documentaries and programs produced by KRON-TV, covering the 1950s-1990s.\nKQED Collection\nNewsfilm, documentaries and programs produced by KQED, covering the 1960s-1980s.\nAIDS Crisis Collection\nA compilation of local and national news reports and special programs relating to the AIDS crisis, from the 1980s and 90s.\nBay Area Sports Collection\nBay Area local news coverage of sporting events and personalities including football, baseball, basketball, boxing, athletics and more.\nWine Country\nLocal newsfilms and documentaries from the 1960s and 70s, featuring the winemaking industry in Sonoma County.\nSan Francisco Street Artists Movement\nLocal newsfilm reports from the 1970s covering the San Francisco Street Artists Movement and their attempts to challenge local government restrictions.\nCésar Chávez Collection\nLocal newsfilm and special programs relating to César Chávez, the United Farm Workers union and agricultural workers, from the 1960s & 70s.\nBayview Hunters Point Collection\nLocal television newsfilm and documentaries featuring the Bayview Hunters Point Community in San Francisco, covering the 1950s-70s.\nKPIX Discovery Collection (1953)\nEpisodes from an early TV series about the arts called Discovery, produced in 1953 by KPIX-TV and the San Francisco Museum of Art.\nKPIX San Francisco Pageant Series\nA Peabody Award winning series produced by KPIX-TV in the 1960s, about the history of San Francisco and the Bay Area.\nFog Town Network Collection\nSelected episodes from the Fog Town Network variety show, produced by Albert P. Pappalardo in San Francisco between 1993-96.\nSaul Rouda Collection\nDocumentary films produced in the Bay Area from the 1960s-80s, made available by local filmmaker Saul Rouda.\nThe\nBay Area Television Archive\nis a collection maintained by the\nLeonard Library\n.\nThe Bay Area TV Archive’s digitization projects are supported in whole or in part by the U.S. Institute of Museum and Library Services under the provisions of the Library Services and Technology Act, administered in California by the State Librarian.\nFor questions or comments about the Bay Area Television Archive, contact:\nAlex Cherian, Bay Area Television Archivist\nEmail -\nacherian@sfsu.edu",
    "url": "https://diva.sfsu.edu/collections/sfbatv",
    "domain": "diva.sfsu.edu"
  },
  {
    "source": "https://diva.sfsu.edu/collections/poetrycenter/bundles/232550",
    "category": "general",
    "title": "Nellie Wong and Genny Lim: August 31, 2017 - Poetry Center Digital Archive",
    "content": "Nellie Wong and Genny Lim: August 31, 2017\nactivism\naffirmative action\nalice walker\nangel island\nantifa\nasian american poets\nasian american studies\nasian american writers\nasian art museum of san francisco\natomic bomb\nbay area poets\nbay area writers\nbeauty pageants\nben fong torres\nberkeley, california\nberkeley protest\nbethlehem steel\nblack lives matter\nblackness\nblack rock\nbuddhism\ncanyon sam\ncapitalism\nchicory blue press\nchina\nchinatown\nchinese american poets\nchinese americans\nchinese language dialects\ncivil rights movement\nconsumerism\ncooking\ncorporate media\ndaughters\ndemocracy\ndeportation\ndisability\ndiscrimination\ndiversity\ndomesticity\ndonald trump\neast/west newspaper\nethnic studies\nfake news\nfear\nfeminism\nfeminist studies\nfilm\nfood\nform\nfrancis wong\nfrantz fanon\nfred ho\ngenny lim\nghost ship fire\nharriet tubman\nherbie lewis\nhiroshima\ninclusion\nishmael reed publishing co.\njazz\njohn jang\njohn santos\nkaren brodine\nkitty tsui\nlabor\nlee morgan\nlesbian\nlgbtq\nmarriage\nmarvin gaye\nmeridian press works\nmerle woo\nmigrant workers\nmills college\nmotherhood\nmotown\nmusic\nmusic and poetry\nnagasaki\nnative americans\nnellie wong\nneoliberalism\nneo-liberalism\nneo-nazis\nnew college of california\nnew york\noakland, california\nomerta publications\npaule marshall\npeter coyote\npoetry and music\npolice brutality\npolitics\nprotest\nracism\nrock music\nroz spafford\nsan francisco\nsan francisco chronicle\nsan francisco jazz poet laureate\nsan francisco state university\nsexism\nsexual assault\nsly and the family stone\nsocial change\nsocialism\nsocial justice\nsolar eclipse\nsong\nsouth america\nstanding rock\nstanford university\nsteve abbott\nstudent demonstrations\nstudent protests\nstudent strike\ntechnology\ntheater\ntiananmen square\ntillie olsen\ntrauma\nunbound feet collective\nunited airlines\nuniversity of california, berkeley\nvenezuela\nvietnam war\nwest end press\nwhiteness\nwhite supremacy\nwomen of color\nwomen poets\nwomen's movement\nwomen's rights\nwomen writers\nworkers\nworking class\nwounded knee\nwriting groups\nDescription\nAdditional Information\nDownloads\nThe Poetry Center presents Nellie Wong and Genny Lim reading and in conversation. Wong reads works from Breakfast Lunch Dinner (Meridian Press Works, 2012), The Death of Long Steam Lady (West End Press, 1986), Stolen Moments (Chicory Blue Press, 1997), and Speaking for Myself (Chicory Blue Press, 2014). Lim reads new work along with poems from Kra! (Omerta Publications, 2016) and Paper Gods and Rebels (Ishmael Reed Publishing Co., 2013). The readings are followed by an extensive conversation in response to questions from the audience.\nOriginally Recorded By\nDocFilm Institute\nLocation\nThe Poetry Center, SFSU\nDate\n08/31/2017\nTotal Run Time\n02:19:39\nContributor\nSteve Dickison, May-lee Chai, Sandra MacKay\nRights\n©© American Poetry Archives. This work is licensed under a\nCreative Commons Attribution-Non Commercial-ShareAlike 3.0 Unported License\n. For all other uses please email\npoetry@sfsu.edu\nViews\n4350\nDownloads\n309\nLimGenny20170831DIG.mp3\n(72.00 MB – MP3 audio)\nConversation20170831DIG.mp3\n(137.34 MB – MP3 audio)\nWongNellie20170831DIG.mp3\n(94.35 MB – MP3 audio)\nStill 3-WongLim.png\n(2.87 MB – PNG image)\nGenny Lim\n(00:31:26)\nClick here to listen to this audio file\nDescription\nSteve Dickison introduces Genny Lim. Lim discusses her background in activism and politics before thanking the students for continuing to fight for social change. Lim reads \"It was the milk of sorrow,\" which includes verses from \"Mercy Mercy Me (The Ecology),\" by Marvin Gaye. She then reads \"Forgetfulness,\" \"I am cutting my mileage plus card...,\" \"Don't apologize for what you've done...,\" \"Confession,\" \"A Century of Rage,\" \"This is My Country,\" \"Ghost Dance,\" \"Pikadon,\" \"A Song for Milarepa,\" and \"Gaza.\" She ends by singing from \"Life,\" by Sly and the Family Stone.\nConversation\n(00:59:59)\nClick here to listen to this audio file\nDescription\nGenny Lim and Nellie Wong take questions from the audience. Lim and Wong discuss more in depth their history of activism. They answer questions about the role of arts in social resistance. Wong talks about her desire for activism coming from being a student at SFSU while working various jobs and experiencing sexism and racism through the workplace. Lim talks about facing these barriers while working in theater arts and broadcast journalism. They also discuss the recent Berkeley protests against white supremacy and biased journalism. Wong talks about the importance of standing up to political bullies, while Lim encourages students to stay informed. They are asked about their first writings, with both saying that all art is political, emphasizing the importance of personal perspective in their writing. Both then discuss their writing style and process, with Lim saying she enjoys using song and aspects of music in her poetry. Wong expresses her love of experimenting with different forms and the music within language.\nNellie Wong\n(00:41:12)\nClick here to listen to this audio file\nDescription\nSteve Dickison introduces Nellie Wong. Wong discusses her experience as a student activist at San Francisco State University before reading: \"When I am breathing...,\" \"Consumed,\" and \"Flying.\" From\nBreakfast Lunch Dinner\n, she reads \"Ironing, Ironing,\" dedicated to Tillie Olsen, \"Sounds in the Night,\" \"A Bad Week for Women in Japan,\" \"My Eyes Follow Them,\" and \"Instrumental Rhythm.\"\nAi and Faye Kicknosway: November 14, 1974\nErica Hunt and Marty Ehrlich: April 3, 2014\nAmarnath Ravva and giovanni singleton: December 4, 2014\nErica Hunt and Marty Ehrlich at Center for New Music: April 4, 2014\nWanda Coleman: October 14, 1982\njayy dodd and Lourdes Figueroa: October 28, 2021\nTroubling Borders — Isabelle Thuy Pelaud with Souvankham Thammavongsa, Aimee Phan, Chau Nguyen, Christilily Chiv: March 12, 2014\nWanda Coleman: April 4, 2013\nMei-mei Berssenbrugge: April 21, 1976\nRichard Aoki Speaks at TWLF Conference\nMonique Wittig and Jayne Cortez: April 12, 1985\nJayne Cortez: April 12, 1985\nGary Snyder with Wang Ping: November 13, 2021\nerica lewis and Christine No: March 12, 2022\nSTRUGGLE FOR A NEW WORLD! Fred Ho Memorial Tribute: September 7, 2014\nWang Ping and Ava Koohbor: November 11, 2021\nAlice Walker at San Jose State University: April 10, 1976\nMei-mei Berssenbrugge, Andrea Abi-Karam, and Ching-In Chen: December 13, 2019\nPoetry Center Chapbook Exchange: April 6, 2017\nLucille Clifton: April 2, 1987",
    "url": "https://diva.sfsu.edu/collections/poetrycenter/bundles/232550",
    "domain": "diva.sfsu.edu"
  }
]