[
  {
    "source": "https://access.sfsu.edu/supporting-students",
    "category": "general",
    "title": "Supporting Students with Disabilities | Disability Programs and Resource Center",
    "content": "Supporting Students with Disabilities\nSan Francisco State University provides reasonable accommodations based on disability for eligible students. To become registered with the DPRC, students are required to meet with disability staff to discuss their disability and how it may impact their academic career. More information is explained in the frequently asked questions below. The best instructional strategy is to facilitate the accommodations that the student is authorized to use while attending SF State, which often also benefits other learners.\nPlease reach out to DPRC staff any time you have questions.\nThe following resources are also available regarding teaching and curriculum development:\nPaul K. Longmore Institute on Disability\nCenter for Equity and Excellence in Teaching and Learning (CEETL)\nWe also recommend watching our\nvideo series on the student perspective\nof disability accommodations and Universal Design for Learning, featuring our own SF State students.\nNote: For employee accommodations, please visit the\nEmployee Accommodations website\nFrequently Asked Questions\nDo you have a Disability Access Statement that I can add to my course syllabus?\nYes, the DPRC has developed the following Disability Access Statement for course syllabi:\n\"Students with disabilities who need reasonable accommodations are encouraged to contact the instructor. The Disability Programs and Resource Center (DPRC) is available to facilitate the reasonable accommodations process. The DPRC is located in the Student Service Building and can be reached by telephone (voice/415-338-2472, video phone/415-335-7210) or by email (\ndprc@sfsu.edu\n).\"\nIn addition to including an Access Statement on your syllabus, the following recommendations may assist in improved access and ease of accommodations to all students:\nAttendance Policy: Please include a clear policy on attendance and its role in your grading scheme, if any.  This is helpful for all students to know and understand at the beginning of the semester.\nIt is University policy to provide, on a flexible and individualized basis, reasonable accommodations to students who have disabilities that may impact how they participate in course activities or meet course requirements. Students with documented disabilities must register with the DPRC to facilitate the reasonable accommodations process. They are encouraged to contact their instructors to discuss their individual needs for accommodation; instructors are encouraged to contact the DPRC for assistance in providing accommodations.\nWe recommend the use of the\nSyllabus Tool\nsince it automatically inserts all required components and generates an accessible syllabus.\nHow will I know if a student needs an accommodation in my classroom?\nThe student will initiate a Faculty Notification Letter that will be emailed to you through our new database,\nmyDPRC\n. This email verifies the student is qualified to receive accommodations and what types of accommodations students will need. Faculty who are presented with this document by a student and have questions about the contents are encouraged to discuss them directly with the student; in the event questions remain, faculty should contact the DPRC at (415) 338-2472 for further clarification.\nFaculty are under no obligation to provide accommodations to students who do not have verification of accommodations from the DPRC office. Direct that student to the DPRC office so that a DPRC specialist and the student, together, can determine what reasonable accommodations meet the student's needs.\nMay I look at student documentation concerning disability or ask about the specific nature of a disability?\nBy law, students have the right not to share any information about the nature of their disability. As long as a student has presented you with their Faculty Notification Letter from DPRC, you are required to implement the accommodations. Faculty who have questions about the implementation of accommodations listed on this document are encouraged to talk with the student and contact DPRC if needed.\nHowever, some students may choose to share disability information with you. Be supportive and keep the information in confidence. Do not disclose the information given.  Listen, validate and refer them to DPRC.\nHow do I provide exams with accommodations?\nStudents can schedule your exams and/or quizzes to be administered with accommodations through DPRC by completing the Alternative Testing Agreement via the\nmyDPRC\nFaculty Portal. To learn more about how to complete the Alternative Testing agreement, please visit the\nmyDPRC\nfaculty training portal\nFaculty are welcome to provide exam accommodations directly if the student agrees to this and you are able to provide all accommodations listed in the Faculty Notification Letter. If you wish to directly accommodate the student, we recommend you consult with our office prior to the exam date to ensure you have a full understanding of the approved reasonable accommodation listed (Low Distraction in particular) and are able to appropriately provide them. All approved reasonable exam accommodations must be applied to the entirety of the exam if the student has requested them.\nAm I required to provide accommodations to a student that notifies me late in the term?\nYes. There could be numerous reasons why a student makes a late request. Perhaps the student could not get documentation of their disability any earlier, and therefore could not initiate accommodations earlier.  However, accommodations are not retroactive. Consult with DPRC if you have questions.\nIs there a way I or my students can convert a PDF document quickly so that it’s accessible?\nYes! Follow the instructions on the\nAccessible Media Quick Converter page\n. This service is available to all SF State Employees and Students.\nHow should I handle a disruptive student whose behavior may be related to the student’s disability?\nFaculty should understand that while they are required to provide reasonable accommodations to students with disabilities, they are not required to tolerate behavior that is substantially disruptive to their ability to teach and to other students' ability to learn. Faculty are expected to hold all students, including those registered with the DPRC, to the same\ncode of conduct\n. Faculty are welcome to consult with the DPRC as needed. If a student's disruptive behavior cannot be contained, contact the\nUniversity Police Department\nfor immediate assistance. Faculty may also benefit from contacting the\nDean of Students\nfor additional non-emergency support.\nWhat is Universal Design for Learning?\nUniversal Design for Learning (UDL) is an educational approach with three primary principles—multiple means of representation of information, multiple means of student action and expression, and multiple means of student engagement. To learn more about campus resources related to UDL visit the\nCEETL website\nDo you have additional resources on instructional strategies for teaching students with disabilities?\nWhile National Science Teachers Association (NSTA) is geared towards science classes, the\nNSTA website\nhas resources that are helpful and applicable to most course subject areas, regardless of the type of instruction.\nWhat are some tips for supporting students on the Autism Spectrum?\nAutism spectrum disorder (ASD) is a general term for a group of complex conditions of brain development. These conditions are characterized, in varying degrees,  by difficulties in social interaction, verbal and nonverbal communication and repetitive behaviors. With the May 2013 publication of the DSM-5 diagnostic manual, all autism disorders were merged into one umbrella diagnosis of ASD. Previously, they were recognized as distinct subtypes, including autistic disorder, childhood disintegrative disorder, pervasive development disorder-not otherwise specified (PDD-NOS) and Asperger syndrome. Each individual with autism is unique. Many of those on the autism spectrum have exceptional abilities in visual skills, music and academic skills.\nTips for Supporting Students on the Autism Spectrum\nThe following tips were generated by the students in the SF State Autism Spectrum Support Group. Taking into account the multifarious and changing abilities and needs of each individual on the autism spectrum, there is no single method or approach that will support an individual at any given time. Thus, any guidance or accommodation that we provide must be rooted in an understanding of each individual’s unique experience.\nIncrease open communication and consistency; limit unexpected changes.\nMaintain a structure that is consistent throughout the course of the semester and provide reasonable room or accommodations for incorporating any new changes to the curriculum. For example, a clear well-organized syllabus including a calendar of assignments and due dates.\nPrepare students for participation; announce topics that will be covered, expectations for the participation, providing exam review sheets or sample papers/test questions.\nIf an issue arises, address it in a courteous manner (e.g., pull the student aside; encourage the student to come to office hours or make an appointment to discuss the issue). For additional support contact the San Francisco State University Disability Programs & Resource Center at (415) 338-2472 and/or Counseling & Psychological Services Center at (415) 338-2208.\nCreate a space for diverse ways of information processing and expression.\nMake sure directions and questions are clear, direct and concise.\nPresent information through multiple methods and modalities (e.g., using illustrations, simulations, graphics, lists, models, videos, or writing in addition to verbal).\nAllow additional time for students to process directions/questions (sometimes up to 30 seconds).\nSome students may be very detail oriented and may need help seeing the bigger picture. Help students to make connections between texts, themselves, others, and the world.\nMake your expectations for communication, participation, and student conduct explicit.\nMake explicit the expected classroom behaviors with the whole class. These may include rules for mobile phone use, attendance, eating/drinking in class, or verbal participation. Work out a class arrangement to give an equal opportunity for students to contribute to class discussion.\nFacilitate equitable in-class participation. Set a reasonable time limit for students to speak. Use agreed upon signals to alert students to a need for topic or speaker change. Provide discussion prompts in advance & assign lead discussants for different questions. Offer alternatives to face-to-face discussions.\nProvide frequent and varied assessments of performance, which allow students to know how they are doing over time and to make adjustments. Diverse assessment approaches (e.g., oral presentations, case studies, take-home exams, in-class quizzes, and papers) allow different ways to demonstrate learning.\nCreate a comfortable sensory environment for learning.\nTalk with the student and find out what makes a comfortable learning environment for them and make reasonable changes to the environment– e.g., asking the class to avoid wearing scented products or bringing pungent food to class; keeping the lights dim or using natural light; and reducing noise levels.\nAdditional Resources\nTips for Faculty: How to Support Students on the Autism Spectrum (Microsoft Word Document)\nAutism Spectrum Studies at San Francisco State University\nAutistic Self Advocacy Network's\nhandbook on self-advocacy written for autistic students from autistic adults\nCenter for Equity and Excellence in Teaching and Learning (CEETL)\nfor more information on Universal Design for Learning",
    "url": "https://access.sfsu.edu/supporting-students",
    "domain": "access.sfsu.edu"
  },
  {
    "source": "https://access.sfsu.edu/",
    "category": "general",
    "title": "Welcome | Disability Programs and Resource Center",
    "content": "Disability Programs and Resource Center\nEnsuring all aspects of life on campus are universally accessible.\nLogin to myDPRC\nWelcome\nWelcome to the Disability Programs and Resource Center (DPRC) at San Francisco State University. We work with students disabilities to ensure all aspects of life on campus including academics, events, and employment are accessible. Please don’t hesitate to\nreach out to DPRC\nif you have questions.\nInformation for\nStudents\nFaculty or Staff\nVisitors\nAnnouncements\nGet Involved with the Longmore Institute on Disability & DREAM\nDid you know SF State not only has the DPRC to support your accommodation needs, but also hosts the Longmore Institute on Disability for disabled students to connect, hang out, and learn more about disability studies and disability justice? The Longmore Institute is a national leader in disability programming and showcases disabled people's experiences to revolutionize social views. Through public education, scholarship and cultural events, the Longmore Institute shares disability history and theory, promotes critical thinking, and builds a broader community. They have paid fellowship opportunities for disabled students too! You can swing by and knock on the door for a place to hang out, 135/136 Humanities (if someone is there, you’ll be free to use the space!). They also host a ton of events on campus, off, and virtually, from their monthly Café Crip disability discussion series to Superfest Disability Film Festival.\nLearn more:\nLongmoreinstitute.sfsu.edu\nIn addition, the Longmore Institute hosts DREAM, the disability student club on campus, which stands for Disability, Rights, Education and Mentorship. They’re seeking new members and officers – see attached, follow the linktree (they have an active discord too) at\nhttps://linktr.ee/dream_sfsu\n.\nEmpowering Youth with Disabilities Mentorship Opportunity\nThe EYD Project is a program that brings adults with disabilities and San Francisco public school students together in the classroom for 5-month intervals. Individuals who work as mentors earn $150.00 per month to work with either junior high or high school students with disabilities on academic or social goals. Mentors have their fingerprint clearances and TB test records kept in EYD Project files.\nFor more information, visit the\nEYD Project website\nor contact Ivana Kirola, EYD Project Leader,\nikirola@eydproject.net\n.\nThe EYD Project is not affiliated with SF State.\nMeet with the CA Department of Rehabilitation at DPRC\nNeed help with job placement, paying for tuition, or equipment you need to do your best in school? The Department of Rehabilitation provides services and resources for Californians with disabilities. You can meet with a DOR counselor at our office, the\nSecond Tuesday of each month 10a-1p,\nin the SSB 105 conference room to get connected with services the DOR provides. Please call the front desk at 415-338-2472 for more information.\nThe CA Department of Rehabilitation is not affiliated with SF State.\nAutism Social Group\nThe Autism Social Group is intended for SF State students that identify as autistic or having autism. Topics covered include personal and academic skill-building, disability identity, campus and community resources, guest speakers/facilitators, and opportunities to play games, socialize and share experiences with peers. Attendance is encouraged the whole semester to get to know your peers and build community, but we welcome you any time!\nThe Fall 2025 Autism Social Group meets in-person on Tuesdays from 12:00pm - 1:00pm\nstarting September 9, 2025.\nLocation:\nStudent Services Building (SSB) Room 404. RSVP is encouraged but not necessary. To RSVP or for more information, please email Daniel Lebrija, Disability Specialist and group facilitator at\ndlebrija@sfsu.edu\n.\nTo request reasonable accommodations to participate in any of these groups, please contact the group facilitators listed above or contact\ndprc@sfsu.edu\n.\nSchedule Updates:\nFall 2025 Student Drop-in Hours:\nMonday, Tuesday and Friday:\n1:00pm to 4:00pm\nWednesday and Thursday:\n9:00am to 12:00pm\nDrop-ins are done in person, by phone, or over Zoom. We are no longer opening the general Zoom lobby during drop-ins. If you would like a phone or Zoom meeting, please call our front desk at\n415-338-2472\nfor assistance. Our desk staff will send you a Zoom meeting invitation after you speak with them.\nDrop-ins are for brief matters and questions that can be answered in 20 minutes or less. We see students on a first-come, first-served basis during drop-in hours. Please note that initial appointments are typically scheduled for 50 minutes and may not be completed during a drop-in. Please email\ndprc@sfsu.edu\nor call the front desk at\n415-338-2472\nto schedule an initial appointment outside of drop-in hours.",
    "url": "https://access.sfsu.edu/",
    "domain": "access.sfsu.edu"
  },
  {
    "source": "https://access.sfsu.edu/campus-visitors",
    "category": "general",
    "title": "Visiting Campus | Disability Programs and Resource Center",
    "content": "Visiting Campus\nInformation about DPRC’s on-campus cart transportation and accessible parking can be found on our\nPhysical Access Page\n. More information can also be found on\nParking & Transportation’s website\n.\nAccess and Construction Alerts\nThe University will provide updates on campus construction, related temporary barriers and options for alternate access around campus during University construction projects. Check the\nAccess and Construction Alerts website\nprior to visiting campus and/or\nsubscribe\nto receive e-mails as new Access and Construction Alerts are posted.\nCampus Map\nPlease\nreview the campus map\nfor information about accessible pathways, entrances, and restrooms if you are visiting campus. As previously references, our Access and Construction Alerts page will provide up-to-date information about any potential temporary barriers and alternate access routes in the event of campus construction and/or other events.",
    "url": "https://access.sfsu.edu/campus-visitors",
    "domain": "access.sfsu.edu"
  },
  {
    "source": "https://access.sfsu.edu/physicalaccess",
    "category": "general",
    "title": "Physical Access | Disability Programs and Resource Center",
    "content": "Physical Access\nOverview of Physical Access Services\nSF State provides a variety of services in order to ensure physical access. Below, you will find information about the DPRC Cart Service and other mobility resources, parking, accessible classroom furniture, as well as campus Access and Construction Alerts.\nOn-Campus Cart Service\nWho can use this service?\nOn-campus transportation is available to all students, faculty, staff and guests who require mobility assistance. Priority is given to riders with disabilities and those who are approved for cart service as an accommodation through our office.\nHow can I request a ride?\nThe DPRC Cart service is available Monday through Friday, from 8:30 a.m. - 4:30 p.m., excluding campus holidays.\nIf you are not registered with DPRC, cart service can be requested by calling our office at (415) 338-2472 on a call-in basis. Ride requests cannot be submitted in advance and will only be accepted on the day you require them.\nIf you are approved for cart service as an accommodation, please complete an\nOn-Campus Cart Request Form\nat least 72 hours prior to your first ride. You will receive email confirmation when your rides have been added to the schedule. Until then, please call in your rides.\nCan I go anywhere with these services?\nDPRC Cart Service is available for transportation to and from on-campus buildings, residential properties, and parking lots that are attached to main campus. The exception is University Park North Residential Housing on Buckingham Way. DPRC can do pick-ups and drop-offs in the parking lot behind Building C – Building J.\nWhat is the difference between attached buildings and off campus properties?\nAttached buildings are connected to the core campus and do not require crossing a public street to access. Campus properties that are unreachable by DPRC Cart Service are University Park South, Manzanita Square, Marcus Hall, Mashouf Wellness Center and Lot 25. If you require assistance locating the nearest pick-up point from one of these locations, please contact our office.\nPlease note the carts will also not enter Lot 19/20. Pick-ups and drop-offs can be from the first floor near the entrance, or from the 5\nth\nfloor bridge.\nCan I request this service if I’ve just injured myself on campus or am experiencing a medical emergency?\nDPRC Cart Service is not qualified to provide emergency support services. Passengers must be able to get on and off the shuttle cart without any physical assistance from the driver. If you are having an emergency or require further assistance, please contact the University Police Department at 415-338-7200.\nWhat if I need a ride outside of DPRC’s regular hours of operations?\nThe Division of Campus Safety (DCS) provides\nSafeWalk\n24/7, and mobility transports after hours and on the weekends. Rides may be requested by contacting UPD Dispatch at 415-338-7200 (then press -0-) on a first come, first served basis. If you will require pre-scheduled or recurring rides, please contact DPRC first.\nParking\nPermit prices and lot assignments will be determined based on your course schedule. Please contact our office if you need any assistance with accessible parking needs as an on-campus resident.\nAn SF State parking permit is required to park in any of the lots located on campus. If you have a DMV placard or Disabled Person (DP) plate but do not display both a placard/plate and a parking permit while parked in a blue zone, you may be cited. Parking in an on-campus blue zone without a DMV placard or plate may result in a citation. Parking is enforced 7 days a week, 24 hours a day.\nPlacard or DP plate holders may park in lots 2, 19 (excluding spaces designated 19A), 20 and 25 regardless of permit assignment. Parking within the blue zones in Lot 6 is also permitted.\nIf approved by a Disability Specialist, students may purchase a permit through the DPRC or apply for a waiver of the parking fees.\nFurniture\nThe request form for furniture is located in your eForm agreement in myDPRC – please submit as soon as possible to ensure placements can be made while taking into account sanitation and distancing measures. For any remote classes, consider\nthis Student Technology Quickguide on how to set up an ergonomic workspace at home\n, created by the campus' Center for Equity and Excellence in Teaching and Learning (CEETL).\nAll furniture accommodations are arranged and provided through the DPRC in compliance with the Americans with Disabilities Act as amended.\nStudents who are approved for furniture accommodations are encouraged to make an accommodation request with DPRC at least three weeks before the start of the term in order to ensure placement prior to the beginning of classes. DPRC furniture accommodations will be clearly marked in the classroom. To make a furniture accommodation request, please\nsubmit an accommodation request through\nmyDPRC\nfor each class you want to use this accommodation in. You can then complete the online classroom furniture request form which can be found under \"My E-form Agreements\" in\nmyDPRC\n. To learn more, please visit the\nmyDPRC training portal\nAdditional questions? Contact the DPRC at (415) 338-2472 or\ndprc@sfsu.edu\n.\nAccess and Construction Alerts\nThe University will provide updates on campus construction, related temporary barriers and options for alternate access around campus during University construction projects. Check\nthe Access and Construction Alerts website\nprior to visiting campus and/or\nsubscribe\nto receive e-mails as new Access and Construction Alerts are posted.\nConstruction activity is a constant reminder of the progressive growth of San Francisco State University as facilities are repaired or renovated to better serve the campus community. Many of these projects require temporary adjustments in accustomed paths of travel, often with little notice. Significant efforts are made to use on-site signage to indicate detours clearly, and to maintain accessible routes with minimum inconvenience.",
    "url": "https://access.sfsu.edu/physicalaccess",
    "domain": "access.sfsu.edu"
  },
  {
    "source": "http://access.sfsu.edu/",
    "category": "general",
    "title": "Welcome | Disability Programs and Resource Center",
    "content": "Disability Programs and Resource Center\nEnsuring all aspects of life on campus are universally accessible.\nLogin to myDPRC\nWelcome\nWelcome to the Disability Programs and Resource Center (DPRC) at San Francisco State University. We work with students disabilities to ensure all aspects of life on campus including academics, events, and employment are accessible. Please don’t hesitate to\nreach out to DPRC\nif you have questions.\nInformation for\nStudents\nFaculty or Staff\nVisitors\nAnnouncements\nGet Involved with the Longmore Institute on Disability & DREAM\nDid you know SF State not only has the DPRC to support your accommodation needs, but also hosts the Longmore Institute on Disability for disabled students to connect, hang out, and learn more about disability studies and disability justice? The Longmore Institute is a national leader in disability programming and showcases disabled people's experiences to revolutionize social views. Through public education, scholarship and cultural events, the Longmore Institute shares disability history and theory, promotes critical thinking, and builds a broader community. They have paid fellowship opportunities for disabled students too! You can swing by and knock on the door for a place to hang out, 135/136 Humanities (if someone is there, you’ll be free to use the space!). They also host a ton of events on campus, off, and virtually, from their monthly Café Crip disability discussion series to Superfest Disability Film Festival.\nLearn more:\nLongmoreinstitute.sfsu.edu\nIn addition, the Longmore Institute hosts DREAM, the disability student club on campus, which stands for Disability, Rights, Education and Mentorship. They’re seeking new members and officers – see attached, follow the linktree (they have an active discord too) at\nhttps://linktr.ee/dream_sfsu\n.\nEmpowering Youth with Disabilities Mentorship Opportunity\nThe EYD Project is a program that brings adults with disabilities and San Francisco public school students together in the classroom for 5-month intervals. Individuals who work as mentors earn $150.00 per month to work with either junior high or high school students with disabilities on academic or social goals. Mentors have their fingerprint clearances and TB test records kept in EYD Project files.\nFor more information, visit the\nEYD Project website\nor contact Ivana Kirola, EYD Project Leader,\nikirola@eydproject.net\n.\nThe EYD Project is not affiliated with SF State.\nMeet with the CA Department of Rehabilitation at DPRC\nNeed help with job placement, paying for tuition, or equipment you need to do your best in school? The Department of Rehabilitation provides services and resources for Californians with disabilities. You can meet with a DOR counselor at our office, the\nSecond Tuesday of each month 10a-1p,\nin the SSB 105 conference room to get connected with services the DOR provides. Please call the front desk at 415-338-2472 for more information.\nThe CA Department of Rehabilitation is not affiliated with SF State.\nAutism Social Group\nThe Autism Social Group is intended for SF State students that identify as autistic or having autism. Topics covered include personal and academic skill-building, disability identity, campus and community resources, guest speakers/facilitators, and opportunities to play games, socialize and share experiences with peers. Attendance is encouraged the whole semester to get to know your peers and build community, but we welcome you any time!\nThe Fall 2025 Autism Social Group meets in-person on Tuesdays from 12:00pm - 1:00pm\nstarting September 9, 2025.\nLocation:\nStudent Services Building (SSB) Room 404. RSVP is encouraged but not necessary. To RSVP or for more information, please email Daniel Lebrija, Disability Specialist and group facilitator at\ndlebrija@sfsu.edu\n.\nTo request reasonable accommodations to participate in any of these groups, please contact the group facilitators listed above or contact\ndprc@sfsu.edu\n.\nSchedule Updates:\nFall 2025 Student Drop-in Hours:\nMonday, Tuesday and Friday:\n1:00pm to 4:00pm\nWednesday and Thursday:\n9:00am to 12:00pm\nDrop-ins are done in person, by phone, or over Zoom. We are no longer opening the general Zoom lobby during drop-ins. If you would like a phone or Zoom meeting, please call our front desk at\n415-338-2472\nfor assistance. Our desk staff will send you a Zoom meeting invitation after you speak with them.\nDrop-ins are for brief matters and questions that can be answered in 20 minutes or less. We see students on a first-come, first-served basis during drop-in hours. Please note that initial appointments are typically scheduled for 50 minutes and may not be completed during a drop-in. Please email\ndprc@sfsu.edu\nor call the front desk at\n415-338-2472\nto schedule an initial appointment outside of drop-in hours.",
    "url": "http://access.sfsu.edu/",
    "domain": "access.sfsu.edu"
  },
  {
    "source": "https://access.sfsu.edu/myDPRC",
    "category": "general",
    "title": "myDPRC | Disability Programs and Resource Center",
    "content": "myDPRC\nis a web-based application where students, faculty and DPRC staff can manage the student accommodation process and request services. Students will be able to register using their SF State credentials and use\nmyDPRC\nto upload documents, send accommodation letters to faculty and communicate with the DPRC directly. Our office moved to this application to make the accommodation process easier for students by ensuring all parties of the accommodation process can stay updated in real-time.\nCurrent Students\nNew Students\nFaculty Portal\nStaff & Hourlies\nTraining Materials\nPlease visit the\ntraining portal\nto view\nmyDPRC\ntraining videos and step-by-step instructions.",
    "url": "https://access.sfsu.edu/myDPRC",
    "domain": "access.sfsu.edu"
  },
  {
    "source": "https://access.sfsu.edu/LD-assessment",
    "category": "general",
    "title": "Off Campus Assessment Referrals for Learning Disabilities | Disability Programs and Resource Center",
    "content": "Off Campus Assessment Referrals for Learning Disabilities\nAny licensed clinical psychologist, educational psychologist, school psychologist or neuropsychologist who has experience with an adult population; or a learning disabilities specialist employed in a college or university can administer an assessment for learning disabilities. Evaluations of a learning disability should follow the SF State/CSU\ndocumentation guidelines\n. Please share the enclosed guidelines with your clinician before being assessed.\nLearning Disabilities Assessment Referrals\nThe following list of Bay Area professionals can assess learning disabilities\nHilary Anand, Ph.D.,\nhilaryanandphd@gmail.com\n,\nLumo Assessment website\nHelen Chen, Psy.D., 1 Shrader Street, Suite 550 SF, Ca, 94117, 415-779-2089\nCorinne Gustafson, M.Ed., BCET, 1221 Marin Avenue, Berkeley/Albany, CA 94706, 510-524-6455 or 510-233-4042\nJennifer Kirkland, Ph.D., 1057 Solano Avenue, Ste. 102, Albany, CA 94706, 510-525-6608\nStacy Nelson, Ph.D., 250 Bel Marin Keys Blvd., Ste. D-5, Novato, CA 94949, 415-257-0702 or 415-999-9687,\nStacy Nelson's website\nKatey Nicolai, Ph.D.,\nkateynicolaiphd@gmail.com\n,\nLumo Assessment website\nAlan Siegel, Ph.D., 2607 Alcatraz Ave., Berkeley, CA 94705, 510-652-4185,\nAlan Siegel's website\nAllison Waterworth, Psy. D., 2409A Sacramento St., SF, CA 94115, 415-577-4750,\nAllison Waterworth's website\nJulie Wolfert, Psy.D., 2409 Sacramento Street, 2nd Floor, SF, CA 94115, 415-308-9631,\nJulie Wolfert's website\nThe following contacts offer reduced or sliding scale fees\nWright Institute Assessment Service, 1918 University Ave., Suite 3D, Berkeley, CA 94704,  510-239-2014\nCSPP Psychological Assessment Clinic, 1 Beach St., San Francisco, CA 94113, 415-955-2106\nUC Berkeley\nPsychology Clinic & Center for Assessment\n, 2121 Berkeley Way, Berkeley, CA 94720, 510-642-2055",
    "url": "https://access.sfsu.edu/LD-assessment",
    "domain": "access.sfsu.edu"
  },
  {
    "source": "http://access.sfsu.edu/programs",
    "category": "general",
    "title": "Programs | Disability Programs and Resource Center",
    "content": "Programs\nThe Disability Programs & Resource Center (DPRC) is excited to offer multiple virtual engagement opportunities for students and the campus community. Students do\nnot\nneed to be registered with the DPRC to participate in any of these groups or events.\nAutism Social Group\nThe Autism Social Group is intended for SF State students that identify as autistic or having autism. Topics covered include personal and academic skill-building, disability identity, campus and community resources, guest speakers/facilitators, and opportunities to play games, socialize and share experiences with peers. Attendance is encouraged the whole semester to get to know your peers and build community, but we welcome you any time!\nThe Fall 2025 Autism Social Group meets in-person on Tuesdays from 12:00pm - 1:00pm\nstarting September 9, 2025. Location:\nStudent Services Building (SSB) Room 404. RSVP is encouraged but not necessary. To RSVP or for more information, please email Daniel Lebrija, Disability Specialist and group facilitator at\ndlebrija@sfsu.edu\n.\nTo request reasonable accommodations to participate in any of these groups, please contact the group facilitators listed above or contact\ndprc@sfsu.edu\n.\nOther Events & Programs Happening in the SF State Community\nGraduating this semester?\nCareer Services & Leadership Development (CSLD)\nis offering several\nworkshops to help prepare you for the job search process\n.",
    "url": "http://access.sfsu.edu/programs",
    "domain": "access.sfsu.edu"
  }
]