[
  {
    "source": "https://conduct.sfsu.edu/",
    "category": "general",
    "title": "Mission | Office of Student Conduct",
    "content": "Mission\nOur Mission\nThe Office of Student Conduct (OSC) at San Francisco State supports the University’s educational purpose and goals set forth by interpreting and enforcing standards of student behavior, related policies and procedures under the State of California Code of Regulations, Title V, sections 41301-41304 through\nExecutive Order 1098\n, Student Conduct Procedures. Cases involving alleged violations of University policies or campus rules by students should be referred to this office, which is responsible for ensuring the fair and confidential administration of the Student Conduct Procedures. The OSC strives to facilitate student learning, ethical development in connection with the student disciplinary process, promote academic integrity and responsible conduct through outreach, conduct outcomes, and education. The OSC works to maintain a safe and orderly campus environment.\nStudent Learning Outcomes\nBe able to articulate why the University community is concerned with their conduct and reflect on any in-congruence between their values and their actions.\nUnderstand, reflect and take ownership of their actions.\nUnderstand that their conduct has consequences.\nLearn skills, strategies, and resources that are likely to assist them in avoiding future violations of the Code of Student Conduct.\nRenew their commitment to embracing their responsibilities as members of the San Francisco State University community and be less likely to engage in violations of the Code of Student Conduct.\nRenew their commitment to their academic careers and participate in school life that reflects positively on themselves and their campus community.\nTo report behavioral or conduct issues, please click the link below:\nReport Non-Academic Student Misconduct\nTo report academic integrity (class grade related) issues, please click the link below:\nReport Academic Student Misconduct\nTo view PDF files, please\ndownload Adobe Reader",
    "url": "https://conduct.sfsu.edu/",
    "domain": "conduct.sfsu.edu"
  }
]