[
  {
    "source": "https://pinc.sfsu.edu/pinc/gstar",
    "category": "general",
    "title": "Data Science and Machine Learning for Biotechnology Certificate Program (aka PINC Certificate) | PINC",
    "content": "Data Science and Machine Learning for Biotechnology Certificate Program (aka PINC Certificate)\nWith scientists at Genentech, we have designed a training program that aligns with the technical needs of the biotech/pharmaceutical industries. Students will take courses that consist of 12 units in total over the span of two semesters.\nWhy get this certificate?\nData science related jobs have been among the top ranked jobs (based on salary, job satisfaction) for several years now\nAs per the U.S. Bureau of Labor Statistics the average growth rate for data science jobs in this decade will be four times higher than the average rate for all occupations\nThe demand for talent is surging -- we need a new generation of young, diverse, and well-rounded computational scientists to help solve problems in biotechnology\nThis certificate program will help to train you in the high demand cutting-edge skills in data science for biotechnology.\nPrerequisites:\nCSC 311 (formerly CSC 219) or CSC 220\nBIOL 100 or BIOL 230 (if not a Biology major)\nOpen to all majors who have completed the course requirements listed above\nBoth Undergraduate and Graduate students are eligible\nSemester 1\nCSC 408*: Machine Learning and Data Science for Personalized Medicine (3 units)\nFormerly listed as CSC 508\nThe course is both a standalone introduction to machine learning for genomic data science and a compliment to previous coursework in biology, biochemistry, or genetics. It is designed for those seeking to gain familiarity with data science and machine learning tools that enable better decision making from genomic data. Students will learn common Python tools used in genomic data science and how to apply them in real world datasets.\nCSC 411:\nIntroduction to Machine Learning for Interdisciplinary Data Scientists\n(3 units)\nFormerly listed as CSC 308\nIntroduction to the basic machine learning concepts and tools. Focuses on applying them for application development, linear model, deep neural network and transfer learning using Python, Tensorflow, and Keras.\n* CSC 408 Counts towards CS Senior elective\nSemester 2\n***CSC 601: Seminar Series (1 unit)\nFeaturing scientists in related areas from Genentech or other biotechnology industry or academia, explore a broad view of the topics on Drug design, modeling to predict drug performance, or new drug approval processes. (CR/NC grading only)\n***CSC 602: Tech Interview Prep (2 units)\nPreparation for interviews for data science-related internships and full-time positions in industry. Development of interview skills such as how to communicate about technical aspects describe a problem, and articulate issues. Practice of key problem-solving strategies specific to technical/coding interviews. (CR/NC grading only)\nCSC 509: Machine Learning for Medical Image Analysis (3 units)\nThis course explores the application of state-of-the-art deep learning models to medical image analysis: the task of identifying objects such as tissue, bone within an image.\n(***only additional courses that PINC students need to take to get both minor and certificate)\nApplying to receive the Certificate\nWhen all requirements are completed, students must take the steps below for the award of the certificate.\nThe student prepares a Certificate Approved Program (CAP) form available on DocuSign:\nClick here for form\nThe program director will determine if all the requirements for the certificate have been satisfactorily completed and sign the CAP form.\nThe student pays the application fee ($7.00) at the Bursars' Office and has the CAP form stamped to confirm payment. Online payment possible:\nPay Graduate Fees Online | Division of Graduate Studies & Career Development (sfsu.edu)\nDownload CAP Form here",
    "url": "https://pinc.sfsu.edu/pinc/gstar",
    "domain": "pinc.sfsu.edu"
  },
  {
    "source": "https://pinc.sfsu.edu/peer-mentorship",
    "category": "general",
    "title": "Peer Mentorship | PINC",
    "content": "Peer Mentorship\nPeer mentorship is a big part of the PINC program at SFSU and we have a dedicated Mentor Trainer that meets with our peer mentors weekly for training on improving the mentor-mentee relationship and experience.\nFor each of our PINC courses, the PINC administration team selects peer mentors (typically PINC or/or Computer Science majors who have successfully passed the course) and pair them with PINC students. The peer mentors meet with the students on a weekly basis to help guide them and set them up for success in the respective PINC course.\nPlease check out our Peer Mentor Resources below that we have used in building our successful PINC Mentorship Program!\nInterested students who want to become a PINC Mentor can apply here:\nPINC MENTOR APPLICATION\nWhy Be A Peer Mentor?\nMentoring is a wonderful opportunity for students to gain leadership skills and to learn how to effectively teach and communicate with others.",
    "url": "https://pinc.sfsu.edu/peer-mentorship",
    "domain": "pinc.sfsu.edu"
  }
]