[
  {
    "source": "https://ces.sfsu.edu",
    "category": "general",
    "title": "Welcome to Conference & Event Services | Conference & Event Services",
    "content": "Life is an event...\nMake it memorable at SF State. Let us turn your ideas into reality!\nWelcome to Conference & Event Services\nConference & Event Services (CES) is a team within SF State’s Housing, Dining & Conference Services Department that provides planning and coordination of events hosted on the SF State campus. With over 50 years of combined event planning experience and strong relationships with campus service providers, you can book your next conference or event with confidence knowing that the CES team will take care of all the details.\nWHY CHOOSE SF STATE?\nLOCATION\nLocated within close proximity to the airport, hotels, and just a few miles from downtown San Francisco and the Pacific ocean, SF State is an ideal destination for your next event.\nMAP\nA VARIETY OF SPACES\nSF State offers a variety of indoor and outdoor spaces such as banquet rooms, classrooms and lecture halls, theater spaces, gym spaces, and athletics fields.\nEVENT SPACES\nPERSONALIZED ATTENTION\nDedicated to providing the best possible experience, our staff is here to assist you with the planning and execution of your event or conference.\nPLANNING\nCOMFORT & CONVENIENCE\nOur comfortable accommodations are conveniently located within our residential community and just steps away from our conference centers and dining facility.\nACCOMMODATIONS",
    "url": "https://ces.sfsu.edu",
    "domain": "ces.sfsu.edu"
  },
  {
    "source": "https://ces.sfsu.edu/off-campus-lodging",
    "category": "general",
    "title": "Off-Campus Lodging | Conference & Event Services",
    "content": "Off-Campus Lodging\nPricing category for each property is subject to change depending on location, current room occupancy, and seasonal demand. Please contact the properties directly for special promotions and nightly rates.\nNEAR SAN FRANCISCO STATE UNIVERSITY\nBUDGET FRIENDLY\nAlpine Inn & Suites\n560 Carter Street\nDaly City, CA 94014\nalpinemotorinn.com\nReservations: (415) 334-6969\nOcean Park Motel\n2690 46th Avenue\nSan Francisco, CA 94116\noceanparkmotel.com\nReservations: (415) 566-7020\nRodeway Inn & Suites Ocean Beach\n1234 Great Hwy\nSan Francisco, CA 94122\nReservations: (833) 517-4054 or\nOnline Reservation\nSeal Rock Inn\n545 Point Lobos Avenue\nSan Francisco, CA 94121\nsealrockinn.com/\nReservations: (888)732-5762 or\nOnline Reservation\nMID-RANGE\nHampton Inn San Francisco-Daly City\n2700 Junipero Serra Boulevard\nDaly City, CA 94015\ndalycity.hamptoninn.com\nReservations: (650) 755-7500\nNEAR DOWNTOWN SAN FRANCISCO\nBUDGET FRIENDLY\nComfort Inn By the Bay\n2775 Van Ness Avenue\nSan Francisco, CA 94109\nsanfranciscocomfortinn.com\nReservations: (800) 228-5150\nIntercontinental San Francisco\n888 Howard Street\nSan Francisco, CA 94103\nintercontinentalsanfrancisco.com\nReservations: (415) 616-6500\nMID-RANGE\nHilton San Francisco Union Square\n333 O’Farrell Street\nSan Francisco, CA 94102\nHilton Hotel Expert: (855) 786-4701\nReservations: (415) 771-1400 or\nOnline Reservation\nHoliday Inn Golden Gateway\n1500 Van Ness Avenue\nSan Francisco, CA 94109\nwww.holidayinn.com\nReservations: (415) 441-4000\nHotel Emblem\n562 Sutter Street\nSan Francisco CA, 94102\nReservations: 1 (800) 433-4434 or\nOnline Reservation\nHyatt Regency Embarcadero San Francisco\n5 Embarcadero Center\nSan Francisco, CA 94111\nsanfranciscoregency.hyatt.com\nReservations: (415) 788-1234\nJW Marriot San Francisco Union Square\n515 Mason St\nSan Francisco, CA 94102\nReservations: (415) 771-8600 or\nOnline Reservation\nKensington Park Hotel\n450 Post Street\nSan Francisco, CA 94102\nkensingtonparkhotel.com\nReservations: (800) 553-1900\nMarriott Hotel\n515 Mason Street (corner of Post and Mason)\nSan Francisco, CA 94102\nReservations: (415) 771-8600 or\nOnline Reservation\nParc 55 Hotel\n55 Cyril Magnin Street\nSan Francisco, CA 94102\nparc55hotel.com\nReservations: (800) 595-0507\nSan Francisco Marriott Marquis\n780 Mission Street\nSan Francisco, CA 94103\nReservations: 1 (888) 575-8934 or\nOnline Reservation\nLUXURY\nHotel Nikko San Francisco\n222 Mason Street\nSan Francisco, CA 94102\nhotelnikkosf.com\nReservations: (800) 248-3308\nThe Fairmont San Francisco\n950 Mason Street\nSan Francisco, CA 94108\nfairmont.com\nReservation: (844) 382-2267\nThe Westin St Francis\n335 Powell St\nSan Francisco, CA 94102\nwestinstfrancis.com\nReservations: (415) 397 7000\nNEAR FISHERMAN'S WHARF\nBUDGET FRIENDLY\nComfort Inn By the Bay\n2775 Van Ness Avenue\nSan Francisco, CA 94109\nsanfranciscocomfortinn.com\nReservations: (415) 928-5000\nHotel Caza Fisherman’s Wharf\n1300 Columbus Ave\nSan Francisco, CA 94133\nhotelcaza.com\nReservations: (650) 502-4200\nHyatt Centric Fisherman’s Wharf\n555 North Point St\nSan Francisco, CA 94133\nfishermanswharf.centric.hyatt.com\nReservations: (415) 563-1234\nMID-RANGE\nHotel Zoe Fisherman’s Wharf\n425 North Point St\nSan Francisco, CA 94133\nHotelZoeSf.com\nReservations: (415) 561-1100\nHotel Zephyr Fisherman’s Wharf\n250 Beach St\nSan Francisco, CA 94133\nhotelzephyrsf.com\nReservations: (415) 617-6565\nNEAR ORACLE PARK\nMID-RANGE\nHotel Via\n138 King Street\nSan Francisco, CA 94105\nHotelViaSF.com\nReservations: (415) 200-4977\nLUXURY\nHotel Griffon\n155 Steuart Street\nSan Francisco, CA 94105\nhotelgriffon.com\nReservations: (415) 495-2100\nNEAR SF AIRPORT (SF0)\nBUDGET FRIENDLY\nCourtyard by Marriot San Francisco Airport\n1050 Bayhill Drive\nSan Bruno, CA  94066\nReservations: (650) 952-3333 or\nOnline Reservation\nCourtyard San Francisco Airport/Oyster Point Waterfront\n1350 Veterans Boulevard\nSouth San Francisco, CA 94080\nReservations: (650) 871-41000 or\nOnline Reservation\nDoubleTree by Hilton Hotel San Francisco Airport\n835 Airport Blvd\nBurlingame, CA 94010\nsanfranciscoairport.doubletree.com\nReservations: (650) 344-5500\nSan Francisco Airport Marriott Waterfront\n1800 Old Bayshore Hwy.\nBurlingame, CA 94010\nReservations: (660) 692-9100 or\nOnline Reservation\nMID-RANGE\nAloft San Francisco\n401 E Millbrae Ave\nMillbrae, CA 94030\naloftsanfranciscoairport.com\nReservations: (650) 443-5500\nEmbassy Suites by Hilton San Francisco Airport Waterfront\n150 Anza Blvd\nBurlingame, CA 94010\nsfoburlingame.embassysuites.com\nReservations: (650) 342-4600\nHyatt Regency\n1333 Bayshore Highway\nBurlingame, CA 94010\nreservationcounter.com\nReservations: 1 (800) 207-5585",
    "url": "https://ces.sfsu.edu/off-campus-lodging",
    "domain": "ces.sfsu.edu"
  },
  {
    "source": "https://ces.sfsu.edu/alcohol-policy",
    "category": "general",
    "title": "Alcohol Policy | Conference & Event Services",
    "content": "Alcohol Policy\nAll sponsored and non-sponsored events that will be serving alcohol must adhere to the Alcohol Policy, the Business and Professional Code, Sections 25658 through 25665, and University Regulations.\nPLEASE NOTE: If a vendor will be serving alcohol, proof of vendor’s liquor liability insurance must be provided with the Alcohol Clearance Request form (below). If the event host will be serving, special event insurance may be required by Enterprise Risk Management.\nALCOHOL POLICY\nRequirements when serving beer and/or wine:\nAttendance shall be limited to members of our group and invited guests and not open to the general public.\nThe host and/or sponsor shall be responsible for compliance of all applicable laws, regulations and University policies regarding the serving and consumption of beer and wine.\nAdequate controls shall be maintained to ensure that all persons served alcohol are at least twenty-one (21) years of age.\nNo person obviously intoxicated shall be furnished, served or given an alcoholic beverage.\nThe serving of alcohol shall not exceed three (3) hours.\nFood and non-alcoholic beverages will also be available.\nConsumption and service of alcohol will be in the facility designated for the event.\nWhere danger or potential danger to persons or property is imminent, the event may be cancelled by an appropriate university official and the University Police Department, at their sole discretion\nIf there is a direct or indirect sale of alcohol such as selling tickets for entrance, selling drink tickets or chits which may be exchanged for drinks; or other methods of charging which are determined by the number of drinks served to an individual or any type of consideration exchange between the host organization and attendees, a temporary alcohol beverage license application must be signed by the Chief of University Police. The application must then be taken to the Department of Alcohol Beverage Control for a temporary alcohol beverage license. ABC application information can be found at:\nhttp://www.abc.ca.gov/forms/PDFSpc.html",
    "url": "https://ces.sfsu.edu/alcohol-policy",
    "domain": "ces.sfsu.edu"
  },
  {
    "source": "https://ces.sfsu.edu/catered-services",
    "category": "general",
    "title": "Catering Services | Conference & Event Services",
    "content": "Catering Services\nSF State Hospitality Services by Sodexo\nSUSTAINABLE\nPRACTICES\nLOCAL\nINGREDIENTS\nHEALTHY & DELICIOUS\nMENUS\nSF State Hospitality Services by Sodexo is committed to creating a memorable event for you and your guests. The team of catering professionals is available to assist you with planning every aspect of your event. Our goal is to provide you with the freshest selections of food items, beautifully displayed, and served professionally by our talented team.\nWe are committed to sustainable practices and incorporate seasonally-available, local ingredients to create fresh, healthy and delicious menus. We are committed to sourcing 100% Marine Stewardship Council or Best Aquaculture Practice certified seafood.\nFor complete information regarding our range of catering services and menus, please contact a member of the catering team at (415) 405-4408 or\nSFSUcatering@sfsu.edu\n.",
    "url": "https://ces.sfsu.edu/catered-services",
    "domain": "ces.sfsu.edu"
  },
  {
    "source": "https://ces.sfsu.edu/index.php/guest-suite-guest-services",
    "category": "general",
    "title": "GUEST SUITE | Guest Services | Conference & Event Services",
    "content": "GUEST SUITE | Guest Services\nCHECK-IN\nCHECK-IN | Begins at 3:00 PM\nAt check-in, guests will be given building and unit keys as well as a covered parking permit (requested ahead of time).\nGuests will also a receive a welcome packet that includes information about the apartment amenities, available services, getting connected to Wi-Fi, getting around San Francisco and more.\nYour check-in location will be emailed to you prior to your arrival.\nCHECK-OUT\nCHECK-OUT | Before 11:00 AM\nAny guest wishing special consideration for a late checkout should inquire with Conference & Event Services on or before the actual arrival day.\nGuest can leave their keys and parking permit (if applicable) on the kitchen table in the guest suite apartment.  A member of the housekeeping team will return the keys and permit on your behalf to Conference Services.\nWhen departing please make sure to check for personal items left in the closets, drawers and bathroom area. Please Note: Guests are responsible for damage to or missing items from suites.\nADDITIONAL SERVICES\nLOST KEYS AND LOCKOUTS\nIf you lose your keys please contact Conference & Event Services to receive a replacement. A $65 replacement fee will be applicable. Payment must be received prior to receiving a replacement. Payment can be made at\nhttps://commerce.cashnet.com/CONFSV\n.\nGuests who lock themselves out of their unit, should go to the front desk of their building. If the front desk in your building is closed, please contact Conference & Event Services.\nPARKING\nEach guest suite includes one reserved covered parking stall at the University Park North high rises. During check-in, guests will receive a parking tag inscribed with the stall number. A $100 fee may be assessed per lost parking permit. For guests staying longer than 30 days, a parking permit can be purchased for an additional monthly fee.\nStreet Parking |\nThe parking permit provided at check-in does not allow for parking on the street in front of the University Park North high rises or anywhere on or around the SF State campus.  If a street permit is needed, please contact the Conference & Event Services for assistance.\nCampus Parking |\nAll vehicles parking on campus must have a valid parking permit, which are available for purchase from nearby pay stations. Parking is enforced 24 hours a day, seven days a week, throughout the year. Guests bear the responsibility to provide their visitors notice of all parking regulations at San Francisco State University campus. For more information please visit\nparking.sfsu.edu/sfsu-parking\n.\nPOLICIES\nCANCELLATION\nA 48-hour cancellation notice in writing (via email) is required.  If a reservation is cancelled less than 48 hours prior to the arrival day, a one night stay of $142.00 will be charged.\nFORCE MAJEURE\nIn the event that CSU considers it necessary or prudent to cancel this rental agreement due to circumstances related to a pandemic, CSU may do so and be relieved of any further financial obligation, risk, or other liability by providing seventy-two (72) hours prior written notice of cancellation to guest.\nLENGTH OF STAY\nReservations in the guest suite program can be made for up to 6 months. Faculty, staff and/or administrators who desire lengthier accommodations should contact the Employee & Family Housing at (415) 405-4000 or\nemployee_housing@sfsu.edu\nfor inquiries and assistance. Please Note: Guests that have occupied their unit for 6 months may not check out of their accommodations and check into another guest suite apartment to extend their duration within the program.\nPAYMENTS\nHousing, Dining & Conference Services (HDCS) will bill guests after the guest housing agreement has been executed. Please do not submit payment until an invoice for accommodations has been received. HDCS will bill the guest or campus supporting department or college. Payments can be made with a personal check, credit card, bank fund transfer or University transfer payment request.\nIf a University division or college is using the “transfer payment request” payment method, the chart-field string fields must be provided before the guest check into their guest suite apartment. Accommodations that are paid with personal funds must be secured with a valid credit card.\nPayments received after five (5) days after invoice due date will be charged $100.00 late fee by the University.\nPlease Note: Credit/debit card payments (MasterCard, VISA, American Express, and Discover) are accepted through Conference & Event Services eMarket site (CashNet), which is a third party provider. A non-refundable service fee of 2.75% for each credit card transaction will be added to the total payment amount.  eCheck payments are free of any service fee. The cardholder, student and/or guest will see two transactions on their statement:  payment to the University and the service fee. Service fees paid through eMarket (CashNet) website are non-refundable.\nPERSONAL PROPERTY\nThe University does not assume responsibility for personal property of guests or visitors. Personal items left after the guests departure will be held by Conference & Event Services for up to five (5) calendar days. If guests are unable to pick up their personal items, guests will have to provide a prepaid shipping for the items to be returned.\nPersonal items that are lost or stolen should be reported to SF State University Police Department non-emergency line at (415) 338-7200.\nPURPOSE FOR ACCOMMODATIONS\nThe Conference & Event Services offers accommodations to individuals whose visits are educationally based or meet the mission of the University. To be compliant with state and federal regulations, the usage of the guest suite program for private use is prohibited.",
    "url": "https://ces.sfsu.edu/index.php/guest-suite-guest-services",
    "domain": "ces.sfsu.edu"
  }
]