[
  {
    "source": "https://future.sfsu.edu/",
    "category": "general",
    "title": "Prospective Students | San Francisco State University",
    "content": "Apply Now\nRequest Info\nProspective Students\nWelcome to San Francisco State University, where nearly 30,000 students enroll each year and every day our network of more than 275,000 graduates contributes to the economic, cultural and civic life of the Bay Area and beyond.\nThe Office of Undergraduate Admissions and Recruitment is your resource for information about visiting the SF State campus, applying for admission, and taking the next steps toward enrollment. We look forward to helping you become a new Gator!\nWhy SF State\nExplore Campus\nAcademics\nAdmissions\nTuition + Aid\nHousing + Dining",
    "url": "https://future.sfsu.edu/",
    "domain": "future.sfsu.edu"
  },
  {
    "source": "https://future.sfsu.edu/housing-dining",
    "category": "student_housing",
    "title": "Housing Options | Future Students | SF State",
    "content": "Housing + Dining\nWhether you are a freshman, transfer or grad student, there are a variety of housing options at San Francisco State University, all conveniently located close to your classes, the library, the bookstore, dining commons, and other campus resources. Living in campus housing is not only a great way to get involved, make connections, and share common interests with other members of your community, but research shows that you may even get better grades and graduate faster than students who live off campus.\nApplying for Housing\nThe Housing Office highly recommends students submit their housing application as soon as the housing portal opens in order to increase their chances of obtaining a space and selecting your preferred room type.\nFor more information on how to apply, visit the\nHousing website\n.\nTake a virtual tour of housing\n.\nStudent with family? For more information on student family housing visit the\nEmployee & Family Housing website\n.\nDining\nA meal plan provides you with a variety of selections from multiple cuisine platforms at our residential dining commons and is a great way to ensure that you always have a nutritious meal. For more information about meal plans and to learn which residential communities have mandatory meal plans, visit\nUniversity Dining\n.",
    "url": "https://future.sfsu.edu/housing-dining",
    "domain": "future.sfsu.edu"
  },
  {
    "source": "https://future.sfsu.edu/international",
    "category": "general",
    "title": "International | Future Students",
    "content": "International\nThe information on this page is for:\nUndergraduate applicants who plan to study at San Francisco State in student visa status\nUndergraduate applicants who are U.S. citizens, U.S. permanent residents, or in another immigration status, and have transcripts from an international institution.\nInternational Freshmen\nInternational Transfers",
    "url": "https://future.sfsu.edu/international",
    "domain": "future.sfsu.edu"
  },
  {
    "source": "https://future.sfsu.edu/submitting-transcripts-and-geadt-certification",
    "category": "general",
    "title": "Submitting Transcripts and GE/ADT Certification | Future Students",
    "content": "Submitting Transcripts and GE/ADT Certification\nPart of the admission process is to submit your official transcripts from all institutions you have attended to the Office of Undergraduate Admissions & Recruitment. If applicable, submit your AP, IB, and CLEP test scores as well.\nInformation for Incoming Students\nHow to see what documents are needed\nLog in to your\nStudent Center\nand look for:\nAny items on your To Do List. In the To Do List, click \"\nmore\n\" and then view the detailed information about each item.\nAny official transcripts that have not been received. Click on the link to \"\nCheck Admissions Status\n\" in the \"New Students\" box of your Student Center to see the Transcript Status section and any institutions where we have not received an official transcript.\nTranscript Status\nDefinition\nNot Received\nTranscript is needed and has not yet been received.\nReceived\nTranscript received and is awaiting review. Status will get updated once reviewed.\nPartial\nTranscript received and has in-progress courses. A final transcript will be needed later.\nIn Progress\nTranscript is not needed yet since all courses are in progress. A final transcript will be needed later.\nIncomplete\nTranscript received but is missing courses or degree information. An updated transcript is needed.\nFinal or Evaluated\nTranscript received. All final grades and degrees have been posted.\nNot Required\nTranscript is not needed.\nFirst-Time Freshmen\nSubmit an official copy of your final high school transcripts that show all of your grades and your date of graduation. If you have taken courses at a community college or university, you will need to have transcripts sent to SF State directly from the institution in order to get credit. For information on how to submit official transcripts, see the information below.\nTransfer Students\nSubmit an official copy of your transcripts from all colleges or universities that you have attended.\nIf you completed an Associate Degree for Transfer (AA-T or AS-T), submit your transcript with the date of ADT certification. If applicable, submit your General Education Certification after it has been certified by your school’s records or registrar’s office. For information on how to submit official transcripts, see the information below.\nGraduate Students\nVisit the Division of Graduate Studies’\nwebsite\nfor information on how to submit official transcripts.\nTranscripts from outside of the United States\nAll official transcripts must be submitted to SF State in your institution’s native language. If your transcript is not in English, it must be accompanied by a word-for-word translation completed by a certified translator.\nHow to submit transcripts\nPlease note that all transcripts submitted become the property of SF State and will not be returned.\nSubmitting transcripts electronically\nIn light of COVID-19, we recommend that students submit transcripts electronically if this is available at your school or institution. Contact your school and request that your official transcripts be sent to SF State through a secure third-party transcript vendor.\nSF State will accept electronic transcripts from vendors such as:\neTranscript California*\nSpeede*\nParchment\nCredential Solutions\nNational Student Clearinghouse\ne-SCRIP\nScoir\nOvergrad\nJoint Service Transcripts (Army, Navy, Marines, Coast Guard)\n*These vendors are recommended if available at your institution.\nSubmitting transcripts by mail\nIf your institution is only able to send transcripts by mail, paper official transcripts must be sent in a\nsealed transcript envelope\nto:\nOffice of Undergraduate Admissions & Recruitment\nSan Francisco State University\n1600 Holloway Avenue\nSan Francisco, CA 94132\nTo be official, all transcripts must come directly from your school or institution. Any transcripts that arrive with a broken seal or that appear to be tampered with will be deemed unofficial.\nChecking the status of your transcripts\nAfter submitting your transcripts, you can check on the status of your transcripts in your\nStudent Center\nby clicking the \"Check Admission Status\" link in the \"New Students\" box of your Student Center portal.\nPlease contact us if your transcript status has not been updated within three weeks from the time you submitted your transcript.\nPhone\nAvailable Monday – Friday, 8:30 a.m. – 5 p.m. Pacific Time\nDomestic admissions: 415-338-6486\nInternational admissions: +1 415-338-2382\nTransfer Credit: 415-338-6132\nEmail\nDomestic admissions:\nugadmit@sfsu.edu\nInternational admissions:\nugintl@sfsu.edu\nTransfer credit:\ntcredit@sfsu.edu\nIn Person\nOne Stop Student Service Center\nStudent Services Building, First Floor\nHours: Monday – Friday, 9:00 a.m. – 5 p.m. Pacific Time",
    "url": "https://future.sfsu.edu/submitting-transcripts-and-geadt-certification",
    "domain": "future.sfsu.edu"
  },
  {
    "source": "https://future.sfsu.edu/Tuition-Aid",
    "category": "general",
    "title": "Tuition and Aid | Future Students | SF State",
    "content": "Tuition and Aid\nAttending San Francisco State University is not only an investment in your future but also an affordable option for higher education with SF State ranking the second most affordable college in California! With competitive tuition rates, a variety of financial aid opportunities, and numerous scholarships available, SF State is dedicated to making education accessible to everyone. Students can focus on their academic and personal growth without the burden of excessive financial stress. Join us at SF State, where a high-quality education is within reach.\nThe cost for California-resident undergraduates to attend San Francisco State University includes direct educational costs (tuition fees, books, supplies) and living costs (meals, housing, transportation, and personal expenses).\nCost of Attendance\n* Note: This table shows full cost for two semesters before any aid is applied\nFall 2025 and Spring 2026 - Undergraduate\nCost Type\nOn Campus\nOff Campus\nLiving At Home\nTuition Fees (7 units or greater)\n$8,256\nHousing\n$18,270\n$15,030\n0\nFood\n$5,620\n$7,560\n$11,826\nBooks and Supplies\n$1,100\nTransportation\n$1,512\n$1,980\n$1,764\nPersonal Expenses\n$2,592\n$4,014\n$4,140\nLoan Fee\n$62\nTOTAL\n$37,412\n$38,002\n$27,148\nLearn more about Undergrad cost\nLearn more about Graduate cost\nFunding Your Education\nFinancial Aid\nScholarships\nMoney shouldn’t come between you and a great education. At San Francisco State University, there are many resources to assist you. Sixty-six percent of our students receive financial aid. San Francisco State offers several forms of public and private financial aid including grants, work-study awards and loans. Students may be eligible for need-based grants made possible by generous donations from alumni and friends of the University.\nFor more information, visit the\nFinancial Aid website\nand the\nFederal Student Aid website\n.\nSan Francisco State students have more than 700 campus and external scholarship opportunities. We encourage you to apply for as many scholarships as possible. Each scholarship has its own criteria, annual amount, and application deadline.\nLearn more about scholarships at\nSFSU Scholarships Opportunities\n.\nLearn about\nSF Promise\n.\nFor more information about tuition and fees,\nvisit the Bursars website\n.\nSupportive Information and Programs\nHigh School Students\nIf you are a high school student under age 19 and you and/or your parents currently live in California, or your family has recently moved to California and plans to stay here, you may be considered a\nCalifornia resident for tuition purposes\n. Your parents must have citizenship, legal immigration or visa status in the U.S. and demonstrate they intend to make California their permanent home to be considered a California resident.\nTransfer Students\nIf you are a transfer student who has been a California resident for at least one year prior to September 20 for Fall semester or January 25 for Spring semester, you may be considered a\nCalifornia resident for tuition purposes\n. You must have citizenship, legal immigration or visa status in the U.S. and demonstrate you intend to make California your permanent home to be considered a California resident.\nDreamers/AB540/SB 68\nIf you are an undocumented student and meet the following requirements, you can be considered a California resident for tuition purposes — according to California Assembly Bill 540 (AB 540) which became law in 2001.\nPlease go to the Dream Resource Center website for more information\n.\nNonresident/International\nIf you are a nonresident of California, an out-of-state or international student, you pay additional tuition fees of $444 per unit or fractional unit.\nWestern Undergraduate Exchange\nThe Western Undergraduate Exchange (WUE) is a regional tuition savings agreement administered by the Western Interstate Commission for Higher Education (WICHE).\nWUE enables freshmen and transfer students from one of 16 WICHE states and territories in the Western U.S. to enroll as nonresidents at SF State at a reduced fee level.\nFor more information, visit:\nhttps://future.sfsu.edu/western-undergraduate-exchange\nPrograms\nThrough in Two Program\nDisability Resources\nDream Resource Center\nEducational Opportunity Program\nMetro College Success Program\nProject Rebound",
    "url": "https://future.sfsu.edu/Tuition-Aid",
    "domain": "future.sfsu.edu"
  },
  {
    "source": "https://future.sfsu.edu/admissions",
    "category": "admissions_undergraduate",
    "title": "Admissions | Future Students | SF State",
    "content": "Admissions at San Francisco State University\nWelcome to San Francisco State University, where all are welcome. No matter where you’re from, what you’ve learned or who you think you’ll be, we’re ready to be the next chapter in your story.\nAt SF State, we champion equity and community inclusion to ignite the power of education for all so you can go on to thrive in a global society.\nSubmit your application at Cal State Apply\nFind Your Major\nWherever your story leads, SF State is dedicated to empowering you to pursue your educational dreams bravely, confidently and passionately.\nAreas of Study\nColleges\nAcademics\nBachelor’s degrees in 82 academic areas with an additional 41 areas of concentration\nMaster’s degrees in 63 academic areas with an additional 32 areas of concentration\nDoctor of Education (Ed.D.) in Educational Leadership with two concentrations\nPh.D. in Education with a concentration in special education\nClinical doctorate of physical therapy (D.P.T.), jointly with UC San Francisco\n13 credential programs and 54 certificate programs\nLearn about our seven colleges\nLam Family College of Business\nCollege of Ethnic Studies\nCollege of Health & Social Sciences\nCollege of Liberal & Creative Arts\nCollege of Professional & Global Education\nCollege of Science & Engineering\nGraduate College of Education\nEver since it was established in 1899 as a teacher training school, SF State has been known for its commitment to educational excellence. Students work closely with senior professors and other instructors from freshman year through graduation. Trained in some of the finest institutions in the world, faculty members include winners of prestigious teaching awards, cutting-edge researchers and professionals devoted to solving community problems.\nLearn more about undergraduate academics\n.\nHow to Apply\nNearly 22,000 students enroll each year, and every day our network of more than 293,000 graduates contributes to the economic, cultural and civic life of the Bay Area and beyond.\nFind your next steps and become a new Gator!\nFreshmen Admissions\nTransfer Admissions\nGraduate Admissions\nInternational Admissions\nCost of Attendance and Financial Aid\nWe believe that money shouldn’t come between you and a great education. SF State is ranked in the top 25 for U.S. universities on CollegeNet’s Social Mobility Index, continuously working to make education affordable and help students graduate and find good-paying jobs.\nTuition and Aid\nLearn more about\ntuition + aid\nat SF State →\nVisit SF State\nExplore the beauty of the SF State campus through guided tours from student ambassadors.\n“\nOur students are like no others.\nThey are diverse in every sense of the word. They bring their rich lives into the classroom and contribute so that we all learn from each other.\n”\n—\nSusanna Jones\nProfessor of Social Work\nFaculty Director, First-Year Experience\nCampus Tours\nAlready Admitted?\nAccept your admission offer, learn about orientation, explore housing and more!\nInformation for Admitted Students\nLooking for more information?\nRequest Information\nSchedule a Call",
    "url": "https://future.sfsu.edu/admissions",
    "domain": "future.sfsu.edu"
  },
  {
    "source": "https://future.sfsu.edu/admissions-covid-19-faq",
    "category": "admissions_undergraduate",
    "title": "Admissions FAQ | Future Students",
    "content": "Admissions FAQ\nThe following FAQs are provided to help you answer some of your pressing questions so you can continue taking the next steps toward your future at SF State.\nCan I visit SF State for a tour?\nPlease visit our\nCampus Visits & Tours\npage for the most up-to-date information on in-person and virtual tour options.\nHow can I contact the Office of Undergraduate Admissions and Recruitment?\nWe are available to support you through your next steps of the college admission process. Here's how you can get in touch with us:\nPhone\nAvailable: Monday – Friday, 8:30 a.m. – 5 p.m. Pacific Time\nDomestic admissions: 415-338-6486\nInternational admissions: +1 415-338-2382\nProspective students: 415-338-2355\nEmail\nDomestic admissions:\nugadmit@sfsu.edu\nInternational admissions:\nugintl@sfsu.edu\nProspective students:\noutreach@sfsu.edu\nIn Person\nOne Stop Student Service Center\nStudent Services Building, First Floor\nRegular Hours: Monday – Friday, 9:00 a.m. – 5 p.m. Pacific Time\nHow can I submit documents to the Admissions Office?\nDocuments can be sent by mail to:\nSan Francisco State University\nOffice of Undergraduate Admissions\n1600 Holloway Avenue\nSan Francisco, CA 94132\nOr you can drop documents off at the Admissions Window in the One Stop on the first floor of the Student Services Building.\nSee our guide on\nsubmitting transcripts\nfor more information.\nWhat if I can't pay for the confirmation deposit to accept my admission offer?\nSome students qualify for an\nautomatic waiver\n. If you are not eligible for the automatic waiver and have a financial hardship, please contact us at\nugadmit@sfsu.edu\n.\nI was admitted to SF State but did not enroll in classes. Can I attend the University at a later date?\nIf you do not enroll in the term of your admission then you must reapply for future admission consideration and meet the requirements that are in effect at that time.\nIncoming First-Time Freshmen\nWill receiving credit or pass grades affect my admission to SF State?\nA-G college preparatory courses taken in Winter, Spring, Summer or Fall 2020 terms and during Winter, Spring or Summer 2021 terms will be accepted with grades of \"Credit\" or \"Pass\".\nAll other coursework must be graded and a grade of C- or better must be earned for the course to satisfy “a-g” requirements.\nGrades of credit/pass or no credit/no pass will not be included in the calculation of high school GPA.\nAre the SAT and ACT tests required?\nThe CSU is no longer using ACT/SAT examinations in determining admission eligibility. Please see the\nFreshmen Admission Eligibility Requirements\nfor more information.\nWill SF State still accept AP exams using the new online format?\nYes, the change in the Advanced Placement test format does not change SF State’s policy regarding\nawarding AP credits\n.\nIncoming Transfer Students\nWill receiving credit or pass grades for my courses affect my admission?\nCourse with credit or pass grades will satisfy the General Education requirements [Oral Communication (Area A1), Written Communication (Area A2), Critical Thinking (Area A3) and Quantitative Reasoning (Area B4)]. Grades of credit/pass or no credit/non-passing will not affect your transfer GPA. Baccalaureate-level courses with credit/pass grades will still be counted in your transferable units.\nIncoming International Students\nWhich English proficiency exams do you accept?\nPlease visit\nour website\nfor a list of tests we accept and the scores required, including the TOEFL Special Home Edition and the IELTS Indicator.\nMy visa was denied or delayed. Can I still attend?\nIf you have questions or concerns about your F-1 status, please contact our F-1 advisors at\nf1@sfsu.edu\n.",
    "url": "https://future.sfsu.edu/admissions-covid-19-faq",
    "domain": "future.sfsu.edu"
  }
]