[
  {
    "source": "https://reslife.sfsu.edu",
    "category": "general",
    "title": "Residential Life | San Francisco State University",
    "content": "Community Living Standards Guide\nView the 2025-2026 Community Living Standards Guide\n.\nDownload Acrobat Reader\nto view PDF files.\nReport a Concern to Residential Life\nResidential Life at SF State\nResidential Life at SF State is an on-campus living community that houses SF State students, faculty, and community members. Spanning five diverse communities, Residential Life serves about 4,500 bed space residents. Residential Life is the largest department within the Division of Student Life & Dean of Students unit and employs 31 professional staff members, 120 live-in student leaders, and over 100 community desk assistants. Residential Life continually works to promote a sense of community among residents and enhance learning beyond the classroom.\nResidential Life is always looking to improve and welcomes feedback, suggestions, and comments.\nIf you have questions about on-campus housing options, cost, and to apply, please visit the\nUniversity Housing website\n.\nI want to learn about...",
    "url": "https://reslife.sfsu.edu",
    "domain": "reslife.sfsu.edu"
  },
  {
    "source": "https://reslife.sfsu.edu/about",
    "category": "general",
    "title": "About Residential Life | Residential Life",
    "content": "About Residential Life\nOur Mission\nResidential Life provides SF State students in residence an experience that supports responsible community engagement, student success, and leadership development.\nOur Vision\nTo create opportunities for co-curricular learning that promotes equity, inspires courage, and creates a community where members are respected, valued, and actively involved in shaping their residential experience.\nOur Values\nIn alignment with University values Courage, Life of Mind, Equity, Community, Resilience; Residential Life grounds our work in a culture of care, clarity, and collaboration\nCare, care means:\nHelping residents achieve their highest esteem both emotionally and physically\nUpholding residential and university practices/protocols that promote safety for all those who reside in our spaces\nAcknowledging feelings/perceptions of risk, fear, and harm and exploration of solutions\nProviding safe spaces to articulate how needs can be met\nClarity, clarity means:\nProviding clear and honest communication\nExplaining the why\nInformation necessary for success is available to all\nEnsuring open pathways for communication\nCollaboration, collaboration means:\nWorking together for a common purpose where all individuals feel heard but also are willing to compromise to find the best solution for all involved.\nStudents, staff, and campus departments work together to create the on-campus experience\nProviding seats at the table for a variety of student, staff, and campus partner voices\nConnection to campus resources in an intentional way\nMeet the Residential Life Team\nWe are committed to providing a comfortable living/learning environment which enhances the academic experience at SF State. Our community is composed of individuals from diverse class backgrounds, gender identities, national origins, physical abilities, racial, ethnic, religious and political beliefs, and sexual orientations.\nOur activities, programs, classes, workshops, lectures, and everyday interactions are enriched by our acceptance of one another. We strive to learn in an atmosphere of positive interaction and mutual respect.\nAs adults, we are responsible for our behavior and are fully accountable for our actions. We take responsibility for our awareness of ageism, heterosexism, homophobia, racism, sexism, xenophobia (fear of that which is strange or foreign), and other forms of oppression.\nThe Residential Community is staffed with people who work to serve residents in a variety of ways. There are a number of students and full-time staff members who work in Residential Life specifically to make sure life outside of the classroom is supported.\nResidential Life Directors\nAssociate Dean of Students & Director of Residential Life\nDavid Rourke, M.A.\ndrourke@sfsu.edu\n(415) 338-1822\nThe Associate Dean & Director of Residential Life is responsible for the comprehensive administration of the Residential Life & Office of Student Conduct programs and works closely with the university community to develop resources and services within the residential community. The Associate Dean & Director of Residential Life also sets the tone for the department and serves as the visionary in leading the Residential Life staff in providing meaningful experiences for the students residing on-campus. The Associate Dean & Director of Residential Life oversees the general administrative supervision of the community desk program and the service incorporated within these areas desks. The director also oversees the Associate Director, Business Operations Specialist, and Administrative Support Coordinator.\nAssociate Director of Residential Education & Leadership\nJessica Robinson\njrobinson@sfsu.edu\n(415) 338-2729\nThe Associate Director of Residential Education & Leadership is primarily responsible for establishing a residential climate that is conducive to academic advancement and engagement. This includes, but is not limited to, oversight of the educational initiatives of the department which include the programming efforts of the staff, serving as the liaison to faculty and staff associated with established and proposed learning communities and faculty fellow positions, and the development and maintenance of theme communities. In addition, the associate director is a key figure in the oversight and administration of response to crisis and emergency situations which entails an on-call rotation; and interfaces directly with students, parents and peers, under sensitive and sometimes complex situations.\nAssistant Director of Central Neighborhood\nTimothy Samuel\ntsamuel@sfsu.edu\n(415) 405-2228\nThe Assistant Director of Central Neighborhood provides management support, department programmatic direction, and oversight of the teams operating communities within their assigned neighborhood.  This position is tasked with the responsibility of visioning and leading the Residential communities.  They assist in the oversight of programs and administrative processes that contribute to the functioning of Residential Life. As part of this, the position supports the Residential Community, which consists of 6 residential communities that house approximately 2,300 students primarily consisting of first time freshman and transfer students. The Assistant Director’s central focus is to provide general guidance, direction, and oversight to the residential education staff, which is comprised of a variety of full-time and part-time staff and residential student leaders (Resident Assistants). The Assistant Director serves in the place of the Associate Director during absences, and may be involved in higher-level resident conduct as deemed necessary.\nAssistant Director of Continuing Students & Retention\nLex King\nabking@sfsu.edu\n(415) 405-4013\nThe Interim Assistant Director of Residential Education and Continuing Student Retention performs duties to lead the Residential Education and Leadership team within the Residential Life Department, specifically in the Residential Communities that house continuing students.  This position is tasked with the responsibility of visioning and leading the Residential communities that house all continuing, transfer, and non-traditional students. This includes but is not limited to Developing, implementing, and assessing residential curriculums that meet the needs of: Sophomore Year Experience, Transfer Student Communities, Continuing Student Living Learning Communities, continual collaboration and assistance with the Employee, Family Housing program, being the Residential Life representative on University Committees surrounding student retention, transfer students and student career planning, and leading Residential Life’s student leader recruitment, hiring, and training processes for compensated student leaders.\nAssistant Director of Residential Conduct\n(Vacant)\nThe Assistant Director of Residential Conduct (the Assistant Director) is primarily responsible for the day-to-day implementation, oversight, and assessment of programs and administrative processes that fall under residential conduct.\nResidential Life Specialists\nResidential Life Specialists are members of the Residential Life Leadership Council with the directors of the department.  They are involved in: discussions and planning of department personnel and financial needs; advise and consultation with daily operations; support to the professional team, student leaders, and student assistants within the overall department.\nThe specialists performs highly complex professional student service by reviewing multifaceted individual, group or organizational problems, developing and recommending courses of action and implementing proposed solutions.\nBusiness Operations Specialist\nAaron Kitashima, M.A.\nakit@sfsu.edu\n(415) 405-2227\nThe Business Operations Specialist is responsible for departmental budget analysis and reporting, branding and strategic marketing, department documentation and practices, and Human Resources personnel and payroll operations and transactions.  Also provides organizational management and administrative/clerical support to Residential Life while providing guidance to the Residential Life Leadership Team regarding operational and budgetary matters.\nResidential Rights & Responsibilities Coordinator\nShawn McCoy\nsmccoy@sfsu.edu\n(415) 405-9378\nThe Residential Rights & Responsibilities Coordinator coordinates the administration of the student conduct process for Residential Life. The incumbent is responsible for the oversight, training, and development of Residential Life hearing officers; and provides guidance for hearing officers in reviewing incident reports of alleged violations, investigations, adjudicate cases, and recommend outcomes.\nResidential Life Case Manager\nShinnomon Bartley\nshinbart@sfsu.edu\n(415) 405-2243\nThe Residential Life Case Manager is responsible for the provision of critical support for students experiencing emotional or material challenges that negatively impact their well-being and ability to achieve academic success. The Residential Life Case Manager will provide mental health assessments, crisis management, triage, effective referrals, follow up, tracking, and continuity of care between campus departments and community resources. This position will mainly support students referred to the Residential Life Care Team and the SF State Action Care Team (ACT), but can support students referred by other programs. They will also work to coordinate services and communication with the campus case management team.\nResidential Life Operations Specialist\nJordan Murray\njomurray@sfsu.edu\n(415) 338-0504\nThe Residential Life Operations Specialist is responsible for the overall design, implementation, and daily administration of the department’s Community Desk program. This position provides strategic planning and leadership for the Community Desk program. The Residential Life Operations Specialist provides oversight for five full-time professional employees (Community Desk Residential Coordinator) in performing their job duties in management of the front desks located in on-campus housing facilities.  This includes student assistant hiring and training processes as well as proposing and tracking desk budgets.\nArea Coordinators & Residential Coordinators for Residential Education\nArea Coordinators (AC)\nA full-time professional Area Coordinator (AC) oversees each residential community. These professionals are skilled in conflict resolution, advising, crisis intervention, resource referral, and administrative management. They can be contacted through your community desk. These coordinators oversee up to two Residential Coordinators for Residential Education\nVACANT\nArea Coordinator for Towers @ Centennial Square & Towers Jr. Suites\nMark Alfaro\nArea Coordinator for Village @ Centennial Square\nmalfaro@sfsu.edu\nRavyn Johnson\nArea Coordinator for West Grove Commons\n(415) 405-4412\nrtjohnson@sfsu.edu\nJose Rivera\nArea Coordinator for University Park North\n(415) 405-0345\njoserivera@sfsu.edu\nBen Kalstrom\nArea Coordinator for University Park South & Manzanita Square\n(415) 338-0503\nbkalstrom@sfsu.edu\nResidential Coordinators for Residential Education (RCRE)\nResidential Coordinators for Residential Education (RCRE) aid in overseeing each residential community. These professionals are skilled in, conflict resolution, advising, crisis intervention, resource referral, and administrative management. These professionals supervise a team of student Resident Assistants.\nAriele Grande\nResidential Coordinator for Residential Education, Towers & Centennial Square & Jr. Suites\n(415) 405-8434\nari@sfsu.edu\nAnna Toledo\nResidential Coordinator for Residential Education, Towers & Centennial Square & Jr. Suites\n(415) 405-2230\natoledo@sfsu.edu\nSogra Naseri\nResidential Coordinator for Residential Education, Village @ Centennial Square\n(415) 405-2225\nsnassriaguilar@sfsu.edu\nMakayla Sandoval\nResidential Coordinator for Residential Education, Village @ Centennial Square\n(415) 405-2224\nmsandoval3@sfsu.edu\nKalisi Taborga\nResidential Coordinator for Residential Education, West Grove Commons\n(415) 405-0348\nktaborga@sfsu.edu\nVincent Torres\nResidential Coordinator for Residential Education, West Grove Commons\n(415) 405-2221\nvtorres20@sfsu.edu\nHannah Snowden\nResidential Coordinator for Residential Education, University Park North\n(415) 405-4411\nhsnowden@sfsu.edu\nJoey Curley\nResidential Coordinator for Residential Education, University Park North\n(415) 405-9379\ncurley@sfsu.edu\nKayla Smith\nResidential Coordinator for Residential Education, University Park South & Manzanita Square\n(415) 405-2229\nksmith99@sfsu.edu\nFatyma Cendejas\nResidential Coordinator for Residential Education, University Park South & Manzanita Square\n(415) 405-2211\nfcendejas@sfsu.edu\nCommunity Desk Residential Coordinators\nFull-time professional Community Desk Residential Coordinators (CDRC) aid in overseeing each residential community desk. These professionals are skilled in, conflict resolution, advising, crisis intervention, resource referral, and administrative management. They can be contacted through your community desk. These professionals supervise a team of Lead Desk Assistants.\nChristian Hodges\nCommunity Desk Residential Coordinator, Towers @ Centennial Square & Towers Jr. Suites\n(415) 405-2257\ncdhodges@sfsu.edu\nKai Stephens\nCommunity Desk Residential Coordinator, West Grove Commons\n(415) 405-2223\nkstephens@sfsu.edu\nLiz Alvarez\nCommunity Desk Residential Coordinator, University Park North, University Park South & Manzanita Square\n(415) 566-1558\nlizalvarez@sfsu.edu\nAdministrative Support Coordinator\nAurelia Swift\n(415) 405-4494\naureliaswift@sfsu.edu\nThe Administrative Support Coordinator (ASC) assists with general administrative support functions for both the department and its leadership team.  The ASC assists and supports the daily administration of the Department of Residential Life.  The position takes primary responsibility for several transactional processes including room reservations, personnel and payroll functions, and supporting the Director.  The position plays a supporting role or administrative back up to travel, procurement, and communications functions.\nResidential Programming Coordinator\nKenny Taboada\n(415) 338-0507\nktaboada@sfsu.edu\nThe Residential Programming Coordinator assists students in their social and intellectual development and their pursuit to degree attainment.   The Programming Coordinator assists in the overall design, implementation, and daily administration of the academic support and success functions for the residential community with specific emphasis on supporting the resident students.\nThe coordinator supports student residential community in providing leadership for residential programming in the areas of academic success and overall holistic wellness, supports the development of the community through academic and wellness related programs, resources, partnership building as well as narrates the story of the resident students within the department through an academic and wellness lens.  This coordinator listens and provides strong advocacy for the needs of the resident students.\nResident Assistants (RA)\nResident Assistants (RA) are students who have experience living in residential communities and are familiar with what it takes to make the most of your experience here. Your RA has been carefully selected on the basis of his/her ability to show concern for students and to help make your living environment positive and educationally enriching. RAs are trained to serve as community builders, activity advisors, group facilitators, and referral agents. Your RA is someone who can answer your questions. If they can't answer your question, they will refer you to the person who can. Remember, our program exists so you, the resident, will be challenged and supported to learn and grow.\nLead Desk Assistants (LDA)\nThe Lead Desk Assistants (LDA) are students who assists with the daily operations of their respective community desk and provides quality customer service to the residence community. The Lead DA is expected to understand and perform all Desk Assistant (DA) tasks and procedures in addition to additional administrative and supervisory responsibilities.\nProgram Assistants (PA)\nProgram Assistants (PA) are students who assists in navigating through specialized areas of Residential Education, including wellness and academics.\nDesk Assistants (DA)\nThe Desk Assistants (DA) is responsible for daily operations of the residence community front desks by providing quality customer service for the residential community.",
    "url": "https://reslife.sfsu.edu/about",
    "domain": "reslife.sfsu.edu"
  },
  {
    "source": "https://reslife.sfsu.edu/involved",
    "category": "general",
    "title": "Getting Involved | Residential Life",
    "content": "Getting Involved\nThere are numerous opportunities for residents to get involved with student organizations while living on-campus! Between Residential Housing Association, and several RHA Branches, there is an organization that fits the needs of every student. In addition to the various organizations available within Residential life, there are a plethora of leadership opportunities available at the campus level. Through the Student Life Initiative, SF State has seen an increase in the number of students living on-campus, the size of the incoming freshman class, and the portion of individuals coming from outside the San Francisco Bay Area.\nResidential Housing Association at San Francisco State University\nThe Residential Housing Association at San Francisco State University is the governing body for the residential community and sponsors numerous activities with both educational and social programs throughout the year. Some of the programs that RHA has sponsored include the Halloween Harvest Festival and Haunted House, monthly Movie Nights, a breast cancer awareness volleyball tournament, and various other community programs, including excursions into downtown San Francisco. Additionally, RHA oversees the Housing Advisory Panel (HAP) which connects residents to University Administrators and helps communicate concerns of student residents. All of this is done in order to enhance the residents’ experiences while living on-campus.\nEveryone who lives on-campus, regardless of whether or not they are involved in the student organization as a student leader, is a member of RHA and is welcome and encouraged to participate in community events.\nRoles of RHA\nTo bring together student leaders to have fun\nTo act in the best interests of residents at local and larger campus levels\nTo develop leadership skills in students\nTo encourage participation of residents in the community\nTo become involved in one of the many programs and organizations happening in the Residence Community, email\nrhaboard@sfsu.edu\nWhat is RHA / how it helps and benefits residents:\nWe, Residential Housing Association of the San Francisco State University residence community, in order to ensure cooperation and coordination among branches and members, to establish the well-being of residents, to provide for a closer relationship with the university community, and to provide the education, representational and social benefits for the individual.\nBoard members:\nPresident\nDirector of finance\nDirector of communications\nDirector of programming\nDirector of marketing\nEx-officio\nBranches:\nWest Grove Commons\nTowers at Centennial Square\nTowers Jr. Suites\nVillage at Centennial Square\nManzanita Square\nUniversity Park North\nUniversity Park South\nEvents we have hosted:\nHaunted house\nCarnival\nSip & paint\nCharm decorating\nPumpkin painting\nTown hall meetings\nChristmas de-stressor\nRHA Branches\nHall Government\nGreat opportunity for ANY resident to get involved with their residential area! Here you can serve as a peer advocate and put on community programs.\nUpcoming events\n:\nExplore - GatorXperience (campuslabs.com)\nHow to get involved:\nhttps://forms.gle/xRdNmN6EbHhgtbs78\nSenate meetings:\nEvery 1st and 3rd Tuesday of every month:\nEgay\n:\nInstagram: sfsu_egay\nEverything Great About you\nMeeting times and days: Wednesdays 5-7pm\nThe Academy\nStudent housing residents interested in playing video games are able to do so weekly, and also host monthly tournaments.",
    "url": "https://reslife.sfsu.edu/involved",
    "domain": "reslife.sfsu.edu"
  },
  {
    "source": "https://reslife.sfsu.edu/",
    "category": "general",
    "title": "Residential Life | San Francisco State University",
    "content": "Community Living Standards Guide\nView the 2025-2026 Community Living Standards Guide\n.\nDownload Acrobat Reader\nto view PDF files.\nReport a Concern to Residential Life\nResidential Life at SF State\nResidential Life at SF State is an on-campus living community that houses SF State students, faculty, and community members. Spanning five diverse communities, Residential Life serves about 4,500 bed space residents. Residential Life is the largest department within the Division of Student Life & Dean of Students unit and employs 31 professional staff members, 120 live-in student leaders, and over 100 community desk assistants. Residential Life continually works to promote a sense of community among residents and enhance learning beyond the classroom.\nResidential Life is always looking to improve and welcomes feedback, suggestions, and comments.\nIf you have questions about on-campus housing options, cost, and to apply, please visit the\nUniversity Housing website\n.\nI want to learn about...",
    "url": "https://reslife.sfsu.edu/",
    "domain": "reslife.sfsu.edu"
  }
]