[
  {
    "source": "https://longmoreinstitute.sfsu.edu/",
    "category": "general",
    "title": "Longmore Institute | College of Liberal & Creative Arts",
    "content": "A Better World Because of Disabled People\nAt the Longmore Institute, our mission is to study and showcase disabled people's experiences in order to revolutionize social views. Through public education, scholarship and cultural events, the Institute shares disability history and theory, promotes critical thinking, and builds a broader community.\nOur work is guided and informed by our beliefs and commitments to the\ncommon good\n,\nscholar-activism\n,\nknowledge\n,\ncommunity\n,\nintersectionality\n,\njoy\nand\nintegrity\n.\nGet to Know Us\nPaul K. Longmore\nThe Paul K. Longmore Institute on Disability continues its founder's legacy by working at the intersection of scholarship and advocacy to celebrate people with disabilities as innovative forces for social change. Paul K. Longmore, a historian of disability, activist and polio survivor, started the Institute on Disability in 1996.\nRead About Our Founder\nSuperfest Disability Film Festival\nSuperfest is the longest running disability film festival in the world. Since it first debuted in a small Los Angeles showcase in 1970 it has become an eagerly anticipated international event. For 34 years, Superfest has celebrated cutting-edge cinema that portrays disability through a diverse, complex, unabashed and engaging lens.\nLearn More About Superfest\n“Patient No More”\nThis virtual and traveling exhibit examines a remarkable, overlooked moment in U.S. history when people with disabilities occupied a government building to demand their rights. The protest profoundly changed the lives of people with and without disabilities, and paved the way for the Americans with Disabilities Act (ADA) in 1990.\nExplore “Patient No More”\nAnnouncements\nNews\nOctober 22, 2024\nCall for Applications: Emerge Summer 2025 Hybrid Disability Studies Workshop for Disabled Activists, Artists, Cultural Producers, Filmmakers, and Academics\nCall for Submissions: Emerge Summer 2025 Hybrid Disability Studies Workshop for Disabled Activists, Artists, Cultural Produc…\nSeptember 01, 2023\n10 Things You'll Find at Superfest 2023 that You Won't Find Anywhere Else\nIt’s almost Superfest season, so mark your calendars for October 19th-22nd 2023 and check out the descriptions below! This y…\nMarch 30, 2023\nHatiye Garip on accessible illustration and how the creative industry can take action\nSF State’s Accessible Comics Collective was cited in an interview with an artist who specializes in accessible illustration.…\nMore News\nEvents\nAug\n22\n2025 Emerge Fellowship Culminating Symposium\nFri, August 22, 10:30 am\nZoom\nFeb\n22\nGoodbye Tiger, Hello Rabbit: Disabled Asian Youth in Conversation\nWed, February 22, 05:00 pm\nOnline (Zoom)\nMore Events",
    "url": "https://longmoreinstitute.sfsu.edu/",
    "domain": "longmoreinstitute.sfsu.edu"
  },
  {
    "source": "https://longmoreinstitute.sfsu.edu/news",
    "category": "general",
    "title": "News Listing | Paul K. Longmore Institute on Disability",
    "content": "News Listing\nOctober 22, 2024\nCall for Applications: Emerge Summer 2025 Hybrid Disability Studies Workshop for Disabled Activists, Artists, Cultural Producers, Filmmakers, and Academics\nCall for Submissions: Emerge Summer 2025 Hybrid Disability Studies Workshop for Disabled Activists, Artists, Cultural Produc…\nSeptember 01, 2023\n10 Things You'll Find at Superfest 2023 that You Won't Find Anywhere Else\nIt’s almost Superfest season, so mark your calendars for October 19th-22nd 2023 and check out the descriptions below! This y…\nMarch 30, 2023\nHatiye Garip on accessible illustration and how the creative industry can take action\nSF State’s Accessible Comics Collective was cited in an interview with an artist who specializes in accessible illustration.…\nMarch 20, 2023\nWay We Were: Making a difference in Park City\nEmily Beitiks, interim director of the Paul K. Longmore Institute on Disability, was referenced in an op-ed about a disabili…\nFebruary 25, 2023\nPark City Museum exhibit is ‘Patient No More’\nAn upcoming exhibit by the Paul K. Longmore Institute on Disability at SF State was discussed.\nRead the article.…\nFebruary 14, 2023\nWe're Hiring!\n2/28/23: Please note, we have begun the interview process and are no longer accepting applications for these positions at th…\nFebruary 01, 2023\nCall for Applications - NOW CLOSED FOR 2023 CYCLE: Emerge July 2023 Hybrid Disability Studies Workshop for Disabled Activists, Artists, Cultural Producers, Filmmakers, and Academics\nOverview:\nThe Paul K. Longmore Institute on Disability at San Francisco State University proudly announces Emerge, a three-…\nJanuary 03, 2023\nEmerge Project Announcement\nLongmore Institute on Disability at San Francisco State University receives $1 million grant from the Mellon Foundation to s…\nNovember 16, 2022\nShow Your Support for Longmore This Giving Tuesday\nOctober 20, 2022\nSuperfest Spotlight: A Q&A with the filmmaker of Ecstasy\nOctober 14, 2022\nSuperfest Disability Film Festival returns with hybrid events\nInterim Director for the Paul K. Longmore Institute on Disability Emily Smith Beitiks was interviewed about this year’s Supe…\nJune 30, 2022\nMeet our Longmore Student Scholarship Fellows\nA $100,000 donation from Anthem Blue Cross to The Longmore Institute on Disability has established a new scholarship fund to…\nFebruary 15, 2022\nLongmore Institute on Disability at SF State to Distribute $100,000 in Anthem Blue Cross Scholarships to Students with Disabilities\nContact:\nCatherine Kudlick, Director, Longmore Institute on Disabilitykudlick@sfsu.edu\nEmily Beitiks, Associate Director, Lo…\nSeptember 29, 2021\n10 Things You'll Find at Superfest 2021 that You Won't Find Anywhere Else\nSUPERFEST 2021: ONLINE!\nIt’s almost Superfest season, so mark your calendars for October 15, 16, and 17 and check out the de…\nSeptember 23, 2021\nSuperfest Spotlight: A Q&A with the Producer of 'ill, actually'\nThis short documentary explores the challenges of being young and chronically ill in a carefully curated online culture. A r…\nSeptember 22, 2021\nSuperfest Spotlight: A Q&A with the filmmaker of Yulubidyi – Until The End\nWhat does it mean to be a man in an aboriginal family when your brother is disabled and your father is cruel? And how do you…\nSeptember 22, 2021\nSuperfest Spotlight: A Q&A with the Filmmaker of Reasonable Adjustment\nIn the 1980s a disabled terror group reasonable adjustment carried out a campaign of violence to gain rights - or did they?…\nSeptember 20, 2021\nSuperfest Spotlight: A Q&A with the creator of An Apparition\nWhat can we learn from the most despised insects about lockdown and embodiment? This film celebrates the ingenuity of a disa…\nAugust 24, 2021\nBecome a Paid Longmore Student Fellow this Fall\nThe Longmore Institute on Disability is seeking students with an interest in disability justice for a paid fellowship opport…",
    "url": "https://longmoreinstitute.sfsu.edu/news",
    "domain": "longmoreinstitute.sfsu.edu"
  },
  {
    "source": "https://longmoreinstitute.sfsu.edu/news/call-applications-now-closed-2023-cycle-emerge-july-2023-hybrid-disability-studies-workshop",
    "category": "general",
    "title": "Call for Applications - NOW CLOSED FOR 2023 CYCLE: Emerge July 2023 Hybrid Disability Studies Workshop for Disabled Activists, Artists, Cultural Producers, Filmmakers, and Academics | Paul K. Longmore",
    "content": "Call for Applications - NOW CLOSED FOR 2023 CYCLE: Emerge July 2023 Hybrid Disability Studies Workshop for Disabled Activists, Artists, Cultural Producers, Filmmakers, and Academics\nAuthor:\nFebruary 1, 2023\nPhoto Credit:\nNathan Burns, Longmore Student Fellow\nOverview:\nThe Paul K. Longmore Institute on Disability at San Francisco State University proudly announces\nEmerge\n, a three-year initiative made possible thanks to a generous $1 million grant from the Mellon Foundation. This support will allow the Longmore Institute to lead a month-long July workshop for 10 emerging Disability Studies scholar-activists, held three consecutive summers at San Francisco State University with an option for hybrid participation.\nEmerge seeks to promote scholar-activism: the bridges and relationships that allow academics and activists to better support each other in the shared pursuit of social change. This initiative will cultivate relationships among the next generation of Disability Studies leaders, further diversify the conversation, and promote more scholar-activism in the field.\nEach Emerge cohort will consist of scholars, artists, cultural producers, filmmakers, or activists whose work enriches the field of Disability Studies with projects that explore disabled people’s experiences intersecting with further marginalization by race, gender, sexuality, incarceration, or immigration. Each group of ten will be invited to SFSU’s campus from across the U.S. on the basis of their 4-5 years’ experience in disability-related scholarship, arts/culture/filmmaking, and/or disability justice activism. They will receive support for working on new projects grounded in scholar-activism, an assigned mentor, and opportunities to meet with the Bay Area’s disability arts, rights, and justice organizations. Throughout the month, we will facilitate conversations for the Emerge fellows with local disabled changemakers about what scholar-activism means to them and the challenges they face in their work today. The summer will culminate in a hybrid-model symposium presenting the Emerge fellows' work to the broader Disability Studies community.\nKey details of Emerge fellowship:\n$10,000 July Stipend to support your own personal project in scholar-activism and associated costs with the fellowship. Additional funding for travel/lodging/meal plan for your stay at SFSU with accessible dorm accommodations provided. If you cannot join us in person because of safety or accommodation needs, a digital means of participation will be provided.\nProject mentor to be provided, including weekly meetings during July and monthly meetings for ten months following the Emerge workshop.\nFor an example of who we are hoping to support,\nsee the Ford Foundation’s Disability Futures Fellows\nand know that applicants with similar levels of accomplishments to the Ford Futures Fellows would likely be turned away. Rather, we are seeking people who have the passion and ideas to grow into precisely these sorts of leaders but aren't there yet and would benefit from the Emerge opportunity to help them move in that direction.\nAccommodation support for your participation (if you’d like to discuss your specific needs before applying, contact\nbeitiks@sfsu.edu\n. We will look forward to working with you to make this program accessible and have budgeted for ASL, live captioning, and some financial support for personal care assistant needs).\nThe schedule will be determined in collaboration with the selected fellows and their access needs. Fellows will be expected to be available each weekday for a 3-4 hour synchronous meeting, including a bio-break. In addition, this commitment will include time for independent work on your proposed project as well as occasional additional meetups for excursions (performances, museums, etc, alway hybrid participation possible). Once the workshop concludes, fellows agree to participate in monthly one-hour check in calls with Emerge cohort from August to May 2024, time TBD based on cohort availability.\nAll applicants must identify as disabled and be working in an area that centers on disability intersections with race, gender, sexuality, incarceration record, and/or immigration status.\nFellows will be selected by a four-member selection committee bringing together people with disabilities who represent the similarly diverse fields that we are hoping our Emerge cohort will represent. Fellows will be selected based on their past accomplishments, proposed individual projects, expressed commitment to scholar-activist practice, and the perceived impact from participation in the Emerge opportunity.\nYou can find a list of frequently asked questions and answers providing more guidance on the application questions and Emerge opportunity here. Please read through before applying:\nhttps://docs.google.com/document/d/e/2PACX-1vTei9cS5xXu-_MGh1bf8N3KU2QwsP2rmKJQxbu-18seR2spV59iPDCZVnlmtqGz1Et0glhQh-rta_QF/pub\nAttend watch a Q&A recording with the Longmore Institute’s Interim Director, visit:\nhttps://sfsu.zoom.us/rec/play/w10deGnmKTmHtqlg9w0zTNbrduQ0qcG9Hqol9A-1FIVtMwIqe441HQgT4VjOTRxy-Y0XZiRmT16GHSHJ.D91GW4NX3us0yy4A\nPasscode\n: R3mLj7!4\nThe recording has the auto captions, but this link has our live transcriber's much better transcript:\nhttps://docs.google.com/document/d/e/2PACX-1vTyziWoyB0EAvbLmN7zey1TidrnFIG8zySGcLSskrBYn2zubpsN7ssdrMsYBI-KOOBUn6joihTATx_e/pub\nApply now at:\nhttps://tinyurl.com/EmergeApply\nOther Inquiries:\ncontact Interim Director Emily Beitiks,\nbeitiks@sfsu.edu\nor 415-338-6010. *Please do not contact our selection committee. Also, please note that Emily will not serve on the committee, so please refrain from reaching out unless you have a legitimate need for assistance with the application process. She cannot review project ideas, CVs, etc.\nTags\nEmerge\nRelated News\nCall for Applications: Emerge Summer 2025 Hybrid Disability Studies Workshop for Disabled Activists, Artists, Cultural Producers, Filmmakers, and Academics\nOctober 22, 2024\n10 Things You'll Find at Superfest 2023 that You Won't Find Anywhere Else\nSeptember 1, 2023\nHatiye Garip on accessible illustration and how the creative industry can take action\nMarch 30, 2023\nWay We Were: Making a difference in Park City\nMarch 20, 2023",
    "url": "https://longmoreinstitute.sfsu.edu/news/call-applications-now-closed-2023-cycle-emerge-july-2023-hybrid-disability-studies-workshop",
    "domain": "longmoreinstitute.sfsu.edu"
  },
  {
    "source": "https://longmoreinstitute.sfsu.edu/superfest-spotlight-qa-filmmaker-reasonable-adjustment",
    "category": "general",
    "title": "Superfest Spotlight: A Q&A with the Filmmaker of Reasonable Adjustment | Paul K. Longmore Institute on Disability",
    "content": "Superfest Spotlight: A Q&A with the Filmmaker of Reasonable Adjustment\nAuthor:\nLongmore Institute\nSeptember 22, 2021\nIn the 1980s a disabled terror group reasonable adjustment carried out a campaign of violence to gain rights - or did they?\nOur Longmore Student Fellow Nathan Burns interviewed Justin Edgar, director of\nReasonable Adjustment\n, which will screen at #Superfest35, October 15-17. Read on and make sure to\nreserve your pass to Superfest now.\nNathan: What inspired you to create\nReasonable Adjustment\n?\nJustin:\nFirst and foremost, the thing to make sure all potential programmers know is that the film is not real. It is entirely a constructed fiction made with actors, digital effects, different film stocks and sound techniques of the period and some deepfake footage of real people. There is a lot of invisible effects work in this film.\nAs a filmmaker, I find mock documentary films don’t really convince so I set the challenge of convincing myself. I had to go to great lengths to do that. It wasn’t easy to do and everything in the film had to be recreated. I made microfiche newspaper articles, burned the chair for real and hired a professional reportage photographer to shoot 35mm ektachrome stills, these photographs were then shot on a 16mm rostrum camera exactly as would have been done back then – you can’t just do that anywhere. We had to source period props, costumes and digitally remove anything that didn’t belong in frame. There is a lot of invisible CGI in the film. We also went to a home office registered firing range in Yorkshire to recreate the attack on the BBC using live ammunition. To get the right locations we had to shoot in the Midlands, Birmingham and various locations in London including a guerrilla shoot in Westminster. We also had to find a voice double for Margaret Thatcher.\nWe shot on 16mm film with an Arriflex camera that would have been used at the time. We used vintage lenses and old-fashioned tungsten lighting. We made the sound mix mono and used special sound filters to ensure it sounded of the period. I auditioned many actors to get someone with the right inflection of a presenter from the 1990s. This authenticity also extended to the accessibility features of the film and it has old-style Ceefax subtitles.\nPart of making it work was the tone – I decided it should have a slightly left-wing journalistic bias which would help to ensure that it felt real. Many British TV programmes of the time had that stance and World in Action is how filmmakers like Paul Greengrass started out. If you look back at old docos from that period they are very mannered and slow as well and we tried to emulate that style.\nI realised that pre-2000AD we were BG (before google) and truth BG is hazy, you can make stuff up. For instance, in 1997 I was involved in quite a big news story, it made national press at the time but it’s nowhere to be found online. For all intents and purposes it doesn’t exist. Before Google is the dark ages in terms of what really happened. Another example is the Animal Liberation Front (ALF) who were very active, and are kind of the model for RAD. They sent letter bombs, killed and even branded people with branding irons, but you never hear anything about them now.\nI have a theory about protest groups – they assimilate the tropes of other, past protest groups, so are quite easy to recreate and emulate. Putin has done this to great effect in Russia to steer and influence public opinion.\nI believe we are living in a post-truth era, whether we like it or not. I also believe that truth is relative and a subjective concept, we all live in our own realities and cinema reflects that. Susan Sontag spoke of humankind revelling in “mere images of the truth”.\nNathan: For our mostly US-based audience, can you share a bit more about the cultural context of disability in relation to radicalism in the UK? Relatedly, was there any significance to the fact that you borrowed footage from the IRA?\nJustin:\nI think outside the UK we have an image as a polite little island, but its actually always been a hotbed of anti-establishment movements. The French called it a revolution but we call ours a civil war! From the Tolpuddle martyrs to Punk to Brexit, there is a long history of dissent, its in the DNA of the British. I grew up in the Thatcher 80s, a very febrile era of mistrust where peace activits and trade unionists were under mass surveillance by the state and the spectre of IRA violence hung over everything – there were metal detectors in my local library and bombings were common. I think a lot of that went into Reasonable Adjustment.\nAccording to the British Medical Journal there have been 130,000 preventable deaths attributable to the austerity policies of the Liberal Democrat and Conservative government of David Cameron and Nick Clegg since 2010.\nErrol Graham, 57, weighed 28.5kg when he starved to death after complications owing to the nature of his disability led to his benefits being cut. He died having pulled out his own teeth with a pair of pliers as he didn’t have the appropriate care.\nThese are holocaust-like numbers more associated with war than social policy and people need a mirror held up to the society we are living in. A society where disabled and disadvantaged people have been disregarded and vilified by a government which we voted in. This is life and death, it’s a big subject and the work needs to be impactful”.\nThat is why I compare the struggle for disability rights to other armed resistance groups with RAD. I wanted to compare the two and draw parallels.\nNathan: What’s the biggest take-away you hope audiences will get from your film?\nJustin:\nIf we start with the notion that truth is tyranny, we can understand the film better. I appreciate not everyone will agree with that assertion, but there’s no point in making a film if it doesn’t cause debate. Whenever you point a camera at something you are making a judgement about how you see that thing, staking your own sense of truth upon it.\nWho is the arbiter of what’s real and what isn’t? Yourself? Can you trust yourself?\nMy reality may not be your reality.\nAnother important point is that this is satire and people have to remember that, it’s meant to make a point through humour. When I put a teaser clip of the film on Facebook it was viewed 80,000 times in 24 hours and was banned by facebook for hate speech. I always felt it was interesting for people to find their own truth about what they are watching, good or bad. After an appeal it was reinstated as it makes a comment on hate speech rather than extolling it.\nThe key question that I hope viewers will ask is why make it up? Why bother? And that question prompts you to delve a bit deeper. I encourage programmers to let audiences make up their own mind about the film. I always knew there was a risk that people would get offended if they felt stupid, that they’d been duped. But then I thought in that realisation there will be an insight where people think about the issues at hand…\nNathan: At Superfest, we often talk about disability being a creative and generative force in filmmaking. Rather than the \"in spite of your disability\" stories, many of our filmmakers find that their disability impacted their filmmaking and led to the unique voice or aesthetic their film brings. Does that resonate with you at all? If so, how?\nJustin:\nAbsolutely, I believe that mainstream culture survives and thrives on the fringes and that is what we bring to the table as disabled filmmakers – a unique voice and world view. I think there is an increasing argument for a school of disability filmmaking and I’m currently writing a book on that subject.\nNathan: How do you think your film challenges and/or improves traditional filmmaking/storytelling about disability?\nJustin:\nIt seems to me the traditional depictions of disabled people in narrative film is either as a villain or a victim. With\nReasonable Adjustment\nI wanted to depict disabled people acting in a way which was questionable and challenged the traditional moral values of the audiences. The film actually began life as part of an exhibition for the Richard Attenborough Gallery in the UK and what was interesting as I eavesdropped on conversations of the gallery visitors was how people thought the group were justified in their actions!\nNathan: What surprised you while making this film?\nJustin:\nI was surprised at how the film was received. It premiered as part of an arts festival at the Southbank Centre which is a major art space in London. It had 60,000 views in one weekend and was actually banned by facebook because some people objected to the language used on grounds of hate speech. We were able to get it put back up though. It was also banned by another festival in the UK because it was seen as controversial. I think people are used to different kinds of depictions of disabled people and it is hard for them to process depictions that are not the norm. It's interesting that the people who objected to it are by and large non-disabled.\nNathan: What about your film are you most proud of?\nJustin:\nI am proud we got banned from Facebook! I’m also proud that it works – that people think its real. There was a lot of sleight of hand involved and I’m glad that the efforts we went to paid off.\nNathan: You handled the audio description of\nReasonable Adjustment\nyourself to make it match the tone of the film. Please share anything you’d want your audience to know about your approach and process.\nJustin:\nFor audio description we invented our own automated version purportedly devised by Texas Instruments called TalkTextTM, the audio description track for the film gives its own narrative, designed to reflect ableist attitudes and language of that time. I think audiences should listen to it, as it tells us a lot about how far terminology has come in the last 30 years.\nNathan: Film festivals like Superfest showcase those stories that Hollywood often leaves behind. What do you want to see happen next for disability in film, on both a large and small scale?\nJustin:\nThe key is getting more disabled filmmakers behind the camera, for example everyone talks about CODA* but why wasn’t the director/writer/producer Deaf? The filmmaking community  needs to stop taking it for granted that disabled stories can be authentically told by non disabled filmmakers and it's our job to constantly challenge that notion.'\n(*Editor's note: This refers to a different CODA than the film screening at Superfest 2021.)\nNathan: What are you currently working on?\nJustin:\nI’m producing four disability shorts for Film Four here in London. It's really exciting they are backing disabled film talent and the films are all on the theme of Love and will premiere on Valentines Day!\nTo check out Justin Edgar's film at Superfest,\nget your passes now\nand check it out any point October 15-17. Free passes available!\nTags\nSuperfest\nRelated News\nCall for Applications: Emerge Summer 2025 Hybrid Disability Studies Workshop for Disabled Activists, Artists, Cultural Producers, Filmmakers, and Academics\nOctober 22, 2024\n10 Things You'll Find at Superfest 2023 that You Won't Find Anywhere Else\nSeptember 1, 2023\nHatiye Garip on accessible illustration and how the creative industry can take action\nMarch 30, 2023\nWay We Were: Making a difference in Park City\nMarch 20, 2023",
    "url": "https://longmoreinstitute.sfsu.edu/superfest-spotlight-qa-filmmaker-reasonable-adjustment",
    "domain": "longmoreinstitute.sfsu.edu"
  }
]