[
  {
    "source": "https://wellness.sfsu.edu/nutrition-clinic",
    "category": "general",
    "title": "Nutrition Clinic | Health Promotion & Wellness",
    "content": "Nutrition Clinic\nSchedule a free one-on-one appointment with a Registered Dietitian Nutritionist (RDN) for individual nutrition support.\nAnjuman Shah, MS, RDN focuses on offering evidence-based, person-centered, compassionate care rooted in a non-diet approach, health at every size (HAES) perspective, and mindfulness strategies. She aims to promote optimal health and well-being by helping students build a positive relationship with food and their bodies.\nCommon reasons for working with a RDN:\nMedical concerns involving nutrition management (e.g. diabetes, celiac disease, eating disorders, digestive conditions, heart health)\nFamily history of nutrition-related health conditions (e.g., high cholesterol, hypertension, heart disease, diabetes, anemia)\nMental health conditions that impact eating (e.g. depression, anxiety, ADHD)\nDigestive issues and/or changes in appetite or energy levels\nFood allergies and intolerances\nVegetarian/vegan nutrition support\nImproving your relationship with food and your body\nFueling for exercise/sports\nOther eating or nutrition-related concerns\nNutrition Specialties\nWhile the Registered Dietitian can support you with any health goal, Anjuman specializes in the following areas:\nDigestive conditions\nDisordered eating, mindful eating, and body image\nPlant-based nutrition\nDiabetes and other chronic condition management\nDietary supplements\nInitial Appointments (50 minutes)\nFor students who have never seen the RDN or not seen the RDN in over a year\nIncludes nutritional assessment, counseling, education, and goal setting\nPlease fill out the online nutrition questionnaire at least 30 minutes before your scheduled appointment.\nNote: You have 40 minutes to fill out the questionnaire and cannot return to the form once submitted to add more information. Please provide as much detail as possible.\nFollow-up Appointments (25 minutes)\nFor students who have seen the RDN within the last year\nOngoing counseling, monitoring, and support in achieving desired health goals\nLooking for more support with improving your eating habits, eating on a budget, meal planning, grocery shopping, meal prepping, and/or other general nutrition concerns?\nJoin our FREE nutrition workshops, cooking demos, and cooking classes happening throughout the school year.\nUpcoming Events\nYou can also check out our online\nnutrition resources\nand\nrecipes\nfor more inspiration and guidance!\nClinic Hours:\nWednesdays:\n10am - 5pm\nAppointments:\nAppointments are currently held virtually via Zoom video chat. If you miss your appointment or do not cancel/reschedule prior to your visit time, you will be billed a $20 no-show fee.\nIn-person appointments are available upon request only.\nAll in-person appointments will take place at\nStudent Health Services\n.\nCost:\nCovered by the Student Health Fee\nTo schedule an appointment, book online through MyHealth or call Student Health Services at 415-338-1251\nMake an Appointment\nFAQ\nI want to lose weight. Can the Registered Dietitian help me with this goal?\nWeight and BMI are poor and inaccurate measures of health – in fact, current BMI ranges are based mainly on white populations and do not take body composition (including muscle mass, body fat percentage, and bone density) into account. BMI does not account for biological and genetic differences in the relationship between weight, muscle mass, and disease risk among different groups of people.\nResearch shows that intentional weight loss may negatively impact health, especially when weight is lost too quickly. Incorporating consistent and balanced eating and lifestyle behaviors improves overall health and well-being regardless of weight change, and our Registered Dietitian can support you in achieving good health at any size.\nThe number on a scale does not define you, your health status, or your abilities. For more information on how intentional weight loss does not support improved health outcomes, please visit\nHAEShealthsheets.com\n.\nWill I be put on a diet?\nNo. We define “dieting” here as any attempt to change body size through food and/or movement. Research shows that diets don’t work and may actually result in a negative relationship with food, weight gain (oftentimes even more than initially lost from dieting), and worsened health outcomes.\nAll food is designed to provide energy to the body – however, the amount and quality of energy received varies based on the quantities and combinations consumed! Maximizing variety and minimizing unnecessary restrictions is the best way to keep eating consistent, joyful, and exciting. Our Registered Dietitian will work with you to find an optimal balance of foods that works best for your body.\nFor more information on how dieting does not support health and well-being, please visit\nHAEShealthsheets.com\n.\nWill the Registered Dietitian tell me what to eat (or what not to eat?)\nNot quite. Our Registered Dietitian believes all foods can fit into a healthy and happy lifestyle, which means that she won’t tell you to avoid or cut out any of your favorite foods unless it is medically necessary (e.g., if you have a food allergy).\nOur Registered Dietitian will learn about your food beliefs and eating preferences and help equip you with the knowledge and skills needed to build balanced meals in any setting and achieve your nutrition-related health goals.\nWhat is the difference between a Registered Dietitian (RD) and a nutritionist?\nIn a nutshell, all Registered Dietitians are nutritionists, but not all nutritionists are Registered Dietitians.\nRegistered Dietitians are nutrition professionals who must:\nHave a Bachelor’s and/or Master’s degree in food and nutrition sciences\nComplete a minimum of 1,200 hours of supervised practice\nPass a rigorous examination to become licensed\nComplete continuing education hours in order to maintain their credentials\nThe term “nutritionist” isn’t regulated, so anyone can call themselves one. While you can find qualified nutritionists with proper education and training, there are also many people calling themselves nutritionists who have little to no education and training (especially on social media). These self-declared “nutritionists” may offer misleading, ineffective, and oftentimes\nharmful\nnutrition advice. If you are seeking evidence-based nutrition advice and support, especially for medical conditions, a Registered Dietitian is your best bet.\nHow long do I need to work with the Registered Dietitian to achieve results?\nThe choice is yours! Exact timing depends on you, your schedule, your specific health goals, and the level of support and accountability needed to achieve them.\nBuilding and maintaining consistency with new habits takes time and practice – we usually recommend working with a Registered Dietitian regularly (i.e., weekly or bi-weekly) for at least 6 months for optimal results.\nOur Registered Dietitian can better assess the length of time needed to achieve long-lasting results after completing an initial consultation. Once started, you always have the option to meet less frequently or on an as-needed basis as you build more comfort and confidence with your eating.",
    "url": "https://wellness.sfsu.edu/nutrition-clinic",
    "domain": "wellness.sfsu.edu"
  },
  {
    "source": "https://wellness.sfsu.edu/about-us",
    "category": "general",
    "title": "About Us | Health Promotion & Wellness",
    "content": "About Us\nOur Mission:\nTo champion an environment at San Francisco State that prioritizes the health and well-being of the campus community in order that every student can reach their full potential.\nOur Vision:\nA culture of health & wellness built on a commitment to equity and social justice.\nPurpose:\nTo promote wellness and health on campus in order to foster student success. We do this by:\nCreating opportunities for students to learn and enact healthy behaviors\nCreating health equity on campus\nShift campus culture to champion health and wellness\nCreate opportunities that empower students to reach their full potential as healthy adults and leaders\nOur Values:\nHealth Equity\nCultural Humility\nHolistic Wellness\nStudent Success\nCommunity Voice\nEvidence-based practice\nCollaborative Leadership\nInnovation\nTransparency",
    "url": "https://wellness.sfsu.edu/about-us",
    "domain": "wellness.sfsu.edu"
  },
  {
    "source": "https://wellness.sfsu.edu/general-faqs",
    "category": "general",
    "title": "General FAQs | Health Promotion & Wellness",
    "content": "General FAQs\nWhen does Therapy Animals happen?\nCheck out our\nWags for Wellness page\nfor specific locations, dates, and times.\nWhere can I get free birth control/safe sex supplies?\nYou can get free birth control and safer sex supplies at the following places:\nHPW Office\nCondom Dispenser in Cesar Chavez Student Center lobby\nCondom Dispenser in Mashouf Wellness Center\nCondom Request Form\nfor Student Orgs or RAs\nStudent Health Services\nWhen is the deadline to apply for HPW Student Leaders and Ambassadors?\nThe Student Leader program is a one academic year commitment. Our application is usually open during mid-Spring semester (February- April) for the next academic year.\nThe Ambassador program is a semester commitment. We typically open our application towards the end of each semester (November and April) for the following semester.\nCheck out our\nStudent Leader\nand\nAmbassador\npages for exact deadlines.\nWhere do I go if I’m experiencing a food or housing emergency?\nFood+Shelter+Success\nsupports students in reaching their full potential at SF State by responding to student hunger and housing insecurity. There are\nfood programs\navailable on campus such as CalFresh Help Clinic, the Campus Food Pantry, and Emergency Meals.\nPATHS\nprovides compassionate crisis support for students who are currently unhoused.\nDoes HPW provide one-on-one counseling or therapy?\nUnfortunately, HPW does not offer one on one counseling or therapy for mental health. We recommend you make an appointment with\nCounseling and Psychological Services.\nI think someone is having an alcohol emergency. What do I do?\nIf someone has been drinking, you can tell something is wrong if they are:\nBreathing irregularly\nCool or clammy to the touch\nUnconscious\nNot waking up while vomiting\nUnusually pale or bluish\nIf you think someone has alcohol poisoning, call 911 immediately. Lay them on their side in a fetal position, and stay with them until the emergency personnel arrive. Do not worry about legal ramifications – your friend’s life may depend on your quick response.\nWhat is the Good Samaritan Rule?\nIf you are under the age of 21 and are calling for yourself or someone else that is in need of medical attention because of an alcohol, or other drug emergency, you are covered under 911 lifeline legislation. For this to apply the following must be true:\nIf you are under the age of 21\nCall 911 for yourself or another person in need of medical assistance\nFirst to make 911 report\nStay until help arrives\nCooperate with emergency personnel\nHow do I access the Sexual Violence Prevention Education Online Training?\nAs part of our University's commitment to ensuring a safe and healthy learning environment, all new incoming students are required to complete mandatory sexual violence prevention education per\nCSU Executive Order 1095\n. Students are able to view instructions to access the training by visiting our\nSexual Violence Prevention Education Online Training page\n.",
    "url": "https://wellness.sfsu.edu/general-faqs",
    "domain": "wellness.sfsu.edu"
  },
  {
    "source": "https://wellness.sfsu.edu/dimensions-of-wellness",
    "category": "general",
    "title": "Dimensions of Wellness | Health Promotion & Wellness",
    "content": "Dimensions of Wellness\nMulticultural Wellness\nMulticultural Wellness develops compassion and consideration for others’ perspectives and cultures.\nFostering Multicultural Wellness\nRespecting and learning about other cultures\nDeveloping interpersonal relationships\nLearning more about the cultures you identify with\nEducating yourself and asking questions to learn more about a friend’s culture\nCampus Resources\nSexual Health Education\nEROS\nGatorXperience\nDivision of Equity & Community Inclusion\nStudy Abroad\nSocial Wellness\nSocial Wellness allows us to maintain healthy relationships with peers, friends, family, and partner(s). It’s all about caring for others and letting others care about you.\nFostering Social Wellness\nMaking an effort to keep in touch with others\nParticipating in group discussions and practicing active listening\nJoining a student organization or getting involved on campus\nVolunteering in the community\nHanging out with people you enjoy spending time with\nTaking time to be sexual with yourself or with partner(s)\nSetting limits with your friends and loved ones if you need “me time”\nCampus Resources\nSexual Health Education\nGet Involved with Health Promotion & Wellness\nGatorXperience\nCampus Recreation\nDiv. Student Life\nIntellectual Wellness\nIntellectual Wellness encourages us to engage in mentally stimulating activities and requires lifelong learning and curiosity.\nFostering Intellectual Wellness\nPicking up a new hobby\nStudying abroad or traveling\nTaking a class outside of your major\nReading for pleasure\nLearning another language\nEngaging in something creative\nReading a book or listen to a podcast that is unrelated to school or work\nGoing to an art museum, history exhibit, sports event, or theatre performance\nCampus Resources\nLibrary\nAcademic Advising\nStudy Abroad\nEmotional Wellness\nEmotional Wellness involves awareness of your feelings, values, attitudes and response to everyday interactions. This also includes developing empathy for others, and seeking help and support when you need it.\nFostering Emotional Wellness\nPracticing gratitude\nTaking care of your body by eating, being active, and sleeping\nWriting in a journal\nTaking a break from your phone\nDoing activities that make you laugh\nDecluttering your living space\nAllowing yourself to cry\nTaking a deep breath\nBoosting your mood with aromatherapy\nSharing your thoughts and feelings with someone you trust or consider seeing a mental health professional\nSpending time with people you value, and who value you\nCampus Resources\nAlcohol, Tobacco, & Other Drugs Education\nMental Health Education\nSexual Violence Prevention Education\nCounseling & Psychological Services\nSF State Rest & Relaxation Stops\nEROS\nHolistic Health Learning Center\nPhysical Wellness\nPhysical Wellness encourages us to care for our bodies by staying healthy and taking preventive measures to maintain our health for the future.\nFostering Physical Wellness\nFinding time to move your body for at least 30 minutes a day\nEating foods that make you feel good and drinking water\nMaintaining a regular sleep schedule and getting between 7-9 hours of sleep each night\nPracticing safer sex and getting yourself tested for STIs, including HIV\nWashing your hands and getting regular check-ups\nTaking time to heal when you’re sick\nAvoiding excessive use of substances that can harm your body\nEmbracing your unique body\nCampus Resources\nAlcohol, Tobacco, & Other Drugs Education\nNutrition Education\nSexual Health Education\nSF State Rest & Relaxation Stops\nFood+Shelter+Success\nStudent Health Services\nCampus Recreation\nOccupational & Financial Wellness\nOccupational & Financial Wellness focuses on understanding your strengths and interests for your career and developing your skills to manage finances.\nFostering Occupational & Financial Wellness\nSetting realistic career and budget goals for yourself and working towards accomplishing these goals\nOpening a savings account – add a small monthly automatic payment, if possible\nStarting with small budget changes that will add up over time\nSpending time once a month and review your finances and budget\nApplying for Financial Aid and scholarships, understanding your student loans\nWriting a list before you go shopping\nStriving for balance among school, work, family, relationships, social life, and rest\nReflecting on what you enjoy and value in a career\nNetworking with people in your career\nConnecting with a mentor in your field of study or career\nCampus Resources\nCalFresh Help Clinic\nMoney Management & Budgeting Resources\niGrad\nCareer Services & Leadership Development\nGet Involved with Health Promotion & Wellness\nAcademic Advising\nOffice of Student Financial Aid\nEnvironmental Wellness\nEnvironmental Wellness cultivates an awareness of how both the natural and built environment impact you, as well as how your behavior impacts the Earth.\nFostering Environmental Wellness\nSpending time outdoors\nSoaking up the sun (and wear SPF!)\nStarting your own garden, even if it’s a rock garden\nPicking up trash.\nUsing reusable bags and water bottles\nBeing mindful of your water use\nGoing to the farmer’s market\nTurning off lights and computers\nDonating unwanted clothing or upcycling them\nCampus Resources\nEnvironmental Resource Center\nCampus Recreation\nOffice of Sustainability\nSol Patch Garden\nSpiritual Wellness\nSpiritual Wellness helps you find purpose, value and meaning in your life with or without religion\nFostering Spiritual Wellness\nLearning more about yourself and your purpose\nExploring your inner self\nMeditating or practicing mindful relaxation\nPracticing acceptance\nBeing curious\nLooking for a religious faith that aligns with your values\nTraveling and experiencing other cultures\nFinding spiritual connection or community\nIdentifying what is meaningful to you and notice its place in your life\nCampus Resources\nHolistic Health Learning Center\nDivision of Equity & Community Inclusion",
    "url": "https://wellness.sfsu.edu/dimensions-of-wellness",
    "domain": "wellness.sfsu.edu"
  },
  {
    "source": "https://wellness.sfsu.edu/wellness-map",
    "category": "general",
    "title": "SFSU Wellness Map | Health Promotion & Wellness",
    "content": "SFSU Wellness Map\nExplore the Wellness Map to find various wellness resources available around campus. Wellness resources include safer sex supplies, lactation rooms, gender-neutral bathrooms, food security resources, sleep stations, identity affirming spaces and much more.\nWellness Map\nFood Security Resources:\nEmergency Meal Card Program – On-Campus Use:\nThis community meal-sharing program helps elevate student food security by providing free meals at\nCity Eats Dining Hall\nto SF State students facing barriers accessing enough food.\nFood Pantry & Gator Groceries\nStop by\nAS Gator Groceries\nand pick up a box of free groceries!\nFood Pantry Hours\nMon: 1 PM - 5 PM; Tues & Wed: 12 PM - 5 PM\nGator Groceries\nThurs & Fri: 11 AM - 4 PM\nLocation:\nCesar Chavez Student Center Rec and Dining Level (bottom floor)\nContact:\nfoodpantry@asi.sfsu.edu\nif you have any questions\nFor most up to date information and to find out what the pantry is giving out this week, follow\n@as_marketandpantry_sfsu\nLactation Rooms\nThe lactation room spaces are private, safe, and clean with a place to sit and have access to plug in pumps. For more information and other resources for nursing and pregnant parents, please visit\nwellness.sfsu.edu/lactation-rooms\nBasic Needs funds for purchasing formula, wipes, diapers, and other items may be available to pregnant and parenting students. To request financial support, please visit the\nbasicneeds.sfsu.edu/diapers\nMenustral Products\nMenstrual Health Supplies\nFree menstrual health supplies are available to all students at select locations around the SFSU campus. Explore the\nSFSU Wellness Map\nto find free menstrual products near you.\nMenstrual Health Kits\nMenstrual health kits are prepackaged kits that included different-sized pads and tampons. Please visit the Health Promotion and Wellness office during in-service hours to pick up your own kit.\nSafer Sex Supplies\nFree Safer Sex Supplies\nFree safer sex supplies can be found in condom dispensers, safer sex supply kits and at information desks around campus. Explore the\nSFSU Wellness Map\nto find free safer sex supplies and services near you.\nCondom Kits via Mail\nAll enrolled SFSU students can request safer sex supplies through the mail. To request a safer sex supply kit, please visit\nwellness.sfsu.edu/safer-sex-supply-request-form\nRest & Relaxation Stops\nNeed a space to relax between classes? Check out the 25 locations around campus to sit back and rest. Please visit\nhttps://wellness.sfsu.edu/sleep\nto learn about sleep tips and tricks to get quality sleep.\nSharp Waste Drop-Off Locations\nCampus sharps drop-off locations are conveniently placed in Gender Neutral Restrooms throughout San Francisco State University (SFSU). Call the EH&S Department at (415) 741-7947 to schedule a pick up for disposal, or any container related issues.\nOpioid Overdose Prevention Supplies\nFree opioid overdose supplies (Narcan or Fentanyl Testing kits) are available for pick-up at the following locations:\nHealth Promotion & Wellness office\nEducation & Referral Organization on Sexuality (EROS)\nStudent Health Services\nWellness Vending Machine",
    "url": "https://wellness.sfsu.edu/wellness-map",
    "domain": "wellness.sfsu.edu"
  }
]