[
  {
    "source": "https://ethnicstudies.sfsu.edu/",
    "category": "general",
    "title": "College of Ethnic Studies | San Francisco State University",
    "content": "Welcome to the College of Ethnic Studies\nEstablished in Fall 1969, the College of Ethnic Studies grew from the 1968 Black Student Union/Third World Liberation Front Student Strike through the a coalition of faculty-scholars, student-activists and community members. The college consists of five departments: Asian American Studies, Africana Studies, Latina/Latino Studies, American Indian Studies and Race and Resistance Studies.\nWe pride ourselves on offering transformative degrees and programs that resonate with students’ present-day issues.\nThe College is founded on these principles of community-based research and teaching, student leadership, and activism. The College continues to be guided by these values in its journey towards liberation via self-determination and collectivism.  Our community is transnational, multi-generational and fluid, and is inclusive of emerging racial, ethnic, sexuality, gender, class, ability and other identities as expressed through myriad academic disciplines in liberation studies and beyond.\nEthnic Studies Diverse Opportunities\n6000+\nStudents\n350\nCourses\n20\nDegrees\nExplore Our College Departments\nStudies show that taking courses in the College of Ethnic Studies raises graduation and retention rates, both for students who are majors/minors as well as for those from other disciplines who take the college’s classes.\nAfricana Studies\nAmerican Indian Studies\nAsian American Studies\nLatina/Latino Studies\nRace/Resistance Studies\nSupport Ethnic Studies Growth\nSupport Ethnic Studies\nDonations also allow our departments to host public lectures and forums to create a larger education platform that amplifies national, international perspectives to enabling student success.\nLearn More: Support\nScholarships\nThe college works to make education affordable by offering funding and scholarship opportunities, in addition to the need-based financial aid offered by the University.\nLearn More: Scholarships\nREJ Project\nThe Race, Empowerment, and Justice (REJ) Project at San Francisco State University supports faculty development in the College of Ethnic Studies in teaching, research, and creative projects.\nLearn More: REJ\nAnnouncements\nNews\nSFSU names Cassie Miura the Takahashi Distinguished Chair in Nikkei Studies\nMiura will focus on advancing awareness, understanding and appreciation of Japanese American experiences\nSAN FRANCISCO — Jun…\nNew faculty bring diverse expertise to the College of Ethnic Studies\nWe are thrilled to announce the arrival of three tenure-track faculty members who will be joining our esteemed academic comm…\nSFSU celebrates new Pacific Islander student support program with launch event\nSFSU community members and speakers gathered in the Cesar Chavez Student Center to celebrate the launch of the Oceania Schol…\nMore News\nEvents\nOct\n08\nCoES Graduate Programs Open House, MA in Ethnic Studies & MA Asian American Program\nWed, October 08, 01:30 pm\nEP 116/ Hybrid\nMore Upcoming Events",
    "url": "https://ethnicstudies.sfsu.edu/",
    "domain": "ethnicstudies.sfsu.edu"
  },
  {
    "source": "https://ethnicstudies.sfsu.edu/55th-anniversary-1968-student-strike",
    "category": "general",
    "title": "55th Anniversary of the 1968 Student Strike | College of Ethnic Studies",
    "content": "55th Anniversary of the 1968 Student Strike\nJoin the College of Ethnic Studies as we commemorate the 1968 SFSU Student Strike with sponsored and supporting events surrounding student activism, art, and politics.\nContact Dr. Tiffany Caesar, Commemoration Chair, for more information.\nTiffany Caesar\nCommemoration Chair\ntiffanycaesar@sfsu.edu\n1968 SFSU Student Strike 55th Commemoration Events and Programs",
    "url": "https://ethnicstudies.sfsu.edu/55th-anniversary-1968-student-strike",
    "domain": "ethnicstudies.sfsu.edu"
  },
  {
    "source": "https://ethnicstudies.sfsu.edu/contact-us",
    "category": "general",
    "title": "Contact Us | College of Ethnic Studies",
    "content": "Contact Us\nAdministrative Office\nAddress:\nEthnic Studies & Psychology, Room 103\nMain Office Phone:\n(415) 338-1054\nMailing Address:\nCollege of Ethnic Studies\n1600 Holloway Avenue\nSan Francisco, CA 94132-4100\nDean's Office\nLocation:\nEthnic Studies & Psychology, Room 121\nPhone:\n(415) 338-1693\nFax:\n(415) 338-1739\nEmail:\nethnicst@sfsu.edu\nDepartment Contacts\nContact List for Departments and Studies Programs\nDepartment\nTitle, Name, Email\nMain Office Phone\nAfricana Studies\nDepartment Chair: Abul Pitre\nEmail:\napitre@sfsu.edu\nAcademic Office Coordinator: Madeline Flamer\nEmail:\nmadeline@sfsu.edu\n(415) 338-2352\nAsian American Studies\nDepartment Chair: Wesley Ueunten\nEmail:\nwesueu@sfsu.edu\nAcademic Office Coordinator: Becky Mou\nEmail:\nsprite@sfsu.edu\n(415) 338-2698\nAmerican Indian Studies\nDepartment Chair: Joanne Barker\nEmail:\njmbarker@sfsu.edu\nAcademic Office Coordinator: Gabriela Segovia-McGahan\nEmail:\ngsegovia@sfsu.edu\n(415) 405-3928\nLatina/Latino Studies\nDepartment Chair: Katynka Martinez\nEmail:\nkatynka@sfsu.edu\nAcademic Office Coordinator: Gabriela Segovia-McGahan\nEmail:\ngsegovia@sfsu.edu\n(415) 338-6160\nRace & Resistance Studies\nDepartment Chair: Falu Bakrania\nEmail:\nbakrania@sfsu.edu\nAcademic Office Coordinator: Gautam Baksi\nEmail:\ngautam@sfsu.edu\n(415) 338-1693",
    "url": "https://ethnicstudies.sfsu.edu/contact-us",
    "domain": "ethnicstudies.sfsu.edu"
  },
  {
    "source": "https://ethnicstudies.sfsu.edu/transfer-students",
    "category": "general",
    "title": "Transfer Students | College of Ethnic Studies",
    "content": "Transfer Students\nThe College of Ethnic Studies is proud to partner with California Community Colleges to create pathways for Transfer Students to get their Bachelor's Degrees at San Francisco State University. All of the majors in the College of Ethnic Studies are forty units or less. This means that all transfer students can complete their degrees within two-years, with some careful selection of classes.\nUse one of our Roadmaps to help you plan your schedule for the next two years.\nTransfer Students with AD-T? (Associate's Degree for Transfer, usually an AA-T in Social Justice)\nTransfer Students with 60 units California Community College  (no AD-T)\nResources for Transfer Students:\nSFSU Welcome Transfers!\nTransfer Student Survey\nTransfer Students in their own Words\n(video)\nFrequently Asked Questions\nTransfer Students with AD-T?\nAll of our major programs are compact! Depending on what courses you completed before transferring, you may already have completed some requirements for the Major.\nIf you took courses at your transfer institution--in African American Studies, Black Studies, Chicana/o Studies, La Raza Studies, Latina/o Studies, Asian American Studies, American Indian Studies, Critical Pacific Islands & Oceania Studies, or Ethnic Studies--you may already have completed some lower-division requirements for your major!  Contact the Ethnic Studies Advising Center and request a transfer transcript evaluation to see if you have already met your Intro courses and lower division humanities and social science requirements for the major. All five major programs have articulation agreements with California Community Colleges.\nTransfer Roadmap for BA in Africana Studies\nTransfer Roadmap for BA in American Indian Studies\nTransfer Roadmap for BA in Asian American Studies\nTransfer Roadmap for BA in Latina/Latino Studies\nTransfer Roadmap for BA in Race and Resistance Studies",
    "url": "https://ethnicstudies.sfsu.edu/transfer-students",
    "domain": "ethnicstudies.sfsu.edu"
  },
  {
    "source": "https://ethnicstudies.sfsu.edu/student-travel-award",
    "category": "general",
    "title": "Student Travel Award | College of Ethnic Studies",
    "content": "Student Travel Award\nStudent Travel Award 2025 - 2026 AY\nConference must take place between\nAugust 20, 2025 and August 18, 2026\nApplications must include:\nStatement on how participation will enhance educational goals\nEvidence of participation from the conference/ meeting organizer\nA day-by-day travel agenda/itinerary\nApplication is open to:\nAll majors, minors, and master’s students in the College of Ethnic Studies who are currently enrolled at SF State and will be actively participating at a conference/meeting are eligible to apply.\nFor all Travelers:\nMust be enrolled at SF State.\nMust actively participate in the conference/meeting.\nStudent Travel Award application must be fully approved before making financial commitments.\nA day-by-day travel agenda/itinerary must be attached to the application and travel report.\nGround transportation tips are reimbursable up to 20%.\nCar rental and mileage are not reimbursable unless employed by the University and meet Driver Safety Program requirements.\nNo per diem or lodging reimbursement for conferences within 25 miles of SF State or home.\nPer diem will be reimbursed on actuals up to the maximum allowable rate per day.\nMust complete within 2 weeks of returning from the trip:\nSend itemized travel receipts and a brief evaluation of the conference to Marlena Jung at\nmjung1@sfsu.edu\n.\nCreate an Instagram post (as a png or jpeg) about your experience and send it to Ty Maniulit at\ntymaniulit@sfsu.edu\n.\nDomestic Travel:\nDomestic travel is travel within the 50 United States and U.S. Territories and Possessions\nLodging costs are capped at $333.00/night plus the required taxes and fees\nCompleted Student Travel Award application must be submitted to the Dean’s Office at least 5 weeks in advance of travel\nInternational Travel:\nInternational travel is travel that is not within the 50 United States and U.S. Territories and Possessions\nMaximum lodging rates for international travel vary by destination and are determined by the U.S. Department of State\nCompleted Student Travel Award application must be submitted to the Dean’s Office at least 8 weeks in advance of the travel\nGrants cover up to $500 for domestic and international conference travel expenses, including flights, hotels, registration, and daily costs, per CSU Travel Policy.\nEach application will be carefully reviewed and considered. Submission of an application does not guarantee that funding will be granted.\nPlease use this\nlink\nif you are interested in applying.\nIf you have any questions, please reach out to:\nStudent Travel Award application questions:\nTy Maniulit,\ntymaniulit@sfsu.edu\nTravel questions:\nMarlena Jung,\nmjung1@sfsu.edu",
    "url": "https://ethnicstudies.sfsu.edu/student-travel-award",
    "domain": "ethnicstudies.sfsu.edu"
  },
  {
    "source": "https://ethnicstudies.sfsu.edu/latinalatino-studies",
    "category": "general",
    "title": "Latina/Latino Studies | College of Ethnic Studies",
    "content": "Latina/Latino Studies\nLatina/Latino Studies Website\nThe Latina/Latino Studies Department is grounded in an anti-colonial perspective. We take into account the annexation of what is today considered the Southwest, the racialization of Latinas/os/x and the ongoing imperial expansionism that has resulted in Latin American and Caribbean migration to the United States.\nThe Department recognizes the historical resistance of Latinas/os/x and affirms ongoing struggles of self-determination that account for gender, sexuality, race, class, and the actual or perceived citizenship or immigration status of our students, their family members and other members of our Latina/o/x community.\nDegree Options\nBachelor’s Degree\nThe curriculum is committed to community service and empowerment and social justice. Students are encouraged to connect their classroom education to internship opportunities at legal services agencies, bilingual newspapers, health clinics, art galleries and more! Students become equipped with a unique body of knowledge and leadership skills to make a difference in their own lives, for Latina/o/x communities and society at large. Our graduates are socially conscious, critically astute and community-minded; they have the skills to create positive change wherever they go.\nBachelor’s Degree - Latino Studies\nMinor\nAn excellent opportunity to amplify your education by integrating the histories and experiences of the fastest-growing ethnic group in the U.S. With an LTNS minor, graduates are well-prepared to pursue careers in various professions, and they have the cultural competency to serve Latina/Latino/Latinx communities.\nMinor LTNS\nCombined B.A. & M.A. Degree\nThe Ethnic Studies SF State Scholar Program is a great opportunity for motivated students majoring in Latina/Latino Studies. The Master of Arts in Ethnic Studies is designed to be a versatile degree that provides a solid foundation for careers teaching at community colleges, working in community and multicultural resource development, administrative work in the non-profit sector, employment in student resource centers, practical application in the business fields and much more!\nB.A. & M.A. Degree",
    "url": "https://ethnicstudies.sfsu.edu/latinalatino-studies",
    "domain": "ethnicstudies.sfsu.edu"
  },
  {
    "source": "https://ethnicstudies.sfsu.edu/news-list",
    "category": "general",
    "title": "News Listing | College of Ethnic Studies",
    "content": "News Listing\nJune 17, 2025\nSFSU names Cassie Miura the Takahashi Distinguished Chair in Nikkei Studies\nMiura will focus on advancing awareness, understanding and appreciation of Japanese American experiences\nSAN FRANCISCO — Jun…\nOctober 15, 2024\nNew faculty bring diverse expertise to the College of Ethnic Studies\nWe are thrilled to announce the arrival of three tenure-track faculty members who will be joining our esteemed academic comm…\nOctober 10, 2024\nSFSU celebrates new Pacific Islander student support program with launch event\nSFSU community members and speakers gathered in the Cesar Chavez Student Center to celebrate the launch of the Oceania Schol…\nJuly 01, 2024\nThe Passing of Dr. Nathan Hare, “A Great One”\nFirst Day of Strike.\nTop right, Nathan Hare (middle) and Sharon Jones, Africana Studies lecturer (left).\nMay 17, 2024\nUniversity showcases highlight student research, creative activities\nThe campus-wide events highlight students’ contribution to SF State’s research community\nWith the end of the semester and Co…\nMay 07, 2024\nA dozen outstanding graduates to be honored at 2024 Commencement\nThe student hood recipients will represent their academic colleges at the University’s 123rd graduation ceremony May 24.\nA d…\nMay 01, 2024\nSF State establishes Henri and Tomoye Takahashi Distinguished Endowed Chair in Nikkei Studies with landmark gift\nHistoric $4.2M donation from the Henri and Tomoye Takahashi Charitable Foundation will advance awareness, understanding and…\nApril 23, 2024\nIn Memory of Catrióna Rueda Esquibel\nDr. Catrióna Rueda Esquibel passed away on February 8, 2024, from a hemorrhagic stroke. She was 58.\nDr. Esquibel served as t…\nJanuary 30, 2024\nSF State Asian American Studies professor receives prestigious CSU Wang Family Excellence Award\nAllyson Tintiangco-Cubales earns accolade for excellence in teaching, scholarship and service\nSan Francisco State University…\nNovember 14, 2023\nSF State launches comprehensive online archive of historic student strike\nAs social movements across the globe are more active than ever, San Francisco State University just upgraded its own archive…\nOctober 09, 2023\nSF State and the Mission Cultural Center for Latino Arts: partners in culture and resistance\nAgainst the odds, two San Francisco institutions have long collaborated on a grassroots level: San Francsico State Universit…\nSeptember 25, 2023\nJeung wins Healthy Neighborhoods Pillar Leadership Award\nAsian American Studies Professor Russell Jeung received a Healthy Neighborhoods Pillar Leadership award from the East Bay As…\nSeptember 18, 2023\nHow Anthropologist José Cuéllar Became Dr. Loco, the Last Pachuco\nKQED wrote an article on how anthropologist José Cuéllar, professor emeritus of Chicano studies at San Francisco State Unive…\nSeptember 14, 2023\nGator Juan Gonzales reflects on 50+ years of Mission community newspaper\nJuan Gonzales was honored at El Tecolote’s Golden Legacy Gala on Aug. 26 in San Francisco, which celebrated five decades of…",
    "url": "https://ethnicstudies.sfsu.edu/news-list",
    "domain": "ethnicstudies.sfsu.edu"
  },
  {
    "source": "https://ethnicstudies.sfsu.edu/ethnic-studies-graduate-certificate-program",
    "category": "general",
    "title": "Ethnic Studies Graduate Certificate Program | College of Ethnic Studies",
    "content": "Learn More: Graduate Certificate\nEthnic Studies Graduate Certificate Program\nBy enrolling in the Ethnic Studies Graduate Certificate Program you can gain the historical background and critical skills necessary to engage in the process of making your workplace more equitable and anti-racist. Coursework and a culminating experience project will provide a foundation in understanding the contemporary realities of communities of color, the origins of inequality, the struggles for equity, and solidify a commitment to social justice that you can take to your professional field.\nCertificate Overview\nProgram Courses\nTake one core course, two additional courses of your choosing, and enroll in a culminating experience to earn your certificate. Your newly earned specialty may enhance your professional career in education, public health, social work, nursing, non-profit management, and business.\nCertificate Courses\nCourse Name\nField of Study\nUnits\nETHS 710\nTheories and Issues in Ethnic Studies\n3\nETHS 750\nEthnic Studies Community Practicum\n3\nSelect two from the following\nAny one course from AAS that is upper division or graduate level\nAny one course from AFRS that is upper division or graduate level\nAny one course from AIS that is upper division or graduate level\nAny one course from LTNS that is upper division or graduate level\nAny one course from RRS that is upper division or graduate level\nAny one course from ETHS that is upper division or graduate level\n(note: upper division courses are those numbered 300 and above)\n6\nLearn More: Academic Bulletin\nApplication Guidelines for current MA students already enrolled in an SF State graduate program\nApplication materials include:\nStatement of purpose that describes your background in Ethnic Studies and identifies the community-based agency, school, or organization where you will be completing the Community Practicum\nTwo letters of recommendation\nTranscripts\nApplicants who are already enrolled in an SF State graduate program can apply to the certificate program by sending application materials directly to the College of Ethnic Studies at\nethnicst@sfsu.edu\n. Statement of purpose must include your SFSU ID, name of your graduate program, and name of your advisor in the graduate program. Current SF State students accepted into the certificate program should consult with their advisor immediately to find out how best to sequence their coursework to satisfy both home department requirements and certificate requirements.\nAcceptance into the program is with the approval of the certificate program coordinator and consent of the admissions committee following the review of the application materials listed above.\nApplication deadline for Fall admission: February 1\nApplication Guidelines for K-12 teachers\nSend the following application materials to\nethnicst@sfsu.edu\n:\nStatement of purpose that describes your background in Ethnic Studies and identifies the community-based agency, school, or organization where you will be completing the Community Practicum\nTwo letters of recommendation\nTranscripts\nApplicants who are K-12 teachers may apply through the College of Professional & Global Education by following the steps outlined on the\nTeacher Training in Ethnic Studies\npage.\nAcceptance into the program is with the approval of the certificate program coordinator and consent of the admissions committee following the review of the application materials listed above.\nApplication Guidelines for all other applicants\nSend the following application materials to\nethnicst@sfsu.edu\n:\nStatement of purpose that describes your background in Ethnic Studies and identifies the community-based agency, school, or organization where you will be completing the Community Practicum\nTwo letters of recommendation\nTranscripts\nApplicants must hold a Bachelor's degree.\nApplicants may apply through the\nCollege of Professional and Global Education\n.\nAcceptance into the program is with the approval of the certificate program coordinator and consent of the admissions committee following the review of the application materials listed above.\nApplication deadline for Fall admission: February 1\nApplication Deadlines\nApplication deadline for Fall admission: February 1\nSpecial Rate for for California K-12 Teachers\nK-12 Teachers in California are eligible for a special tuition rate from the College of Professional & Global Education scholarships. More information is available at\nEthnic Studies Certificate Teacher Training.\nThis special rate is not available for community college professors.\nMatriculated students and non K-12 CA teachers are not eligible for this special rate.\nTuition and Fees\nInformation on tuition and fees for currently matriculated SF State students is available on the\nDivision of Graduate Studies website\n(please see \"Master's Degree, Second Baccalaureate\" column).\nInformation on tuition and fees for all other students is available at the\nCollege of Professional and Global Education\n(click on \"Length and Costs\" tab).",
    "url": "https://ethnicstudies.sfsu.edu/ethnic-studies-graduate-certificate-program",
    "domain": "ethnicstudies.sfsu.edu"
  },
  {
    "source": "https://ethnicstudies.sfsu.edu/memoriam",
    "category": "general",
    "title": "In Memoriam | College of Ethnic Studies",
    "content": "In Memoriam\nIn our hearts forever\nAhlermann Vann\nAnantha Sudhakar\nAnatole Anton\nArt Carraway\nAug Malonga Casquelord\nBernard Hoehner \"Peji\"\nBevelyn Ann Moss\nBrenda Goodman\nCarol Lee Sanchez\nCarolina Borromeo\nCatrióna Rueda Esquibel\nClaire Sallop\nD. Phillip McGee\nDonna Nomura\nEd De La Cruz\nEdison Uno\nElmer Cooper\nEnola Maxwell\nFlournoy Coles\nFlorence Mae Davis\nFrances Oka\nFranklyn Brann\nFred Thalheimer\nGene Royale\nGeorge Price\nGordon De Marco\nHelen Toribio\nHerbert Williams\nHerbert Wilner\nIsidro Gali\nJames Dudley Yasuda\nJames Hirabyashi\nJames Todd\nJeff Chin\nJeff Freed\nJerry W. Varnado\nJesus Contreras\nJoanne Mitchell-Stringer\nJoe Bill\nJohn \"Tito\" Gerassi\nJohn Alcorn\nJohn Cleveland\nJohn Ihle\nJoseph White\nJuan Pifare\nJulian Richardson\nKathy Wallace\nKaye Boyle\nKhosoro Kalantari\nKurt Schneider\nLaura Head\nLeon Cathey\nLiz DeWitt Belcher\nLouie Kemnitzer\nMargaret Leahy\nMark Him Lai\nMary Lewis\nMary Rhodes Hoover\nMickey Kimmel\nMiguel Casuso\nDr. Nathan Hare\nNia Carol Cornwell\nPat Sumi\nPaula Gunn Allen\nPhilip Klasky\nPhilip Tingley\nPhillip P. Choy\nRandy Senzaki\nRebecca Rubi\nReginald Lockett\nReginald Majors \"Reggie\"\nReverend Arnold Townsend\nRich Bliss\nRichard Oakes\nRobert Prudhomme\nRoberto Rivera\nRochon Perry\nRon Bentley\nRoy Harrison\nSachiko Nakamura\nSid Welch\nSyed Khatib\nTed Murguia\nTerry Collins\nTim Sampson\nTom Gable\nTom Kim\nTomatra Scott\nVelia Garcia\nVernon Ketcheshawno\nWade \"Speedy\" Woods\nWilliam Dickey\nWoesha Cloud North",
    "url": "https://ethnicstudies.sfsu.edu/memoriam",
    "domain": "ethnicstudies.sfsu.edu"
  }
]