[
  {
    "source": "http://advising.sfsu.edu",
    "category": "general",
    "title": "Undergraduate Advising Center | San Francisco State University",
    "content": "Welcome!\nPlease visit us in ADM 203.\nUndergraduate Advising Center\nThe\nUndergraduate Advising Center (UAC)\nis the primary location for all undergraduate students seeking academic advising. We are committed to supporting you and meeting your advising needs. We encourage you to meet with us to support your overall transition, wellness, and success at SF State. Some of the common services we provide include, degree planning, choosing/registering for classes, major exploration, academic success strategies, and policy clarification and appeals. We support students both virtually and in-person through advising appointments and drop-in. For more information see below.\nAcademic Advising Appointments\nAppointments are available in-person and virtually.\n\"Learn how to schedule an advising appointment\"\nTo schedule an appointment, please click the button below or go to\nhttps://sfsu.campus.eab.com/\nWe are unable to schedule same-day appointments. For urgent circumstances, please refer to our (same-day) academic advising drop-in hours.\nSchedule an Appointment\nAcademic Advising Drop-In Hours\nDrop-ins are for \"quick questions\" that can be answered in 15 minutes or less. We see students on a first come, first serve basis during the drop-in hours posted below.\nPlease note the following:\nThe 1st & 2nd and Undeclared Advising Team\ndo not\noffer virtual drop-ins. Please refer to our in-person drop-ins.\nThe College of Ethnic Studies and the Graduate College of Education advising teams\ndo not\noffer drop-in advising, but they may take same-day appointments upon availability. Check with our front desk to inquire about a same day appointment.\nIn-Person Drop-Ins\nMonday through Friday\n10am - 12pm and 2pm - 4pm\n* Last intake for check-in will be 11:45am and 3:45pm\nLocation: ADM 203\nVirtual Drop-Ins\nMonday through Friday\n10am - 12pm and 2pm - 4pm\n* Last intake for check-in will be 11:45am and 3:45pm\nVirtual (Zoom) Drop-In Link\nI am a...\nProspective Student\nNew Incoming Student\nFormer Student Seeking Readmission\nWe look forward to connecting with you!\nUndergraduate Advising Center\nAdministration Building, Room 203\n(415) 338 – 2101\nOffice Hours: Monday through Friday from 8:30am – 4:30pm\nPhone Hours: Monday through Friday from 8:30am – 4:30pm",
    "url": "http://advising.sfsu.edu",
    "domain": "advising.sfsu.edu"
  },
  {
    "source": "http://advising.sfsu.edu/frequently-asked-questions",
    "category": "general",
    "title": "Frequently Asked Questions | Undergraduate Advising Center",
    "content": "Frequently Asked Questions\nHave a question?  We can help.  These are some commonly asked questions and some of the things to consider.  If you need more assistance, feel free to reach out to your advisor.\nWhere should I go for advising?\nCampus Advising Centers\nFirst-year freshmen\nContact your assigned counselor in the UAC.\nUndeclared students\nContact your assigned counselor in the UAC.\nChanging your major or Special Major\nCall the UAC front desk to schedule an appointment.\nSophomores, juniors, seniors\nContact:\nassociated with your major for general advising and/or your faculty advisor for major advising (refer to your\ndepartment website\nfor contact information). <---- ?\nReturning students\nIf you plan to return to SF State after being out of attendance a year or more, call the UAC’s Virtual Front Desk to schedule a Readmission appointment.\nHow do first-year freshmen and undeclared students find out who their assigned advisor is in the UAC?\nRefer to your SF State email account to find messages from your assigned counselor in the UAC with instructions on how to connect with them throughout the year.\nHow many units should I take?\nFull-time status is 12 units but if your goal is to graduate in 4 years, plan to complete at least 30 units each year. For example, some students take 15 units in the fall semester and 15 units in the spring semester so they earn 30 units by the end of their first year at SF State.\nHow do I balance college with the rest of my priorities?\nPrioritize the things that are important and be realistic about your time. A full-time schedule (12 units) requires you to set aside at least 40 hours per week for class and study time. Students with part-time jobs generally do not work more than 20 hours per week if they are attending college full-time.\nWhere can I find more information about SF State majors?\nThe\n1\nst\nSemester Recommendations by Major\non the Advising Hub is a good starting place for your research about majors at SF State. Each page includes FAQs and links to degree requirements/roadmaps in the University Bulletin and the major department website.\nWhen should I declare my major?\nOnce you decide on a major, it is best to declare as soon as possible. For non-impacted majors, you can declare at any time. Impacted majors may have deadlines so you should connect with the major department for information about their declaration process (refer to the\ndepartment website\nfor contact information).\nWhat is an impacted major and how do I know if a major is impacted?\nWhen a major is impacted, it means that more students than can be accommodated want to declare the major. Students have to apply and be accepted into impacted majors so if you are interested, you should connect with the major department for information about how to declare (refer to the\ndepartment website\nfor contact information). For a list of impacted majors, refer to\nfuture.sfsu.edu/impaction\n.\nWhere can I find information about careers that are associated with my major of interest?\nThe\nCareer Services and Leadership Development\noffice and their team of career counselors offer individualized career counseling, workshops, events, and more. This is an excellent campus resource for all undeclared students to connect with during their first semester and beyond.\nWhat courses should I take if I am undeclared and have no majors in mind?\nDuring your first year, taking lower division (courses numbered 100-299)\nGeneral Education\ncourses are a great way to explore potential majors and choosing courses from a variety of different GE areas can help create a more balanced schedule.  Try to identify GE courses from departments you might be interested in.\nWhat do I take if I have a major in mind?\nTo explore a major, it may be possible to take introductory major courses or prerequisites for the major.  Refer to the\n1\nst\nSemester Recommendations by Major\non the Advising Hub for course recommendations from the major department.  You can take an introductory major class for a few majors if you have more than one in mind as long as you meet prerequisites.\nCan I use GE requirements to satisfy major/minor requirements?\nYou can use courses to meet multiple requirements (i.e. GE and major), however, units for the course will only be counted once.\nWhat is a minor and how can I add one?\nA minor is a focused area of study that does not require as many units as a major and is generally between 12-24 units. To add a minor, connect with the minor department to learn about their declaration process and timeline (refer to the\ndepartment website\nfor contact information).\nCan I double major?\nIt may be possible for students to complete two majors if they can complete both degrees without exceeding 120 units. You will need to connect with the departments of both majors for approval (refer to the\ndepartment website\nfor contact information).\nWhat is a special major?\nThe Bachelor of Arts: Special Major is an interdisciplinary program offered by San Francisco State University for students who have unique and well-defined academic goals which cannot be satisfactorily attained through one of the undergraduate major programs at SF State or with a major and minor combination.\nLearn more about the special major!",
    "url": "http://advising.sfsu.edu/frequently-asked-questions",
    "domain": "advising.sfsu.edu"
  },
  {
    "source": "http://advising.sfsu.edu/",
    "category": "general",
    "title": "Undergraduate Advising Center | San Francisco State University",
    "content": "Welcome!\nPlease visit us in ADM 203.\nUndergraduate Advising Center\nThe\nUndergraduate Advising Center (UAC)\nis the primary location for all undergraduate students seeking academic advising. We are committed to supporting you and meeting your advising needs. We encourage you to meet with us to support your overall transition, wellness, and success at SF State. Some of the common services we provide include, degree planning, choosing/registering for classes, major exploration, academic success strategies, and policy clarification and appeals. We support students both virtually and in-person through advising appointments and drop-in. For more information see below.\nAcademic Advising Appointments\nAppointments are available in-person and virtually.\n\"Learn how to schedule an advising appointment\"\nTo schedule an appointment, please click the button below or go to\nhttps://sfsu.campus.eab.com/\nWe are unable to schedule same-day appointments. For urgent circumstances, please refer to our (same-day) academic advising drop-in hours.\nSchedule an Appointment\nAcademic Advising Drop-In Hours\nDrop-ins are for \"quick questions\" that can be answered in 15 minutes or less. We see students on a first come, first serve basis during the drop-in hours posted below.\nPlease note the following:\nThe 1st & 2nd and Undeclared Advising Team\ndo not\noffer virtual drop-ins. Please refer to our in-person drop-ins.\nThe College of Ethnic Studies and the Graduate College of Education advising teams\ndo not\noffer drop-in advising, but they may take same-day appointments upon availability. Check with our front desk to inquire about a same day appointment.\nIn-Person Drop-Ins\nMonday through Friday\n10am - 12pm and 2pm - 4pm\n* Last intake for check-in will be 11:45am and 3:45pm\nLocation: ADM 203\nVirtual Drop-Ins\nMonday through Friday\n10am - 12pm and 2pm - 4pm\n* Last intake for check-in will be 11:45am and 3:45pm\nVirtual (Zoom) Drop-In Link\nI am a...\nProspective Student\nNew Incoming Student\nFormer Student Seeking Readmission\nWe look forward to connecting with you!\nUndergraduate Advising Center\nAdministration Building, Room 203\n(415) 338 – 2101\nOffice Hours: Monday through Friday from 8:30am – 4:30pm\nPhone Hours: Monday through Friday from 8:30am – 4:30pm",
    "url": "http://advising.sfsu.edu/",
    "domain": "advising.sfsu.edu"
  },
  {
    "source": "https://advising.sfsu.edu/returning-students-advising",
    "category": "general",
    "title": "Returning Students Advising Support | Undergraduate Advising Center",
    "content": "Returning Students Advising Support\nWe are looking forward to welcoming you back to SF State!\nPlease complete the form below if you have been away from SF State for\ntwo or more semesters\n, and are now seeking advising support for one or more of the following:\nReadmission to SF State to continue making degree progress\nImproving your academic standing and GPA to be eligible for readmission\nApplying for graduation\nOnce you submit the form, an advisor will reach out to you in 3-5 business days. Please be sure to check your junk/spam email as well. If you have not received an email from an advisor after 5 business days, please do not resubmit the form, instead you can follow up with the front desk at (415) 338-2101 to confirm that your contact information was submitted correctly.\nFor more information on admissions dates and deadlines for returning students, please visit the\nFuture Students\nwebpage.",
    "url": "https://advising.sfsu.edu/returning-students-advising",
    "domain": "advising.sfsu.edu"
  }
]