[
  {
    "source": "https://research.sfsu.edu/",
    "category": "general",
    "title": "Office of Research & Sponsored Programs | SF State",
    "content": "Office of Research and Sponsored Programs\nOffice of Research & Sponsored Programs\nORSP helps to create a dynamic, engaging and vibrant environment for SF State faculty and students. By providing support and infrastructure, ORSP gives faculty and students the opportunity to engage in life changing programs that  have an impact both individually and to the broader community.\nI WANT TO...\nNews\nSF State Create\nSF State Create is a new initiative designed to centralize students’ opportunities to participate in research, scholarship a…\nLimited Submission: Recordings at Risk\nORSP invites proposals to a limited submission opportunity. One proposal will be selected to move forward to submission to t…\nORSP Affinity Group Catalyst Grants 2025–26\nThe Office of Research and Sponsored Programs (ORSP) Affinity Group Catalyst Grants program supports the creation and develo…\nMore News",
    "url": "https://research.sfsu.edu/",
    "domain": "research.sfsu.edu"
  },
  {
    "source": "https://research.sfsu.edu/news-list",
    "category": "general",
    "title": "News Listing | Office of Research and Sponsored Programs",
    "content": "News Listing\nFebruary 20, 2025\nLimited Submission: Recordings at Risk\nORSP invites proposals to a limited submission opportunity. One proposal will be selected to move forward to submission to t…\nFebruary 11, 2025\nORSP Affinity Group Catalyst Grants 2025–26\nThe Office of Research and Sponsored Programs (ORSP) Affinity Group Catalyst Grants program supports the creation and develo…\nFebruary 11, 2025\nInstitutional Review Board Updates\nFollowing are highlights of institutional review board (IRB) updates. For full details, see the spring 2025 updates document…\nFebruary 10, 2025\nORSP Small Grants 2025–26\nThe Office of Research and Sponsored Programs (ORSP) Small Grants program supports new or ongoing research projects and scho…\nJanuary 15, 2025\nFederal Funding Updates\nIn January 2025, the White House began issuing executive orders, memos and agency guidance, including some impacting federal…\nDecember 19, 2023\n2023–24 RSCA Fund Competition Awardees\nCongratulations to the 2023–24 RSCA Fund Competition awardees!\n· Scott Boswell: Bloodroot: AI & Independent Filmmaking\n·…\nDecember 12, 2022\nORSP Launches Grants Management System\nThe Office of Research and Sponsored Programs has implemented a grants management system to streamline and manage the propos…\nOctober 21, 2022\nNIH Diversity Training Program\nNational Institutes of Health’s National Heart, Lung, and Blood Institute’s T32 Training Program for Institutions That Promo…\nOctober 21, 2022\nNew Awards - September 2022\nSF State received $6,038,004 in grants and contracts in September 2022.\nDaniel Bernardi, Cinema / Veteran Documentary Corp…\nSeptember 28, 2022\nGrants and Contracts - July 2022\nSF State received $562,584 in grants and contracts in July 2022.\nBlake Riggs, Biology, American Society for Cell Biology,…\nSeptember 28, 2022\nGrants & Contracts – August 2022\nSF State received $3,148,573 in grants and contracts in August 2022.\nCharli Sakari, Physics and Astronomy, National Scienc…\nAugust 30, 2022\n2022-23 SF State Research, Scholarly and Creative Activity (RSCA) Fund Competition\nKey Dates\n· Submission Deadline: Monday, October 10th, 2022 at 9:00 AM (no exceptions)\n· Anticipated Announcement of Funded…\nJune 22, 2022\nNSF Mid-Career Advancement (MCA) Funding Opportunity\nSubmission Window Date(s) (due by 5 p.m. submitter's local time):\nFebruary 01, 2023 - March 01, 2023\nFebruary 1 - March 1, A…\nJune 16, 2022\nINFORMATION WEBINAR: FY 2023 Funding Opportunity Announcement for DoD's Research and Education Program for HBCUs/MIs - June 23, 2022, 1:00-2:30 PM Eastern Time\nYou are invited to join us for an information webinar to discuss the FY 2023 Funding Opportunity Announcement For DoD's Rese…\nJune 09, 2022\nThe California Alliance for Hispanic-Serving Social Science Advancement (CAHSSA) -  MENTORED WRITING GROUPS\n(Faculty members who have attended three virtual CAHSSA webinars are eligible to apply to participate in a mentored proposal…\nJune 03, 2022\nThe CSU Systemwide Virtual IT-Cybersecurity Roundtable on June 17th, 2022 from 10:00 a.m.-1:00 p.m.\nDear California Cybersecurity Education and Industry Colleagues,\nCurrent cybersecurity employment data indicates 63,087 avai…\nMay 31, 2022\nNew Funding Opportunity Announcement: Community-Driven Approaches to Address Factors Contributing to Structural Racism in Public Health\nThe Office of Minority Health (OMH) at the U.S. Department of Health and Human Services administers grant programs to suppor…\nMay 25, 2022\nNASA Office of STEM Engagement Opportunity for Minority-Serving Institution STEM and/or Education Faculty/Staff\nThird Pre-Submission Webinar is Scheduled for Thursday, June 2nd, 2022  at 5:00 pm - 6:30 pm Eastern Time\nPre-Registration L…\nMay 20, 2022\nBecome a Peer Reviewer for Department of Education\nThe U.S. Department of Education (Department) announces opportunities for individuals to participate in its peer review proc…\nMay 05, 2022\n36th Annual CSU Student Research Competition Winners\nSession 1: Behavioral, Social Sciences and Public Administration - Graduate #1\n1st Place: Eric Pennino, California State Uni…\nApril 22, 2022\nSFSU hosts 36th Annual California State University Student Research Competition April 29-30, 2022\nSan Francisco State University will be hosting the 36th Annual California State University Student Research Competition virt…\nApril 11, 2022\niMERS Grant Writing Workshop SJSU: May 17 and 18, from 10:00 a.m to 5:00 p.m\nThe Office of Research at SJSU is pleased to announce that we are hosting a free two-day Interactive Mentoring to Enhance Re…\nApril 11, 2022\nGrant Writing for Early Career Scientists: April 12, 2022 2:00-3:00 pm EDT (11:00 am-12:00 pm PDT)\nApril 12, 2022\n2:00-3:00 pm EDT (11:00 am-12:00 pm PDT)\nThe grant writing and review process can feel daunting and difficult…\nMarch 08, 2022\nRacial Inequities in NIH Grant Funding - March 10, 1:30 to 2:30 p.m. CST\nMichael Taffe, Ph.D., will present “Racial Inequities in NIH Grant Funding” from 1:30 to 2:30 p.m. CST on Thursday, March 10…\nFebruary 10, 2022\nICYMI: Final reminder to register for FREE Feb 18 webinar (Funding Strategies for Social Scientists at HSIs)\nFunding Strategies for Social Scientists at HSIs\nFebruary 18, 2022, 10:00 A.M. – 12:00 P.M.\nPresenters:\nHolly M. Hapke, P…\nJanuary 20, 2022\nHAP Office Updates for Spring Semester 2022\nHAP Office Hours remain virtual\nDue to the hybrid nature of this semester, HAP Office Hours will remain virtual. Have ques…\nMarch 02, 2021\nRestarting Research, Scholarship, and Creative Activities at SF State Application\nWith the help of the University Research Council and the University COVID-19 Budget and Logistics Committee, we have been wo…\nMarch 02, 2021\nCOVID-19 Guidance for Research and Sponsored Programs (11.06.2020)\nSF State’s Office of Research and Sponsored Programs co…\nMarch 02, 2021\nCSU System Wide Grant Writing Peer Group Pilot Program\nYou are invited to join the CSU Systemwide Grant Writing Peer Group Pilot Program if you meet all of the following criteria:…\nMarch 01, 2021\nBuild and Broaden 2.0: Enhancing Social, Behavioral and Economic Science Research and Capacity at Minority-Serving Institutions\nWhat:\nThe goal of the SBE B2 2.0 funding opportunity is to encourage submission of proposals from MSIs, and partnerships wi…\nLimited Submission: New Directions Fellowship Program\nORSP invites proposals to a limited submission opportunity. One proposal will be selected to move forward to submission…\n2024–25 RSCA Fund Competition Awardees\nCongratulations to the 2024–25 RSCA Fund Competition awardees!\nCristina Azocar: Indigenous Peoples and the Media\nJennifer B…\nSPIN for SFSU Students\nSF State students can now access the SPIN database to search for research grants, fellowships and other funding opportunitie…\nNew NSF PAPPG has been issued effective May 20, 2024\nThe National Science Foundation (NSF) has announced the issuance of the revised Proposal and Award Policies and Procedures G…\nSF State Research, Scholarship and Creative Activities Fund Competition 2024–25\nKey Dates\nSubmission Deadline: Friday, March 15, 2024, at 5 p.m.\nAnticipated Announcement of Awards: May 2024\nAnticipated S…\nSF State Create\nSF State Create is a new initiative designed to centralize students’ opportunities to participate in research, scholarship a…\nSF State Research, Scholarship and Creative Activities Fund Competition 2023–24\nKey Dates\n· Submission Deadline: Tuesday, Oct. 10, 2023, at 9 a.m.\n· Anticipated Announcement of Awards: December 2023\n· Ant…\nORSP’s Qualtrics PI Checklist no longer available by February 1, 2023\nStarting February 1, 2023, the Qualtrics PI Checklist will no longer be used for managing grants within the ORSP office. In…\nChan Zuckerberg Initiative Science Diversity Leadership Award\nSeeking Applications: Science Diversity Leadership Program\nApplications DUE May 19, 2022 by 5p.m. Eastern Time\nThe Chan Zuck…\nNIH Support for Research Excellence (SuRE) Program Grant Workshop - February 18, 2022\nThe SuRE program supports research capacity building at institutions that enroll significant numbers of students from backgr…\nNational Endowment for the Arts Research Awards  guidelines now available\nGuidelines are now available for two funding programs offered through the National Endowment for the Arts' Office of Researc…\nHumanities For All Quick Grant Winter Application Webinar - January 19, 2022\nHumanities for All Quick Grant WebinarWednesday, January 19, 202211 am PTRegister here\nQuick Grants (between $1,000 and $5,…\nThe California Alliance for Hispanic-Serving Social Science Advancement (CAHSSA) Faculty Research Networking and Grant Writing Opportunities\nThe California Alliance for Hispanic-Serving Social Science Advancement (CAHSSA) is pleased to announce the launch of new op…\nThe National Institutes of Health (NIH) UNITE Announces Listening Sessions to Discuss Racial & Ethnic Equity\nWhen: January 12, 2022 @12pm to 1:30pm ET\nPurpose:\nThe purpose of this Notice is to announce the UNITE Listening Sessions Se…\nThe NIH Grant Process: From Submission to Notice of Award (January 19, 2022 - 10:00 to 11:30am)\nJoin us as NIH experts walk through the path of a typical NIH R01 research grant from submission to summary statement to not…\nOctober 29th Holistic Health Series on Friday - Hardiness at work: Psychoneuroimmunological (PNI) buffers against stress reactions\nOctober 29th Hollistic Health Series - Hardiness at work: Psyconeuroimmunological (PIN) buffers against stress reactions\nDat…\nStrategies for Reviewing Grant Proposals Webcast - November 12, 2021  10:00 am – 12:00 pm\nStrategies for Reviewing Grant Proposals Webcast\nNovember 12, 2021  10:00 am – 12:00 pm\nParticipation in the review process…\nREGISTRATION OPEN for Webinar October 20th: Best Practices For Competitive Grant Applications: NIH Funding for Research & Career Development Activities\nREGISTRATION OPEN for Webinar October 20th: Best Practices For Competitive Grant Applications: NIH Funding for Research…\nNSF HSI National STEM Resource Hub: Semillas Mentored Grantsmanship Program Accepting Applications for 2022 Cohort\nNSF HSI National STEM Resource Hub is pleased to announce a call for applications for the 2022 Semillas Mentored Grantsmansh…\nORSP Fall 2021 Updates\nWelcome Back!\nORSP Office Schedule – ORSP is open and most staff are working on campus two days per week. If you need to me…\nNSF Dear Colleague Letter: Research to Improve STEM Teaching, Learning, and Workforce Development for Persons with Disabilities\nAugust 5, 2021\nDear Colleagues:\nWith this Dear Colleague Letter, the National Science Foundation's (NSF) Directorate for Edu…\nCalifornia Humanities: Second Round of Relief Grants–Application is Now Open!\nWe are pleased to launch a second round of the California Humanities Relief Grants to provide much-needed funds to the publi…\nUnited States Department of Education (USDE) Live Webcast for HSI-STEM program - Thursday, July 22nd, 2021\nThursday, July 22nd, 2021\nPresentation: 10:00 A.M. – 12:00 P.M.\n(Lobby opens 10 minutes prior to live session)\nTOPICS\n• Insi…\nTwo New NIH Funding Opportunities: SuRE & SuRE-First Support for Research Excellence (SuRE) Award (R16 Clinical Trial Not Allowed) (PAR-21-169)\nSuRE is a research capacity building program designed to develop and sustain research excellence in U.S. higher education in…\nLiving in Color: Promoting Health and Celebrating Culture Through Play - Maiya Lane Evans, MPH - Friday April 2, 2021 Time: 12-1PM\nHollistic Health Series on Friday\nCome join us as we share ways to stay healthy at home. Open to students, staff, faculty an…\nNSF IUSE Seeking Potential Reviewers\nThe Division of Undergraduate Education at the National Science Foundation is in the pr…\nWebcast: Tips for Writing Strong Grant Proposal Narratives January 29th\nWebcast: Tips for Writing Strong Grant Proposal Narratives\nPresented by Leslie Ponciano, Director of Research Opportunities,…\nRegister Now for “Demystifying NIH” Workshop To Be Held January 25\nWebcast: “Demystifying NIH” Workshop\nJanuary 25 12 to 1:30 PM EST\nWebcast: Registration Link\nZoom link will be sent after…\nHumanities Research Grants Available for Faculty and Staff at Hispanic-Serving Institutions\nWho: Awards support individuals pursuing scholarly research that is of value to humanities scholars, students, and/or gene…\nCOVID-19 Guidance for Research and Sponsored Programs (11.06.2020)\nSF State’s Office of Research and Sponsored Programs cont…\nNIH Grants 101 & Early Career Reviewer Program Webinar - April 14, 2021 at 2:00 PM\nApril 14, 2021 at 2:00 PM\nHosted by the NIH Center for Scientific Review (CSR)\nAttend this webinar to learn about navigating…\nRelease of The California Air Resources Board(CARB) Research Solicitation - April 8, 2021\nThe California Air Resources Board (CARB or Board) has released its fiscal year 2021-22 research solicitation. The projects…\nNEH Summer Stipends Webinar - Wednesday, April 14, 2021\nNEH staff will host a webinar describing the program, including eligibility, the application and nomination processes, and s…\nRestarting Research, Scholarship, and Creative Activities at SFSU Application\nWith the help of the University Research Council and the University COVID-19 Budget and Logistics Committee, we have been wo…\nTwo New NIH Funding Opportunities: SuRE & SuRE-First\nSuRE is a research capacity building program designed to develop and sustain research excellence in U.S. higher education in…\nLiving in Color: Promoting Health and Celebrating Culture Through Play - Maiya Lane Evans, MPH - Friday April 2, 2021 Time: 12-1PM\nHollistic Health Series on Friday\nCome join us as we share ways to stay healthy at home. Open to students, staff, faculty…\nWorkshop on Strategies for Effective Data Management and Sharing Hosted by NASEM\nApril 28, 2021: 11:00 AM - 4:00 PM ET\nApril 29, 2021: 11:00 AM - 3:45 PM ET\nThis is a two-day virtual workshop that will exp…\nCommunity-Based Research Webinar Hosted by NIH Scientific Review Committee\nDo you conduct community-based research? NIH's Center for Scientific Review (CSR) is hosting a webinar on the peer review of…",
    "url": "https://research.sfsu.edu/news-list",
    "domain": "research.sfsu.edu"
  }
]