[
  {
    "source": "https://campusmemo.sfsu.edu/november-21-2022",
    "category": "general",
    "title": "November 21, 2022 | CampusMemo",
    "content": "November 21, 2022\nNews & Announcements\nEnd of Year Celebration set for Dec. 15\nPresident Mahoney invites all staff and faculty to an End of Year Celebration recognizing all your hard work in 2022.\nWhen: 3 to 5 p.m., Thursday, Dec. 15\nWhere: Jack Adams Hall in the Cesar Chavez Student Center\nPlease\nRSVP via Qualtrics\nif you are planning on attending.\nThose coming to the celebration can bring donations to the University’s holiday toy drive. This year, toys collected will be donated to Oceanview, Merced, Ingleside (OMI) and Lakeview Holiday Toy Giveaway and Celebration, an annual event that brings in the joy of the holidays with food and activities for the entire family and provides youth of all ages in our surrounding community with holiday gifts. No gift is too small or too big. However, the Office of the President is requesting that toys donated are new, unwrapped and appropriate for children between the ages of 0 (infant) and 17 years old. Suggested donations: baby toys and supplies, dolls/action figures, stuffed animals, books, sports items, board games and puzzles, arts and crafts supplies, gift cards (for teens), or learning and sensory toys. For questions or concerns regarding the SF State toy drive, please contact\nicce@sfsu.edu\nor\npresident@sfsu.edu\n.\nCampus programs target food insecurity\nWith Thanksgiving on the way, many Americans are preparing for their most elaborate meal of the year. Unfortunately, many others are in no position to feast, and just staying one step ahead of hunger is a challenge. That’s why SF State wants to remind the University community of the many resources — including those offered by\nBasic Needs Initiatives\n,\nAssociated Students\n(AS) and other programs and organizations — available for students who may be short on food.\nCalFresh Help Clinic\nStudents can apply to the\nCalFresh program\n, which provides money each month for buying groceries. Those interested can meet with a\nCalFresh health assistant\nto learn more about the program and how to get started.\nAS Gator Groceries & Farmers Market\nIn partnership with the San Francisco-Marin Food Bank, Associated Students Gator Groceries provides students access to a box of free food every week. For details about operating hours and locations, visit the\nGator Groceries website\n. The best place to stay up to date with Gator Groceries and what food is being offered for the week is via\nthe AS Farmers Market & Gator Groceries Instagram page\n.\nCooking Classes\nHealth Promotion & Wellness\n(HPW) hosts hands-on cooking classes that provide students with the skills to make quick, healthy and budget-friendly meals and snacks. HPW also hosts cooking demonstrations that teach students how to prepare simple recipes using items from the weekly Gator Groceries boxes. Stay up to date on when these are happening through HPW’s\nevents and workshops page\nor through\nthe HPW Instagram page\n.\nEquity & Community Inclusion and Food Access\nThrough the Basic Needs Initiatives, the\nDivision of Equity & Community Inclusion\nstudent identity spaces below are now stocked with snacks and treats so that students can hold intercultural/intergroup dialogue while sharing foods that are meaningful and relevant to their cultures.\nAsian American & Pacific Islander Student Services, Village C, Room 141 (full kitchen available)\nBlack Unity Center, Village C, Room 142 (full kitchen available)\nDream Resource Center, Student Services Building, Room 206\nOffice of Diversity & Student Equity and Interfaith Programs, Student Services Building, Room 206\nLatinx Student Center, Village C, Room 140 (full kitchen available)\nAnd you can help, too! Through Wednesday, Nov. 23, the University will be collecting canned goods, non-perishables and hygiene items to support the Gator Groceries program. Donation boxes are available on the first floor of the Administration Building and the first floor of the Student Services Building.\nThe list of goods Gator Groceries hopes to receive can be viewed online\n. Questions? Contact\nbasicneeds@sfsu.edu\n.\nExhibition sheds light on environmental racism\nInspired by the Black Lives Matter movement, the Global Museum’s fall exhibition, Clearly Polluted: The Fight for Environmental Justice in the Bay Area, investigates environmental racism and its ongoing, disproportionate impact on BIPOC communities. The exhibit features photographs and oral history recordings with local activists and advocates conducted between February and April 2021. Participants include a Civil Rights icon, a documentary filmmaker, and grassroots advocates and educators who share their lived experiences and ongoing efforts for climate and social justice.\nClearly Polluted will be on view in the Global Museum, Fine Arts building room 203, just inside the main entrance, Tuesdays, Wednesdays and Thursdays from 11 a.m. to 4 p.m. through Dec. 8. Learn more on\nthe Global Museum website\nor\nFacebook\nand\nInstagram\npages.\nGrant to support computing curriculum redesign for underrepresented students\nThe\nNational Science Foundation\n(NSF) has awarded funding to SF State and five other CSU campuses to help transform the early curriculum experience of historically marginalized students in computing. The alliance brings SF State together with Cal Poly in San Luis Obispo, CSU Dominguez Hills, CSU Fullerton, CSU Los Angeles and Cal Poly Pomona.\nAccording to the proposal, the new curriculum should help “transform early student experience in computing with the integration of socially responsible computing curriculum.” The goal is for students to see the real-world connection in their courses early in the computing program, and the NSF grant will help with the program redesign.\n“Helping students realize that their computational skills can be used to make headway on some of the most difficult societal problems we face is a powerful and empowering experience,” said SF State Associate Professor of Computer Science Anagha Kulkarni. “Systematically providing these experiences to computer science students is the goal of this new alliance.”\nThe six participating universities have identified that a larger percent of underrepresented minority students at CSUs drop out of their computing majors than non-underrepresented minority computing students. Because the largest percentage of underrepresented minority students drop out of their computer science major in the first two years, the goal is for professors to show students through their initial coursework how the study of computer science can influence and impact the communities they are from.\nWith the $1.8 million grant for culturally responsive computing curriculum, the universities will incorporate inclusive STEM pedagogy into early computing courses, with faculty training to support community-centered projects in the coursework. The project organizers will evaluate the new curriculum through peer review and focus on the retention rate of Hispanic and Latino students.\nThe project team aims to establish curriculum and pedagogical changes integrated throughout the first two computing courses to address students’ community needs and employ project-based learning.\nThe grant’s co-principal investigator, SF State Assistant Professor of Computer Science Aakash Gautam, is creating a new introductory programming course (CSC 101) as part of the project. He believes the course will help “broaden the notion of what computing is and can be, and who gets to shape it in the future.”\n“I hope this project and the changes impact our students to renew their concepts about computing and see how relevant and applicable the computing is,” said SF State Professor of Computer Science Ilmi Yoon.\nReminder: feedback sought on University homepage\nA new version of\nthe SF State website homepage\nwent live Friday, Nov. 4, as part of the transition of all University webpages from Drupal 7 to Drupal 8. The new page was designed to streamline the user experience, especially for students and potential students. The result is a faster webpage with improved readability and search engine optimization.\nHave ideas about how the University can make its web presence even more engaging and effective?\nShare your thoughts via a Qualtrics questionnaire\n.\nAcademic Senate report\nThe Academic Senate met Tuesday, Nov. 15, via Zoom. The senate:\nViewed an informational item: The Division of Graduate Studies has merged with Career Services and is now known as the Division of Graduate Studies and Career Development (GSCD)\nAdopted by general consent the Resolution in Memoriam: A Tribute in Honor of Michael Ritter, Academic Senator.\nPassed B.S./B.A. in Business (Distance Education Authorization, with 8 concentrations).\nPassed B.A. in Economics (Distance Education Authorization).\nPassed Minor in Juvenile Justice.\nPassed Certificate in Creative Non-Fiction Comic Making.\nPassed Early Tenure Policy.\nDeferred the following items until the Dec. 6 senate plenary:\nOnline Education Policy\nTenure Density Policy\nThe full agenda, meeting materials and minutes can be found on the senate website.\n35th Annual Stillwell Student Exhibition receptions, Nov. 29 & Dec. 3\nThe\n35th Annual Stillwell Student Exhibition\nwill open in the Fine Arts Gallery (FA 238) Tuesday, Nov. 29, and run through Thursday, Dec. 8. This year’s showcase of student art will feature a juried selection of works by current School of Art undergraduate student artists and a selection of work by the late Leo D. Stillwell. There will be an opening reception from 4 to 6 p.m. Tuesday, Nov. 29, in the Fine Arts Gallery. Another reception will be held in the gallery from 1 to 3 p.m. Saturday, Dec. 3. Regular gallery hours are Tuesday through Friday, noon to 4 p.m., and Saturday, Dec. 3, 1 to 3 p.m.\nThis exhibition is supported by the University’s Instructionally Related Student Activities Fund. The Fine Arts Gallery would like to give a special thanks to the students enrolled in ART619 for their work on the exhibition and serving as the jury.\nWatercolor and oil painter Leo Stillwell died in 1948 at the age of 22. His mother donated hundreds of his works to SF State, and examples are displayed during the annual exhibition of student work named after him.\nCampus Art Crawl, Nov. 30\nThe Associated Students Art Gallery has organized a campus art crawl from 4 to 6 p.m. Wednesday, Nov. 30. Start at the AS Art Gallery on the terrace level of Cesar Chavez for detailed info on the crawl. If joining at 4 p.m., you will be led on a guided tour. Participating galleries include AS Art Gallery, Special Collections in the library, Martin Wong and the Fine Arts Gallery, the Global Museum and the DesignSpace Gallery. Attendees are encouraged to\nRSVP online\n.\nLearn more on the College of Liberal & Creative Arts website\n.\nWomen/Life/Freedom: A Musical Tribute to the Liberation Movement of Iran, Dec. 1\nA special musical program from 1:30 to 3 p.m. Thursday, Dec. 1, will feature performances by Iranian SF State students and alumni guests. Coordinated by Professor of Music Hafez Modirzadeh and co-sponsored by the Center for Iranian Diaspora Studies, “Women/Life/Freedom: A Musical Tribute to the Liberation Movement of Iran” will be held in CA 146. The event is free and open to the public. Among the guest performers will be Chair of American Indian Studies John-Carlos Perea.\nStaff Council meet and greet event, Dec. 7\nSF State staff are invited to join Staff Council members for a meet and greet event Wednesday, Dec. 7, from 10:30 a.m. to 1:30 p.m. in Rosa Parks A-C (Student Union Building, Basement Level). Come and bring your ideas to help the Staff Council as it works to develop events and programs that benefit the entire campus community. The Staff Council is hoping to revive the Staff Craft Fair as well as other programs, but it needs your help to make it happen. Coffee, tea, water and healthy snacks will be provided.\nThis event is being hosted by the Staff Enrichment Committee of the Staff Council. Reach out if you have any questions:\nRoberto Santiago\n,\nDavid Apelt\n,\nJanet Remolona\nor\nAnarose Schelstrate\n. If you are interested in being a vendor at the event, please let the Staff Council know by emailing Anarose Schelstrate at\naschels@sfsu.edu\n.\nSpotlight\nCollins discusses ‘Unsettling Museum Exhibits’\nAssociate Professor of American Indian Studies\nRobert Keith Collins\nchaired a roundtable with Alaka Wali, curator emeritus of North American anthropology at Chicago’s Field Museum, at the\nAmerican Anthropological Association\nin Seattle on Nov. 10. The event was titled “Unsettling Museum Exhibits: International Prospects for Paradigm Shifts in Native Community Collaborations.”\nThe roundtable centered on the following question: What new paradigm shifts in museum practice lend to greater collaborations with Native American communities and individuals and enable exhibitions to illuminate the agency behind material culture? To explore this question, the panel brought into conversation European and U.S. anthropologists, museum practitioners and members of the Native American advisory board for the Field Museum exhibition\n“Native Truths: Our Voices, Our Stories.”\nThey discussed the changing relationships between museums and Native American communities and individuals and the best practices that enable museum practitioners to create exhibits that go beyond colonial and settler discourse.\nAfricana Studies Professor Dorothy Tsuruta presents at renowned Bay Area event\nAfricana Studies Professor\nDorothy Tsuruta\nwas invited by the Village Project to serve as presenter and praised at this year’s annual, now famous Black Bay Area community event that recognizes several individuals and organizations with Lifetime Achievement Awards and proclamations by political officials. The event, supported by the San Francisco mayor’s office, was held Saturday, Oct. 29, at Hotel Nikko San Francisco. After the dinner and very formal part of the evening there followed dancing in the Hotel Nikko’s ballroom, themed in music and 1920s attire.\nHines and international researchers review cetacean conservation\nA new paper in\nEndangered Species Research\ndetails the challenges and priorities for the conservation of river cetaceans (dolphins, porpoises) — some of the world’s most threatened aquatic mammal groups. Professor of Geography and Environment\nEllen Hines\nat the Estuary and Ocean Sciences Center is among the international researchers on this paper.\nReview of the last two decades of literature revealed that the major threats to cetaceans continue to be habitat degradation and fishery interactions. Conservation efforts via cetacean-specific protected areas, habitats that mirror a species’ natural habitats, community-led conservation and educational programs show promise. The authors propose steps to further improve conservation but note the need for additional research and transnational political will.\nLogan writes for Jacobin, New Labor Forum on Starbucks labor organizing\nJohn Logan\n, professor and chair of Labor and Employment Studies, recently wrote articles for\nJacobin\nand\nNew Labor Forum\nabout the “high-octane” unionization efforts that have fueled Starbucks workers nationwide.\nBoth articles analyze the resounding successes despite an intense union-busting campaign. “In less than a year, Starbucks Workers United has gone from having zero to 258 unionized stores,” Logan noted in Jacobin.\nIn New Labor Forum, Logan states that media coverage and social media have given millions of Americans “an education in how powerful anti-union corporations abuse and exploit weak labor laws” and has potential to spark “an organizing wave across the low-wage service sector.”\n“The new American labor movement might just have started at a coffee house in Buffalo,” he writes.\nMcDaniel discusses SF elections\nPolitical Science Associate Professor\nJason McDaniel\nhas provided his perspectives on San Francisco elections to media outlets more than five times this month, including in the\nSan Francisco Public Press\nand\nSan Francisco Chronicle\n. In the Chronicle on Nov. 10, he said early results affirmed Mayor London Breed’s moderate views.\n“There’s a clear majority of the city that is at least not endorsing progressive candidates and policies and is giving the mayor more say,” he said, noting voters will still hold Breed accountable for her performance. “Voters want a government that’s working, and that requires a government that’s working together,” McDaniel added.\nTaylor publishes article on claims-making in South Africa\nPolitical Science Assistant Professor\nWhitney Taylor\nand Kira Tait published “The Possibility of Rights Claims-Making in Court: Looking Back on 25 Years of Social Rights Constitutionalism in South Africa” on Nov. 14 in\nLaw and Social Inquiry\n.",
    "url": "https://campusmemo.sfsu.edu/november-21-2022",
    "domain": "campusmemo.sfsu.edu"
  }
]