[
  {
    "source": "https://ltns.sfsu.edu/ba-ma-degree",
    "category": "general",
    "title": "Combined B.A. & M.A. Degree | Department of Latina/Latino Studies",
    "content": "Combined B.A. & M.A. Degree\nThe Ethnic Studies SF State Scholar Program is a great opportunity for motivated students majoring in Latina/Latino Studies. The Master of Arts in Ethnic Studies is designed to be a versatile degree that provides a solid foundation for careers teaching at community colleges, working in community and multicultural resource development, administrative work in the non-profit sector, employment in student resource centers, practical application in the business fields and much more!\nStudents apply for this program during their sophomore or junior year so that they can begin an accelerated pathway to a graduate degree. Students in the SF State Scholars Program pursue a bachelor’s degree in Latina/Latino Studies and a master’s degree in Ethnic Studies simultaneously. This program allows students to earn graduate credit while in their junior and/or senior year, reducing the number of semesters required for completion of a master’s degree. Through this program, students can pay undergraduate fees while taking courses for their M.A. degree.\nSpecial Degree Programs\nLatina/Latino Studies students have the unique opportunity to earn credit toward an Ethnic Studies Master's degree during their junior and/or senior year.\nB.A. & M.A. Scholars Program\nA Chance to Connect with More Students and Faculty\nAmalia Laventure (Latina/Latino Studies B.A., Spring 2021 & Ethnic Studies M.A., Fall 2021)\nI chose the B.A./M.A program in Ethnic Studies because of its rich and radical commitment toward the liberation of oppressed peoples. The BA/MA program in particular allowed for me to graduate on an accelerated path, and gave me the ability to apply what I was learning in my undergraduate classes to my graduate degree. I deeply enjoyed the opportunity to engage with Ethnic Studies on multiple levels, giving me a deeper analysis, and the chance to connect with more students and faculty.\nDegree Program Data\n2\nDegrees Awarded\n$0\nApplication Fee\n15\nUG Units applied toward MA\nB.A. to M.A. Eligibility and Process\nEligibility\nApplication Instructions\nUndergraduate to Graduate\nUndergraduate students interested in an accelerated pathway to a graduate degree through the SF State Scholars Program must be sponsored by a Tenured/Tenure Track faculty advisor in the degree program.\nStudents must apply to the program before they complete 90-105 semester units (consult with your program) and before enrolling in a senior capstone course in their major.\nStudents must have a minimum 3.0 cumulative GPA or 3.0 GPA in the last 60 semester units.\nStudents must not be declared in another major or second baccalaureate.\nStudents must meet admission requirements for their intended graduate program. For more information about your program admission requirements, please consult with your department (additional supplemental materials might be required).\nStudents must submit a SF State Scholars Program application that includes a Planned Course of Study to the Division of Graduate Studies.\nConsult with an SF Scholars Coordinator to determine if you are eligible for the SF State Scholars Program and if the program is the best fit for you.\nComplete the\nSF State Scholars Application\nand submit it to your SF Scholars Coordinator for approval. The SF Scholars Coordinator will forward your application to the Division of Graduate Studies for final submission.\nNo Application fee is required.\nNo GRE/GMAT test is required.\nTransition to Graduate Level for Current Undergraduate SF State Scholars:\nIn the last semester of completion of undergraduate degree requirements (e.g., degree applicable 120 units, GE, GWAR, SF Studies), SF State Scholars students will apply for graduation for their B.A./B.S. in Gateway Student Center. For more information about the registrar’s office deadlines please visit the\nregistration graduation webpage\n.\nThe application fee will be automatically applied to student financial accounts once they apply for graduation.\nThe Registrar’s office uses the Degree Progress Report (DPR) to determine if the student meets the requirements for graduation.\nThe DPR will not reflect which courses were taken in undergraduate standing that will be used toward the student’s graduate program. SF Scholars program coordinators will work with students to verify which classes they plan to use for the master’s degree.\nAfter students apply for graduation, each\nSF State Scholars program coordinator\nwill send a list of students and classes they wish to use toward their graduate degree. This should be sent to Khaled Ezzat at\nkhaled@sfsu.edu\nby\nMarch 15 for Spring\nand\nOctober 15 for Fall.\nExplore Gator Resources\nAdvisors\nAdvising Center\nBecome a Gator\nHave Questions?\nForms\nMeet with an\nLTNS Advisor\n, Please Contact Them by Email:\nLatina/Latino Studies Major and Minor Advising\nLocated in Ethnic Studies Psychology Building\nFaculty Advisor\nemail\nA-Carra\nBarbara Abadia-Rexach\nbarbaraabadiarexach@sfsu.edu\nCarri-E\nMelissa Guzman-Garcia\nmguz@sfsu.edu\nF-Hen\nLeticia Hernandez\nleticiah@sfsu.edu\nHer-Men\nKatynka Martinez (Department Chair)\nkatynka@sfsu.edu\nMon-Pen\nMichael De Anda Muniz\nmdeandamuniz@sfsu.edu\nPin-R\nMichelle Gomez Parra\nmgparra@sfsu.edu\nS-Z\nCarolina Prado\ncarolinaprado@sfsu.edu\nTo find the location of the Ethnic Studies & Psychology (EP) building visit the\nSF State southeast quadrant\ncampus map.\nFull Instructor Directory\nAvailable Advising Centers\nEthnic Studies Advising Center\nThe Ethnic Studies Advising Center (ESAC) serves all Ethnic Studies majors/minors and all students taking courses within the College of Ethnic Studies. ESAC supports students in their academic, professional and personal goals, from the time of admission to the time of graduation.\nAdvising Hub\nThe Advising Hub is a one-stop-shop of all advising needs to ensure students are on a successful path to graduation with support from General Education and minor advisors.\nUndergraduate Advising Center\nUAC is the home base for freshmen during their first year and undeclared-major students at SF State.\nExcited to Learn More About Becoming a New Gator?\nVisit\nFuture Students\nto learn more about\ncampus life at SF State\nand\nexplore the campus\n. Receive information on admissions, tuition and aid. Whether you are a freshman, transfer, international or graduate student, find everything you need to know about applying to SF State.\nYour Future\nUndergraduate Admissions Counselors Are Available to Provide Guidance\nPlease contact\nltns@sfsu.edu\nfor additional questions or concerns.\nChecklists\nLTNS_minor_checklist_03_11_24.pdf\n285.47 KB\nLTNS_major_checklist_09_17_24.pdf\n389.46 KB\nIntake\nSF State Latina Latino Intake Form\n63.52 KB\nPetitions/Registrar Forms\nhttps://registrar.sfsu.edu/forms\nGraduation Forms\nThe Division of Graduate Studies has developed a list of\nvarious forms\nto support your academic journey.\nSteps to a Graduate Degree Checklist\nApplication For Award of Degree/Graduation\nReport of Completion\nRequest for Reissue of Diploma\nQuick Links\nAll Programs\nGeneral Education\nLTNS Minor\nB.A. Degree",
    "url": "https://ltns.sfsu.edu/ba-ma-degree",
    "domain": "ltns.sfsu.edu"
  }
]