[
  {
    "source": "http://mll.sfsu.edu/japanese-program/",
    "category": "general",
    "title": "Japanese Program | Department of Modern Languages & Literatures",
    "content": "Japanese Program\nThe Japanese program offers a diverse range of undergraduate- and graduate-level courses in Japanese language, literature, culture, linguistics and pedagogy, as well as providing the following degree options: Master of Arts in Japanese, Bachelor of Arts in Japanese (major) and a minor in Japanese.\nThe Japanese program offers courses leading to the Bachelor of Arts in Japanese (major in Japanese), minor in Japanese and the Master of Arts in Japanese. The program is ranked No. 2 among the “Most Popular Schools for Japanese Language and Literature” in the entire nation according to a study by\nStateUniversity.com\n.\nThe undergraduate Japanese program focuses on developing proficiency in the language in a sociocultural context by offering a variety of language training courses and by conducting courses in culture, linguistics and literature in Japanese. In addition to the required coursework, students choose electives from a broad range of subjects, which include various courses in literature and culture as well as in translation, interpretation and business Japanese.\nDeclare a Major/Minor in Japanese\nTo declare a major or minor, complete a\nDeclaration of Major/Minor form\n, then make an appointment to see the program advisor. Bring a copy of your most recent university transcript to the meeting.\nProspective Undergraduates\nRequest Information\nProgram Contacts\nProgram Coordinator:\nMasahiko Minami,\nmminami@sfsu.edu\nMajors Advisor:\nMasahiko Minami,\nmminami@sfsu.edu\nMinor Advisor:\nMidori McKeon,\nmmckeon@sfsu.edu\nResources\nJapanese Program on Facebook\nJapanese Course Descriptions\nBachelor of Arts\nThe Japanese major consists of 45 units of lower and upper division coursework. Upper-division courses in Japanese are generally conducted in Japanese, and students are expected to use Japanese in their speaking, reading and writing.\nWriting in the Major\nStudents must complete the University’s GWAR requirement by taking MLL 400GW or CWL 400GW.\nComplementary Studies\nRequired of all candidates for the Bachelor of Arts degree in Japanese are 12 units of Complementary Studies, which must come from courses bearing a prefix other than JAPN, excluding\nMLL 325\n, and not cross-listed with JAPN.\nJapanese (B.A.) — 45 units\nCourses are 3 units unless otherwise indicated.\nRequired Courses (39 units) (Fall 2022 Bulletin ~ present)\nJAPN 101 First Semester Japanese (4 units)\nJAPN 102 Second Semester Japanese (4 units)\nJAPN 103 Third Semester Japanese (4 units)\nJAPN 250 Intensive Study of Kanji: Level 1\nJAPN 301 Japanese Conversation\nJAPN 302 Japanese Reading and Grammar\nJAPN 251 Intensive Study of Kanji: Level 2\nJAPN 305 Advanced Conversation and Composition - Language and Culture or JAPN 306 Advanced Conversation and Composition - Language and Humanities\nJAPN 309 Advanced Readings in Japanese I or JAPN 310 Advanced Readings in Japanese II\nMLL 325 Linguistics for Foreign Languages\nJAPN 401 Topics in Japanese Culture\nJAPN 510 Modern Japanese Literature\nUpper division electives (6 units)\nOn advisement\nNote: A minimum of 30 upper division units must be completed for the degree (including upper division units required for the major, general education, electives, etc.). A student can complete this major yet not attain the necessary number of upper division units required for graduation. In this case additional upper division courses will be needed to reach the required total.\nIn addition to these course requirements, the Residential Unit Requirement for BA in Japanese must be fulfilled. If course waivers for AP scores, advanced proficiency in the Japanese language, challenge by examination, or transfer credit from previous colleges are awarded, additional upper-division JAPN courses may be needed to fulfill the residential unit requirement.\nMinor in Japanese\nThe Japanese minor consists of 24 units of lower and upper division coursework. Upper-division courses in Japanese are generally conducted in Japanese, and students are expected to use Japanese in their speaking, reading and writing.\nJapanese, Minor — 24 units\nCourses are 3 units unless otherwise indicated.\nRequired Courses (24 units)\nJAPN 101 First Semester Japanese (4)\nJAPN 102 Second Semester Japanese (4)\nJAPN 103 Third Semester Japanese (4)\nJAPN 250 Individualized Study of Kanji: Level 1 (3)\nJAPN 301 Japanese Conversation (3)\nJAPN 302 Japanese Reading and Grammar (3)\nAny upper division Japanese course (except JAPN 510) (3)",
    "url": "http://mll.sfsu.edu/japanese-program/",
    "domain": "mll.sfsu.edu"
  },
  {
    "source": "http://mll.sfsu.edu/french",
    "category": "general",
    "title": "French Program | Department of Modern Languages & Literatures",
    "content": "French Program\nThe French Program offers a wide selection of undergraduate and graduate courses in French language, literature and culture as well as providing the following degree options: Master of Arts in French, Bachelor of Arts in French (major) and a minor in French.\nThe French program offers a challenging and enriching experience for those who are interested not only in the French language but also in French and Francophone culture and society. French is one of the very few languages spoken all over the world, ranked the sixth most widely spoken language after Mandarin Chinese, English, Hindi, Spanish and Arabic.  Today, more than 220 million people speak French throughout the world: roughly 51% live in Africa and the Middle East, 40% live in Europe, 8% in the Americas, and 1% in Asia/Oceania.  As a result of population growth there will be more than 700 million French Speakers by 2050, 80% of whom will be living in Africa. The French Program is excited to offer an an avenue to engage with this expanding and diverse Francophone cultural and linguistic world.\nWe offer full-fledged Bachelor of Arts and Master of Arts programs and focus on developing proficiency in the language in a sociocultural context by offering a variety of courses and by conducting courses in culture and literature in French. Great importance is placed on participatory classes, which are small and practice-oriented, to help students adapt themselves to a changing world. Excellent computer facilities and a multimedia center provide support for our educational program.\nSF State is located in San Francisco, a cosmopolitan city with a large and active French community, which makes it a great place to study French. Students are also given a number of opportunities to study in France. Through the California State University’s international programs, selected students may study at Aix-en-Provence and in Paris. Such opportunities give students practical experience in everyday French life and culture, helping to build and reinforce these skills.\nIf you are an undergraduate student and wonder which class to take, you can take a placement test and see an advisor. Please contact an advisor for further details.\nDeclare a Major/Minor in French\nTo declare a major or minor, complete a\nDeclaration of Major/Minor form\n, then make an appointment to see the program advisor. Bring a copy of your most recent university transcript to the meeting.\nProgram Contacts\nProgram Coordinator:\nAnne Linton,\naelinton@sfsu.edu\nUndergraduate Advisor A-L:\nBlanca Misse,\nbmisse@sfsu.edu\nUndergraduate Advisor M-Z:\nAnne Linton,\naelinton@sfsu.edu\nResources\nFrench Program on Facebook\nFrench Course Descriptions\nAdditional Resources for M.A. Students\nProspective Undergraduates\nRequest Information\nBachelor of Arts\nThe Bachelor of Arts in French is a 30 unit major consisting of courses in French language, literature, linguistics, and culture.  All upper-division courses are conducted in French, and students are expected to use French in their speaking, reading, and writing. A minimum of four semesters is required to complete the required and elective courses for the major.\nAdvising\nStudents who have previously studied French should consult with a Faculty Advisor in the French Program for placement at the proper class level. You must also see a Faculty Advisor to determine the best sequence of courses for you. Students seeking to Major in French will meet with their Undergraduate Advisor and complete together a\nFrench Advising Worksheet\n, which will be updated each semester. Students are placed in a class on the basis of their academic background, an interview with the Faculty Advisor and the instructor of the class, and an on-line placement test. Lower division courses (100-200) listed for a major can be waived if the student has taken their equivalent or if sufficient knowledge and ability are demonstrated.\nPlacement Test\nThe Placement Test in French can be taken via iLearn-- please consult your advisor for further details. There are 45 questions in the online test:\nA grade above 40 = Student should enroll in courses beyond the prerequisites.\nA grade above 30 = Student should enroll in FR 216\nA grade above 20 = Student should enroll in FR 215\nA grade above 10 = Student should enroll in FR 102\nA grade less than 10 = Student should enroll in FR 101\nLower-Division\nStudents who begin at SF State with no previous knowledge of French are expected to spend at least two semesters at the beginning level (100), and at least two semesters at the intermediate level (200) before enrolling in upper-division courses.\nFirst year courses consist of two 5-unit semester courses, FR 101 and FR 102, taught in a sequence over two semesters. They meet five times a week, generally in the morning. The same textbook is used for both semesters. It is complemented by a Workbook, a video, and c.ds; extra material is available online. All classes are taught in French from the very beginning. A regular faculty member teaches the course three times a week, and a GTA teaches the other two days, under the supervision and coordination of the regular faculty member.\nSecond year courses consist of 3 semester units and meet two times a week during the day (8 a.m-4.pm.). We offer FR 215, Intermediate French I and FR 216, Intermediate French II.\nUpper-Division\nUpper-division courses, leading to a B.A. or a minor in French, consist of three units and meet two or three times a week during the day (8 a.m. - 4 p.m.). The French B.A. Program includes 30 semester units of core courses in French language, literature and culture.\nFrench majors must take:\nREQUIRED COURSES\nI. Language\n(choose one)\nMLL 325 Linguistics for Foreign Languages (3 units)\nFR 301 French Phonetics (3 units)\nFR 450 Translating Themes: English/French (3 units)\nFR 304 Advanced Grammar (3 units)\nII. Composition\n(choose one)\nFR 305 French Composition (3 units)\nIII. Culture\n(choose one)\nFR 400GW French Culture (3 units)\nFR 410 Contemporary French Civilization (3 units)\nIV. Literature\n(choose one)\nFR 500 Introduction to Literary Texts (3 units)\nFR 501 Contes et Poèmes (3 units)\nCAPSTONE COURSES\nBoth FR 500 and FR 501 have been designated as the “capstone courses” in French, meaning that students must take at least one in residence at SF State. They cannot be replaced by study abroad coursework.\nELECTIVE COURSES\n18 units (6 courses) in French courses numbered 300-699 not taken as required courses. At least 9 units (3 courses) must be taken at the 400 level or above\nNOTE: All upper-division courses are conducted in French, and students are expected to use French in their speaking, reading, and writing. It should take a minimum of four semester to complete the required and elective courses for the major (300-600 level; 30 units).\nSequence of Courses and Semesters Offered\nAt the lower division level, FR 101 and FR 102 are offered every semester; FR 215 is offered in the Fall and FR 216 in the Spring.\nAt the upper-division level, at least 2 of the 4 required courses will be offered in the Fall, and at least 2 of the 4 required courses will be offered in the Spring. Elective courses will be offered both in Fall and Spring semesters, their number may vary.\nLower division courses (Prerequisites for Major and Minor)\nFall\nFR 101 - First Semester French (5 units)\nFR 102 - Second Semester French (5 units)\nSpring\nFR 101 - First Semester French (5 units)\nFR 102 - Second Semester French (5 units) †\nFall\nFR 215 - Intermediate French part I\nSpring\nFR 216 - Intermediate French part II\nInternational Program\nStudents can complete up to one half of the undergraduate major degree in France. The International Program of the California State University has its French campus in Aix-en-Provence. This program has been very successful and offers the students a closely guided course-of-study in a university town and in one of the most pleasant regions of France. Students can also participate in an exchange program with universities in Paris (MICEFA), also coordinated by the office of International Programs on campus. A maximum of 15 units may be counted towards the major, or 10 towards the minor, the exact composition of which shall be determined in close consultation with your academic advisor. Please see your French Program Advisor at SF State both before and after you return from abroad.\nMinor in French\nThe French minor consists of up to 14 units of lower-division and from 9 to 15 units of upper-division coursework. Students must complete the lower-division sequence -- or the equivalent -- prior to beginning upper-division coursework in French language, literature, linguistics, and culture. The program may waive some or all lower-division requirements if the student demonstrates appropriate competency through advising, by taking the placement test, or by having taken the equivalent coursework elsewhere. All courses are conducted in French, and students are expected to use French in their speaking, reading and writing.\nAdvising\nStudents who have previously studied French should consult with a Faculty Advisor in the French Program for placement at the proper class level. You must also see a Faculty Advisor to determine the best sequence of courses for you. Students seeking to Minor in French will meet with their Faculty Advisor and complete together a French Advising Worksheet, which will be updated each semester. Students are placed in a class on the basis of their academic background, an interview with the Faculty Advisor, or instructor of the class, and/or an on-line placement test. Lower division courses (100-200) listed for a major can be waived if the student has taken their equivalent or if sufficient knowledge and ability are demonstrated.\nPlacement Test\nThe Placement Test in French can be taken via ilearn-- please consult your advisor for further details, or go to the MLL Multimedia Center (HUM 403) to gain access to the test. There are 45 questions in the online test:\nA grade above 40 = Student should enroll in courses beyond the prerequisites.\nA grade above 30 = Student should enroll in FR 216\nA grade above 20 = Student should enroll in FR 215\nA grade above 10 = Student should enroll in FR 102\nA grade less than 10 = Student should enroll in FR 101\nCourse Requirements\nAll upper-division courses are conducted in French and students are expected to use French in their speaking, reading, and writing.\nStudents must complete the lower-division sequence, or the equivalent, prior to beginning upper-division coursework. The program may waive some or all lower-division requirements if the student demonstrates appropriate competency through advising, by taking the placement test, through AP examination, or through equivalent coursework taken elsewhere. Students must pass a minimum of 15 units to successfully complete the minor. A minimum of 9 upper-division units need to be taken in residence and cannot be transferred from study abroad, or another institution. All lower-division units can be transferred, as appropriate.\nStudents should meet with an advisor or take the placement test prior to enrolling in their first French class. To take the online placement test, email the French program coordinator.\nPathways:\nStarting at FR 101, students will complete a 23-unit minor (FR 101, FR 102, FR 215, FR 216, FR 304 or FR 305, 3 upper-division elective units, and either FR 500 or FR 501).\nStarting at FR 102, students will complete a 19-unit minor (FR 102, FR 215, FR 216, FR 304 or FR 305, 3 upper-division elective units, and either FR 500 or FR 501).\nStarting at FR 215 level, students will complete a 15-unit minor (FR 215, FR 216, FR 304 or FR 305, 3 upper-division elective units, and either FR 500 or FR 501).\nStarting at FR 216, students will complete a 15-unit minor (FR 216, FR 304 or FR 305, 6 upper-division elective units, and either FR 500 or FR 501).\nStarting at 300-level, students will complete a 15-unit minor (FR 304 or FR 305, 9 upper-division elective units, and either FR 500 or FR 501).\nLinks to the pathways:\nR 101\n,\nFR 102\n,\nFR 215\n,\nFR 216\n,\nFR 304\n,\nFR 305\n,\nFR 500\nor\nFR 501\nSequence of Courses and Semesters Offered\nAt the lower division level, FR 101 and FR 102 are offered every semester; FR 215 is offered in the Fall and FR 216 in the Spring.\nAt the upper-division level, at least 2 of the 4 required courses will be offered in the Fall, and at least 2 of the 4 required courses will be offered in the Spring. Elective courses will be offered both in Fall and Spring semesters, their number may vary.\nLower division courses (Prerequisites for Major and Minor)\nFall\nFR 101 - First Semester French (5 units)\nFR 102 - Second Semester French (5 units)\nSpring\nFR 101 - First Semester French (5 units)\nFR 102 - Second Semester French (5 units) †\nFall\nFR 215 - Intermediate French part I\nSpring\nFR 216 - Intermediate French part II\nInternational Program\nStudents can do part of the undergraduate major degree in France. The International Program of the California State University has its French campus in Aix-en-Provence. This program has been very successful and offers the students a closely guided course-of-study in a university town and in one of the most pleasant regions of France. Students can also participate in an exchange program with universities in Paris (MICEFA), also coordinated by the office of International Programs on campus. The number of credits earned abroad that may be counted towards the major is 15 (towards the minor is 10), and determined though consultation with the appropriate French Program advisor at San Francisco State University.\nMasters of Art (Advancement to Candidacy)\nThe M.A. Program in French at SF State requires the completion of 30 units of course work in French Literature, culture or language, and offers two different culminating experience options: Master's Comprehensive Written and Oral Examinations, or a Master's Thesis and Master's Comprehensive Oral Examination.\nOption I\n30 units of coursework and Comprehensive Written and Oral Examinations.\nOption II\n27 units of coursework and FR 898 Master’s Thesis (3 units), plus a Master’s Comprehensive Oral Examination.\nStudents must take a minimum of 15 units of graduate courses in French.\nFor the remaining courses, they have the choice of 6 units of graduate / paired courses in French, and 9 or 6 units (according to the option) of graduate /paired / undergraduate courses in French, or related subjects. For instance, students interested in the teaching profession can take two courses in related subjects from the Department of Modern Languages and Literatures: Curriculum and Instruction I and II, e.g. 6 units of graduate course work towards the completion of their degree.\nTransfer of units and cross-registration:\nYou may transfer up to 12 units taken as an Unclassified Graduate Student at SF State, subject to approval of the graduate adviser.\nIf you cannot find courses to meet your interests or time schedule in our program, you may take up to 3 units per semester through cross-registration at other universities, in particular U.C. Berkeley, subject to approval by the graduate advisor.\nYou may transfer up to 6 post-baccalaureate units you took at another university, subject to approval by the graduate advisor in French and the graduate division of SF State, as long as these units were not counted towards another diploma.\nLevel I and Level II English requirement\nAll graduate students at SF State must complete Level I and Level II writing English requirements. The level I requirement is met when applying to the French M.A. program, by giving to the French Program a statement of purpose in English (500 words) along side the same or a similar statement written in French.\nThe level II writing requirement needs to be met while in the graduate program. It can be met in the following ways:\nOption I:\nby submitting for evaluation to the French faculty either a 15-20 page essay written in English for a graduate class (program other that the French Program), or the English translation of a 15-20 page essay written in French for a graduate class from the French Program, unless the French instructor of that class accepts to receive an essay written in English.\nOption II:\nstudents writing a thesis must write a 15-page summary of their thesis in English, if they do not choose option I. This summary will be submitted for evaluation to the French faculty.\nIn order to fulfill this requirement successfully, discuss how to be best prepared for it with the graduate advisor early in the course of your graduate studies, especially if English is not your first language or if you have deficiencies in writing.\nFor more information on the M.A. Program in French requirements and option, consult the following documents:\nCheck list for French M.A. Students (found on the\nFrench Resources page\n)\nFrench M.A advising worksheet\nGuidelines Thesis – French (found on the\nFrench Resources page\n)\nReading List – French M.A.\nThe M.A. Program in French - Course Descriptions\nHere is a sample of French M.A. courses taught in the past 3 years:\nL’Amour et la Guerre au Moyen Age\nLes Femmes du Moyen Age à la Renaissance\nLe Corps à la Renaissance\nLe Conte de Fées du 17e siècle\nLe Spectacle du Moyen Age au 17e siècle\nLe Merveilleux du Moyen Age au 17e siècle\nLe Théâtre du 17e et 18e siècle\nLes Philosophes (18e siècle)\nLes Deux Sexes du Roman (18e siècle)\nLe Roman du 19e siècle\nParis: Capitale du 19e siècle\nMonstres du 19e siècle\nThéâtre et poésie romantique\nArt et Poésie 1860-1940\nLe Roman du 20e siècle\nHumour, Arts et Littérature (20e siècle)\nLa Francophonie (20e siècle)\nExhaustive on-line French M.A. course titles and descriptions are available in the University Bulletin.\nInternational Program\nStudents can do part of the M.A. degree in France. They can participate in an exchange program with universities in Paris (MICEFA), coordinated by the office of International Programs on campus. The number of credits earned abroad that may be counted towards the M.A. is determined though consultation with the Graduate French Program advisor at San Francisco State University.\nIn addition to the aforementioned requirements, students are advised to do the following:\nSeek Graduate Advising Every Semester\nStudents should plan their courses in consultation with the graduate advisor and fill out the “Advising Worksheet - M.A. student in French” every semester. Pay attention to the type of courses and number of units needed to graduate and cross-registration regulations if you want to take courses in universities such as U.C. Berkeley or other universities from the CSU system. Send an electronic copy to your advisor to keep him/her informed of the courses taken.\nIf you are conditionally admitted to the program, seek the advisor for “Advancement to Classified Graduate Standing” when you complete the courses specified as preconditions (Such course work may NOT be used to meet degree requirement).\nBegin studying early the document containing the “Reading List” of the French M.A. Program and the description of the culminating experience requirements (option I or option II). It is a good idea to begin preparing your reading list for the oral exam early on. It is also a good idea to start reflecting on your preferences concerning the culminating experience requirements. Check also the document: “Guidelines Thesis – French”.\nFulfill the Second Level English Proficiency Requirement\nAll graduate students must complete Level I and Level II writing English requirements. The level I requirement is met when applying to the graduate program, by giving to the French Program a statement of purpose in English (500 words) along side the same statement written in French.\nThe level II writing requirement needs to be met while in the graduate program. It can be met in the following ways:\nChoice I:\nby submitting for evaluation to the French faculty either a 15-20 page essay written in English for a graduate class (pr",
    "url": "http://mll.sfsu.edu/french",
    "domain": "mll.sfsu.edu"
  },
  {
    "source": "http://mll.sfsu.edu/french-resources",
    "category": "general",
    "title": "French Resources | Department of Modern Languages and Literatures",
    "content": "French Resources\nCheck List for M.A. Students\nDuring the course of your graduate studies, and in order to complete and verify what is stated here, consult frequently the\nDivision of Graduate Studies website\n.\n•\nSEEK GRADUATE ADVISING EVERY SEMESTER.\nStudents\nshould plan their courses in consultation with the graduate advisor and fill out the\n“Advising Worksheet - M.A. student in French”\nevery semester\n. Pay attention to the type of courses and number of units needed to graduate and cross-registration regulations if you want to take courses in universities such as U.C. Berkeley or other universities from the CSU system.\nSend an electronic copy\nto your advisor to keep him/her informed of the courses taken.\n• If you are\nconditionally\nadmitted to the program, seek the advisor for “Advancement to Classified Graduate Standing” when you complete the courses specified as preconditions (Such course work may NOT be used to meet degree requirement).\n• Begin studying early the document containing the “\nReading List”\nof the French M.A. Program and the description of the culminating experience requirements (option I or option II). It is a good idea to begin preparing your reading list for the oral exam early on. It is also a good idea to start reflecting on your preferences concerning the culminating experience requirements. Check\nalso the document:\n“Guidelines Thesis – French”.\nFULFILL THE SECOND LEVEL ENGLISH PROFICIENCY REQUIREMENT.\n•\nAll graduate students must complete Level I and Level II writing English requirements\n. The level I requirement is met when applying to the graduate program, by giving to the French Program a statement of purpose in English (500 words) alongside the same statement written in French.\n• The level II writing requirement needs to be met while in the graduate program. It can be met in the following ways:\nChoice I\n: by submitting for evaluation to the French faculty either a 15-20 page essay written in English for a graduate class (program other than the French Program), or the English translation of a 15-20 page essay written in French for a graduate class from the French Program, unless the French instructor of that class accepts to receive an essay written in English.\nChoice II\n: all students writing a thesis must write a 500/700 word or 2-3 page summary of their thesis in English. An extended version of this summary in English (15 pages) or a 15 page translation of part of the thesis can be submitted for evaluation to the French faculty. In order to fulfill this requirement successfully, discuss how to be best prepared for it with the graduate advisor early in the course of your graduate studies, especially if English is not your first language or if you have deficiencies in writing.\nA SEMESTER BEFORE THE SEMESTER YOU EXPECT TO GRADUATE\nYou will need to fill out and turn in two forms\nat the beginning of that semester:\n“The Advancement for candidacy” (ATC)\nand the\n“Culminating Experience”\n,\ntypically before the third week of instruction.\nCheck the deadlines\n.\nYou will thus have to choose your option for the culminating experience\n(option I or II) by that date.\nAt the same time, decide also how to fulfill the second level English requirement (15-20 page essay written in English or 15 page summary of the thesis written in English).\n• Make an appointment with the graduate advisor\nto discuss your\nATC - i\nt is a good idea to make a first draft of it, and discuss your choice for the\n« Culminating Experience»\nrequirement: you can either take a written and oral. Comprehensive examination (Option I), or an oral Comprehensive examination and write a thesis (Option II). In the second case, you need to choose a topic and a title for the thesis, you also need to choose a thesis committee.\n• When you are ready, fill out the\n“\nThe Advancement for candidacy” (ATC)\nform\nonline, Option I or Option II\nYou will find all necessary forms on the\nforms section of the Graduate website\n. Print it out and have it approved and signed by the graduate advisor. The ATC should show at least 6 units yet to be completed for the degree. If you are making any substitutions for the program requirements stated in the Bulletin, file a petition for ATC substitution along with the ATC.\n• Fill out also the form “\nCulminating Experience\n”\nonline: either\nComprehensive examination (Option I) or 898 Thesis without animal human subject (Option II). On this form, you will write a paragraph summary of your project, give the title of the thesis and list the members of your committee. Any change made later in the title chosen or the composition of the committee will require to fill a new form indicating these changes. As a general rule,\nany change in the content of a form\nsubmitted to Graduates Studies\nwill require submission of a new form.\nPrint it out and have it approved and signed by the Graduate adviser and the members of your committee.\nBoth forms will be signed by the Chair of the Department of Modern Languages and Literatures  and sent together to Graduate Studies by the Department.\n•\nIf you choose the thesis\n, read carefully the document prepared by the French Program: “\nGuidelines Thesis – French\n”. Check the format of the thesis and the administrative requirements at the\nthesis page\n. You will have to present your thesis prospectus to your committee for discussion some time during that semester (one hour). You will also have to take your oral exam at the end of that semester (one hour).\nTHE SEMESTER YOU EXPECT TO GRADUATE\n• Fill out online the form “Application for Award of Degree” on the\nRegistrar's website\ntypically before the third week of instruction of the term you expect to graduate. Check the deadline.\nComplete the Culminating Experience Requirements chosen to obtain your French M.A. (OPTION I or OPTION II).\nIf you chose OPTION I (written and oral exams), you will need to select a date with the graduate advisor towards the end of the semester for taking the written exam (4 hours). The oral exam (1 hour) is typically set two weeks after the written exam. During that semester, meet with the graduate adviser to discuss how to be best prepared for the written and oral exams.\nIf you chose OPTION II (thesis), you should enroll in FR 898 and write your thesis during that semester. Be careful about the calendar you set for yourself in order to submit the final approved copy of your thesis in time to Graduate Studies (check the deadline).\nWhen your Culminating Experience Requirements are completed, obtain the Graduate Advisor’s signature on the form “Report of Completion of Specified Graduate Program Requirements” (not available on line) and file it with the Department of Modern Languages and Literatures Office (which submits the report to Graduate Studies).\nThesis Guidelines\nFOR M.A. FRENCH STUDENTS  WHO ARE CHOOSING OPTION II\nGUIDELINES FOR THE PROSPECTUS AND THE THESIS\n1\n:\n1 This document is based on the guidelines written by the English department of San Francisco State University for the graduate students in the Literature Program. If you are interested, you can consult these guidelines on the site of the graduate program of the\nEnglish Program\n. We adapted them to the specific requirements of the French Program and the specifications available on line on the\nDivision of Graduate Studies website\n.\n1.\nWHEN TO START THINKING ABOUT WRITING A THESIS\n? It is a good idea to think about it early in your graduate studies. You are technically supposed to write it during your last semester, when you are enrolled in FR 898 (Master’s Thesis), but you need to start working on your project much earlier, at least a year before, in order to have the time to choose a topic, reflect about it and exchange ideas, do research, fill up and turn in the required forms in time (see 2 below), present the prospectus describing the project to your committee (usually a semester before taking FR 898), and finally do the actual writing. Be also aware that writing often takes more time than planned, considering the need for revisions and final proofing.\n2.\nADMINISTRATIVE CONSTRAINTS\n.\na) A semester before the end of your studies (before taking the last 6 units of courses necessary for the completion of your M.A.), you must file the\nACT form\n, which is due early in the semester (check the deadlines). Upload the ACT form for the French Program\nOption II\n. Fill the form on line and print it before having it approved and signed by the graduate advisor. Remember that if later you change the courses or the type of culminating experience indicated on your ACT, you will need to fill a new form.\nb) To the ATC you must attach another form: “\nCulminating experience”: 898 thesis\n(No human/animal subjects) (\nOption II\n) available on the same site. File this form on line and print it before having it approved and signed by the graduate adviser and the members of your committee. On this form, you will write a paragraph summary of your project, give the title of the thesis and list the members of your committee. Any change made later in the title chosen or the composition of the committee will require to fill a new form indicating these changes.\n3.\nWHERE DO THESIS IDEAS COME FROM?\nThesis ideas should come from your study of French and francophone literature, culture and language and from your special interests. You may develop a thesis out of a seminar paper or an independent study. Your research papers and/or the suggestions of professors may help you frame and develop a topic. You may also consult bound copies of theses written by French M.A. students in the Library or in the Graduate Reading Room (HUM 473). You should undertake considerable primary and secondary reading in order to convince yourself that your project has worth. The range of possibilities for an M.A. thesis is immense; however, it is preferable to choose a topic corresponding to the types of courses taught and/or interest areas of the French faculty, especially of your first reader. It is also important to think about your future goals, and to be realistic about your time and your abilities. Don’t be overambitious.\n4. HOW LONG SHOULD A THESIS BE?\nLong enough to develop in detail a focused and structured argument. The thesis should extend in scope and conception beyond the range of a seminar paper and be more concise than a dissertation or book-length study. The number of pages depends entirely upon the individual project, but, generally speaking, the range is around 60 pages or a little longer (not to extend beyond 100 pages).\n5. HOW TO FIND MY READERS?\nYour thesis committee can have two or three members. They will most likely be made up of faculty from the French program and the first reader should be a member of the French program. But you may choose another reader from another department or program if it seems appropriate for your topic. Remember that your thesis must be written in French: all your readers should be able to read French. Initially, you must find a first reader from the French faculty who is interested in your general topic and responsive to you and your approach. Your first reader should have some specialization, or at least interested experience, in one or more of the areas of your topic. (For a list of faculty interests and specializations, see the program website) To find such a reader, you must appear with a fairly clear idea and some enthusiasm as well as flexibility. It is recommended that you write down a short description of your project to present to prospective readers. This description should articulate your research questions, list some of the texts you wish to examine, and what you think you might find. Once you have found a first reader, you should discuss who might serve as second and eventually third reader on the committee. If, for any reason, you experience difficulty finding a first reader, you should consult the Graduate Program advisor or the Program Coordinator for advice.\n6. WHAT IS THE PROSPECTUS?\nThe prospectus is a written statement that establishes the main lines of argument and organization for the thesis. It should be developed from your initial description of the project and written in consultation with your committee. The prospectus should present the topic chosen, explain the purpose and significance of the thesis; the approach chosen by you; the selection of literary sources; and an overview of relevant scholarship and criticism.” You should also indicate the time line for remitting each chapter and the final version to your committee. The format might look like this:\n–\nStatement describing the project, its significance and the approach chosen\n–\nChapter outline\n–\nWorking bibliography of major primary and secondary sources\n–Time line for remitting chapters and final version\nA finished prospectus tends to be 8-12pp. in length but can be slightly shorter; a draft is usually submitted to your first reader for commentary and revision before going to the full committee.\n7. PRESENTATION OF THE PROSPECTUS.\nYou will meet with your committee to discuss your project (based upon the completed prospectus) and to evaluate your readiness to start writing. This presentation should be scheduled during the semester before you intend to begin writing, usually towards the end of the semester (or earlier). At the latest, it could be done very early in your final semester but it is not recommended because in this case you may not have enough time to finish writing before the end of that semester. Expect that presentation to last about an hour. First, you’ll be given a chance to explain how you chose your topic and your approach to it. You must be prepared to present and argue the case for a well-delineated plan of research. You will defend or modify your plan of study in response to questions and suggestions from your readers.\n8. ORAL EXAM.\nStudents who chose to write a thesis need to remember that they must also take a comprehensive oral exam where they are tested on their knowledge of French literature in order to receive their M.A. in French. The preparation of this exam should also be planned early, while taking graduate classes. It is the same for option I (written comprehensive exam) and for option II (thesis). To prepare it, you have to select a specified number of readings from the French Reading list of the M.A. Program (see this reading list for more details on the preparation and the format of this exam). The oral exam lasts one hour and takes place with the three members of the French faculty (unless one of them is on sabbatical/unavailable. It should also be scheduled during the semester before you start writing; if not, at the latest, very early in your final semester. Talk with the graduate adviser in order to plan wisely the dates of the presentation of the prospectus and the oral exam.\n9. MAY I CHANGE MY MIND CONCERNING THE CONTENT OF MY THESIS?\nYes, if you mean that your thesis takes different twists and turns as you write. But, if you move completely away from the original proposed topic, you must write a new proposal, develop a new prospectus, and make a new presentation, which implies filling up new forms online.\n10. WHAT ARE THE ROLES OF THE FIRST AND SECOND OR THIRD READERS?\nAt some early stage—perhaps at the end of your oral—readers’ responsibilities will be clarified for your particular project. It may be helpful for the first reader to proceed through the complete manuscript before submitting it to the other readers; sometimes another reader will want to see drafts of chapters immediately after the first reader has perused them or at the same time. Check with your committee to formulate the most appropriate plan of submission. It is important to allow sufficient time for your readers to read and respond to your work, and to apportion time for your revisions and modifications (see 6 above).\n11. LEVEL II WRITING ENGLISH REQUIREMENT?\nTo meet this requirement, students writing a thesis must write a 15-page summary of their thesis in English. This summary will be submitted for evaluation to the French faculty. In order to fulfill this requirement successfully, discuss how to be best prepared for it with the graduate advisor early in the course of your graduate studies, especially if English is not your first language or if you have deficiencies in writing.\n12. OTHER FORMS TO FILL?\nAfter your ACT and “Culminating Experience” forms have been filed, you will sign up for FR 898 (Master’s Thesis) in the first two weeks of your final semester. You will also need to fill out a “report of completion of specified graduate program requirements” and “an application for award of degree” in order to receive your diploma (see 2. above for the site).\n13. HOW DO I SUBMIT MY THESIS?\nBe sure you know the thesis submission deadline for the semester you intend to graduate (check Graduate Division website). You will need to submit the final draft to your committee members with enough time for them to read it and for you to make any last minute changes (usually 2-3 weeks before the published deadline). Theses should follow the latest\nMLA Style Manual\n, available on line, in the Library, the bookstore, or anywhere academic books are sold. Pay attention to the Graduate Division guidelines for formatting and submission. It can be downloaded from its website (look for “Thesis Guidelines” under “Graduate Forms”). You will need to take the final approved copy of your thesis to yours readers for signature. Then you can file it. Remember that you will need to make an extra copy of the thesis for the archives of the Department of Modern Languages and Literatures.\n14. WHAT IF I DON’T MAKE THE DEADLINE FOR COMPLETING THE THESIS AT THE END OF THE SEMESTER THAT I SIGNED UP FOR FR 898?\nYou will be issued a grade of “RP,” which indicates “report of progress”. When you do finish the thesis, there is no new paperwork to file as long as there are no changes to either the original GAP or “Culminating Experience” forms you submitted. If your graduate application was approved but you did not finish your thesis, you will need to re-apply for graduation in the semester that you complete the thesis. Please keep in mind the university’s 7-year limit for completing post-graduate programs: you should endeavor to complete the thesis within 7 years of the date of the earliest course work listed on your GAP form. You will not need to reapply to the university if you need an extra semester to finish your thesis. However, if it takes you longer, you will then have to reapply to the university.",
    "url": "http://mll.sfsu.edu/french-resources",
    "domain": "mll.sfsu.edu"
  },
  {
    "source": "http://mll.sfsu.edu/italian",
    "category": "general",
    "title": "Italian Program | Department of Modern Languages & Literatures",
    "content": "Italian Program\nThe Italian Program offers a selection of undergraduate and graduate courses in Italian language, literature and culture as well as providing the following degree options: Master of Arts in Italian, Bachelor of Arts in Italian (major) and minor in Italian.\nIf you are interested in studying Italian, you should definitely consider enrolling at San Francisco State University. We offer the Bachelor of Arts and the Master of Arts in Italian. For a student who wishes to combine language study with another discipline, there is also a minor to consider. All courses beyond the first year are taught by experienced professors who hold either a Ph.D. or an Italian doctorate. Even first-year courses are conducted by them, with the assistance of qualified teaching assistants.\nThe number of students in our classes is such that each student receives individual attention. Instructors are always ready to help.\nThe Italian program offers a comprehensive background in literature, linguistics, culture and civilization. These aspects, combined with constant practice in reading, writing, speaking and listening, give students broad educational experience, while a degree in Italian also prepares one for a specialized career.\nMany people study Italian in order to become teachers, but those enrolled in other disciplines have found Italian useful as well. It is particularly pertinent to studies in Music, Art, Cinema, Archeology, International Relations, History, Business and Comparative Literature. At the same time, many are interested in Italian because of the cultural enrichment it offers. The study of Italian can be especially rewarding for those of Italian heritage.\nAll regularly enrolled, full-time students of the San Francisco Consortium may register in a course offered by our program if the desired course is not offered at their home institutions. Applications for cross registration are available at the SF State Registrar's Office.\nAll regularly enrolled students may spend a year at the California International Programs’ Center in Florence or at University of Pavia, where they can pursue their studies in Italian or other fields, receive credit and enjoy some free time to travel.\nA number of scholarships are offered only for undergraduate and graduate students through either the Italian program or the Department of Modern Languages and Literatures. Teaching assistantships are also available for graduate students to teach lower-division classes. A maximum of two courses per semester may be taught.\nDeclare a Major/Minor in Italian\nTo declare a major or minor, complete a\nDeclaration of Major/Minor form\n, then make an appointment to see the program advisor. Bring a copy of your most recent university transcript to the meeting.\nProgram Contacts\nProgram Coordinator:\nFrederik Green,\nfgreen@sfsu.edu\nUndergraduate Advisor:\nFrederik Green,\nfgreen@sfsu.edu\nGraduate Advisor:\nFrederik Green,\nfgreen@sfsu.edu\nResources\nItalian Course Descriptions\nProspective Undergraduates\nRequest Information\nBachelor of Arts\nThe Italian major consists of 30 units of upper-division coursework. Up to 14 units of lower division coursework or demonstrated language proficiency is required for the major.\nProficiency can be demonstrated by completing the necessary lower-division courses or testing out of them.\nMost upper-division courses are conducted in Italian, and students are expected to use Italian in their speaking, reading, and writing.\nCurriculum:\nLower division language classes (14 units)\nITAL 101 First-Semester Italian (4)\nITAL 102 Second-Semester Italian (4)\nITAL 103 Third-Semester Italian (3)\nITAL 104 Fourth-Semester Italian (3)\nCore requirements (15 units)\nITAL 305 Advanced Grammar and Composition (3)\nMLL 325 Linguistics and Foreign Language (3)\nITAL 401 Italian Culture and Civilization (3)\nITAL 510 Italian Literature: Early Period (3)\nITAL 511 Italian Literature: Late Period (3)\nFive upper-division electives on advisement from the following (15 units):\nITAL 350 Advanced Oral and Reading Practice (3)\nITAL 525 Literature and the Risorgimento (3)\nITAL 530 Italian Renaissance Literature (3)\nITAL 550 The Italian Theatre (3)\nITAL 560 The Italian Novel (3)\nITAL 570 Italian Women Writers (3)\nITAL 580 Great Figures in Italian Literature (3)\nITAL 581 Divina Commedia (3)\nITAL 600 Italian Literature on Film (3)\nITAL 699 Special Study (1-3)\nTotal units required for Major: 44\nWriting in the Major\nStudents must complete the University’s GWAR requirement by taking MLL 400GW, CWL 400GW or ITAL 600GW.\nComplementary Studies\nRequired of all candidates for the Bachelor of Arts degree in Italian are 12 units of Complementary Studies, which must come from courses bearing a prefix other than ITAL, and not cross-listed with ITAL. Complementary Studies for the Italian major can be satisfied via four possible routes: (1) 12 units in any foreign language other than Italian (which may include up to 3 units of FL prefix courses); (2) 12 units of coursework taken in an approved study abroad program (including the CSU Study Abroad and the SF State Bilateral Program); (3) 12 units of coursework taken as partial completion of a second major, a minor or a certificate; (4) 12 units of coursework in related disciplines with the approval of an Italian Program advisor. Related disciplines typically include classics, linguistics, literature, humanities, philosophy, history, music,art history, education, Jewish studies, apparel design and merchandising, industrial design, and any aspect of greater Italy, Mediterranean, Italian-American or European studies.\nWhere a course with a non-ITAL prefix, (and not cross-listed with ITAL), is taken as a core requirement or elective for the Italian major, the said course may also (doubly) count towards Complementary Studies only via the Study Abroad option or the 2nd Major/Minor/Certificate option listed above. Students satisfying Complementary Studies through the Foreign Language option are allowed a maximum of 3 units of overlap of FL-prefix courses between Italian major and Complementary Studies units. Students satisfying Complementary Studies through the Related Subjects option are not allowed to double-count major and Complementary Studies units.\nMinor in Italian\nThe Italian minor consists of up to 14 units of lower-division and from 6 to 12 units of upper-division coursework.\nLower-Division Core (0-14 units)\nCourse List\nCode\nTitle\nUnits\nITAL 101\nFirst Semester Italian\n1\n4\nITAL 102\nSecond Semester Italian\n1\n4\nSelect Two:\n6\nITAL 103\nThird Semester Italian\n1\nITAL 104\nFourth Semester Italian\n1\nITAL 206\nItalian Conversation\n1\nThese courses can be fulfilled through AP test credit.\nElectives (6-12 units)\nElectives can include any upper-division course in Italian (ITAL prefix) or a related area selected upon advisement.",
    "url": "http://mll.sfsu.edu/italian",
    "domain": "mll.sfsu.edu"
  },
  {
    "source": "http://mll.sfsu.edu/advising",
    "category": "general",
    "title": "Advising | Department of Modern Languages and Literatures",
    "content": "Advising\nAdvising is key to a successful college experience. Advisors are available from each language program to assist students in planning their degrees.\nMLL Advisors\nProgram\nAdvisor\nFocus\nArabic\nFrederik Green\nCoordinator\nChinese\nChris Wen-Chao Li\nCoordinator, Majors, Graduates\nChinese\nFrederik Green\nFlagship\nFrench\nAnne Linton\nCoordinator, Majors last name M-Z\nFrench\nBlanca Misse\nMajors last name A-L\nGerman\nIlona Vandergriff\nCoordinator, Majors\nItalian\nFrederik Green\nCoordinator, Majors, Graduates\nJapanese\nMasahiko Minami\nCoordinator, Majors\nJapanese\nMidori McKeon\nMinors\nPersian\nMitra Ara\nCoordinator, Minors\nRussian\nNatalia Tkachov\nCoordinator, Minors\nSpanish\nAna Luengo\nCoordinator, Majors last names R-Z, Graduates\nSpanish\nGustavo Calderon\nMajors last names A-H\nSpanish\nMichael Hammer\nMajors last names I-Q\nUndergraduate Advising\nMajors and minors in the College of Liberal & Creative Arts (LCA) should consult with two advisors each semester:\n(1) an advisor in the major and\n(2) a general education and university requirements advisor in the\nUndergraduate Advising Center\nForms:\nUndergraduate Advising Forms\nGraduate Advising\nGraduate Advising Forms\nGraduate Advising Center\n: The Division of Graduate Studies offers counseling and advising regarding issues ranging from applications to graduation.\nDegree Outcomes\nFind out about our undergraduate and graduate degree outcomes\nDegree Outcomes\nAdvising Resources\nAdvising Hub\nTutoring Center\nCareer Center\nCounseling and Psychological Services\nDisability Programs and Resource Center",
    "url": "http://mll.sfsu.edu/advising",
    "domain": "mll.sfsu.edu"
  },
  {
    "source": "http://mll.sfsu.edu/french-program/",
    "category": "general",
    "title": "French Program | Department of Modern Languages & Literatures",
    "content": "French Program\nThe French Program offers a wide selection of undergraduate and graduate courses in French language, literature and culture as well as providing the following degree options: Master of Arts in French, Bachelor of Arts in French (major) and a minor in French.\nThe French program offers a challenging and enriching experience for those who are interested not only in the French language but also in French and Francophone culture and society. French is one of the very few languages spoken all over the world, ranked the sixth most widely spoken language after Mandarin Chinese, English, Hindi, Spanish and Arabic.  Today, more than 220 million people speak French throughout the world: roughly 51% live in Africa and the Middle East, 40% live in Europe, 8% in the Americas, and 1% in Asia/Oceania.  As a result of population growth there will be more than 700 million French Speakers by 2050, 80% of whom will be living in Africa. The French Program is excited to offer an an avenue to engage with this expanding and diverse Francophone cultural and linguistic world.\nWe offer full-fledged Bachelor of Arts and Master of Arts programs and focus on developing proficiency in the language in a sociocultural context by offering a variety of courses and by conducting courses in culture and literature in French. Great importance is placed on participatory classes, which are small and practice-oriented, to help students adapt themselves to a changing world. Excellent computer facilities and a multimedia center provide support for our educational program.\nSF State is located in San Francisco, a cosmopolitan city with a large and active French community, which makes it a great place to study French. Students are also given a number of opportunities to study in France. Through the California State University’s international programs, selected students may study at Aix-en-Provence and in Paris. Such opportunities give students practical experience in everyday French life and culture, helping to build and reinforce these skills.\nIf you are an undergraduate student and wonder which class to take, you can take a placement test and see an advisor. Please contact an advisor for further details.\nDeclare a Major/Minor in French\nTo declare a major or minor, complete a\nDeclaration of Major/Minor form\n, then make an appointment to see the program advisor. Bring a copy of your most recent university transcript to the meeting.\nProgram Contacts\nProgram Coordinator:\nAnne Linton,\naelinton@sfsu.edu\nUndergraduate Advisor A-L:\nBlanca Misse,\nbmisse@sfsu.edu\nUndergraduate Advisor M-Z:\nAnne Linton,\naelinton@sfsu.edu\nResources\nFrench Program on Facebook\nFrench Course Descriptions\nAdditional Resources for M.A. Students\nProspective Undergraduates\nRequest Information\nBachelor of Arts\nThe Bachelor of Arts in French is a 30 unit major consisting of courses in French language, literature, linguistics, and culture.  All upper-division courses are conducted in French, and students are expected to use French in their speaking, reading, and writing. A minimum of four semesters is required to complete the required and elective courses for the major.\nAdvising\nStudents who have previously studied French should consult with a Faculty Advisor in the French Program for placement at the proper class level. You must also see a Faculty Advisor to determine the best sequence of courses for you. Students seeking to Major in French will meet with their Undergraduate Advisor and complete together a\nFrench Advising Worksheet\n, which will be updated each semester. Students are placed in a class on the basis of their academic background, an interview with the Faculty Advisor and the instructor of the class, and an on-line placement test. Lower division courses (100-200) listed for a major can be waived if the student has taken their equivalent or if sufficient knowledge and ability are demonstrated.\nPlacement Test\nThe Placement Test in French can be taken via iLearn-- please consult your advisor for further details. There are 45 questions in the online test:\nA grade above 40 = Student should enroll in courses beyond the prerequisites.\nA grade above 30 = Student should enroll in FR 216\nA grade above 20 = Student should enroll in FR 215\nA grade above 10 = Student should enroll in FR 102\nA grade less than 10 = Student should enroll in FR 101\nLower-Division\nStudents who begin at SF State with no previous knowledge of French are expected to spend at least two semesters at the beginning level (100), and at least two semesters at the intermediate level (200) before enrolling in upper-division courses.\nFirst year courses consist of two 5-unit semester courses, FR 101 and FR 102, taught in a sequence over two semesters. They meet five times a week, generally in the morning. The same textbook is used for both semesters. It is complemented by a Workbook, a video, and c.ds; extra material is available online. All classes are taught in French from the very beginning. A regular faculty member teaches the course three times a week, and a GTA teaches the other two days, under the supervision and coordination of the regular faculty member.\nSecond year courses consist of 3 semester units and meet two times a week during the day (8 a.m-4.pm.). We offer FR 215, Intermediate French I and FR 216, Intermediate French II.\nUpper-Division\nUpper-division courses, leading to a B.A. or a minor in French, consist of three units and meet two or three times a week during the day (8 a.m. - 4 p.m.). The French B.A. Program includes 30 semester units of core courses in French language, literature and culture.\nFrench majors must take:\nREQUIRED COURSES\nI. Language\n(choose one)\nMLL 325 Linguistics for Foreign Languages (3 units)\nFR 301 French Phonetics (3 units)\nFR 450 Translating Themes: English/French (3 units)\nFR 304 Advanced Grammar (3 units)\nII. Composition\n(choose one)\nFR 305 French Composition (3 units)\nIII. Culture\n(choose one)\nFR 400GW French Culture (3 units)\nFR 410 Contemporary French Civilization (3 units)\nIV. Literature\n(choose one)\nFR 500 Introduction to Literary Texts (3 units)\nFR 501 Contes et Poèmes (3 units)\nCAPSTONE COURSES\nBoth FR 500 and FR 501 have been designated as the “capstone courses” in French, meaning that students must take at least one in residence at SF State. They cannot be replaced by study abroad coursework.\nELECTIVE COURSES\n18 units (6 courses) in French courses numbered 300-699 not taken as required courses. At least 9 units (3 courses) must be taken at the 400 level or above\nNOTE: All upper-division courses are conducted in French, and students are expected to use French in their speaking, reading, and writing. It should take a minimum of four semester to complete the required and elective courses for the major (300-600 level; 30 units).\nSequence of Courses and Semesters Offered\nAt the lower division level, FR 101 and FR 102 are offered every semester; FR 215 is offered in the Fall and FR 216 in the Spring.\nAt the upper-division level, at least 2 of the 4 required courses will be offered in the Fall, and at least 2 of the 4 required courses will be offered in the Spring. Elective courses will be offered both in Fall and Spring semesters, their number may vary.\nLower division courses (Prerequisites for Major and Minor)\nFall\nFR 101 - First Semester French (5 units)\nFR 102 - Second Semester French (5 units)\nSpring\nFR 101 - First Semester French (5 units)\nFR 102 - Second Semester French (5 units) †\nFall\nFR 215 - Intermediate French part I\nSpring\nFR 216 - Intermediate French part II\nInternational Program\nStudents can complete up to one half of the undergraduate major degree in France. The International Program of the California State University has its French campus in Aix-en-Provence. This program has been very successful and offers the students a closely guided course-of-study in a university town and in one of the most pleasant regions of France. Students can also participate in an exchange program with universities in Paris (MICEFA), also coordinated by the office of International Programs on campus. A maximum of 15 units may be counted towards the major, or 10 towards the minor, the exact composition of which shall be determined in close consultation with your academic advisor. Please see your French Program Advisor at SF State both before and after you return from abroad.\nMinor in French\nThe French minor consists of up to 14 units of lower-division and from 9 to 15 units of upper-division coursework. Students must complete the lower-division sequence -- or the equivalent -- prior to beginning upper-division coursework in French language, literature, linguistics, and culture. The program may waive some or all lower-division requirements if the student demonstrates appropriate competency through advising, by taking the placement test, or by having taken the equivalent coursework elsewhere. All courses are conducted in French, and students are expected to use French in their speaking, reading and writing.\nAdvising\nStudents who have previously studied French should consult with a Faculty Advisor in the French Program for placement at the proper class level. You must also see a Faculty Advisor to determine the best sequence of courses for you. Students seeking to Minor in French will meet with their Faculty Advisor and complete together a French Advising Worksheet, which will be updated each semester. Students are placed in a class on the basis of their academic background, an interview with the Faculty Advisor, or instructor of the class, and/or an on-line placement test. Lower division courses (100-200) listed for a major can be waived if the student has taken their equivalent or if sufficient knowledge and ability are demonstrated.\nPlacement Test\nThe Placement Test in French can be taken via ilearn-- please consult your advisor for further details, or go to the MLL Multimedia Center (HUM 403) to gain access to the test. There are 45 questions in the online test:\nA grade above 40 = Student should enroll in courses beyond the prerequisites.\nA grade above 30 = Student should enroll in FR 216\nA grade above 20 = Student should enroll in FR 215\nA grade above 10 = Student should enroll in FR 102\nA grade less than 10 = Student should enroll in FR 101\nCourse Requirements\nAll upper-division courses are conducted in French and students are expected to use French in their speaking, reading, and writing.\nStudents must complete the lower-division sequence, or the equivalent, prior to beginning upper-division coursework. The program may waive some or all lower-division requirements if the student demonstrates appropriate competency through advising, by taking the placement test, through AP examination, or through equivalent coursework taken elsewhere. Students must pass a minimum of 15 units to successfully complete the minor. A minimum of 9 upper-division units need to be taken in residence and cannot be transferred from study abroad, or another institution. All lower-division units can be transferred, as appropriate.\nStudents should meet with an advisor or take the placement test prior to enrolling in their first French class. To take the online placement test, email the French program coordinator.\nPathways:\nStarting at FR 101, students will complete a 23-unit minor (FR 101, FR 102, FR 215, FR 216, FR 304 or FR 305, 3 upper-division elective units, and either FR 500 or FR 501).\nStarting at FR 102, students will complete a 19-unit minor (FR 102, FR 215, FR 216, FR 304 or FR 305, 3 upper-division elective units, and either FR 500 or FR 501).\nStarting at FR 215 level, students will complete a 15-unit minor (FR 215, FR 216, FR 304 or FR 305, 3 upper-division elective units, and either FR 500 or FR 501).\nStarting at FR 216, students will complete a 15-unit minor (FR 216, FR 304 or FR 305, 6 upper-division elective units, and either FR 500 or FR 501).\nStarting at 300-level, students will complete a 15-unit minor (FR 304 or FR 305, 9 upper-division elective units, and either FR 500 or FR 501).\nLinks to the pathways:\nR 101\n,\nFR 102\n,\nFR 215\n,\nFR 216\n,\nFR 304\n,\nFR 305\n,\nFR 500\nor\nFR 501\nSequence of Courses and Semesters Offered\nAt the lower division level, FR 101 and FR 102 are offered every semester; FR 215 is offered in the Fall and FR 216 in the Spring.\nAt the upper-division level, at least 2 of the 4 required courses will be offered in the Fall, and at least 2 of the 4 required courses will be offered in the Spring. Elective courses will be offered both in Fall and Spring semesters, their number may vary.\nLower division courses (Prerequisites for Major and Minor)\nFall\nFR 101 - First Semester French (5 units)\nFR 102 - Second Semester French (5 units)\nSpring\nFR 101 - First Semester French (5 units)\nFR 102 - Second Semester French (5 units) †\nFall\nFR 215 - Intermediate French part I\nSpring\nFR 216 - Intermediate French part II\nInternational Program\nStudents can do part of the undergraduate major degree in France. The International Program of the California State University has its French campus in Aix-en-Provence. This program has been very successful and offers the students a closely guided course-of-study in a university town and in one of the most pleasant regions of France. Students can also participate in an exchange program with universities in Paris (MICEFA), also coordinated by the office of International Programs on campus. The number of credits earned abroad that may be counted towards the major is 15 (towards the minor is 10), and determined though consultation with the appropriate French Program advisor at San Francisco State University.\nMasters of Art (Advancement to Candidacy)\nThe M.A. Program in French at SF State requires the completion of 30 units of course work in French Literature, culture or language, and offers two different culminating experience options: Master's Comprehensive Written and Oral Examinations, or a Master's Thesis and Master's Comprehensive Oral Examination.\nOption I\n30 units of coursework and Comprehensive Written and Oral Examinations.\nOption II\n27 units of coursework and FR 898 Master’s Thesis (3 units), plus a Master’s Comprehensive Oral Examination.\nStudents must take a minimum of 15 units of graduate courses in French.\nFor the remaining courses, they have the choice of 6 units of graduate / paired courses in French, and 9 or 6 units (according to the option) of graduate /paired / undergraduate courses in French, or related subjects. For instance, students interested in the teaching profession can take two courses in related subjects from the Department of Modern Languages and Literatures: Curriculum and Instruction I and II, e.g. 6 units of graduate course work towards the completion of their degree.\nTransfer of units and cross-registration:\nYou may transfer up to 12 units taken as an Unclassified Graduate Student at SF State, subject to approval of the graduate adviser.\nIf you cannot find courses to meet your interests or time schedule in our program, you may take up to 3 units per semester through cross-registration at other universities, in particular U.C. Berkeley, subject to approval by the graduate advisor.\nYou may transfer up to 6 post-baccalaureate units you took at another university, subject to approval by the graduate advisor in French and the graduate division of SF State, as long as these units were not counted towards another diploma.\nLevel I and Level II English requirement\nAll graduate students at SF State must complete Level I and Level II writing English requirements. The level I requirement is met when applying to the French M.A. program, by giving to the French Program a statement of purpose in English (500 words) along side the same or a similar statement written in French.\nThe level II writing requirement needs to be met while in the graduate program. It can be met in the following ways:\nOption I:\nby submitting for evaluation to the French faculty either a 15-20 page essay written in English for a graduate class (program other that the French Program), or the English translation of a 15-20 page essay written in French for a graduate class from the French Program, unless the French instructor of that class accepts to receive an essay written in English.\nOption II:\nstudents writing a thesis must write a 15-page summary of their thesis in English, if they do not choose option I. This summary will be submitted for evaluation to the French faculty.\nIn order to fulfill this requirement successfully, discuss how to be best prepared for it with the graduate advisor early in the course of your graduate studies, especially if English is not your first language or if you have deficiencies in writing.\nFor more information on the M.A. Program in French requirements and option, consult the following documents:\nCheck list for French M.A. Students (found on the\nFrench Resources page\n)\nFrench M.A advising worksheet\nGuidelines Thesis – French (found on the\nFrench Resources page\n)\nReading List – French M.A.\nThe M.A. Program in French - Course Descriptions\nHere is a sample of French M.A. courses taught in the past 3 years:\nL’Amour et la Guerre au Moyen Age\nLes Femmes du Moyen Age à la Renaissance\nLe Corps à la Renaissance\nLe Conte de Fées du 17e siècle\nLe Spectacle du Moyen Age au 17e siècle\nLe Merveilleux du Moyen Age au 17e siècle\nLe Théâtre du 17e et 18e siècle\nLes Philosophes (18e siècle)\nLes Deux Sexes du Roman (18e siècle)\nLe Roman du 19e siècle\nParis: Capitale du 19e siècle\nMonstres du 19e siècle\nThéâtre et poésie romantique\nArt et Poésie 1860-1940\nLe Roman du 20e siècle\nHumour, Arts et Littérature (20e siècle)\nLa Francophonie (20e siècle)\nExhaustive on-line French M.A. course titles and descriptions are available in the University Bulletin.\nInternational Program\nStudents can do part of the M.A. degree in France. They can participate in an exchange program with universities in Paris (MICEFA), coordinated by the office of International Programs on campus. The number of credits earned abroad that may be counted towards the M.A. is determined though consultation with the Graduate French Program advisor at San Francisco State University.\nIn addition to the aforementioned requirements, students are advised to do the following:\nSeek Graduate Advising Every Semester\nStudents should plan their courses in consultation with the graduate advisor and fill out the “Advising Worksheet - M.A. student in French” every semester. Pay attention to the type of courses and number of units needed to graduate and cross-registration regulations if you want to take courses in universities such as U.C. Berkeley or other universities from the CSU system. Send an electronic copy to your advisor to keep him/her informed of the courses taken.\nIf you are conditionally admitted to the program, seek the advisor for “Advancement to Classified Graduate Standing” when you complete the courses specified as preconditions (Such course work may NOT be used to meet degree requirement).\nBegin studying early the document containing the “Reading List” of the French M.A. Program and the description of the culminating experience requirements (option I or option II). It is a good idea to begin preparing your reading list for the oral exam early on. It is also a good idea to start reflecting on your preferences concerning the culminating experience requirements. Check also the document: “Guidelines Thesis – French”.\nFulfill the Second Level English Proficiency Requirement\nAll graduate students must complete Level I and Level II writing English requirements. The level I requirement is met when applying to the graduate program, by giving to the French Program a statement of purpose in English (500 words) along side the same statement written in French.\nThe level II writing requirement needs to be met while in the graduate program. It can be met in the following ways:\nChoice I:\nby submitting for evaluation to the French faculty either a 15-20 page essay written in English for a graduate class (pr",
    "url": "http://mll.sfsu.edu/french-program/",
    "domain": "mll.sfsu.edu"
  },
  {
    "source": "http://mll.sfsu.edu/certificate-multilingual-international-business-competencies",
    "category": "general",
    "title": "Certificate in Multilingual & International Business Competencies | Department of Modern Languages and Literatures",
    "content": "Certificate in Multilingual & International Business Competencies\nGain basic competency in two essential sets of skills sought after by today’s employers: Knowledge of international business operations as well as proficiency in languages other than English\nView requirements for the Certificate in Multilingual & International Business Competencies\nThe certificate (pending approval) requires completion of 4 classes, two of which are chosen from a list of classes offered by the Departments of International Business (IBUS) and Apparel Design & Merchandising (ADM) and two from the list of language classes offered by the Department of Modern Languages and Literatures (MLL). For their choice of language classes, students are encouraged to complete two sequential classes in the same language. Depending on class choice, completion of the certificate requires 12-14 units.\nCOURSE REQUIREMENTS\nGROUP 1: Choose 2 classes\nIBUS 517: Legal Environment of World Business\nIBUS 531: Cross-Cultural Innovation and Creativity in Business and Management\nIBUS 592: Doing Business in Greater China\nIBUS 593: Doing Business in Europe\nIBUS 620: Research in International Business and the Global Market\nIBUS 638: Global Leadership and Cultural Competencies\nADM 560: Supply Chain Management in the Textile and Apparel World Marketplace\nGROUP 2: Choose 2 language classes (LD or UD) with the following prefixes\nArabic (ARAB)\nChinese (CHIN)\nFrench (FR)\nGerman (GER)\nItalian (ITAL)\nJapanese (JAPN)\nPersian (PRSN)\nRussian (RUSS)\nSpanish (SPAN)\nStudents wishing to apply need to meet with the Program Coordinator Dr. Frederik Green, current chair of MLL or program Advisors Dr. Bruce Heiman, current chair of IBUS, or Dr. Amy Dorie, chair of Apparel Design & Merchandising (ADM), to discuss their course selection. Following the meeting, students submit a short statement of purpose that includes a list of classes they intend to enroll in along with their certificate application (PDF) to the Department of Modern Languages and Literatures office in HUM 475 or email the documents to the Program Coordinator Dr. Frederik Green (\nfgreen@sfsu.edu\n).\nPlease complete\nthis survey\nif you are interested in pursuing this certificate.",
    "url": "http://mll.sfsu.edu/certificate-multilingual-international-business-competencies",
    "domain": "mll.sfsu.edu"
  }
]