[
  {
    "source": "http://sxs.sfsu.edu/",
    "category": "general",
    "title": "Department of Sociology & Sexuality Studies | Department of Sociology & Sexuality Studies",
    "content": "Department of Sociology & Sexuality Studies\nThe Department of Sociology & Sexuality Studies encompasses two academic program areas, both of which are committed to critical analysis of societies, with particular emphasis on inequalities, injustices and processes of social change.\nOur Programs\nSociology\nThe Sociology program’s primary mission is to provide students with the theoretical and methodological skills needed to better understand, critique and contribute to the worlds in which they live.\nThe major prepares students for a broad range of career paths, including employment in community-based organizations, local governments, human service agencies and research settings. It also provides students with a foundation to successfully pursue graduate work in multiple areas.\nThe program offers a B.A. in Sociology and an undergraduate minor in Sociology.\nMore about the Sociology Program\nSexuality Studies\nSF State is a pioneer in sexuality teaching and research in the United States with a 50-year history of advocating and teaching sexuality education, sexual literacy and social justice for all people.\nWe explore sexuality as it intersects with gender, race, class, ability, nation, and other categories of difference. Our work is shaped by feminist thought, queer studies and queer of color critique, critical race theories and methodological innovation.\nThe program offers an M.A. in Sexuality Studies, an undergraduate minor in LGBT Studies and an undergraduate major in Sexuality Studies.\nMore about the Sexuality Studies Program\nExplore Degrees\nB.A. in Sociology\nM.A. in Sexuality Studies\nUndergraduate Minors\nCurrent Happenings\nNews\nBriana Fernandez Diaz 11/17/1999-9/13/2022\nThe Department of Sociology and Sexuality Studies is deeply saddened by the loss of our former student, Briana Fernández Dia…\nNew Assistant Professor, Dr. Angela Fillingim!\nThe Department of Sociology and Sexuality Studies at San Francisco State University is pleased to announce that Dr. Angela F…\nStatement In Support of Asian American and Pacific Islander Communities\nThe faculty of the Department of Sociology & Sexuality Studies at San Francisco Statemourn and condemn the recent brutal…\nMore News\nMore events coming soon!\nMore Upcoming Events\n\"In a racist society it is not enough to be non-racist, we must be anti-racist.\"\n— Professor Angela Davis, UC Santa Cruz Distinguished Professor Emerita and past faculty member, San Francisco State University, College of Ethnic Studies",
    "url": "http://sxs.sfsu.edu/",
    "domain": "sxs.sfsu.edu"
  }
]