[
  {
    "source": "https://vpsaem.sfsu.edu/",
    "category": "general",
    "title": "Welcome from the Vice President for Student Affairs & Enrollment Management | Vice President for Student Affairs & Enrollment Management",
    "content": "Welcome from the Vice President for Student Affairs & Enrollment Management\nDear Gator Family,\nWelcome back to San Francisco State University for the Fall 2025 semester! I hope your summer brought moments of rest, connection, and joy—and that you were able to spend meaningful time with friends and family.\nWhether you are joining us as a first-year student, transferring from another institution, or returning to continue your academic journey, we are thrilled to have you here. Your energy and presence bring our campus to life after the quiet of summer. I also want to thank our dedicated faculty and staff whose commitment to teaching, supporting, and guiding our students is the foundation of our vibrant and diverse community. Together, we carry forward SF State’s proud tradition of academic excellence and student success.\nAs you begin the semester, remember that SF State offers a wide range of resources to help you thrive—academically, personally, and professionally. The\nStudent Concerns and Inquiries Quick List\nis a great starting point, with links to services from health care and counseling to academic advising and study abroad.\nI encourage you to get involved beyond the classroom. Join a club or organization, volunteer in the community, explore leadership opportunities, or try something new. Challenge yourself, embrace new experiences, and make the most of your time as a Gator.\nIf you need guidance or support, the\nDivision of Student Affairs\nis here for you. From your Resident Assistant and hall director to the Counseling Center, Gator Health, and the Mashouf Wellness Center, our team is ready to help you navigate challenges and create a rewarding SF State experience.\nThis fall is full of opportunities to connect—starting with\nGatorFest!\nand continuing with events throughout the semester. Be sure to look at\nthe full calendar of events for the Fall\nto see some of the many ways to engage with campus life.\nI look forward to meeting you, hearing your stories, and seeing all that you will accomplish this year. Here’s to a confident, joyful, and successful semester—immerse yourself in the Gator experience!\nWith warm regards,\nDr. Jamillah Moore (she/her/hers)\nVice President for Student Affairs & Enrollment Management",
    "url": "https://vpsaem.sfsu.edu/",
    "domain": "vpsaem.sfsu.edu"
  }
]