[
  {
    "source": "https://studentsuccess.sfsu.edu/",
    "category": "general",
    "title": "Student Success and Graduation Initiative | Student Success and Graduation Initiative",
    "content": "Student Success and Graduation Initiative\nAt SF State, holistic student success is the culmination of learning that happens both inside and outside of the classroom. Holistic student success acknowledges our students as unique individuals with varying needs for support to be successful in achieving their education, career, and personal goals. We seek to build upon the existing strengths of students to enhance their knowledge, perseverance, skills, and opportunities, and to support student wellbeing as they engage with our campus, as well as to include families and community members as contributors in supporting students on their path to graduation and their future.",
    "url": "https://studentsuccess.sfsu.edu/",
    "domain": "studentsuccess.sfsu.edu"
  },
  {
    "source": "https://studentsuccess.sfsu.edu/long-term-strategies",
    "category": "general",
    "title": "Long-Term Strategies | Student Success and Graduation Initiative",
    "content": "Long-Term Strategies\nOur campus strategy to increase course availability includes three components:\nCourse Availability and Curriculum\nOur campus strategy to increase course availability includes three components:\ndata-informed analysis of student course demand to enable effective curricular planning;\na fully funded curriculum, including increased funding for lecturers, GTAs and tenure-line faculty to teach required courses in high-demand major and general education requirements; and\nsupport for programs to analyze and restructure their curriculum and course pedagogy—with a special focus on prerequisites, requirements, quantitative reasoning and electives—in order to reduce students’ excess unit load and advance their progress to degree, academic achievement and success.\nAdvising\nThe second-most identified barrier to timely graduation, according to the senior exit surveys, is inadequate advising. In response, Academic Affairs conducted an operational review of advising in 2015-16, which utilized student surveys, focus groups and analysis by external consultants. We are preparing to implement a number of improvements including:\nhiring new advisors in both the central Undergraduate Advising Center (UAC) and the college-based resources centers;\nconducting a review of advising that takes place in other administrative units;\nraising funds to renovate the existing UAC to be a more accessible and welcoming space for our students;\nimplementation of a data management system to facilitate more strategic, case-management-based advising; and\nproactively identifying students in need of assistance earlier in each academic term.\nStudent Success Data\nOur plan to develop a more strategic advising system necessitates a responsive, accessible platform that makes student success data available to departments, colleges and the central administration in order to monitor and address student degree progress. Data will be captured in “real time” and longitudinally by:\nclass cohort, to track impact of large scale interventions over time;\ntargeted student communities, to ensure that we close and keep closed any opportunity gaps;\nmajor/program, to ensure ongoing curricular and co-curricular improvements are achieving intended goals and outcomes; and\ncourses/sections, to help improve teaching and learning outcomes.\nFirst Year of College\nSF State experiences its highest levels of attrition in the lower division, when 34% of our beginning FTF students leave without a degree before beginning their junior year. In order to increase retention rates, we plan to:\nexpand academic and social engagement;\nassist students in identifying appropriate majors;\nreduce health and wellness barriers; and\nincrease student success in the first year.\nTargeted Support Services\nTo enhance our capacities to improve student engagement, new personnel resources needed include but are not limited to:\nexpansion of Metro academies across the campus;\ntutoring, particularly in writing and math;\nsupplemental instruction aligned with high failure-rate courses;\nhealth, including mental health, and recreation professionals to improve student wellbeing, decrease stress and increase active learning capacities;\na first-year faculty director to collaborate with the FYE director being hired in Student Affairs and Enrollment Management; and\nfaculty resources to teach first-year seminars and meta-major courses.\nFaculty Hiring and Development\nIf SF State can accomplish any of our SSGI goals, we need to:\nmaintain an adequate number of faculty to support the curriculum;\nprovide the professional development neccessary to support student learning and retention efforts; and\nimplement a hiring strategy that targets bottleneck courses and highly enrolled major programs.",
    "url": "https://studentsuccess.sfsu.edu/long-term-strategies",
    "domain": "studentsuccess.sfsu.edu"
  },
  {
    "source": "https://studentsuccess.sfsu.edu/home",
    "category": "general",
    "title": "Student Success and Graduation Initiative | Student Success and Graduation Initiative",
    "content": "Student Success and Graduation Initiative\nAt SF State, holistic student success is the culmination of learning that happens both inside and outside of the classroom. Holistic student success acknowledges our students as unique individuals with varying needs for support to be successful in achieving their education, career, and personal goals. We seek to build upon the existing strengths of students to enhance their knowledge, perseverance, skills, and opportunities, and to support student wellbeing as they engage with our campus, as well as to include families and community members as contributors in supporting students on their path to graduation and their future.",
    "url": "https://studentsuccess.sfsu.edu/home",
    "domain": "studentsuccess.sfsu.edu"
  },
  {
    "source": "https://studentsuccess.sfsu.edu/long-term-challenges",
    "category": "general",
    "title": "Long-Term Challenges | Student Success and Graduation Initiative",
    "content": "Long-Term Challenges\nChallenges\nContributing Factors\nStrategies\nGraduation Delays\nUndersupply of required courses\nInadequate advising\nInstitute data-informed curriculum planning\nSupport curriculum redesign\nCreate new structures for intrusive advising\nHire and train more advisors\nRenovate central advising office\nLower-Division Attrition\nLow student engagement\nCampus-wide analysis of the first year\nExpand metro college success program\nEnhance co-curricular life (expand health promotion, improve residential life, career services)\nOpportunity Gaps\nUnder-supported students\nUnder-supported faculty\nReview campus tutoring and academic support\nImprove early outreach to struggling students\nIdentify and redesign courses with high d, w, f rates\nDevelop teaching and learning commons",
    "url": "https://studentsuccess.sfsu.edu/long-term-challenges",
    "domain": "studentsuccess.sfsu.edu"
  }
]