[
  {
    "source": "https://icce.sfsu.edu",
    "category": "general",
    "title": "Welcome | Institute for Civic and Community Engagement (ICCE)",
    "content": "Welcome\nThe Institute for Civic and Community Engagement (ICCE) provides opportunities for civic engagement and leadership development at San Francisco State University for\nstudents, faculty, staff, and community members\n. Through innovative courses, experiential learning, political engagement, participatory action research, and direct services, we connect the resources and expertise of the urban university with the knowledge and assets of diverse communities. Working locally, statewide, nationally, and internationally, we cultivate strong leaders who will effectively advocate for social, economic, and educational inclusion, and fully participate in the civic life and political processes of their communities.\nExplore ICCE\nStudents\nFaculty and Staff\nCommunity Partners\nThe documents on this website might not be fully accessible to persons with disabilities. We are working to fix these accessibility barriers. If you experience difficulty in accessing this content, please contact\nicce@sfsu.edu\nand we will provide you with accessible alternatives.",
    "url": "https://icce.sfsu.edu",
    "domain": "icce.sfsu.edu"
  },
  {
    "source": "https://icce.sfsu.edu/partner-request",
    "category": "general",
    "title": "Partner with Us - Request to Initiate Partnership | Institute for Civic and Community Engagement (ICCE)",
    "content": "Partner with Us - Request to Initiate Partnership\nThank you for your interest in partnering with San Francisco State University. We’re excited about the possibility of collaborating with your organization or department and connecting you with our campus community in ways that support your mission and offer meaningful learning experiences for students.\nWhether you are an\noff-campus community partner\nor an\non-campus department or program\n, the first step in initiating a partnership is registering in\nULink\n, SF State’s official digital platform for community engagement. This helps us learn more about your site and the learning opportunities you would like to make available to students, including any relevant safety protocols. The registration should be completed by someone familiar with the learning activities students will be involved in and your safety policies and procedures.\nSF State collaborates with organizations and departments across a wide range of sectors to provide\napplied learning opportunities\nfor students, including\ncurricular (for-credit)\n,\nco-curricular (non-credit)\n,\npaid\n, and\nunpaid\nroles. All partners—both off-campus and on-campus—must complete the ULink registration process.\nIn addition:\nOff-campus partners\noffering\nopportunities\nwill also be asked to sign a\nLearning Placement Site Agreement (LPSA)\nto formalize the partnership.\nOn-campus departments and programs\nwill instead be sent an\nOn-Campus Learning Placement Site Acknowledgement\nform to confirm alignment with university protocols for student learning and safety.\nIf you represent an\nSF State student organization\n, please use the\nSF State Activities & Events platform\nto post available roles, as this is the appropriate space for student-led, on-campus opportunities.\nThe\nInstitute for Civic & Community Engagement (ICCE)\ncoordinates and provides administrative support for academic internships, community service learning, and related partnerships. We’re here to help you navigate this process and look forward to working together.\nEstablish a Partnership with SFSU\nTo initiate a partnership request, it is a simple 2-step process:\n1) Register Your Organization with ULink\nThe first step for an agency to become a \"preferred\" community partner is to register as an \"Organization\" in ULink. ULink is SF State's official community engagement portal.\nDuring registration, you will be asked to complete a Learning Site Assessment (LSA): Site Requirements & Safety Information. As you complete the LSA, you will also be asked to provide a detailed description of the service-learning or internship opportunities available at your organization. You can upload an existing position description that you already have available. If you already have a student placed in your organization, please upload their current position description/tasks. This information helps match SF State students with roles that align with their skills and interests. This will also help ICCE be able to more effectively promote your available opportunities.\nRegister with ULink\nULink How to Register Guide\n2) Review & DocuSign University-Partner Organization Agreement\nOnce your ULink registration is completed and reviewed, we will then send you a\nLearning Site Placement Agreement (LPSA\n)\nfor review and signature.\nWhen the Agreement is executed by all parties, ICCE will then approve your organization in ULink and you then will be able to have full access to ULink to create and post your opportunities.\nNeed help or have questions? Contact the ICCE team at\nicce-communityplacement@sfsu.edu\nDownloadable Sample Document\nSAMPLE-SF State Learning Placement  Site Agreement-Final-2.8.24.pdf\n171.05 KB\nOn-campus Depts./Programs\n1) Register Your SFSU Dept./program with ULink\nIf your on-campus department or program is hosting academic interns or service-learning students, you’ll need to register in\nULink\n, SF State’s official community engagement portal. This ensures alignment with university protocols and enables ICCE to support your student placements appropriately. This applies to all non-clinical roles, including departments or programs that may have hosted students in the past but are not yet registered in ULink.\nRegistration involves two simple steps:\nRegister as an “Organization” in ULink.\nComplete the Learning Site Assessment (LSA): Site Requirements & Safety Information.\nAs part of the LSA, you’ll be asked to provide a short description of the internship or service-learning opportunities your department offers. You can upload an existing position description, or if a student is already placed, the tasks they are currently completing. This helps match SF State students with roles that align with their academic and career interests and allows ICCE to highlight your opportunities more effectively.\nRegister with ULink\nULink How to Register Guide\n2) Review & DocuSign the SFSU On-Campus Learning Placement Site Acknowledgement\nAfter your registration is reviewed, ICCE will send you the\nOn-Campus Learning Placement Site Acknowledgement\nform. This form confirms your department’s understanding of and commitment to university expectations related to student learning and placement. Once signed by all parties, your department will be approved in ULink and able to post and manage student opportunities directly through the platform.\nNeed help or have questions? Contact the ICCE team at\nicce-communityplacement@sfsu.edu\nAdobe Acrobat Reader\nis required to view PDF files. This is a free program available from the\nAdobe web site\n. Follow the download directions on the Adobe web site to get your copy of Adobe Acrobat Reader.\nThe documents on this website might not be fully accessible to persons with disabilities. We are working to fix these accessibility barriers. If you experience difficulty in accessing this content, please contact\nicce@sfsu.edu\nand we will provide you with accessible alternatives.",
    "url": "https://icce.sfsu.edu/partner-request",
    "domain": "icce.sfsu.edu"
  },
  {
    "source": "https://icce.sfsu.edu/sf-state-ulink",
    "category": "general",
    "title": "SF State ULink | Institute for Civic and Community Engagement (ICCE)",
    "content": "SF State ULink\nWhat is ULink?\nULink is SF State's digital community engagement platform, connecting students, faculty/staff, and community partners.\nWe strive to create an institution of higher education that is fully engaged by developing and sustaining strategic partnerships to increase access to educational opportunities, leading to positive impacts in communities.\nClick here to view a graphic showcasing possible ULink connections.\nQuestions? / Need more Information?:\nicce-communityplacement@sfsu.edu\nStudent\nFaculty/Staff\nOrganizations",
    "url": "https://icce.sfsu.edu/sf-state-ulink",
    "domain": "icce.sfsu.edu"
  },
  {
    "source": "https://icce.sfsu.edu/course-designation-CEL%20initiative",
    "category": "general",
    "title": "Overview | Institute for Civic and Community Engagement (ICCE)",
    "content": "Overview\nTo align with the CSUs systemwide understanding of Community Engaged Learning (CEL) courses, the Institute for Civic and Community Engagement has re-developed the course attribute processes to better support faculty efforts, understand student learning, and community impact.\nOverview ➔\nAttributes: CSL and CCEL\nBenefits of CEL Attributes\nHow to Propose a CCEL/CSL Designated Course\nHow to Revise an Existing Course (Not Previously Designated CSL/CCEL)\nAlready Teaching a CSL course?\nHow to Record CSL Hours\nThe Purpose & Benefits of Community Engagement Learning\nFor over 20 years, community-engaged learning (CEL) has contributed to high-quality student learning across the CSU and currently, CEL directly advances the CSU’s long-term goals of eliminating equity gaps for students.\nIn alignment with Graduation Initiative 2025, the Chancellor’s Office charged the CSU Center for Community Engagement (COCCE) to lead an effort (the Community-Engaged Learning Initiative) to improve data collection and identify the spectrum of community-engaged learning courses taking place across the CSU.  As a result, the Chancellor's Office has instituted two common systemwide “attributes” for community-engaged learning courses. This CEL Initiative is possible due to systemwide collaboration and financial support from California’s Call to Service (CCS) initiative.\nAs part of this effort, the Institute for Civic and Community Engagement is working towards institutionalizing the faculty survey (\nCommunity Engagement Learning Attribute Tool - CELT\n) so that courses are periodically reviewed to ensure the attribute is relevant based on the student learning experience and partnerships happening within the course at the time of review. Our goal is to have this survey completed for 100% of unique CE/SL courses by May 2025.\nCommunity Engaged Learning Tool (CELT)\nOnce you have reviewed the CEL Essential Elements Taxonomy, begin taking the CELT for your course!\nTake the CELT\nDepartment Guide for Community Engaged Attribute\nThis document is a resource for departments and faculty on moving a course through Course Leaf\nSee Step by Step Guide\nCommunity Engaged Learning Essential Elements\nClick the link below to view the Community Engaged Learning Essential Elements Interactive Roadmap\nReview CEL Essential Elements\nHow to Complete the CELT Tutorial\nBrought to you by the CSU Center for Community Engagement\nCheck out Video\nFrequently Asked Questions\nAcademic Senate Policy\nAcademic Senate Policy #S22-224, Designation Policy for Community Service Learning Courses\nCurrent (supersedes Policy # S03-224) Senate Approval: 5/03/2022 [Presidential Approval: 5/06/22]\nAbstract\nThis policy seeks to provide definitions and policy, in accordance with guidance from the Chancellor’s Office, on the process for designating various types of community service or community-engaged courses.\nSummary\nAs part of the Chancellor’s Office (CO) 2018-19 California’s Call to Service Initiative, the CO identified an accountability goal to strengthen system-wide data collection infrastructure around community-engaged courses (as defined by the Chancellor's Office Center for Community Engagement). The purpose is to improve data collection to better support faculty and understand student learning, faculty efforts, and community impact. All campuses must implement two system-wide course attributes (community service learning and community-engaged learning) in the course management system to effectively identify and track these types of courses. Campuses are also required to distinguish service learning, as a distinct pedagogy, from community-engaged learning, which can include a variety of community-based learning experiences. A working group consisting of representatives from the Chancellor’s Office, CSU campuses, and the CSU Academic Senate developed the tools and resources needed for this initiative. The Institute for Civic and Community Engagement (ICCE) is overseeing this effort for San Francisco State University, including the dissemination, tracking, assessment, and reporting of the survey and survey data.\nCommunity service learning (CSL) and community-engaged learning (CEL) include a range of high-impact pedagogical practices that enhance students’ learning and foster civic understanding through active course-based learning that involves meaningful collaboration with community partners. The academic study may be in any discipline or combination of fields. Student learning outcomes benefit the common good, whether through direct service to communities in need or the organizations that serve them or through indirect service projects that contribute to community capacity building more broadly. CSL and CEL enhance academic learning by allowing students to make connections between their classroom education and its application to the field. These high-impact learning experiences help students to clarify their career goals and acquire work-related skills, develop a heightened sense of civic responsibility and awareness of moral and ethical issues, and provide them with a wide variety of work options with the goal of being value-added for the community they serve. Working from a common understanding will further the university’s identity as an “engaged institution,” contribute to quality transparent learning experiences for students, and offer opportunities for faculty dialogue and scholarship within and across disciplines.\nAcademic Senate Policy: Course Designation\n#S22-224 Academic Senate Policy\n362.96 KB\nHow are the Community-Engaged Learning (CEL) attributes being applied?\nThe attributes are applied in the student information system and based on a CEL Tool (CELT) that asks faculty about their teaching and community partnership\nii\npractices. The CELT is based on a\ncourse taxonomy for community- engaged learning\nwhich outlines the essential elements of these types of courses within a spectrum of implementation practices. Faculty complete a separate CELT for each course and the attribute is applied based on the faculty member’s responses.\nHow frequently will faculty be asked to complete the CELT?\nFaculty will need to complete a separate CELT for each CEL course they teach and should be completed at a minimum of every five years, but it may also be completed anytime there is a significant course change (i.e., a new CEL course developed, significant revisions to the CEL course or change in faculty member teaching the CEL course).\nWhat happens after a faculty member completes the CELT?\nFaculty members who complete the CELT will receive a Confirmation Email with your designated CEL attribute (either CCEL or CSLI). If more information is needed, ICCE will follow up with you.\nWhat if my course is already attributed as CSL?\nFor course that are currently listed as CSL, ICCE recommends faculty still take the\nCELT Survey\nand edit the designated community engagement course attribute if needed.\nWe acknowledge our faculty who have committed to teaching community-engaged learning courses and greatly appreciate current CSL faculty for completing the CELT tool. It is our intention to use the CELT results to enhance our services to provide faculty with resources to support community-based teaching and strengthen community partnerships. Furthermore, working from a common understanding will further the university’s identity as an “engaged institution,” contribute to quality transparent learning experiences for students, and offer opportunities for faculty dialogue and scholarship within and across disciplines.\nRelated Links\nCall to Service Grants\nCurrent List of CSL Courses\nStudent Community Placements\nCEL Attributes Guide for AOC/Dept. Chairs",
    "url": "https://icce.sfsu.edu/course-designation-CEL%20initiative",
    "domain": "icce.sfsu.edu"
  }
]