[
  {
    "source": "http://museum.sfsu.edu/",
    "category": "general",
    "title": "Museum Studies | College of Liberal & Creative Arts",
    "content": "Welcome to the Museum Studies Program\nThe Museum Studies Program, unique within the California State University system and highly regarded nationally, stays on the cutting edge of its field. Students build upon their knowledge in related disciplines, gaining expertise through practical experience, professionalism and important developments in the museum world.\nWhy Museum Studies at SF State?\nInterdisciplinary Curriculum\nTeaching Museum\nFaculty-Practitioners\nBroad, interdisciplinary curriculum reflects 21\nst\ncentury museum practice of connecting to communities and engaging diverse audiences. Courses combine theory, real-world practice, and career development. Students also have access to complementary courses throughout the University.\nGain practical experience creating exhibits, educating the public, and caring for collections in the Global Museum, the teaching lab for the program. Facilities include a 2,000 square foot public gallery that's entirely student-operated, state-of-the-art collections preservation areas, and digital lab. Stewarded collections come from the Ancient Mediterranean, Africa, Asia, Oceania, and the Americas. Public programming includes student-developed exhibitions, educational field trips, and special events for SF State and the surrounding community.\nMuseum Studies faculty are experienced teachers, scholars, and museum professionals who emphasize ethics, engagement, and global citizenship. They are leaders in their disciplines, participate in professional conferences and symposia, and serve on museum boards and similar community work.\nAnnouncements\nNews\nOctober 24, 2024\nMuseum Studies is Hiring: Assistant Professor in Museum Studies\nMuseum Studies is hiring for the position of Assistant Professor in Museum Studies.\nOctober 11, 2022\nFogarty Gives Advice On Museum Jobs\nChristine Fogarty, associate director of the Global Museum and lecturer in Museum Studies, participated in a panel discussio…\nSeptember 09, 2022\nKelli-Ann Nakayama Named Chief Development Officer at JANM\nAlumna Kelli-Ann Nakayama is the new chief development officer for the Japanese American National Museum.\nRead the article.…\nMore News\nMore events coming soon!\nMore Upcoming Events",
    "url": "http://museum.sfsu.edu/",
    "domain": "museum.sfsu.edu"
  },
  {
    "source": "http://museum.sfsu.edu/virtual-exhibits",
    "category": "general",
    "title": "Virtual Exhibits | Global Museum | Museum Studies",
    "content": "Virtual Exhibits\nClearly Polluted\nInspired by the Black Lives Matter movement,\nClearly Polluted: The Fight for Environmental Justice in the Bay Area\ninvestigates environmental racism and its ongoing, disproportionate impact on Black, Indigenous, and people of color, or BIPOC, communities in the San Francisco Bay Area. Presented in-person, October 29, 2022-December 8, 2022.\nView\nClearly Polluted\nShow and Tell\nShow & Tell: Ordinary Objects, Revealing Stories\nfeatured a collection of treasured memories from nine student storytellers enrolled in Museum Studies 730 Exhibition Development. Presented in-person April 22, 2022-May 11, 2022.\nClimate Stories\nexplores the impacts of climate change on Indigenous communities across the globe and action being taken now, including on the SF State campus.\nView\nClimate Stories\nThings Seen\nThings Seen: Experiences of COVID-19\npresents a selection of observations and artworks created by Museum Studies graduate students in response to the COVID-19 crisis.\nView\nThings Seen",
    "url": "http://museum.sfsu.edu/virtual-exhibits",
    "domain": "museum.sfsu.edu"
  },
  {
    "source": "http://museum.sfsu.edu/events",
    "category": "general",
    "title": "Events | Global Museum | Museum Studies",
    "content": "Events\nFilter by Year\n2025\n2024\n2023\n2022\n2025\nFeb\n07\n2025 M.A. Admissions Zoom Information Session\nFri, February 07, 12:00 pm\nOnline\n2024\nNov\n14\nMuseum Studies Open House at the Global Museum\nThu, November 14, 12:00 pm\nFine Arts Building Room 124A\nMay\n02\nFilipino American Heritage Symposium, May 2-4, 2024\nThu, May 02, 05:30 pm\nFine Arts Building Room 203\nFeb\n24\nThrough My Father's Eyes: The Filipino American Photographs of Ricardo Ocreto Alvarado\nSat, February 24, 11:00 am\nFine Arts Building Room 203\nFeb\n09\n2024 M.A. Admissions Zoom Information Session\nFri, February 09, 12:00 pm\nOnline\n2023\nNov\n29\nArtists-in-Conversation with David Bacon and Juan Fuentes\nWed, November 29, 04:00 pm\nFine Arts Building Room 203\nOct\n25\nZoom Mixer with M.A. Program in Museum Studies\nWed, October 25, 06:30 pm\nOnline\nOct\n24\nTechnology in Excavating Pompeii & M.A. Classics at SF State\nTue, October 24, 04:00 pm\nOnline\nOct\n03\nIn the Fields of the North | En los campos del Norte\nTue, October 03, 11:00 am\nFine Arts Building Room 203\nApr\n22\nExplore SF State | Global Museum Open House\nSat, April 22, 10:00 am\nFine Arts Building 203\nApr\n17\nSetting A Course In The Museum Field: A Casual Conversation with Museum Professionals About Career Pathways in Museums and Beyond\nMon, April 17, 06:00 pm\nOnline (Zoom)\nApr\n13\nPoetry Reading & Discussion inspired by stories of the Vietnamese Diaspora\nThu, April 13, 04:00 pm\nGlobal Museum, Fine Arts Building Room 203\nFeb\n28\nExhibits: 'Textures of Remembrance' and 'Other Worlds'\nTue, February 28, 11:00 am\nGlobal Museum, Fine Arts Building, Room 203\nFeb\n25\nOpening reception for exhibit featuring stories of the Vietnamese Diaspora, Feb. 25\nSat, February 25, 01:00 pm\nGlobal Museum, Fine Arts Building, Room 203\nJan\n25\n(Rescheduled) 2023 M.A. Admissions Zoom Information Session\nWed, January 25, 12:00 pm\nOnline\n2022\nDec\n07\nArt, Activism and Environmental Justice\nWed, December 07, 06:00 pm\nCommonwealth Club of San Francisco\nNov\n18\nMA Admissions Open House\nFri, November 18, 12:00 pm\nFine Arts Building 203\nOct\n29\nClearly Polluted: The Fight For Environmental Justice in the Bay Area\nSat, October 29, 11:00 am\nFine Arts Building 203\nOct\n19\nExplore LCA Majors!\nWed, October 19, 11:00 am\nCésar Chávez Student Center Plaza\nJul\n18\nThe Museum at The Cliff: Global Museum collaborative exhibit through Aug. 21\nMon, July 18, 11:00 am\n1090 Point Lobos Ave. in San Francisco\nApr\n27\nGlobal Museum spring preview hours\nWed, April 27, 01:00 pm\nApr\n22\nGlobal Museum Spring Open House Day\nFri, April 22, 01:00 pm\nFine Arts Building Room 203\nApr\n21\nDrop In Advising #2 for the Museum Studies Minor\nThu, April 21, 01:00 pm\nThe Global Museum, Fine Arts 203\nApr\n14\nDrop-in Advising #1 for the Museum Studies Minor\nThu, April 14, 11:00 am\nThe Global Museum, Fine Arts Room 203\nFeb\n26\nGlobal Museum Day at The Museum at the Cliff\nSat, February 26, 11:00 am\n1090 Point Lobos Avenue, San Francisco\nFeb\n23\nRemoving Collector Names from Museum Legacy Collections: A Case Study and Discussion Panel with the Global Museum at SF State\nWed, February 23, 12:00 pm\nOnline (Zoom)\nJan\n31\n2022 Admissions Q+A\nMon, January 31, 05:00 pm\nOnline via Zoom",
    "url": "http://museum.sfsu.edu/events",
    "domain": "museum.sfsu.edu"
  },
  {
    "source": "http://museum.sfsu.edu/global-museum-spring-open-house-day",
    "category": "general",
    "title": "Global Museum Spring Open House Day | Global Museum | Museum Studies",
    "content": "Global Museum Spring Open House Day\nFriday, April 22, 2022\nEvent Time\n01:00 p.m.   -  03:00 p.m.\nPT\nCost\nFree\nLocation\nFine Arts Building Room 203\nContact Email\nglobalmuseum@sfsu.edu\nOpen House RSVP\nOverview\nWant to learn more about working in museums and Museum Studies at SF State? Visit the Global Museum's Spring Open House Day to see student and community curated exhibit ideas we're trying out while we prepare to reopen fully in Fall, 2022! Refreshments provided by the Museum Studies Student Association, thanks to funding from Associated Students at SF State. Free admission, advance RSVP required.\nOn view:\nShow and Tell\nfeatures a collection of treasured objects from and produced by student storytellers from Fran Osborne's Museum Studies 730 Exhibit Development class\nWorn Stories\ndisplays a collection of face masks and explores each of their stories, curated by M.A. Candidate, Lindsey Hanson\nClearly Polluted\nis a forthcoming exhibition investigating environmental racism in the San Francisco Bay Area. Help us test some of the activities planned for the Fall 2022 exhibit.\nThe Global Museum will be open on Wednesdays and Thursdays from April 20 to May 11, 2022. RSVP required.\nVisit\nthis link\nto register for another date.\nThe Global Museum will be requiring proof of full COVID-19 vaccination for all visitors ages 12 years and older and will accept the following forms of verification:\nAn original, a copy, or a picture of your CDC vaccination card\nDocumentation from a healthcare provider\nDigital COVID-19 vaccine record issued by the State of California\nMasks will be required at all times for those over 2 years old. Reduced capacity to encourage physical distancing.\nSan Francisco State University welcomes persons with disabilities and will provide reasonable accommodations upon request. If you would like reasonable accommodations for this event, please contact\nlcabox@sfsu.edu\nas soon as possible so your request may be reviewed.  Please contact us at least one week in advance for priority accommodation.\nUpcoming Events\nMore events coming soon!",
    "url": "http://museum.sfsu.edu/global-museum-spring-open-house-day",
    "domain": "museum.sfsu.edu"
  },
  {
    "source": "http://museum.sfsu.edu/minor-museum-studies",
    "category": "general",
    "title": "Minor in Museum Studies | Global Museum | Museum Studies",
    "content": "Minor in Museum Studies\nOverview\nMinor Requirements\nAdding the Minor\n**Minor Program Temporarily Suspended Due to California Governor's AY 2025-2026 Budget\nUndergraduate Coordinator: L. Jiménez\nCoursework in the Museum Studies Minor emphasizes acquiring knowledge in museum practice and theory to understand the public service role of museums, and to apply this knowledge to support the work of museums in creating exhibits, educating the public and caring for collections through collaborative efforts.\nStudents gain a useful set of pre-professional skills in museum practice, relevant information about museum theory and history, and learn about future careers in museums and informal educational settings. Written, oral and critical thinking skills are developed to evaluate the work of museums.\nThe Museum Studies Minor will prepare students for the terminal M.A. degree in Museum Studies, or for additional on-the-job training for work in museums. Graduates will appreciate the role and power of museums in the world as centers of learning, enjoyment and community engagement, and as stewards of cultural and natural heritage.\nMinor Program Learning Outcomes\nAcquire and combine general education skills with relevant knowledge and information on museum practice and theory to understand and discuss the public service role of museums in a multicultural world.\nApply knowledge of museum practice and theory as a pre-professional to support the work of museums in creating exhibits, educating the public, caring for collections and serving the public, through collaborative work.\nUse written, oral and critical thinking skills to apply knowledge of museum practice and theory to evaluate the work of museums.\nAcquire knowledge of museum practice and theory to serve as an advocate for the role of museums as centers of education, community and preservation.\n**Minor Program Temporarily Suspended Due to California Governor's AY 2025-2026 Budget\nMuseum Studies minor: 18 units\nCourses are 3 units unless otherwise indicated\nRequired Courses\nM S 201 Introduction to Museums\nM S 202 Introduction to Museum Exhibits\nM S 310 Museum Education Methods and Community Engagement\nOne Course Selected on Consultation with Faculty (*)\nM S 681 Preparation for Museum Practicum (2 units)**\nM S 682 Capstone Practicum\nM S 683 Collections Stewardship Practicum (1 unit)**\nM S 684 Educational Programming and Interpretation Practicum (1 unit)**\n(*) It is highly recommended that students enroll in ART 619 Exhibition Design, which is offered every semester. Upon admission to the Minor, students will be allowed to enroll in Art 619.\n(**) Either M S 683 or M S 684 must be taken concurrently with M S 681\n**Minor Program Temporarily Suspended Due to California Governor's AY 2025-2026 Budget\nCURRENTLY NOT ACCEPTING NEW APPLICATIONS TO THE MINOR\nPreparing to Add/Declare the Minor\nStudents first must complete either M S 201 or M S 202 with a minimum grade of C, have upper division standing, and meet with a Museum Studies faculty advisor BEFORE admission to the Minor\n.\nUpon approved admission to the Minor, students will be eligible for M S 681, Preparation for Museum Practicum, which involves work in SF State’s Global Museum, and M S 682, the Capstone Practicum, a 120-hour practicum in a museum located off campus. M S 681 is taken concurrently with M S 683 or M S 684 for a total of 3 units; all are offered in the Fall semesters. M S 682 is offered in the spring semesters.\nNote:\nAll coursework in the Minor must be completed with a grade of C or better. Students should meet with a faculty advisor at least once a semester to remain on track for a timely graduation.\nHow to Add/Declare the Minor in Museum Studies\nStudents need to make an advising appointment with a Museum Studies faculty advisor after completing either M S 201 or M S 202 to declare a minor in Museum Studies. If you are a Transfer student and would like to Minor in Museum Studies, please contact a Faculty Advisor as soon as possible. Email\nmuseumst@sfsu.edu\nto make an appointment with faculty.\nAfter advising, students may then complete an online Request to Add a Minor via SF State Gateway/MySFSU. Go to the online\nStudent Center.\nUnder the Academics section, select\nChange Major\nfrom the drop-down menu and follow the instructions. If you're having trouble with the online form, you may also download and complete the Add Minor form.\nSee the Bulletin\nfor more information about the Minor in Museum Studies.",
    "url": "http://museum.sfsu.edu/minor-museum-studies",
    "domain": "museum.sfsu.edu"
  },
  {
    "source": "http://museum.sfsu.edu/event/exhibits-textures-remembrance-and-other-worlds",
    "category": "general",
    "title": "Exhibits: 'Textures of Remembrance' and 'Other Worlds' | Global Museum | Museum Studies",
    "content": "Exhibits: 'Textures of Remembrance' and 'Other Worlds'\nTuesday, February 28, 2023\nEvent Time\n11:00 a.m.   -  04:00 p.m.\nPT\nCost\nFree\nLocation\nGlobal Museum, Fine Arts Building, Room 203\nContact Email\nOverview\nSpecial Saturday hours on April 22, 10 a.m. to 2:45 p.m. for Explore SF State Day!\nThe exhibits will be on view in the Global Museum on Tuesdays, Wednesdays and Thursdays from 11 a.m. to 4 p.m. through May 4.\nTextures of Remembrance: Vietnamese Artists and Writers Reflect on the Vietnamese Diaspora\nexplores stories of personal struggles and memories demonstrating the effects of the Vietnam war on identity, sense of family and community, and representation, featuring works by emerging writers and artists.\nOther Worlds: The Art of Storytelling\nis a student-developed exhibit which explores global storytelling traditions — acting, dance, puppetry, game design, costuming, film and literature — through material culture, immersing visitors in an adventure following the Hero's Journey.\nFollow the Global Museum and Museum Studies program on Instagram and Facebook for updates: @GlobalMuseumSFSU and @SFSUMuseumStudies.\n*The museum will be closed Thursday, April 20, for off-site class field trip\nUpcoming Events\nMore events coming soon!",
    "url": "http://museum.sfsu.edu/event/exhibits-textures-remembrance-and-other-worlds",
    "domain": "museum.sfsu.edu"
  }
]