[
  {
    "source": "https://cpage.sfsu.edu/datascience",
    "category": "general",
    "title": "Data Science and Machine Learning for Biotechnology Professionals| Noncredit Certificate | College of Professional & Global Education",
    "content": "Send Me Updates\nData Science and Machine Learning for Biotechnology Professionals\nThe Data Science and Machine Learning for Biotechnology Professionals certificate program is designed for professionals from any background. The curriculum was developed in close collaboration with Genentech scientists. The program aligns with the technical needs of the biotechnology/pharmaceutical industries and is adapted for professionals in various work-life situations.\nCurriculum\nExplore the curriculum and course descriptions\nCurriculum\nOnline Class Schedule\nOnline course dates\nClass Schedule\nFaculty\nMeet the instructors\nFaculty\nAbout the Program\nProgram Learning Outcomes\nGenentech Partnership\nCost and Length\nProgram Learning Outcomes\nDemonstrate proficiency in the fundamentals of computer programming, data science and machine learning for biotechnology: theory, tools and techniques.\nDemonstrate ability to synthesize computer programming, machine learning and data science concepts around the big questions in biotechnology to develop solutions to real-life problems.\nDemonstrate effective scientific communication skills, verbal and written, to convey information to multidisciplinary audiences from different functional areas of the biotechnology field.\nGenentech Partnership\nThis program is offered in partnership with\nGenentech\n.\nCost and Length\nCost:\n$1,500 per course, $7,500 total program\nLength:\n11 months\nContact Us\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/datascience",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/contact/dean",
    "category": "general",
    "title": "Office of the Dean | College of Professional & Global Education | San Francisco State University",
    "content": "Office of the Dean\nShih-Hsung (Alex) Hwu, Ph.D.\n(He/Him/His)\nAVP/Dean\nalexhwu@sfsu.edu\n(415) 405-4290\nAlexander Chang\n(He/Him/His)\nDirector of International Recruitment, Global Partnership and Student Mobility Programs\nachang@sfsu.edu\n(415) 405-4232\nRianne Connor\n(She/Her/Hers)\nDirector of Enrollment\nrianne.c@sfsu.edu\n(415) 338-1630\nElaine Feng\n(She/Her/Hers)\nFinance Director\nefeng@sfsu.edu\n(415) 405-4292\nRyan Gurney, Ph.D.\n(He/Him/His)\nInterim Assistant Dean\nrgurney@sfsu.edu\n(415) 405-4278\nAnna Lebedeff\n(She/Her/Hers)\nDirector of Marketing and Communications\nalebedeff@sfsu.edu\nAngie Lipschuetz, Ph.D.\n(She/Her/Hers)\nAssociate Dean\nalipschuetz@sfsu.edu\n(415) 405-4205\nKate White, Ed.D.\n(She/Her/Hers)\nAssistant Dean\nkatewhite@sfsu.edu\n(415) 405-4208\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/contact/dean",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/continuous",
    "category": "general",
    "title": "Continuous Enrollment | San Francisco State University | College of Professional & Global Education",
    "content": "Continuous Enrollment\nIf you need more time to finish your Culminating Experience, you must stay enrolled each semester until you complete your degree. The Continuous Enrollment option lets you remain an active SFSU student while you complete your graduate work.\nAbout Continuous Enrollment\nKey Points\nContinuous Enrollment classes are listed as 499-level courses\nNo units are granted and no grade is assigned\nClasses are offered only in fall and spring\nEach SFSU college has Continuous Enrollment courses available every semester\nThis requirement applies to all students admitted or re-admitted in fall 2008 or later. Doctoral students should follow their program’s specific continuous enrollment and degree completion requirements.\nCost\n$360 per class\nHow to Register\nStep 1: Find Your Class\nFall 2025\nContinuous Enrollment Classes\nClass\nClass Number\nBUS 499\n8888\nEDUC 499\n8889\nETHS 499\n8890\nHSS 499\n8891\nLCA 499\n8892\nSCI 499\n8893\nStep 2: Check for Course Requirement\nCheck your\nStudent Center\nfor this\nHold\nmessage:\nCPaGE 499 Course Requirement\nIf you\ndo not\nhave this hold, stop and contact Graduate Studies at (415) 338-2234.\nStep 3 - Call to Register\nCall (415) 405-7700.\nEnrollment is open throughout the semester.\nSee\nPolicies and Procedures\n.\nRetroactive Add\nIf you need to add Continuous Enrollment after the semester has ended, follow these steps:\nContact the Division of Graduate Studies at (415) 338-2234 to confirm you are term-activated for the semester and that the negative service indicator authorizing you to take the class is on your account.\nDownload and complete the\nRegistration Form\nand\nPetition for Waiver of College Regulations\n.\nOn the petition form, check the retroactive add box, explain why your registration is late, and sign. You do not need to gather additional signatures—the College of Professional & Global Education will handle that.\nSubmit both forms to the College of Professional & Global Education in person or by Express Mail, along with a check or money order for the full course fee, payable to SFSU-CPaGE.\nContinuous Enrollment Policy\nFind the\nDivision of Graduate Studies & Career Development | Continuous Enrollment Policy\n.\nContact\nGraduate Studies |\ngradstudies@sfsu.edu\n| Phone (415) 338-2234 | Website:\nGraduate Studies\nCollege of Professional & Global Education | Eduardo Cerpa |\necerpa@sfsu.edu\n| Phone (415) 405-4244 | Fax (415) 405-4299\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/continuous",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/global/contact",
    "category": "general",
    "title": "Contact the Center for Global Engagement | San Francisco State University | College of Professional & Global Education",
    "content": "Contact the Center for Global Engagement\nContact Us\nEmail:\nglobaled@sfsu.edu\nTelephone: (415) 338-1438\nLocation\nCenter for Global Engagement\nCollege of Professional & Global Education\nSan Francisco State University\n1600 Holloway Avenue\nScience and Engineering Innovation Center, 5\nth\nFloor\nSan Francisco, CA 94132\nUSA\nHours\nMonday - Friday\n9 a.m. - 5 p.m.\nSocial Media\nFacebook: @GLOBALSFState\nInstagram: @globaled_sfsu\nYouTube: Center for Global Engagement, SF State\nCenter for Global Engagement Home\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/global/contact",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/register/grades",
    "category": "general",
    "title": "Grades and Transcripts | San Francisco State University | College of Professional & Global Education",
    "content": "Grades and Transcripts\nGrades\nStudents receive letter grades (A - F) for academic credit courses unless the course is audited or taken for credit/no credit CR/NC. Some academic courses are available for letter grade only, others for CR/NC only. In a course where CR/NC grading is optional, students must indicate the desire to be graded on a CR/NC basis on the\nSFSU Gateway\nwebsite. This must be done by the deadline published in\nCalendar and Deadlines\n.\nStudents may not change from letter-graded to CR/NC status or vice versa after the deadline.\nCEU courses are graded on a credit/no credit basis and appear on SFSU transcripts when students earn a grade of credit. Grade reports and transcripts are not available for noncredit courses. Grade availability dates are listed in\nCalendar and Deadlines\n. Grades are available online through the\nSFSU Gateway\n.\nAudit\nStudents wishing to audit a course must register and pay the same fees as students enrolled for credit. An auditor may be required by the instructor to participate in any or all classroom activities. Auditors may not obtain credit by examination for audited classes or repeat audited classes for credit at a later date.\nTo request an audit status, students should complete an audit request form, obtain instructor's signature, and submit the form to the College of Professional & Global Education by the deadline published in\nCalendar and Deadlines\n.\nStudents may not change from audit to credit status after the second week of instruction. Only students enrolled in academic credit courses can audit a class.\nIncomplete\nAt the initiation of the student or the instructor, an incomplete grade (I) may be assigned by the instructor when the student is unable to complete the course requirements within the official period of the course. An incomplete must be made up within one calendar year from the end of the course or the grade of \"I\" will be automatically changed to a failing grade for academic unit courses. For CEU courses, if an incomplete is not made up within one year, the course is deleted from the student's record.\nTranscripts\nOfficial transcripts\nare available from the SFSU Registrar. Transcript availability dates are listed in\nCalendar and Deadlines\n. Check the\nRegistrar's Office Transcripts page\n, for instructions on how to request a transcript. The fee for transcripts is $8 per copy. If the transcript is to show the results of the current semester's work, the request should specify \"Hold for Grades.\"\nUnofficial transcripts\nand grades are available online by accessing student’s\nSFSU Gateway\naccount after the semester ends.\nWithdrawal\nStudents may withdraw from courses that earn academic credit (units) after the Drop Deadline and receive grades of \"W\" by following the guidelines on the\nRegistrar's Office Dropping and Withdrawing\npage. Do not put a stop payment on a check or credit card charge to drop or withdraw from a course. This results in a financial obligation to SFSU for the course fee, plus an additional $20 charge. Failure to withdraw officially from a course generates a failing grade of \"F\" or \"WU.\" If you do not see the option in your Student Center to submit a withdrawal request and/or you are enrolled in one of the classes below, please fill out the\nWithdrawal Petition\nand email the completed form to\nsfsucel@sfsu.edu\n.\nPlease see\nDrops and Refunds | Withdrawal\nfor more information.\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/register/grades",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/contact/gurney",
    "category": "general",
    "title": "Ryan Gurney, Ph.D. | College of Professional & Global Education",
    "content": "Ryan Gurney, Ph.D.\n(\nHe/Him/His\n)\nInterim Assistant Dean\nPhone:\n(415) 405-4278\nEmail:\nrgurney@sfsu.edu\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/contact/gurney",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/about/caljobs",
    "category": "general",
    "title": "CalJOBS | San Francisco State University | College of Professional & Global Education",
    "content": "CalJOBS\nCalJOBS connects dislocated workers with employment training opportunities. SFSU is an eligible training provider.\nHow to Find Us\nInstructions\nGo to the\nCalJOBS Website\nSelect:\nJob Seekers > Education and Training > Training Providers and Schools\nSearch on Keyword:\nCollege of Professional & Global Education, SF State\nCalJOBS Website\nEligible Programs\nClinical Medical Assistant\nConstruction Professional\nCriminal Justice Studies Bachelor's Degree Completion\nE-Learning Design and Development\nGeographic Information Systems (GIS)\nHospitality and Tourism Management\nInternational Business\nParalegal Studies\nPharmacy Technician\nEmployment Training for Adults and Dislocated Workers\nAs a result of the Workforce Innovation and Opportunity Act (WIOA) of 2014, CalJOBS provides connections to customer-focused employment training for adults and dislocated workers. Training providers who are eligible to receive Individual Training Accounts through WIOA funds are listed on the Eligible Training Provider List (ETPL) on the CalJOBS website.\nCalJOBS Website\nThe CalJOBS website helps job seekers and employers navigate California's workforce services by providing employment and labor market information for the State of California. The site allows users to search for jobs, build résumés, access career resources, find qualified candidates for employment and gather information on education and training programs.\nQuestions?\nIf you have questions, please contact the\nstaff\nfor your program of interest.\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/about/caljobs",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/news",
    "category": "general",
    "title": "News Listing | College of Professional & Global Education",
    "content": "News Listing\nOctober 02, 2025\nComplete a Business Degree Online - Spring Deadline Extended to October 15\nFinish Your Bachelor's Degree Online\nOur new Bachelor of Science in Business Administration (BSBA) online degree completion…\nOctober 02, 2025\nCriminal Justice Online Degree Completion - Spring Deadline Extended to October 15\nApply Now to Start in Spring 2026\nAre you ready to finish your degree? Do you have at least 60 college credits in any major?…\nOctober 01, 2025\nCenter for Global Engagement Newsletter – October 2025\nCampus Events\nGame Night\nJoin us for an exciting night of games ra…\nOctober 01, 2025\nPre-Health Professions Post-Baccalaureate Program - Apply by March 1 for Summer\nGet ready for medical school or another health professional program with SFSU's Pre-Health Professions Post-Baccalaureate pr…\nOctober 01, 2025\nPre-Health Professions Post-Baccalaureate Program - Apply by April 15 for Fall\nAre you planning to apply to medical school or another health professional program?\nSFSU’s Pre-Health Professions Post…\nOctober 01, 2025\nClinical Laboratory Science - Apply by November 16\nApply Now to Start in Fall 2026\nInterested in a career in clinical lab science? The Clinical Laboratory Science (CLS) progra…\nOctober 01, 2025\nFinish Your B.A. in Psychology Online - Apply for Fall 2026 by April 1\nApply Now to Start in Fall\nDo you have at least 60 college credits and want to finish your degree? Complete your B.A. in Psy…\nOctober 01, 2025\nCriminal Justice Online Degree Completion - Apply by April 1 to Start in Fall\nApply Now to Start in Fall\nAre you ready to finish your degree? Do you have at least 60 college credits in any major? Comple…\nOctober 01, 2025\nComplete a Business Degree Online - Apply by April 1 to Start in Fall\nFinish Your Bachelor's Degree Online\nOur new Bachelor of Science in Business Administration (BSBA) online degree completion…\nOctober 01, 2025\nSchool Nurse Services Credential: Start in Fall 2026 - Apply by February 28\nClear Your Credential\nAre you a school nurse with a preliminary credential? Clear your credential with the School Nurse Serv…\nOctober 01, 2025\nGraduate Certificate in PK-12 Climate Justice Education - Apply by March 1\nStart in Summer 2026\nAre you an educator who wants to include climate justice topics as part of your curriculum? Find out ab…\nSeptember 25, 2025\nSFSU Offers Full Scholarships for First-of-Its-Kind PK-12 Certificate in Climate Justice Education\nStudents participate in the inaugural cohort for the Graduate Certificate in PK-12 Climate Justice Education program that st…\nSeptember 12, 2025\nParalegal Studies Faculty Paul DeAngelis to Speak at Constitution Day Conference, Sept. 17\nSan Francisco State University will host its annual Rights and Wrongs: A Constitution and Citizenship Day Conference, Septem…\nSeptember 10, 2025\nSystem Update: Shopping Cart and Class Schedule Downtime, September 12–13\nInformation Technology Services (ITS) will apply a critical Oracle patch to SFSU databases from Friday, September 12, a…\nSeptember 07, 2025\nParalegal Studies Scholarship – Apply by October 31 for Fall 2025\nApply for the David Goldstein Memorial Scholarship\nFall Deadline: October 31\nIf you're an SFSU Paralegal Studies studen…\nSeptember 02, 2025\nSFSU Closed for Veterans Day, Nov. 11\nSFSU will be closed for Veterans Day, Tuesday, November 11, 2025.\nSeptember 01, 2025\nCenter for Global Engagement Newsletter – September 2025\nCampus Events\nLibrary Tour: Highlights and Insights\nTour the SFSU…\nAugust 19, 2025\nSFGATE Highlights the SFSU ElderCollege Program\nSFGATE recently featured SFSU’s ElderCollege program in the article San Francisco State’s $55 Learning Hack. The story share…\nAugust 13, 2025\nLanguage, Literature and Journalism Courses Available through Open University\nTake SFSU Classes This Fall\nSeveral language, literature and journalism courses at SFSU still have space for Open University…\nAugust 12, 2025\nAfter Your Degree, Choose Open University\nYou Earned Your Degree. What’s Next?\nYou finished your bachelor’s degree, but maybe you’re not quite ready for grad school o…\nAugust 11, 2025\nOpen University - Register Now for Fall 2025\nTake Undergraduate and Graduate Classes at SFSU\nFall 2025 Open University registration is now open for courses that beg…\nAugust 01, 2025\nInternational Students: Apply by May 15 for Fall 2026 Certificate Programs\nAre you an international student interested in earning an academic certificate? Apply by May 15 for priority consideration.…\nAugust 01, 2025\nPre-Health Post-Baccalaureate: Apply for Spring 2026 by October 1\nApplication Period: August 1–October 1Deadline: October 1 at 8:59 p.m. PT\nThinking about medical, dental, PA or another heal…\nJuly 29, 2025\nCenter for Global Engagement Newsletter – August 2025\nEverything you need for school and fun in August.\nJuly 15, 2025\nRegister Now for Fall 2025\nProfessional Development Registration Now Open\nRegister now for professional development fall 2025 courses. See the fall 202…\nJuly 11, 2025\nSystem Upgrade: Shopping Cart and Class Search Downtime, July 11-12\nThe Chancellor’s Office will upgrade the PeopleSoft Campus Solutions and Human Resources servers to Linux 8. System downtime…\nJuly 10, 2025\nSFSU Closed for Labor Day, September 1\nSFSU will be closed for Labor Day on Monday, September 1, 2025.\nJuly 01, 2025\nEnglish for Academic Preparation - Apply Now for Spring 2026\nInternational Students - Study English in San Francisco, California\nThe English for Academic Preparation (EAP) program gives…\nJune 30, 2025\nFall GIS Classes Open for Registration July 15\nLearn GIS Online\nGet ready to expand your skills with Geographic Information Systems (GIS). All fall GIS classes are offered…\nJune 26, 2025\nPrepare for the Clinical Lab Science Program with Fall Pre-CLS Courses\nPre-CLS Fall Classes\nGet ready to apply to the Clinical Laboratory Science (CLS) program by taking required courses. You don…\nJune 26, 2025\nIntervener Training: Deafblind Education - Start in Fall 2025\nFor Paraeducators: Enroll in Intervener Training for Fall\nTake the first course in our Intervener Training: Deafblind Educat…\nJune 26, 2025\nE-Learning Fall 2025 Class Schedule Is Live\nRegister Starting July 15\nThe E-Learning Design and Development class schedule is now live. Find your classes and get ready…\nJune 25, 2025\nConstruction Professional - Fall Classes Start September 15\nFall Online Classes Start September 15, 2025\nFind your online classes on the Construction Professional class schedule,…\nJune 24, 2025\nJust Added: Pharmacy Technician Hybrid Course Starts August 26\nTake the Pharmacy Technician Hybrid Course (Online/In-Person)\nThis 10-week course will prepare you to work as a pharmacy tec…\nJune 24, 2025\nJust Added: Fall CMA Hybrid Course Starts September 3\nFall Hybrid CMA Course\nWe’re excited to announce that a new section of our Clinical Medical Assistant hybrid course will run…\nJune 24, 2025\nEducator Training in Ethnic Studies - Sign up before August 25\nEthnic Studies Courses for Educators\nTake a graduate-level course or upper-division undergraduate course a la carte or towar…\nJune 23, 2025\nSFSU Closed for Independence Day, July 4\nSFSU will be closed for Independence Day, Friday, July 4, 2025. 🇺🇸\nJune 23, 2025\nFall 2025 Class Schedule Now Online\nFall Classes\nThe fall class schedule is now up. Find professional development classes to help you advance in your career or…\nJune 23, 2025\nOpen University - Fall 2025 Registration Starts August 11\nRegister Starting August 11, 2025\nOpen University registration for fall 2025 starts August 11. Find your classes now on the…\nJune 01, 2025\nParalegal Studies: Apply for Fall by August 1\nStart in Fall: Apply by August 1\nTake the first step toward a rewarding career in the legal field, and apply to our ABA-appr…\nMay 27, 2025\nJuneteenth Holiday, June 19\nSFSU will be closed on Thursday, June 19, 2025, in observance of Juneteenth.\nMay 16, 2025\nInternational Students - Apply for Spring 2026 Certificate Programs by November 15\nDo you want to apply for an academic certificate program? The priority application deadline for spring is November 15.…\nMay 01, 2025\nComplete a B.A. in Psychology Online - Apply for Spring 2026 by October 1\nApply Now to Start in Spring 2026\nDo you have at least 60 college credits and want to finish your degree? Complete your B.A.…\nApril 29, 2025\nJust Added: Summer CMA Hybrid Course Starts June 30\nSummer Hybrid CMA Course\nWe’re excited to announce that a new section of our Clinical Medical Assistant hybrid course will r…\nApril 23, 2025\nRegister Now for Summer 2025\nRegistration Now Open\nRegister now for both professional development and Open University summer courses.\nProfessional Devel…\nApril 23, 2025\nTake Undergraduate and Graduate Classes in Summer 2025\nOpen University — Register Now\nOpen University allows you to take space-available SF State undergraduate and graduate classe…\nApril 22, 2025\nMemorial Day Holiday, May 26\nSFSU will be closed for Memorial Day on Monday, May 26, 2025.\nApril 09, 2025\nPrepare for the Clinical Lab Science Program – Register Starting April 23\nSummer Pre-CLS Classes\nTake the courses you need before you start the Clinical Lab Science (CLS) program. You don't have to…\nApril 07, 2025\nConstruction Professional - Summer Classes Start June 23\nSummer Online Classes Start June 23, 2025\nFind your online classes on the Construction Professional class schedule, and…\nApril 02, 2025\nComplete a Business Degree Online - Fall Deadline Extended to April 25\nFinish Your Bachelor's Degree Online\nOur new Bachelor of Science in Business Administration (BSBA) online degree completion…\nApril 02, 2025\nCriminal Justice Online Degree Completion - Fall Deadline Extended to April 25\nApply Now to Start in Fall 2025\nAre you ready to finish your degree? Do you have at least 60 college credits in any major? C…\nMarch 28, 2025\nDonate for Gators Give Day, April 2\nWednesday, April 2, is the giving day for the University\nFor the first time ever,…\nMarch 25, 2025\nOpen University - Summer 2025 Registration Starts April 23\nRegister Starting April 23, 2025\nOpen University registration for summer 2025 starts April 23. Find your classes now on the…\nMarch 25, 2025\nSummer 2025 Class Schedule Now Online\nSummer Classes\nThe summer class schedule is now up. Find professional development classes to help you advance in your career…\nMarch 21, 2025\nStudy Stars in the Sierras this Summer\nOutdoor Astronomy Class at the SFSU Sierra Nevada Field Campus\nWe offer short summer courses for academic credit at the SFSU…\nMarch 06, 2025\nGIS Paid Internships - Apply Now\nPaid Internships for GIS Students\nPaid GIS internships arw available at the Central Contra Costa Sanitary District. Central…\nMarch 06, 2025\nJust Added: CMA Hybrid Course (MWF) Starts April 21\nTake the Clinical Medical Assistant Course Both Online and in Person\nThis 10-week course will prepare you to perform patient…\nMarch 03, 2025\nStudy Biology in the Tahoe National Forest this Summer\nSummer Study in the Sierras\nStudy Biology in the Tahoe National Forest this summer at SFSU’s Sierra Nevada Field Campus. Reg…\nMarch 03, 2025\nGraduate Certificate in PK-12 Climate Justice Education - Apply by April 2\nStart in Summer 2025 - Deadline Extended\nAre you an educator who wants to include climate justice topics as part of your cur…\nMarch 01, 2025\nParalegal Studies: Apply for Summer by May 7\nStart in Summer: Apply by May 7\nTake the first step toward a rewarding career in the legal field, and apply to our ABA-…\nFebruary 24, 2025\nSFSU Closed for César Chávez Day, March 31\nSan Francisco State University will be closed on Monday, March 31, 2025 in observance of César Chávez Day.\nFebruary 07, 2025\nParalegal Studies Scholarship - Apply by March 31 for Spring 2025\nApply for the David Goldstein Memorial Scholarship\nSpring Deadline: March 31\nParalegal Studies students are encouraged…\nFebruary 06, 2025\nSierra Nevada Field Campus - Register Now for Summer\nGo offline this summer. Study in the Tahoe National Forest at SF State’s Sierra Nevada Field Campus (SNFC). Summer classes a…\nJanuary 31, 2025\nHuman Resources Students: HR Assistant Job Opportunity\nFor Human Resource Management Students\nAim High, a multi-year summer enrichment program offered at no cost to 6th–9th grader…\nJanuary 17, 2025\nOpen University - Register Now for Spring 2025\nRegistration Now Open\nSpring 2025 Open University registration is now open for courses that begin Monday, January 27. R…\nJanuary 13, 2025\nConstruction Professional - Spring 2025 Class Schedule\nSpring Online Classes Start April 7, 2025\nFind your online classes on the Construction Professional class schedule, and…\nJanuary 09, 2025\nPeople over 50 - Take Spring Classes at SFSU with ElderCollege\nElderCollege at San Francisco State University\nPeople over 50 years of age are invited to participate in ElderCollege. With…\nJanuary 06, 2025\nSFSU Closed for MLK Day, January 20\nSFSU will be closed on Monday, January 20, 2025, in observance of Dr. Martin Luther King, Jr. Day.\nJanuary 06, 2025\nRegister Now for Spring 2025\nProfessional Development Registration Now Open\nRegister now for professional development spring 2025 courses. See the spring…\nJanuary 02, 2025\nEnglish for Academic Preparation - Apply by July 15 for Fall 2025\nInternational Students - Study English in San Francisco, America's Most International City\nThe English for Academic Preparat…\nDecember 16, 2024\nCMA Hybrid Course (MWF) Starts January 27\nTake the Clinical Medical Assistant Course Both Online and in Person\nThis 10-week course will prepare you to perform patient…\nDecember 16, 2024\nPharmacy Technician Hybrid Course Starts February 17\nTake the Pharmacy Technician Hybrid Course (Online/In-Person)\nThis 10-week course will prepare you to work as a pharmacy tec…\nDecember 16, 2024\nSTEM Exploration – Apply Now for Summer 2025\nInternational Program Blends STEM and English Skills\nIn our STEM Exploration Program, you will gain English langua…\nDecember 12, 2024\nWinter Break: Phones Open 12/20 & 12/23, Office Closed 12/20 - 1/1\nWinter Break\nPhones will be open on December 20 and 23. Our office will be closed December 20, 2024 - January 1, 2025. We wi…\nDecember 06, 2024\nWe Will Close at Noon on Monday, December 9\nClosing Early\nWe will be closed starting at noon on Monday, December 9, 2024.\nDecember 05, 2024\nProject Rebound Wins Award\nAmerican Society of Criminology President’s Award for Distinguished Contributions to Justice\nProject Rebound won the Preside…\nDecember 03, 2024\nEnglish for Academic Preparation - Apply by May 15 for Summer 2025\nInternational Students - Study English in San Francisco, California\nThe English for Academic Preparation (EAP) program gives…\nDecember 01, 2024\nInternational Students - Apply for Fall 2025 Certificate Programs by May 15\nDo you want to apply for an academic certificate program? The priority application deadline for fall is May 15. La…\nNovember 15, 2024\nSpring 2025 Class Schedule Now Online\nThe spring 2025 class schedule is now up. Explore our offerings to find your classes, and get ready to register.\nRegistrati…\nNovember 15, 2024\nTeacher Training in Ethnic Studies - Sign up before January 27\nEthnic Studies Courses for Teachers and Education Professionals\nTake a graduate-level course or upper-division undergraduate…\nNovember 14, 2024\nSTEM Exploration – Apply by December 15 for Spring 2025\nInternational Program Blends STEM and English Skills\nIn our STEM Exploration Program, you will gain English langua…\nNovember 12, 2024\nSFSU Closed for Fall Recess, November 28 & 29\nThe SFSU campus will be closed for Fall Recess (Thanksgiving), Thursday, November 28, 2024 and Friday, November 29, 2024.…\nNovember 04, 2024\nPre-Health Post-Bac Scholarship Granted\nScholarship Recipient\nWe are proud to announce that Kevin Varos has been awarded t…\nNovember 01, 2024\nRegister Now for Winter Session\nWinter Session Registration Now Open\nRegistration is now open for Winter Session, January 2 - 21, 2025. Sign up today to tak…\nOctober 18, 2024\nConstruction Professional - Winter 2025 Class Schedule Now Online\nWinter Online Classes Start January 13, 2025\nThe Construction Professional class schedule is now up. Find your online c…\nOctober 14, 2024\nWinter Session 2025 Class Schedule Now Online\nWinter Session 2025: January 2 - 21\nSF State Winter Session classes are now up. Check the class schedule to find y…\nOctober 10, 2024\nParalegal Studies: Apply for Spring by January 7\nStart in Spring: Apply by January 7\nTake the first step toward a rewarding career in the legal field, and apply to…\nOctober 09, 2024\nNew Certificate in Business Analytics\nNow you can earn your Business Analytics Certificate at San Francisco State University, in one of the most innovative busine…\nOctober 04, 2024\nSchool Nurse Services Credential: Start in Fall 2025 - Apply by April 1\nClear Your Credential\nAre you a school nurse with a preliminary credential? Clear your credential with the School Nurse Serv…\nOctober 02, 2024\nGIS Paid Internship - Apply by November 29\nPaid Internship for GIS Students\nA paid GIS internship is available at the Central Contra Costa Sanitary District. Central S…\nOctober 01, 2024\nPre-Health Post-Bac - Start in Fall - Apply by April 15\nAre you planning to go to medical school?\nSFSU's Pre-Health Professions Post-Baccalaureate program is intended for students…\nOctober 01, 2024\nPre-Health Post-Baccalaureate: Start in Summer - Apply by March 1\nPrepare for medical school or other health professional school\nSF State's Pre-Health Professions Post-Baccalaureate program…\nOctober 01, 2024\nFinish Your B.A. in Psychology Online - Apply for Fall 2025 by April 1\nApply Now to Start in Fall 2025\nDo you have at least 60 college credits and want to finish your degree? Complete your B.A. i…\nSeptember 26, 2024\nInclusion Pilot Project Staff and Students Highlighted in Xpress Magazine\nAccessible Education\nSF State Inclusion Pilot Project staff and students have been highlighted in Xpress Magazine. Read \"Spe…\nSeptember 07, 2024\nParalegal Studies Scholarship - Apply by October 31 for Fall 2024\nApply for the David Goldstein Memorial Scholarship\nFall Deadline: October 31\nParalegal Studies students are encouraged…\nSeptember 06, 2024\nSFSU Closed for Veterans Day, November 11\nSFSU will be closed for Veterans Day, Monday, November 11, 2024.\nAugust 05, 2024\nTake Undergraduate & Graduate Classes in Fall 2024\nOpen University — Register Now\nOpen University allows you to take space-available SFSU undergraduate and graduate classes wi…\nAugust 05, 2024\nOpen University - Register Now for Fall\nFall 2024 Open University registration is now open for courses that begin Monday, August 19. Register today.…\nAugust 01, 2024\nPre-Health Post-Baccalaureate: Apply for Spring 2025 by October 1\nAre you planning to go to medical school? Dental, PA, or other health professional school?\nSF State's Pre-Health Professions…\nJuly 16, 2024\nRegister Now for Fall 2024\nProfessional Development Registration Now Open\nRegister now for professional development fall 2024 courses. See the fall 202…\nJuly 12, 2024\nInstructional Design for E-Learning starts August 26\nTake the first online class in the E-Learning Design and Development online certificate program.\nInstructional Design for E-…\nJuly 08, 2024\nDr. Luna Abdallah Memorial Scholarship 2024 Recipients\n2024 Scholarship Recipients\nWe are proud to announce the 2024 recipients of the Dr.…\nJuly 05, 2024\nSFSU Closed for Labor Day, September 2\nSFSU will be closed for Labor Day on Monday, September 2, 2024.\nJuly 02, 2024\nEAP Merit Scholarship  - Apply by November 28 for Spring 2025\nMerit Scholarship for English for Academic Preparation (EAP) & Gateway Students\nSpring Application Deadline: November 28…\nJuly 01, 2024\nTeacher Training in Ethnic Studies - Sign up before August 26\nEthnic Studies Courses for Teachers and Education Professionals\nTake a graduate-level course or upper-division undergraduate…\nJuly 01, 2024\nPharmacy Technician Hybrid Course Starts August 26\nTake the Pharmacy Technician Hybrid Course (Online/In-Person)\nThis 10-week course will prepare you to ",
    "url": "https://cpage.sfsu.edu/news",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/events",
    "category": "general",
    "title": "Events | College of Professional & Global Education",
    "content": "Events\nFilter by Year\n2026\n2025\n2026\nFeb\n12\nCriminal Justice Studies Online Bachelor's Degree Completion Information Session - Fall 2026\nThu, February 12, 04:00 pm\nOnline\nFeb\n12\nBusiness Administration Online Bachelor's Degree Completion Info Session - Fall 2026\nThu, February 12, 12:00 pm\nOnline\nJan\n22\nE-Learning Certificate Online Information Session - Spring 2026\nThu, January 22, 12:00 pm\nOnline\nJan\n20\nGIS Certificate Online Information Session - Spring 2026\nTue, January 20, 12:00 pm\nOnline\nJan\n08\nOpen University Online Information Session — Spring 2026\nThu, January 08, 12:00 pm\nOnline\n2025\nNov\n14\nPre-Health Workshop: Finding Clinical Experience\nFri, November 14, 12:00 pm\nOnline\nNov\n06\nWinter Session 2026 Information Session\nThu, November 06, 12:00 pm\nOnline\nNov\n05\nCriminal Justice Studies Online Bachelor's Degree Completion Info Session\nWed, November 05, 04:00 pm\nOnline\nNov\n05\nBusiness Administration Online Bachelor's Degree Completion Info Session\nWed, November 05, 12:00 pm\nOnline\nNov\n05\nClinical Laboratory Science Advising Session\nWed, November 05, 11:00 am\nOnline\nOct\n30\nParalegal Studies Online Information Session - Spring 2026\nThu, October 30, 05:30 pm\nOnline\nOct\n27\nWinter Session 2026 Information Table\nMon, October 27, 11:00 am\nMalcolm X Plaza, SFSU\nOct\n22\nClinical Laboratory Science Advising Session\nWed, October 22, 11:00 am\nOnline\nSep\n19\nPre-Health Workshop: How to Navigate the Curriculum\nFri, September 19, 12:00 pm\nOnline\nSep\n17\nCriminal Justice Studies Online Bachelor's Degree Completion Info Session - Spring 2026\nWed, September 17, 04:00 pm\nOnline\nSep\n17\nBusiness Administration Online Bachelor's Degree Completion Info Session\nWed, September 17, 12:00 pm\nOnline\nSep\n12\nPre-Health Post-Bac Application Guidance Info Session - Spring 2026\nFri, September 12, 12:00 pm\nOnline\nSep\n10\nClinical Laboratory Science Advising Session\nWed, September 10, 11:00 am\nOnline\nJul\n18\nCriminal Justice Studies Online Bachelor's Degree Completion Information Session\nFri, July 18, 04:00 pm\nOnline\nJul\n18\nPre-Health Professions Post-Baccalaureate Info Session\nFri, July 18, 12:00 pm\nOnline\nJul\n18\nBusiness Administration Online Bachelor's Degree Completion Info Session\nFri, July 18, 12:00 pm\nOnline\nJun\n27\nPre-Health Workshop Series: Reapplying to Medical School, Dental, PA and Other Health Professions\nFri, June 27, 12:00 pm\nOnline\nJun\n24\nClinical Laboratory Science Advising Session\nTue, June 24, 11:00 am\nOnline\nJun\n12\nParalegal Studies Online Information Session - Fall 2025\nThu, June 12, 05:30 pm\nOnline\nJun\n12\nOpen University Information Session - Fall 2025\nThu, June 12, 12:00 pm\nOnline\nJun\n05\nPharmacy Technician Online Information Session - Fall 2025\nThu, June 05, 12:45 pm\nOnline\nJun\n05\nE-Learning Certificate Online Information Session - Fall 2025\nThu, June 05, 12:00 pm\nOnline\nJun\n05\nClinical Medical Assistant Online Information Session - Fall 2025\nThu, June 05, 12:00 pm\nOnline\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/events",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/about/mailinglist",
    "category": "general",
    "title": "Email Signup | San Francisco State University | College of Professional & Global Education",
    "content": "Email Signup\nSelect your program of interest to request information\nAmerican Language Institute\nBSBA Online Degree Completion\nCenter for Global Engagement\nClimate Justice Education (PK-12) Graduate Certificate\nClinical Lab Science\nClinical Medical Assistant\nConstruction Professional\nCriminal Justice Studies Online Bachelor's Degree Completion\nData Science & Machine Learning for Biotechnology Professionals\nDental Assistant\nEKG Technician\nE-Learning Design and Development Certificate\nEnglish for Academic Preparation\nGateway: English + University Credit Studies\nGeographic Information Systems (GIS) Certificate\nIntervener Training: Deafblind Education\nMedical Administrative Assistant\nMedical Billing and Coding Professional\nOpen University\nParalegal Studies Certificate\nPharmacy Technician\nPre-Health Professions Post-Bac\nPre-MBA (Partners)\nPPSC: School Psychology\nPsychology Online Bachelor's Degree Completion\nSan Francisco Discover\nSchool Nurse Services Credential\nSemester @ SFSU\nSierra Nevada Field Campus\nSTEM Exploration\nSterile Processing Technician\nSummer in San Francisco\nSurgical Technician\nWinter Session\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/about/mailinglist",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/pharmacy",
    "category": "general",
    "title": "Pharmacy Technician | Online Course | San Francisco State University | College of Professional & Global Education",
    "content": "Send Me Updates\nPharmacy Technician\nEarn your Pharmacy Technician Certificate through a 60-hour course with an 80-hour clinical externship. Choose a hybrid option with in-person classes in downtown San Francisco and online learning, or take the course fully online at your own pace. You’ll gain the skills to work in retail, hospital or other pharmacy settings.\nIn-Person/Online Hybrid Course\nDowntown San Francisco/online Pharmacy Tech class\nHybrid Course\nOnline Course\nTake the course online, on your schedule\nOnline Course\nContact\nGet your questions answered\nContact Us\nPharmacy Tech Certificate Program\nCertification\nGet Prepared\nHybrid Class\nIn Downtown SF and Online\nOnline Class\nSelf-Paced, Start Anytime\nAbout the Pharmacy Tech Program\nWhat You Will Learn\nCost and Length\nExternship\nCertification and Employment\nEducational Requirements\nWhat You Will Learn\nThis 60-hour course with an 80-hour clinical externship prepares you to work as a pharmacy technician in retail, hospital or other pharmacy settings. You’ll also be ready to take the Pharmacy Technician Certification Board (PTCB) exam.\nTopics include:\nRole of the pharmacy technician and the certification process\nHistory of pharmacy and practice settings, including retail, hospital, long-term care, mail order and home care\nPharmacy measurements, abbreviations and roman numerals\nGeneric and brand-name drugs, dosage forms and patient profiles\nPrescription requirements, order transcription, inventory control, pricing and reimbursement\nFormularies, unit dose systems, crash carts and dose calculations\nAseptic technique and handling sterile products, including chemotherapy drugs\nIV solutions, electrolytes, children’s doses and pharmaceutical math\nTotal Parenteral Nutrition (TPN) and hands-on IV admixture practice\nCost and Length\nHybrid Course\nCost:\n$1,499. Includes 80-hour clinical externship, all textbooks and materials and the PTCB CPhT exam fee.\nLength:\n2 to 3 months\nRegistration Opens:\nFall: Mid-July\nSpring: Early January\nSummer: Mid-April\nHybrid Course\nOnline Course\nCost:\n$1,499\nLength:\nUp to 9 months (6 months access with possible 3-month extension)\nRegistration:\nAnytime\nOnline Course\nCalJOBS\nSFSU is an eligible training provider.\nCalJOBS\nPayment Plan\nFor online courses, Health Ed Today offer 3-, 6- and 10-month payment plans.\nPayment Plan\nExternship\nYou may choose to take part in an optional volunteer externship with a local organization in your field to gain hands-on experience. Externship sites may require additional documentation such as health records, immunizations, drug screening or background checks. After completing your program, you can contact the Health Ed Today Externship Coordinator at\nmentor@healthedtoday.com\nto arrange placement.\nPrepare for PTCB Certification\nOur online or hybrid course prepares you to work as a pharmacy technician in retail, hospital or other pharmacy settings and to take the Pharmacy Technician Certification Board (PTCB) exam.\nNational and State Certification\nThis course meets the requirements for national certification exams. If you live or plan to work outside California, check your state’s requirements to be sure this program qualifies.\nThe Pharmacy Technician Profession\nPharmacy technicians work under the direction of a pharmacist. Their main role is filling prescriptions based on doctors’ orders. This includes retrieving the correct drug, measuring the right amount and preparing a prescription label. You may also prepare medications for oral, topical or other uses, and in some settings, mix drugs for intravenous use.\nTypical duties include:\nChecking inventory and ordering supplies\nReceiving and verifying shipments\nAssisting customers\nKeeping work areas clean\nCompleting insurance forms\nPreparing “bingo cards” for nursing home patients\nEmployment\nPharmacy technicians work in retail, mail order, home infusion and long-term care pharmacies, as well as hospitals, clinics, pharmacy benefit managers and large industrial settings. Demand for qualified technicians is growing due to new medications, a shortage of pharmacists, national certification standards and an aging population.\nEducational Requirements\nThere are no prerequisites for this course, and you can register without a high school diploma. However, the Pharmacy Technician Certification Board (PTCB) requires a high school diploma or GED to take the national certification exam. Externship placements are only available to students who are at least 18 years old.\nNews and Events\nSFSU Closed for Veterans Day, Nov. 11\nSFSU will be closed for Veterans Day, Tuesday, November 11, 2025.\nContact Us\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/pharmacy",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/criminaljustice/events/info-session",
    "category": "general",
    "title": "Criminal Justice Studies Online Bachelor's Degree Completion Info Session | College of Professional & Global Education",
    "content": "Criminal Justice Studies Online Bachelor's Degree Completion Info Session\nWednesday, November 05, 2025\nEvent Time\n04:00 p.m.   -  05:00 p.m.\nPT\nCost\nFree\nLocation\nOnline\nContact Email\ncjsonline@sfsu.edu\nRSVP\nOverview\nDo you have at least 60 college credits and want to finish your degree? Find out how you can\ncomplete your bachelor's degree in Criminal Justice Studies\nwith our 100% online degree completion program.\nJoin us on Zoom to learn about the program and get your questions answered. RSVP for the Zoom details.\nTags\ndegree completion\ncjs\nonline courses\nonline\nUpcoming Events\nClinical Laboratory Science Advising Session\nWednesday, October 22, 2025\nWinter Session 2026 Information Table\nMonday, October 27, 2025\nParalegal Studies Online Information Session - Spring 2026\nThursday, October 30, 2025\nClinical Laboratory Science Advising Session\nWednesday, November 05, 2025\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/criminaljustice/events/info-session",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/customized/medical",
    "category": "general",
    "title": "Customized Medical Training | College of Professional & Global Education",
    "content": "Contact Us\nCustomized Medical Training\nThe College of Professional & Global Education at San Francisco State University offers professional development and training for businesses, agencies and nonprofit organizations in the Bay Area and beyond. Our specialized medical programs can open up a world of dynamic, flexible and convenient training options for your staff or clients.\nWhat We Offer\nTraining for Your Staff of Eight or More at Your Workplace\n– After a needs assessment, we propose a training solution and recommend a format that fits your organizational culture. This might mean tailored scheduling like morning, afternoon and/or evening meetings, extended lunchtime forums or full-day sessions.\nBlended Learning\n– We can offer in-person at an off-campus location, online or hybrid classes (which is a combination of in-person and online).\nOpen Courses in SF or Online\n– Choose from individual certificate courses, or combination medical programs in a classroom or in online Zoom format.\nLength of Training -\nMost programs can be completed in one to three months depending on the number of hours in attendance.\nMedical Training Options\nAll of our medical trainings can be customized to meet the needs of your organization. This includes custom training content and curriculum that can address the challenges that may exist.\nWe also provide customized programs for government or private agencies that subsidize one or more cohort of students/clients.\nClinical Medical Assistant\nMedical Administrative Assistant\nMedical Billing and Coding Professional\nPharmacy Technician\nTraining programs are available in other areas. Please tell us what your organization needs.\nBenefits\nGuaranteed Quality\nthat is backed by the SF State brand\nFlexible Training\nat your offices, our Downtown Campus or virtual solutions\nRelevant Training\nfor today’s business needs\nTested Curriculum\nfor effective learning\nIndustry Experts\noffering real insights and practical solutions\nConvenient Location\nin downtown San Francisco\nWhat Partners Say\n“Ms. Tera Clemons is really great at teaching the material for medical assisting. She summarizes the material concisely and highlights the important points. She shows videos and draws out images for those who are more visual learners. She also encourages us during our EKG and blood draw training. She gives us suggestions on ways we can improve performing an EKG and blood draws so that we can improve as we practice from class to class.”\n- Training Client\nContact Us\nPlease contact us to discuss your training needs.\nJanet Alford\njalford@sfsu.edu\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/customized/medical",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/openuniversity/news/fall2025-openuniversity",
    "category": "general",
    "title": "Open University - Register Now for Fall 2025 | College of Professional & Global Education",
    "content": "Open University - Register Now for Fall 2025\nAuthor:\nStaff\nAugust 11, 2025\nPhoto Credit:\nStaff\nTake Undergraduate and Graduate Classes at SFSU\nFall 2025\nOpen University\nregistration is now open for courses that begin Monday, August 25.\nRegister today.\nWhat is Open University?\nOpen University\nallows you to take space-available SFSU undergraduate and graduate classes without formal admission to the University. You can apply up to 24 undergraduate units toward a bachelor’s degree or six graduate units toward a master’s degree at SFSU.\nTags\nfall\nRelated News\nComplete a Business Degree Online - Spring Deadline Extended to October 15\nOctober 2, 2025\nCriminal Justice Online Degree Completion - Spring Deadline Extended to October 15\nOctober 2, 2025\nCenter for Global Engagement Newsletter – October 2025\nOctober 1, 2025\nPre-Health Professions Post-Baccalaureate Program - Apply by March 1 for Summer\nOctober 1, 2025\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/openuniversity/news/fall2025-openuniversity",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/bsba/news/apply-spring2026",
    "category": "general",
    "title": "Complete a Business Degree Online - Spring Deadline Extended to October 15 | College of Professional & Global Education",
    "content": "Complete a Business Degree Online - Spring Deadline Extended to October 15\nAuthor:\nStaff\nOctober 2, 2025\nPhoto Credit:\nStaff\nFinish Your Bachelor's Degree Online\nOur new\nBachelor of Science in Business Administration (BSBA)\nonline degree completion program is now accepting applications. If you have 60 transferable credits from any major and are looking for a flexible way to finish your degree, our 100% online program is a good choice.\nLam Family College of Business\nYou will earn your degree from SF State's\nLam Family College of Business,\naccredited by the Association to Advance Collegiate Schools of Business (AACSB) International since 1964.\nYou will study the same curriculum, learn from the same faculty and earn the same degree as those in the on-campus program.\nWhy Choose SF State?\nCurriculum\n: Choose from a wide array of concentrations to match your interests.\nFaculty\n: Learn from professionals and academic leaders from a variety of business disciplines ranked among the best in their fields.\nCost\n: See if you are eligible for financial aid.\nSupport\n: Be part of a small cohort with one-on-one attention from faculty.\nReputation\n: Earn your degree from an AACSB-accredited business college that was included in The Princeton Review’s list of Best Business Schools in the country.\nApply\nFind out how to apply.\nApply Now\nTags\nBSBA\ndegree completion\nonline courses\nRelated News\nComplete a Business Degree Online - Spring Deadline Extended to October 15\nOctober 2, 2025\nCriminal Justice Online Degree Completion - Spring Deadline Extended to October 15\nOctober 2, 2025\nCenter for Global Engagement Newsletter – October 2025\nOctober 1, 2025\nPre-Health Professions Post-Baccalaureate Program - Apply by March 1 for Summer\nOctober 1, 2025\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/bsba/news/apply-spring2026",
    "domain": "cpage.sfsu.edu"
  },
  {
    "source": "https://cpage.sfsu.edu/sfsummer/news/summer2023-apply",
    "category": "general",
    "title": "Summer in SF - Apply for Summer 2023 | College of Professional & Global Education",
    "content": "Summer in SF - Apply for Summer 2023\nAuthor:\nStaff\nFebruary 24, 2023\nPhoto Credit:\nStaff\nInternational Students\nSummer in San Francisco\nis a complete university experience at San Francisco State University.\nExperience the City\nSpend your summer immersed in the culture of one of the most diverse and exciting cities in the world. Enjoy everything San Francisco and the Bay Area have to offer, through field trips, social activities and visits to famous neighborhoods, museums and more.\nEarn University Credit\nTake two university courses of your choice and\nA U 110: Living in San Francisco\n(seven credits) at SFSU. You may be able to transfer the credits back home or to other universities around the world.\nOnline Option\nSummer in San Francisco is offered in person and online. Students taking the program online may enroll in SFSU classes from anywhere and can enroll in the number of units that best meets their needs\nSummer 2023\nApply now\nto start in June or July.\nDeadlines\nIn Person Priority Deadline:\nR1 & R4: March 15\nR3: April 15\nOnline:\nRolling - classes are first-come, first-serve\nRelated News\nComplete a Business Degree Online - Spring Deadline Extended to October 15\nOctober 2, 2025\nCriminal Justice Online Degree Completion - Spring Deadline Extended to October 15\nOctober 2, 2025\nCenter for Global Engagement Newsletter – October 2025\nOctober 1, 2025\nPre-Health Professions Post-Baccalaureate Program - Apply by March 1 for Summer\nOctober 1, 2025\nDocument Readers\nare required to view documents.",
    "url": "https://cpage.sfsu.edu/sfsummer/news/summer2023-apply",
    "domain": "cpage.sfsu.edu"
  }
]