[
  {
    "source": "https://csld.sfsu.edu/",
    "category": "general",
    "title": "Career & Leadership Development | San Francisco State University",
    "content": "💒 Office Hours\nAdministration Building, Suite 254\n, Monday – Friday | 8:30 AM – 4:30 PM\nDrop-In Hours\n:\nMonday – Friday | 10:00 AM – 11:00 AM\nAvoid Job Scams\nSchedule an Appointment\nCareer & Leadership Development\nResumes & Cover Letters\nLeadership Development\nInterview Preparation\nCareer Handouts\nHot Jobs\nCheck out the latest openings!\nCheck Openings ▷\nHandshake\nJoin the SFSU Handshake today!\nGo To Handshake ▷\nFree Professional Headshots\nUsing our Iris Headshot Booth.\nMake an Appointment ▷\nEvents, Workshops & Fairs\nCheck out the latest events!\nCheck The Latest Events ▷\nCLD Hours\nCampus Partners\nCareer & Leadership Development (CLD) Hours:\nMonday – Friday: 8:30 a.m. – 4:30 p.m.\nEmail:\ncareer@sfsu.edu\nor Phone:\n(415) 338-1764\nSchedule Your Career Counseling Appointment Now!\nOur Campus Partners:\nGraduate Studies\nUndergraduate Advising Center\nInstitute for Civic and Community Engagement\nCollege of Business Career Center\nGatorXperience- Student Organizations\nCSU Entertainment Alliance\nWhat Can I Do With My Major?\nClick on your respective college below to find accompanying resources associated with your major:\nCollege of Ethnic Studies\nCollege of Health & Social Sciences\nLam Family College of Business\nCollege of Liberal & Creative Arts\nGraduate College of Education\nCollege of Science & Engineering\nCLD Platforms\nClick here\nto get more information about all CLD platforms.\nHandshake\nHandshake is our online career management platform for students and employers. Over 10,000+ employers, 5,600+ jobs, 1,500+ internships listings and growing.\nHandshake ➔\nHiration\nHiration is a 24/7 AI-powered career platform that helps users create optimized resumes, cover letters, LinkedIn profiles, and practice interviews tailored to specific job opportunities.\nHiration ➔\nBack to Top",
    "url": "https://csld.sfsu.edu/",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/interview-preparation",
    "category": "general",
    "title": "Interview Preparation | Career & Leadership Development",
    "content": "Interview Preparation\nResume, CV, Cover Letter & LinkedIn\nOn Campus Jobs\nJobs & Internships\nEvents, Workshops & Fairs\nWhat Can I Do With This Major?\nChoose a Career Direction or Major\nBuild Connections (Networking & More)\nInterviewing Preparation   ➔\nGraduate & Professional Programs\nCareer Advising Appointments\nResources & Career Tools\nFree Professional Headshots\nPreparing for an interview is one of the most crucial aspects of the job search process. Your resume, cover letter, and network connections helped you stand out in a pool of applicants, but now is your chance to wow the employer by showing your fit with the company and excitement for the opportunity. Being well-prepared for the interview will give you the confidence to impress the employer and succeed in obtaining a job offer.\nReview our\ninterviewing handouts\nregarding the types of interviews, common interview questions, dressing for interviews, follow-up thank you notes, and general advice to help you prepare.\nPlease choose a category below to view:\nPractice Interviewing\nBuild your interview confidence with our online Hiration tool. Practice common interview questions, questions related to your job description, and review sample answers—all in one place. You can answer questions in writing or by recording a video, which is the most effective method. Give it a try!\nHiration Interviewing Tool\nJob Offers\nCongratulations on the job offer! Be sure to receive a formal, written confirmation of the offer that includes information about position title, start date, salary, benefits, and deadline for responding.\nIf in doubt, a career counselor with CLD can help you through the process of evaluating the offer, negotiating salary, and deciding whether to accept or decline the offer\nSome areas to consider when evaluating an offer are:\nJob Duties:\nWhat are the job duties and responsibilities? Are they realistic and exciting? Will the work be challenging to you? Are there a variety of tasks to perform? Are there opportunities for growth?\nWork Environment:\nDo you like the physical work environment? Do you feel comfortable with your future supervisor and fellow employees? Is your supervisor likely to be a good mentor? Do your values and lifestyle correspond with the values and culture of the organization?\nOrganization:\nWhat is the organization's reputation? Is the organization growing or downsizing?\nCompensation:\nWhat is the total compensation package (base salary and benefits)? Does the salary meet your financial needs and obligations? If the salary is low, are there opportunities for significant responsibilities and advancement? What benefits are offered, i.e. healthcare, vacation, sick time, etc.?  Be aware that some smaller employers offer creative benefits to attract good employees including stock options, transportation costs, free meals, flextime, telecommuting, etc.\nSalary Negotiations\nDon't be afraid to negotiate your offer! The employer expects it. Check out websites such as\nGlassdoor\n,\nSalary\n, or\nLinkedIn Salary\nto explore salary ranges by job title and location. See how years of experience, industry, location and more can impact your salary and use this to support any salary negotiations you make.\nSalary Negotiation Handout",
    "url": "https://csld.sfsu.edu/interview-preparation",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/gator-leadership-circle",
    "category": "general",
    "title": "Gator Leadership Circle (GLC) | Career & Leadership Development",
    "content": "Gator Leadership Circle (GLC)\nLeadership Development Home\nGator Leadership Circle (GLC)\n➔\nPresident's Leadership Fellows\nProgram (PLFP)\nPLFP Cohort Student Spotlights\nEustace-Kwan Family Foundation\nApply Now for Fall 2025!\n1. Program History & Purpose\nThe Gator Leadership Circle (GLC) was founded by CLD Career Counselor Dr. Joseph Adams in Fall 2020 in efforts to provide leadership development and career preparation workshops for first and second year students at SFSU. The goal of GLC is to support students in taking their first steps into preparing for their future careers, both professional, and academic through self-exploration exercises, workshops focused on opportunities available on campus, and a cohort-based learning model.\nStudents who participate in GLC will learn to recognize their interests and strengths and will gain a head start in developing themselves as holistic leaders with high rates of critical thinking, work ethic, and career knowledge.\nAs an extension of the Career & Leadership Development office, GLC participants will receive guidance in regards to resume building, career resources on campus including digital platforms such as Hiration, and Handshake. Members will learn to recognize their own expertise and strengths, and will also receive a Certificate of Completion for completing program requirements.\n2. Requirements for Eligibility\nThe program is open to currently enrolled full time first and second-year students.\nAttendance at all sessions is a strict requirement of the program in order to receive the Certificate of Completion.\n3. Program Commitments\nGator leadership Circle (GLC) consists of 5 sessions. The cohort will meet on select Tuesdays from 2:00PM – 3:30PM IN-PERSON in Library 121.\nAttendance is a requirement of our program. Please ensure that this program aligns with your class schedule before applying.\n4. Selection Process\nAll full time first-year and second-year students in good academic standing will automatically be accepted into the program. Students will be notified via their SF State campus email and by phone if a number is included in their application 48 hours after application deadline (TBD).\n5. Upcoming Program Dates/Times\nFall 2025 GLC Schedule:\nEach workshop is 2:00-3:30pm.\nSeptember 23rd\n- GLC Orientation\nSeptember 30th\n- Presenter TBD\nOctober 7th\n- Presenter TBD\nOctober 14th\n- Presenter TBD\nOctober 21st\n- Certificate Ceremony\n6. Frequently Asked Questions\nWho is eligible to apply to GLC?\nAll current first-year and second year SFSU students are welcomed to the program regardless of major.\nAre there any requirements to apply?\nMust be a freshmen or sophomore to apply and, you must be available each week for the entire programmed time that the program is scheduled to meet IN-PERSON.\nCan I participate in GLC remotely through Zoom?\nAs of Fall 2023, we are committing to keeping GLC fully IN-PERSON with no remote alternative. We understand that not everybody is available at these times, but believe the networking and face to face elements of our program are necessary for our students.\nWhere will the workshops/meetings be held?\nMeetings will be conducted in-person in Library 286.\nPlease note attendance is a mandatory requirement for completion of our program. Please only consider applying if our meeting time (Tuesdays 2:00-3:30PM) works for your class and work schedule.\nI just transferred and I am in my second semester as a freshman, am I eligible?\nYes, you are still considered a freshmen or sophomore and you are welcome to apply.\nDo I need to bring anything with me to the meetings?\nAn open mind, big smile and a notebook and pen since there will be a lot of valuable information!\n7. How to Apply\nApplications will be sent to all currently enrolled first and second year students via their SF State campus email (ends with @sfsu.edu or @mail.sfsu.edu!).\nAPPLY FOR FALL 2025 NOW!\nQuestions? Please contact:\nKylie Schneider\nStudent Engagement & Leadership Programs Coordinator\nglc@sfsu.edu",
    "url": "https://csld.sfsu.edu/gator-leadership-circle",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/choose-career-direction-or-major",
    "category": "student_career",
    "title": "Choose a Career Direction or Major | Career & Leadership Development",
    "content": "Choose a Career Direction or Major\nResume, CV, Cover Letter & LinkedIn\nOn Campus Jobs\nJobs & Internships\nEvents, Workshops & Fairs\nWhat Can I Do With This Major?\nChoose a Career Direction or Major   ➔\nBuild Connections (Networking & More)\nInterviewing Preparation\nGraduate & Professional Programs\nCareer Advising Appointments\nResources & Career Tools\nFree Professional Headshots\nFiguring out what career or major to pursue is tough.  There is no magical sorting hat or crystal ball that will give you the answer. This is a decision that\nyou\nmust make yourself, and it takes time and research. Think of it this way - Knowledge is power. The more information you have, the more thoughtful and well rounded your decisions will be.\nUnderstand Yourself\nFinding a career or major that aligns with your strengths and interests is important to your overall job satisfaction and wellbeing.  We’ve provided some free personality assessments to help you identify careers or majors that compliment your personality traits, workplace preferences and personal values.\nInstructions: Please choose and complete one of the free personality assessments below (or do all three!).  Be sure to take your time so that you get the truest results. Remember, there are no wrong answers when completing these assessments.\nMy Next Move\n- O*NET Online helps you identify your interests and provides occupations that align with those interests. This takes approximately 5-10 minutes to complete.\nCareer Explorer\n- Uses career satisfaction data, psychometrics and machine learning to help you find your ideal career or major.  This takes approximately 30-45 minutes to complete and can be done in multiple sittings.\nValues – Personal values are a core part of our being.  They provide a sense of purpose and influence the decisions we make in life. Because of this, it’s important to have a career that aligns with these personal values. Complete the attached exercise to identify which values are top priority for you when choosing a career or major.\nValues Worksheet\nExplore Career/Major Options\nOnce you have a greater understanding of your values and unique talents, it’s important to explore various careers or majors that align to your interests.  Use the attached exercises to help you organize your exploration efforts.  Start with your top three choices.  Think of it like a puzzle you’re putting together piece by piece.  With research, each piece you discover will add to your overall career or major picture.\nUse the resources below to gather more information about specific careers or majors of your choosing:\nPersonal Reflection Worksheet\nKnow Yourself Worksheet\nJob Research Worksheet\nRead about Majors:\nWhat Can I Do With This Major?\nLearn about specific careers:\nO*NETonline\nZippia\nTalk to those in specific fields:\nInformational Interviewing Document\nJoin a student club:\nClick Here!\nHere are some further suggestions provided by the Undergraduate Advising Center:\nClick Here!\nMake a Plan\nMaking a plan can help you set goals and create actionable steps to move forward.  If you’ve completed the Know Yourself and Explore Career/Major Options sections of this website, you have identified your interests and researched your top careers/majors.  The next step is to narrow down your choices. This is a decision that only YOU can make.\nCareer Counseling:\nMake an Appointment with a Career Counselor to determine the best approach with your next steps\nClick Here!\nAcademic Advising:\nFor any questions regarding required courses, registering for classes or changing majors, be sure to meet with your academic advisor to ensure that you meet all the program requirements\nClick Here!\nUndergraduate Academic Advising  ➔\nGraduate Advising ➔",
    "url": "https://csld.sfsu.edu/choose-career-direction-or-major",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/index.php/employing-students-campus-jobs",
    "category": "general",
    "title": "Employing Students for On-Campus Jobs | Career & Leadership Development",
    "content": "Employing Students for On-Campus Jobs\nGetting Started\n💢 Where to Post Jobs\nHandshake\nTo hire students for on-campus jobs, we recommend using\nHandshake\n, SF State’s online job listing platform for students, alumni, and staff.\nHandshake\ncan be used for job types like:\nWork Study Program (through Financial Aid)\nStudent Assistant (non-work study)\nInstructional Student Assistant\nTeaching Associate\nGraduate Assistant\nHandshake\nAccount Types\nSF State faculty/staff have the opportunity to request the following types of Handshake accounts:\nEmployer Account\n- Employer Accounts enable you to post jobs listings, track and manage job applicants, and outreach to students. For this account type, you will not be able to use Single Sign-On (SSO) and will instead need to use an email and password.\nStudent Account -\nStudent Accounts enable you to log in and see what students see in Handshake. This can be helpful for reviewing your department's job postings and understanding the job search process from a student perspective. For this account type, you will be able to use Single Sign-On (SSO) to log in.\n💢 Logging Into Handshake\nHow to Log into your Employer Account\nGo to:\nhttps://app.joinhandshake.com/login\nEnter:\nEmail\nunder Employers & Career Centers (USA)\nClick on:\nOr log in using your Handshake credentials\n(Do not click on the blue button that says Current SFSU Student Login - SSO)\nEnter:\nYour password\n(Click:\nForgot your password\nif you have never set up a password or forgot it)\nComplete your profile\nClick on the\n+Post a Job\nbutton on your home dashboard to begin creating your job post\nHow to Log into your Student Account\nGo to:\nhttps://sfsu.joinhandshake.com/login\nClick on the blue button that says\nSFSU Current Student Login\nEnter your credentials for SF State Global Login and click on\nLogin\nComplete your profile\nAccount approval may take a few days. If you encounter any issues creating an account, waiting for account approval, or posting jobs, please reach out to\ncampusjobs@sfsu.edu\n.\nHow to Post a Job on Handshake\nStep 1: Fill in Basic Information\nJob Title\nTo help students find jobs, we recommend using the following format when creating job titles:\n(LAEP or Work Study [only or preferred]) - [Undergraduate or Graduate if applicable] Title of Job - Department or Division - [Time Range if Applicable]\nExample job titles following this format include:\nWebmaster – Career & Leadership Development\nGraduate Student Assistant - Graduate College of Education\n(Work Study Only) Undergraduate Financial Aid Student Assistant - Office of Financial Aid\n(Work Study Preferred) Undergraduate Reading/Writing Tutor - Tutoring & Academic Support - Academic Year 2024 - 2025\nPosition Type\nYou\nmust\nselect\nOn Campus Student Employment\nor students will not be able to search and filter for this type of job opportunity. Please also select\nWork Study program\nif your position is Work Study only. For more information on Work Study positions, please review the\nFederal Work-Study page from the Office of Financial Aid\n.\nDescription\nCreate a description that outlines job duties and lists qualifications.\nStep 2: Add Details to Your Job Posting\nLocation Requirements\nAs you start typing the address, some suggestions will show up in the address field - you\nmust\nselect one rather than manually typing it in. This can be a specific office location, or a general city like \"San Francisco, USA.”\nTime Requirements\nList\nPart time\n(number of hours optional),\nTemporary or seasonal\n, and\nEstimated start and end times\n. Please note SF State students can work up to 8 hours a day and 20 hours a week during the academic year and up to 40 hours per week during summer sessions and semester breaks.\nCompensation and Benefits\nFor most on-campus jobs, select\nPer Hour\n. Other sections like\nBenefits\nand\nPerks\nare optional.\nCategorize Your Job\nThis section provides a drop-down menu of types of job roles. To support students in searching for your job listing, please select up to three options that best describe the general job responsibilities.\nCommon job role groups for student employees include:\nAdministrative Service Managers\nDocument Management Specialists\nProject Managers\nCamera Operators, Television, Video, and Film\nGraphic Designers\nTeaching Assistants\nComputer and Information Systems Managers\nInstructional Coordinators\nTraining and Development Managers / Specialists\nComputer User Support Specialists\nMarketing Managers\nTutors\nCustomer Service Representatives\nOffice and Administrative Support Worker\nUniversity Student Researchers\nData Analysts\nPhotographers\nWeb Administrator\nStep 3: Select Your Applicant, Campus, and Document Preferences\nCandidate Qualifications\nThis feature enables you to set\noptional\npreferences for the types of candidates for your job posting. Setting these preferences will not prevent those who do not meet your qualifications from applying.\nChoose Schools\nSelect San Francisco State University.\nPlease do not add additional schools for On-Campus Jobs.\nApplication Process\nHandshake provides the option to accept applications through Handshake or through another applicant tracking system. If you select\nyes\n, you'll be able to input a URL for students to apply through. Handshake will provide a place for you to add additional instructions for the external website.\nDocuments like resumes, cover letters, transcripts, and more can all be collected through Handshake. Please leave resume checked, as a resume is required.\nYour Hiring Team\nSF State utilizes the Divisions Model of Handshake’s on-campus employment recruitment environment. Campus departments are listed as a Division. These Divisions are under one Company, called\nSan Francisco State University\n. Some Divisions have been pre-input into our system. If your department or college has not been input, please contact\ncampusjobs@sfsu.edu\nto add your department to the Division feature.\nStep 4: Review, Post, and Duplicate Your Job\nYou're all set! Select\nCreate\non the bottom navigation to review and post your job.\nFind Your Job Posts\nOnce you are done creating a job in Handshake, you will be able to find your Active and Expired job posts on the\nJobs\ndashboard. Select your Division from the drop down menu to more quickly filter for your job posts.\nRecreate a Job\nTo recreate a job post, begin by locating your expired posting. Then:\nClick the\nMore Actions\nbutton on the top right\nSelect\nDuplicate\nEdit the job post to update relevant dates and details\nStep 5: Manage Your Job Posting\nExplore these Handshake articles to find step-by-step guidance on managing your job postings.\nHow to Edit a Job Posting\nUpdating Job Posting Closing Dates\nManage your Job Drafts\nHow to Add or Change a Contact to Receive Applicant Packages\nDownload Applications / Create a Resume Book\nClose a Job Posting\nSource Tag URL for External Applicant Tracking Systems\nQUESTIONS: Need assistance?\nHandshake provides several ways to get answers to your questions:\nThe\n'Help'\nbutton is located in the top right corner of the homepage, this feature gives you access to:\nContact Support\n: Opens a chatbot for real-time assistance with your inquiries.\nHelp Center\n: Takes you to Handshake's Help Center, where you can search for detailed articles on a wide range of topics to resolve your issues.\nYou can also visit the Handshake Help Center directly\nhere\n.\nSteps to Complete the Hiring Process\nSTUDENTS\nMAY NOT BEGIN\nWORK UNTIL AFTER the I-9 Verification has been completed AND the completed Student Hiring Packet has been submitted to Human Resources through DocuSign. Students who have already completed an I-9 verification process do not need to complete the verification process again, but will need to complete the Student Hiring Packet.\nStep 1: I-9 Verification Process\nStep 1:\nAsk the Student if they are an International Student. If they are, they must first contact the Office of International Programs (OIP) to obtain the\nOn-Campus Employment Certification\n. Then international students may start the I-9 Verification Process. If they are not, please proceed to the following steps.\nStep 2:\nAsk the student to send an email to\nStudent_i-9@sfsu.edu\nwith the following information:\nTheir  full and complete first and last name as it appears on their identification\nSF State student email (No personal emails)\nSF State Student ID Number #\nStep 3:\nThe student’s I-9 Tracker profile will be created by I-9 Verification Specialist from Campus Safety. An automated message from I-9 Tracker will be sent to their SF State student email.  Please ask students to check their spam or junk folder if they do not see it in their inbox. Students will log into I-9 Tracker and complete Part 1 (Section 1).\nStep 4:\nA second email will be sent to the student’s SF State email with instructions on how to complete the Form I-9 (Part 2). The instructions email will include what documents are acceptable to verify their identity and employment eligibility, and where to go in person to present their documents on-campus:\nThey will need to present one or more acceptable documents that are listed\nhere\nor in the attached List of Acceptable Identification for I-9 Verification. They must present original documents; scans or photos of their documents are not accepted.\nStudents can verify their identification and supporting documents in person at Campus Safety (UPD) located on-campus at 100 North State Drive, San Francisco, California, 94132. (See map below).\nDrop-in hours are available Monday through Thursday (M/T/W/Th) from 8:30AM to 3:00PM.\nYou can also make an appointment for I-9 verification online by going to the following link and selecting the appointment calendar: Calendly - Fingerprint or I-9 Appointment Calendar.\nGraduate Assistant (GA) or Graduate Teaching Assistant (GTA):\nGA and GTA will complete the I-9 with their hiring departments.\nAuxiliary Positions:\nComplete I-9 with the on-campus employer.\nAuxiliary positions refer to positions at Sodexo, Associated Students, Inc., University Cooperation (U-Corp), SFSU Bookstore, or any other on-campus commercial employers.\nRemember, NO STUDENT MAY BEGIN WORK until after their I-9 verification has been completed.\nI-9 Verification is not available on holidays, or when the campus is closed. Please check the online calendar for upcoming holidays and dates when the campus will be closed.\nStep 2: HR Paperwork\nStudents must complete and sign the Student Hiring Packet before starting work. After their I-9 form has been completed and their documents verified, students should notify you of completion.\nStudent Hiring Packet\nIn DocuSign, the designated staff member for your department will use the template “Student Hiring Packet” to set up the hiring documents for the student to receive and fill out. This packet includes:\nW-9 form\n(CSU Student Payroll Action Request)\nCSU Form SSA-1945 - Information About Social Security\nAffordable Care Act (ACA) Form\nCANRA Form (Child Abuse and Neglect Reporting Act)\nPlease note:\nOn-campus employers are not able to provide direct tax advice or guidance for how to fill out tax-related forms. For more information, students can review\nIRS form W–4\nand\nCalifornia form DE-4\n.\nIf hiring an International Student, the student being hired\nmust\ncontact the University Tax Specialist to verify their tax status before filling out these forms. Please include the campus’s\nUniversity Tax Specialist\nto sign off on the DocuSign Student Hiring Packet for all international students.\nE-TRAC\nThe designated staff member of your hiring department will\ncomplete and submit a new hire E-trac\nto complete the hiring process. The starting date for the E-trac cannot be earlier than the I-9 Verification date. Enter the E-trac number onto the Hiring Documents. For international students make sure the University Tax Specialist has signed off on the Student Hiring Packet.\nInstructions for Academic Year 2023-2024 Student E-TRAC Processing\nBackground Check\nMany student employment positions may require a background check.  Please contact Human Resources for assistance with this process.\nEO-1083 Attachment CANRA Child Abuse and Neglect Reporting Act\nStep 3: Confirm Pay Rate & Schedule\nPay Rate\nHR announced effective September 1, 2021, the San Francisco State University wage for Student Employees and Casual Workers was set at $16.50 per hour (minimum). Although not required, campus departments are encouraged to set pay rates at the\nSan Francisco Living Wage\n, or as close to it as possible.\nSchedule\nPlease confirm with the hiree what their academic schedule is for the upcoming semester. Student hours should not exceed 8 hours per day and 20 hours per week during regular academic sessions, and 8 hours per day and 40 hours per week during summer sessions and semester breaks.\nStep 4: Plan for Onboarding\nTraining\nPlease conduct a departmental training for the student, including:\nIntroductions to others in the department\nDuties and job expectations\nScheduling and clocking in and out\nTimesheets & payroll\nRisk management & safety, etc.\nPayroll\nAs a part of the onboarding process, please provide students with the current year’s payroll calendar showing when monthly timesheets are due and when payday is. Students will receive an email from HR Payroll prior to payday regarding the details of their upcoming paycheck. Students should expect to be issued a live check until their Direct Deposit for Payroll is activated. For payroll-related questions or status on a direct deposit request, please contact your\nDepartment Payroll Representative\n.\nHow to Report Student Time Guide\nReport Your Time Guide",
    "url": "https://csld.sfsu.edu/index.php/employing-students-campus-jobs",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/node/39",
    "category": "general",
    "title": "College of Health & Social Sciences | Career & Leadership Development",
    "content": "College of Health & Social Sciences\nAll Colleges\nCollege of Ethnic Studies\nCollege of Health & Social Sciences\n⭐\nLam Family College of Business\nCollege of Liberal and Creative Arts\nGraduate College of Education\nCollege of Science and Engineering\nAPPAREL DESIGN & MERCHANDISING\nCHILD & ADOLESCENT DEVELOPMENT\nCOUNSELING\nCRIMINAL JUSTICE STUDIES\nENVIRONMENTAL STUDIES\nFAMILY AND CONSUMER SCIENCES (Child & Family Studies)\nGERONTOLOGY\nINTERIOR DESIGN\nKINESIOLOGY\nNURSING\nNUTRITION & DIETETICS\nPUBLIC ADMINISTRATION\nPUBLIC HEALTH\nRECREATION, PARKS, AND TOURISM\nSOCIAL WORK\nSOCIOLOGY\nURBAN STUDIES AND PLANNING\nWhat Can I Do With a Major in Retail/Merchandising? ➔\nBest Jobs and Career Paths for\nSales and Merchandising\nMajors\nAverage\nSales and Merchandising Major Salary\nSF State Apparel Design & Merchandising Major Overview\nOccupational Outlook\nCustomer Service Representatives\nPurchasing Managers\nRetail Sales Workers\nSales Representatives, Wholesale and Manufacturing\nEmployment Opportunities\nClothing Industry Jobs\nRetail Jobs\nStyle Careers\nWork in Retail\nProfessional Associations\nNational Association for Retail Marketing Services\nNational Retail Federation\nRetail Industry Leaders Association\nRelated Resources\nApparel Search\nCareer Information for Merchandising Marketing, Sales, and Distribution\nFashion Careers\nHome Furnishings News\nInternet Retailer\nThis is Retail (NRF)\nRetail Marketing Information\nRetailwire\nWe Connect Fashion\nWhat Can I Do With a Major in Child and Family Studies? ➔\nBest Jobs and Career Paths for\nHuman Development\nMajors\nAverage\nHuman Development Major Salary\nSF State Child and Adolescent Development Major Overview\nOccupational Outlook\nChildcare Workers\nKindergarten and Elementary School Teachers\nMental Health Counselors and Marriage and Family Therapists\nPreschool Teachers\nRehabilitation Counselors\nSchool and Career Counselors\nSocial and Community Service Managers\nSocial and Human Service Assistants\nSocial Worker\nSubstance Abuse and Behavioral Disorders Counselors\nEmployment Opportunities\nCounseling Jobs\nSocial Service Jobs\nProfessional Associations\nAmerican Association for Marriage and Family Therapy\nAmerican Association of Family and Consumer Sciences\nAmerican Counseling Association\nAmerican Psychological Association\nAmerican School Counselors Association\nAssociation of Child Life Professionals\nAssociation for Lesbian, Gay, Bisexual and Transgender Issues in Counseling\nAssociation for Multicultural Counseling and Development\nInternational Congress of Infant Studies\nNational Association for the Education of Young Children\nNational Council on Family Relations\nNational Human Services Assembly\nRelated Resources\nAmerican Society on Aging\nChild and Family Policy Consortium\nChild Welfare League of America\nChildren Now\nChildren’s Defense Fund\nEarly Childcare and Education Resource Guide\nExplore Health Careers\nMilitary Family Services\nNational Resource Center for Health and Safety in Child Care\nU.S. Department of Health and Human Services: Administration for Children and Families\nWhat Can I Do With a Major in Counseling? ➔\nBest Jobs and Career Paths for\nSchool Counseling\nMajors\nBest Jobs and Career Paths for\nMental Health Counseling\nMajors\nAverage\nSchool Counseling Major Salary\nAverage\nMental Health Counseling Major Salary\nSF State Counseling Major Overview\nOccupational Outlook\nMarriage and Family Therapists\nPostsecondary Teachers\nRehabilitation Counselors\nSchool and Career Counselors\nSocial and Community Service Managers\nSocial and Human Service Assistants\nSubstance Abuse, Behavioral Disorder, and Mental Health Counselors\nEmployment Opportunities\nCounseling Jobs\nEmployment Opportunities\nSocial Service Jobs\nProfessional Associations\nAmerican Art Therapy Association\nAmerican Association for Marriage and Family Therapy\nAmerican Counseling Association\nAmerican Mental Health Counselors Association\nAmerican Music Therapy Association\nAmerican Psychological Association\nAmerican School Counselors Association\nAssociation for Counselor Education and Supervision\nAssociation for Lesbian, Gay, Bisexual and Transgender Issues in Counseling\nAssociation for Multicultural Counseling and Development\nCouncil for Accreditation of Counseling and Related Educational Programs\nExpressive Arts Therapy Association\nNational Association of School Psychologists\nNational Board for Certified Counselors\nNational Career Development Association\nNational Employment Counseling Association\nNational Organization for Human Services\nNational Rehabilitation Association\nRelated Resources\nChoosing a Graduate Program\nCounseling Degrees\nCounseling Internet Resources\nExplore Health Careers\nWhat Can I Do With a Major in Criminal Justice? ➔\nBest Jobs and Career Paths for\nCriminal Justice\nMajors\nAverage\nCriminal Justice Major Salary\nSF State Criminal Justice Studies Major Overview\nOccupational Outlook\nCorrectional Officers\nJudges, Mediators and Hearing Officers\nLawyers\nParalegals and Legal Assistants\nPolice and Detectives\nPrivate Detectives and Investigators\nProbation Officers and Correctional Treatment Specialists\nSecurity Guards and Gaming Surveillance Officers\nEmployment Opportunities\nAmerican Police Beat\nAmerican Society of Criminology Careers\nCorrectionalOfficerEDU.org\nCriminal Justice Jobs Help.com\nFederal Bureau of Investigation - Careers\nFederal Jobs Network - Law Enforcement Jobs and Careers\nGo Law Enforcement\nNational Criminal Justice Association Public Safety Career Center\nU.S. Department of Justice Careers\nProfessional Associations\nAmerican Correctional Association\nAmerican Society of Criminology\nNational Association of Criminal Justice\nNational Association of Legal Assistants\nNational Narcotic Officers Association\nThe American Parole and Probation Association\nRelated Resources\nBureau of Alcohol, Tobacco, Firearms & Explosives (ATF)\nCentral Intelligence Agency\nCriminal Justice Careers\nCriminal Justice Degree Schools (Explore Criminal Justice Careers)\nCriminal Justice Programs\nCriminal Justice USA\nDepartment of Defense\nEnvironmental Protection Agency (EPA)\nFederal Bureau of Investigation\nNational Security Agency\nNaval Criminal Investigative Service (NCIS)\nU.S. Department of Justice\nU.S. Department of State\nWhat Can I Do With a Major in Environmental Studies/Science? ➔\nBest Jobs and Career Paths for\nEnvironmental Science\nMajors\nAverage\nEnvironmental Science Major Salary\nSF State Environmental Studies Major Overview\nOccupational Outlook\nConservation Scientists and Foresters\nEnvironmental Science and Protection Technicians\nEnvironmental Scientists and Specialists\nEmployment Opportunities\nConservation Jobs\nCyber-Sierra Natural Resources Job Search\nEarthworks-jobs.com\nEcotourism Job Centre\nEnvironmental Career Opportunities\nEnvironmental, Health, and Safety Jobs\nEnvironmentalCareer.com\nNew Scientist Jobs\nScience Careers\nScience Societies Career Center\nProfessional Associations\nAmerican Geosciences Institute\nCrop Science Society of America\nEcological Society of America\nInternational Erosion Control Association\nNational Association of Environmental Professionals\nNational Council for Science and the Environment\nNational Environmental Education Foundation\nNational Environmental Health Association\nNorth American Association for Environmental Education\nSierra Club\nSociety for Conservation Biology\nSociety of Women Environmental Professionals\nSoil Science Society of America\nThe Coastal Society\nThe Student Conservation Association\nRelated Resources\n50 Careers in Trees\nEcotourism professional outlook\nEPA – Careers\nGuide to Green Careers\nUSDA Living Science\nWhat Can I Do With a Major in Child and Family Studies? ➔\nBest Jobs and Career Paths for\nFamily and Consumer Sciences\nMajors\nAverage\nFamily and Consumer Sciences Major Salary\nSF State Family and Consumer Sciences Major Overview\nOccupational Outlook\nChildcare Workers\nKindergarten and Elementary School Teachers\nMental Health Counselors and Marriage and Family Therapists\nPreschool Teachers\nRehabilitation Counselors\nSchool and Career Counselors\nSocial and Community Service Managers\nSocial and Human Service Assistants\nSubstance Abuse and Behavioral Disorders Counselors\nEmployment Opportunities\nCounseling Jobs\nSocial Service Jobs\nProfessional Associations\nAmerican Association for Marriage and Family Therapy\nAmerican Association of Family and Consumer Sciences\nAmerican Counseling Association\nAmerican Psychological Association\nAmerican School Counselors Association\nAssociation of Child Life Professionals\nAssociation for Lesbian, Gay, Bisexual and Transgender Issues in Counseling\nAssociation for Multicultural Counseling and Development\nInternational Congress of Infant Studies\nNational Association for the Education of Young Children\nNational Council on Family Relations\nNational Human Services Assembly\nRelated Resources\nAmerican Society on Aging\nChild and Family Policy Consortium\nChild Welfare League of America\nChildren Now\nChildren’s Defense Fund\nEarly Childcare and Education Resource Guide\nExplore Health Careers\nMilitary Family Services\nNational Resource Center for Health and Safety in Child Care\nU.S. Department of Health and Human Services: Administration for Children and Families\nBest Jobs and Career Paths for\nGerontology\nMajors\nAverage\nGerontology Major Salary\nSF State Gerontology Major Overview\nOccupational Outlook\nMedical and Health Services Manager\nSocial and Community Service Managers\nSocial and Human Service Assistants\nSocial Worker\nEmployment Opportunities\nAgeWork\nHealtheCareers\nInstitute on Aging\nProfessional Associations\nThe Gerontological Society of America\nRelated Resources\nGSA Emerging Scholar and Professional Organization\nExploring Careers in Aging: A Roadmap for Students\nAHCA/NCAL Workforce Resource Center\nLeadingAge Center for Workforce Solutions\nSenior Living Works\nWhat Can I Do With a Major in Interior Architecture/Design? ➔\nBest Jobs and Career Paths for\nInterior Design\nMajors\nAverage\nInterior Design Major Salary\nSF State Interior Design Major Overview\nOccupational Outlook\nArchitects\nIndustrial Designers\nInterior Designers\nLandscape Architects\nEmployment Opportunities\nBehance\nCareers in Interior Design\nInterior Design Jobs\nProfessional Associations\nAmerican Institute for Architects\nAmerican Society of Interior Designers\nCouncil for Interior Design Accreditation\nInterior Design Educators Council\nInternational Interior Design Association\nNational Association of Schools of Art and Design\nCouncil for Interior Design Qualification\nRelated Resources\nCareers – Building Communities\nInterior Design Body of Knowledge\nInterior Design Media\nLearn How to Become an Interior Designer\nThe Art Project\nWhat Can I Do With a Major in Kinesiology? ➔\nBest Jobs and Career Paths for\nKinesiology\nMajors\nAverage\nKinesiology Major Salary\nSF State Kinesiology Major Overview\nProfessional Associations\nAerobics and Fitness Association of America\nAmerican Aerobic Association International/International Sports Medicine Association\nAmerican College of Sports Medicine\nAmerican Council on Exercise\nAmerican Fitness Professionals and Associates\nAmerican Occupational Therapy Association\nAmerican Physical Therapy Association\nAmerican Sports & Fitness Association\nAssociation for Applied Sports Psychology\nFederation of Professional Trainers\nInternational Health, Racquet and Sports Club Association\nNational Athletic Trainers’ Association\nNational Intramural-Recreational Sports Association\nNational Strength and Condition Association\nNCAA\nRelated Resources\nExplore Health Careers\nHuman Kinetics\nIdeafit\nPT Aide Guide\nWomen’s Sports Foundation\nYoga Alliance\nOccupational Outlook\nAthletic Trainers\nExercise Physiologist\nFitness Trainers and Instructors\nOccupational Therapists\nPhysical Therapists\nRecreation Workers\nEmployment Opportunities\nBlueFish Jobs\nExercise Jobs.com\nFitness Jobs.com\nSports Medicine Jobs\nWhat Can I Do With a Major in Nursing? ➔\nBest Jobs and Career Paths for\nNursing\nMajors\nAverage\nNursing Major Salary\nSF State Nursing Major Overview\nProfessional Associations\nAmerican Association of Colleges of Nursing\nAmerican Association of Nurse Anesthetists\nAmerican Nurses Association\nAmerican Telemedicine Association\nNational Council of State Boards of Nursing\nNursing Society\nRelated Resources\nDiscover Nursing\nExplore Health Careers\nNurse Career Tips\nNursing Explorer\nNursing License Map\nNursing Schools\nPractical Nursing.org\nRegistered Nursing.org\nRN to BSN Programs\nSloan Foundation Careers in STEM\nTop Nursing Careers & Specialties\nOccupational Outlook\nLicensed Practical and Licensed Vocational Nurses\nRegistered Nurses\nEmployment Opportunities\nHealtheCareers\nNursing Jobs\nTravel Nursing Jobs\nWhat Can I Do With a Major in Nutrition? ➔\nBest Jobs and Career Paths for\nDietetics\nMajors\nBest Jobs and Career Paths for\nNutrition Science\nMajors\nAverage\nDietetics Major Salary\nAverage\nNutrition Science Major Salary\nSF State Nutrition and Dietetics Major Overview\nProfessional Associations\nAcademy of Nutrition and Dietetics\nAmerican Society for Nutrition\nBoard for Certification of Nutrition Specialists\nCommission on Dietetic Registration\nNational Association of Nutrition Professionals\nRelated Resources\nExplore Health Careers\nNutrition.gov\nToday’s Dietitian\nUnited States Department of Agriculture\nOccupational Outlook\nDietitians and Nutritionists\nFood Service Managers\nHealth Educators\nEmployment Opportunities\nDietitian Central\niHireNutrition\nNutrition Jobs\nWhat Can I Do With a Major in Public Administration? ➔\nBest Jobs and Career Paths for\nPublic Administration\nMajors\nAverage\nPublic Administration Major Salary\nSF State Public Administration Major Overview\nProfessional Associations\nAmerican Political Science Association\nAmerican Society for Public Administrators\nAssociation for Public Policy Analysis and Management\nInternational Association for Political Science Students\nRelated Resources\nAmerican Enterprising Institute for Public Policy Research\nCareers for Political Scientists\nCorporation for National & Community Service\nEqual Justice Works\nFBI Employment\nFederal Jobs.Net\nGo Government\nHealth Administration Careers\nLaw School Admission Council\nLaw Students Center\nNational Academy of Public Administration\nNational Association of Schools of Public Affairs and Administration\nNonprofit Careers at Idealist\nPreparing for Law School\nS. Department of State\nUnited States Senate Employment\nOccupational Outlook\nArbitrators, Mediators, and Conciliators\nJudges, Mediators, and Hearing Officers\nLawyers\nMedical and Health Services Managers\nParalegals and Legal Assistants\nSocial and Community Service Managers\nTeachers-Postsecondary\nTraining and Development Managers\nUrban and Regional Planner\nEmployment Opportunities\nFederal Jobs\nLobbying Jobs\nPublic Affairs Council\nPublic Service Careers\nUSA JOBS\nWhat Can I Do With a Major in Public Health? ➔\nBest Jobs and Career Paths for\nPublic Health\nMajors\nBest Jobs and Career Paths for\nHealth Education\nMajors\nAverage\nPublic Health Major Salary\nAverage\nHealth Education Major Salary\nSF State Public Health Major Overview\nProfessional Associations\nAmerican College of Epidemiology\nAmerican Public Health Association\nAssociation for Professionals in Infection Control\nAssociation of State and Territorial Health Officials\nNational Association of Community Health Center\nNational Association of County and City Health Officials\nPublic Health Foundation\nSociety for Public Health Education\nRelated Resources\nAssociation of Schools & Programs of Public Health\nCareers in Public Health\nCouncil on Education for Public Health\nExplore Health Careers\nHealth Administration Careers\nNational Center for Health Statistics\nNational Institutes of Health\nPublic Health from Allied Health Schools\nPublicHealth.org\nSchools of Public Health Application Service (SOPHAS)\nWhat is Public Health?\nWorld Health Organization\nOccupational Outlook\nEnvironmental Scientists and Specialists\nEpidemiologists\nHealth Educators\nMedical and Health Services Managers\nMedical Scientist\nMicrobiologist\nEmployment Opportunities\nHealth Promotion Career Network\nPublic Health Jobs\nWhat Can I Do With a Major in Recreation and Leisure Studies? ➔\nBest Jobs and Career Paths for\nRecreation Management\nMajors\nAverage\nRecreation Management Major Salary\nSF State Recreation, Parks, and Tourism Major Overview\nProfessional Associations\nAmerican Camp Association\nAmerican Therapeutic Recreation Association\nAssociation of Church Sports and Recreation Ministries\nInternational Festivals and Events Association\nMeeting Planners International\nNational Council for Therapeutic Recreation Certification\nNational Intramural-Recreational Sports Association\nNational Recreation and Park Association\nWilderness Education Association\nRelated Resources\nAWANA\nEvent Planning Information\nHospitality Net\nHospitality, Tourism and Recreation Career Guide\nRec Therapy Today\nYouthWorks\nOccupational Outlook\nCoaches and Scouts\nDirectors, Religious Activities and Education\nFlight Attendants\nMeeting and Convention Planners\nOccupational Therapists\nRecreation Workers\nRecreational Therapists\nRehabilitation Counselors\nTravel Agents\nEmployment Opportunities\nBlueFish Jobs\nCool Works\nIdealist\nJob Monkey\nWhat Can I Do With a Major in Social Work? ➔\nBest Jobs and Career Paths for\nSocial Work\nMajors\nAverage\nSocial Work Major Salary\nSF State Social Work Major Overview\nProfessional Associations\nAssociation of Social Work Boards\nCouncil on Social Work Education\nInternational Federation of Social Workers\nNational Association of Social Workers\nSchool Social Work Association of America\nRelated Resources\nChronicle of Philanthropy\nExplore Health Careers\nHelp Starts Here\nIdealist\nJournal of Social Work Values and Ethics\nSocial Worker Blog\nSocial Workers Speak\nSocial Work Career Network\nOccupational Outlook\nSocial and Community Service Managers\nSocial and Human Service Assistants\nSocial Workers\nHealth Educators and Community Health Workers\nMarriage and Family Therapists\nSubstance Abuse, Behavioral Disorder, and Mental Health Counselors\nEmployment Opportunities\nSocial Work Career Center\nSocial Service Jobs\nSocial Workers Online Career Center\nSocial Worker Online\nWhat Can I Do With a Major in Sociology? ➔\nBest Jobs and Career Paths for\nSociology\nMajors\nAverage\nSociology Major Salary\nSF State Sociology Major Overview\nProfessional Associations\nAmerican Sociological Association Resources for Students\nAmerican Society of Criminology\nGlobal Studies Association of North America\nInternational Sociological Association\nJustice Studies Association\nSociety for the Study of Social Problems\nAssociation of Black Sociologists\nRelated Resources\nFederal Agencies that Collect Demographic Statistics\nIdealist\nPartnership for Public Service\nPublicServiceCareers.org\nWorld Wide Learn Guide to Sociology Major\nOccupational Outlook\nCounselors\nMarket Research Analysts\nMental Health Counselors and Marriage and Family Therapists\nPolice and Detectives\nPostsecondary Teacher\nProbation Officers and Correctional Treatment Specialists\nRehabilitation Counselors\nSocial and Human Service Assistants\nSociologist\nSubstance Abuse and Behavioral Disorders Counselors\nSurvey Researchers\nEmployment Opportunities\nSocial Service Jobs\nUSA Jobs\nWhat Can I Do With a Major in Urban Studies? ➔\nBest Jobs and Career Paths for\nUrban Planning\nMajors\nBest Jobs and Career Paths for\nUrban Studies\nMajors\nAverage\nUrban Planning Major Salary\nAverage\nUrban Studies Major Salary\nSF State Urban Studies Major Overview\nProfessional Associations\nAmerican Planning Association\nAmerican Society for Public Administrators\nGlobal Planners\nNetwork\nInternational Economic Development Council\nUrban Land Institute\nRelated Resources\nCareers – Building Communities\nCorporation for National & Community Service\nEducation and Careers in Planning\nGo Government\nIBM SMARTER Cities\nNational Association of Schools of Public Affairs and Administration\nPlanning Careers\nPlanners Web\nPublicServiceCareers.org\nThe Sierra Club\nUrban Studies from College Board\nUrban Studies Journal\nU.S Department of Housing and Urban Development\nOccupational Outlook\nMarket Research ",
    "url": "https://csld.sfsu.edu/node/39",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/posting-jobs-and-internships",
    "category": "general",
    "title": "Posting Jobs and Internships | Career & Leadership Development",
    "content": "Posting Jobs and Internships\nRecruit at SF State\nAttend Events & Fairs\nHost On-Campus Interviews\nPosting Jobs and Internships   ➔\nPolicies & Guidelines\nEmployer Engagement Testimonials\nCareer & Leadership Development (CLD) seeks to connect your organization and opportunities with a diverse and talented pool of candidates from the SF State student and alumni community. Handshake is SF State's online job and internship career platform for our students. Employers can use Handshake to post jobs and internships, as well as register for recruiting events, and sign up for On-Campus Interviewing.\nJoin the SFSU Handshake today!\nGo To Handshake ➔\nFrequently Asked Questions About Handshake:\nHow do I create a Handshake account?\nGo to\nhttps://joinhandshake.com\nand click \"Employers\" in the top left corner. Then, click \"Sign-up for an account\" link on the top right corner. Follow the step-by-step instructions provided by Handshake to register.\nI requested to join SF State's Handshake network. Why hasn't my request been approved yet.\nUnder normal circumstances it typically takes 3-5 days to process pending employer approval requests. If your request is not complete in this timeframe, please log into Handshake and check your notifications for any comments on your registration. If you have an urgent need to post a job or internship listing for SF State students, please contact us at\nrecruit@sfsu.edu\nor (415) 338-1764.\nHow do I post a job/internship on Handshake?\nPlease\nlog-in or create a FREE account.\nOnce you are logged in, click on the \"Post a Job\" button to complete the job form.\nI created a job posting. Why does it take a few hours/days for it to appear?\nWhen you submit your posting, it's added to a queue that includes all of the other pending positions awaiting approval from CLD. Depending on the day and staff availability, our queue may contain a 100+ postings in it. And while we try to review them as quickly as possible (many are cleared within hours of posting), on occasion there is heavy traffic on Handshake, or other internal demands (events, university holidays, etc.) that may contribute to a delay of a few business days. If you have an urgent need to post a job or internship listing for SF State students, please contact us at\nrecruit@sfsu.edu\nor (415) 338-1764.\nWhy do my job postings need to be approved?\nIt's in our students' best interest for us to screen and verify employers and the opportunities they present. We do our best to ensure that each employer registration is legitimate, and that each posting meets our employer policies and guidelines. By giving us the time to do that, we can trust that you are interested in making our mission to ensure that our students' needs are a priority. We reserve the right to decline postings that are not in the best interest of our students.\nCan students receive academic credit for internships?\nMany students are interested in earning academic credit during their internship or co-op. For a program to be eligible for academic credit, the employer/organization must work in conjunction with a faculty advisor to fulfill specific requirements established by the student's academic department. Often such a program involves little additional effort on the part of the employer. Consult directly with the Deans' or Chairs' offices of appropriate SF State College departments for more information. Some departments have designated internship advisors. You are encouraged to reach out to your department for the most up to date information on internship advisors. US Department of Labor Internship Programs FLSA\nCan I post unpaid internships?\nNo, all internships posted with Career and Leadership Development must conform to wage regulations as outlined by the U.S. Dept. of Labor's Fair Labor Standards Act (FLSA). Please review the Wage and Hour Division's six-point unpaid intern test to ensure that your internship program falls within federal standards.\nHow do I reach out to more students/alumni about my job opportunity?\nWe suggest employers reach out to student organizations.\nGatorXperience\nallows viewers to locate clubs and contacts. And there are hundreds of campus clubs, many of which have a professional focus. It's free for employers to find student groups that may be interested in their organization.\nCan you email out my job description for me?\nThis service is reserved only for a select number of employers and requires employers reach out directly to\nrecruit@sfsu.edu\nfor a more in-depth discussion. Career and Leadership Development receives hundreds of postings and we strive to make sure that we're not \"spamming\" our students. Rather than sending a message through CLD's employer engagement team, employers can target specific student organizations using\nGatorXperience.",
    "url": "https://csld.sfsu.edu/posting-jobs-and-internships",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/index.php/free-professional-headshots",
    "category": "general",
    "title": "Get Your Free Professional Headshot in Minutes! | Career & Leadership Development",
    "content": "Get Your Free Professional Headshot in Minutes!\nResume, CV, Cover Letter & LinkedIn\nOn Campus Jobs\nJobs & Internships\nEvents, Workshops & Fairs\nWhat Can I Do With This Major?\nChoose a Career Direction or Major\nBuild Connections (Networking & More)\nInterviewing Preparation\nGraduate & Professional Programs\nCareer Advising Appointments\nResources & Career Tools\nFree Professional Headshots   ➔\nCreate a strong first impression and online presence with a professional headshot using our Iris Headshot Booth. A high-quality headshot helps you to stand out in a competitive job market.  Schedule an appointment on Navigator or stop by during our drop-in hours.\nDROP IN HOURS:  Monday – Thursday 10 am – 12 pm; Friday – 9 am – 4 pm\nMake an appointment. Click the button below, choose\nCareer Services\nand then\nProfessional Headshots\n:\nSchedule an Appointment\nOr scan the QR code\nLOCATION: Administration Building, Room 254 – The Hub\nNOTE: The Iris Booth is for professional photos only. Career & Leadership Development staff has access to all photos and reviews them periodically. Inappropriate photos will be immediately deleted, and users may face suspension of future access to the booth and referral to the Dean of Students for disciplinary action.\nHow to Use the Iris Photo Booth\nTo learn more about how to use the Iris Photobooth, please check out this helpful guide.\nIris Photobooth Instruction Guide\nTips for a Professional Looking Headshot\nDress Professionally\nWear solid colors or subtle patterns to avoid distractions.\nChoose an outfit that aligns with your industry (corporate, creative, etc.).\nAvoid overly trendy styles that might look outdated soon.\nFocus on Grooming and Styling\nKeep your hair neat and styled as you normally wear it.\nGo for a natural, polished look.\nUse a Simple, Neutral Background\nA clean, uncluttered background keeps the focus on you.\nA blurred or neutral background works best for a professional feel.\nRelax & Show Confidence\nA natural smile makes you appear friendly and approachable.\nMaintain good posture—relaxed shoulders and a straight spine.\nAvoid forced expressions; a subtle smile or serious look can work depending on your industry.",
    "url": "https://csld.sfsu.edu/index.php/free-professional-headshots",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/alumni",
    "category": "general",
    "title": "Alumni | Career & Leadership Development",
    "content": "Platform access request for SF State Alumni ➔\nAlumni\nStay Connected with San Francisco State University (SFSU)!\nResources and services are available to address the career development and job search needs of all SFSU Alumni and Recent Graduates. If you are looking to recruit for your organization or an alumnus interested in mentoring current students, we welcome your continued participation with SFSU.\nResources & Services\nSFSU Alumni will keep the most of access to Career & Leadership Development (CLD) services that they had as a student.\nCLD Platforms\nAccess to platforms Handshake & Hiration.\nHandshake\nHandshake is our online career management platform for students, alumni and employers.Thousands of employers, jobs, and event listings and growing.\nHiration\nHiration is a 24/7 AI-powered career platform that helps users create optimized resumes, cover letters, LinkedIn profiles, and practice interviews tailored to specific job opportunities.\nTo gain access to any of the following platforms, please complete this form:\nPlatform access request for SF State Alumni ➔\nAttend CLD Sponsored Workshops & Job Fairs\nIf you want to continue building your career readiness skills or looking for your next role, alumni are welcome to attend in-person and virtual CLD sponsored workshops and job fairs. You must have a Handshake account to access event information and register. Request a Handshake account\nhere\n.\nCollege to Career Bootcamp Workshop Series\n- for Recent Graduates\nLooking for a job after graduation, but don’t know where to begin? Starting the world of work isn’t as daunting as you might think. The Career & Leadership Department (CLD) has designed Summer Bootcamp Workshops just for you. In these virtual workshops, we’ll help you clarify your goals and provide a step by step approach to getting that job! Whether you’ve held a job or no job at all, our Summer Bootcamp Workshops are for you.\nYou can also view more upcoming CLD events and fairs\nhere\n.\nGet Involved and Connect with Students\nOnce a Gator always a Gator! Are you looking for ways to connect with students or share your company's available positions? We offer a variety of ways to engage with current SFSU students.\nHire a Gator:\nPost jobs and internships in SFSU Handshake for current students and fellow SFSU alumni. Register your organization for a\nfree Handshake account\nand be sure to check out our other\nEmployer Resources.\nRecruit On-Campus:\nIf you are hiring or your company is hiring, register to participate in an Event or Fair at SFSU. To view upcoming dates, click\nhere\n.\nSFSU Alumni Association\nThe San Francisco State University alumni network is vast. As a graduate of SF State, you are part of a community of 280,000+ innovators, activists and leaders. More than 150,000 Gators are making their mark around the Bay Area and even more are impacting communities throughout the country and around the world. Working in education, public service, tech, entertainment, heath care and so much more, your peers have incredible stories to tell and knowledge to share. You have so much to be proud of.\nKeep your SF State bonds strong and\njoin\nthe SFSU Alumni Assocation today!\nNon-Affiliated Career Resources\nCLD does not offer one-on-one career counseling appointments to alumni.\nAlumni seeking services associated with career coaching and career transitions could seek out community resources and/or professional career services.\nNOVAworks Job Center\nJewish Vocational Service (JVS)\nCareer One Stop",
    "url": "https://csld.sfsu.edu/alumni",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/leadership-development",
    "category": "general",
    "title": "Leadership Development | Career & Leadership Development",
    "content": "President's Leadership Fellows Program and Gator Leadership Circle Applications for FALL 2025 are open now! To apply, please click the links below.\nJoin Gator Leadership Circle\n|\nJoin President's Leadership Fellows Program\nLeadership Development\nLeadership Development Home   ➔\nGator Leadership Circle (GLC)\nPresident's Leadership Fellows\nProgram (PLFP)\nPLFP Cohort Student Spotlights\nEustace-Kwan Family Foundation\nThe\nPresident’s Leadership Fellows Program (PLFP)\nhelps students build key career readiness skills—like communication, leadership, critical thinking, and professionalism—based on the National Association of Colleges and Employers (NACE) standards, and connects what they’re learning in class to real-world, professional success.\nLearn More!\nThe\nGator Leadership Circle (GLC)\nsupports first- and second-year students at San Francisco State University by fostering academic, career, and leadership development, while offering opportunities to build community, develop networking skills, and navigate the college experience successfully.\nLearn More!\nA crucial part of Career & Leadership Development’s (CLD) mission is to develop visionary, goal-driven and action-oriented student leaders. Because there is no one-size-fits-all leadership style, CLD empowers each student with the ability to access their own unique identity as a leader.\nWith opportunities to focus on multiple aspects of leadership, students will develop lifelong skills through character development, creative and critical thinking, interpersonal communication, practical knowledge and career preparation. We also encourage students to become leaders in their everyday lives by facilitating and encouraging opportunities for co-curricular learning, intentional engagement, self-reflection and skill development.",
    "url": "https://csld.sfsu.edu/leadership-development",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/resources-career-tools",
    "category": "student_career",
    "title": "Resources & Career Tools | Career & Leadership Development",
    "content": "Resources & Career Tools\nResume, CV, Cover Letter & LinkedIn\nOn Campus Jobs\nJobs & Internships\nEvents, Workshops & Fairs\nWhat Can I Do With This Major?\nChoose a Career Direction or Major\nBuild Connections (Networking & More)\nInterviewing Preparation\nGraduate & Professional Programs\nCareer Advising Appointments\nResources & Career Tools  ➔\nFree Professional Headshots\nPlease choose a category from the choices below:\nHandouts\nJob Search Websites\nLinkedIn Resources\nDiversity Resources\nCareer Webinars\nAvoid Job Scams\nHOT Jobs\nPlatforms",
    "url": "https://csld.sfsu.edu/resources-career-tools",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/student-spotlight",
    "category": "general",
    "title": "PLFP Student Spotlight | Career & Leadership Development",
    "content": "PLFP Student Spotlight\nLeadership Development Home\nGator Leadership Circle (GLC)\nPresident's Leadership Fellows\nPLFP Cohort Student Spotlights\n➔\nEustace-Kwan Family Foundation\nThe President’s Leadership Fellows Program (PLFP) Student Spotlight shines a light on the voices and experiences of Fellows who embody leadership, growth, and purpose. These spotlights showcase the unique journeys of students in the program, offering insight into what it means to lead with intention and make an impact within the campus community and beyond. By sharing their stories—through written reflections and on-camera testimonials—students help inspire future fellows and build a legacy of leadership. We sincerely thank the students who participate and rise to the occasion with honesty, vulnerability, and courage. Your voice makes a difference.\nSpring 2025 PLFP Cohort\nJose Ventura Hernandez Camacho\nB.S. in Business Administration\nSpotlight Video\nGokul Krishna Radhakrishnan Nair\nB.S. in Computer Science\nSpotlight Video\nUzma Naaem\nM.S. in Business Analytics\nSpotlight Video\nFall 2024 PLFP Cohort\nCitlally Castro\nB.S. in Buisness Management\nSpotlight Video\nBulus Mark\nB.S. in Psychology\nSpotlight Video\nAmina Azgui Castillo\nB.S. in Criminal Justice Studies",
    "url": "https://csld.sfsu.edu/student-spotlight",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/index.php/handshake-faculty-and-staff",
    "category": "general",
    "title": "Handshake for Faculty and Staff | Career & Leadership Development",
    "content": "Handshake for Faculty and Staff\nCareer & Leadership Development invites faculty and staff to join Handshake in order to view or post job opportunities for students. Use the information below to decide if you would like to create an employer and/or student account.\nCreate an Employer Account\nIf you would like to:\nPost on campus jobs and interact with students like an employer would\nView on-campus opportunities only\nWhen creating an employer account, Handshake will ask you to connect with schools and your company. Please search and select San Francisco State University. If you choose to make this account, CLD asks that you do not change or delete any of the information on the SF State employer page or make edits/changes/delete any jobs that you did not post.\nCreate a Student Account\nIf you would like to:\nSee exactly what students can see\nFind jobs that are relevant to your students (both on- and off- campus)\nIf you select to make this account, CLD asks that you do not apply to jobs or RSVP for events through your student account.\nHow To Create An Account\nGo to\nsfsu.joinhandshake.com\n.\nCreate an account with your [blank]@sfsu.edu email address. You will not be granted access to Handshake without using a San Francisco State University email address.\nYou should receive a confirmation email after completing your registration. If you don’t find your confirmation email, please check your spam folder.\nCLD needs to approve your access to SF State’s employer page and/or student account. To assist CLD with approving your request faster, you can email\nrecruit@sfsu.edu\nwith your title, department, and a brief description of what you intend to use your account for.\nMerge Employer and Student Account (optional): Sign up for your student and employer account with the same SFSU email username and password. Handshake will merge the accounts and allow you to toggle between them.\nFinished creating your account? Post a job (link)! Career & Leadership Development reserves the right to decline or revoke your access if there is any suspected misuse of these accounts. If you have any questions, please contact\nrecruit@sfsu.edu\nfor assistance.",
    "url": "https://csld.sfsu.edu/index.php/handshake-faculty-and-staff",
    "domain": "csld.sfsu.edu"
  },
  {
    "source": "https://csld.sfsu.edu/node/36",
    "category": "general",
    "title": "Lam Family College of Business | Career & Leadership Development",
    "content": "Lam Family College of Business\nAll Colleges\nCollege of Ethnic Studies\nCollege of Health & Social Sciences\nLam Family College of Business\n⭐\nCollege of Liberal and Creative Arts\nGraduate College of Education\nCollege of Science and Engineering\nACCOUNTING\nGENERAL BUSINESS\nDECISION SCIENCES\nECONOMICS\nFINANCE\nHOSPITALITY AND TOURISM MANAGEMENT\nINFORMATION SYSTEMS\nINTERNATIONAL BUSINESS\nLABOR AND EMPLOYMENT STUDIES\nMANAGEMENT\nMARKETING\nWhat Can I Do With a Major in Accounting ➔\nBest Jobs and Career Paths for\nAccounting\nMajors\nAverage\nAccounting Major Salary\nSF State Accounting Major Overview\nOccupational Outlook\nAccountants and Auditors\nBudget Analysts\nFinancial Managers\nPersonal Financial Advisors\nEmployment Opportunities\nAccounting.com Job Board\nAccounting Jobs Today\nAccountemps\nCareers in Accounting\nProfessional Associations\nAmerican Institute of Certified Public Accountants\nInstitute of Internal Auditors\nInstitute of Management Accountants\nState Boards of Accounting\nRelated Resources\nAccountingWEB\nAICPA Become a CPA\nAll Accounting Careers\nBusiness and Finance Careers\nCareers in Accounting\nEquity Analysts Career Info\nWhat Can I Do With a Major in Business Studies? ➔\nBest Jobs and Career Paths for\nGeneral Business\nMajors?\nAverage\nGeneral Business Major Salary\nSF State General Business Major Overview\nOccupational\nOutlook\nAccountants and Auditors\nAdvertising, Promotions and Marketing Manager\nEconomists\nFinancial Managers\nHuman Resources Managers\nHuman Resources Specialists\nInsurance Sales Agents\nLoan Officers\nMarket Research Analysts\nPurchasing Managers\nReal Estate Brokers and Sales Agents\nSales Engineers\nSales Manager\nSecurities, Commodities, and Financial Service Sales Agents\nWholesale and Manufacturing Sales Representatives\nEmployment\nOpportunities\nCareers in Real Estate – Account set-up required\nInsurance Jobs\nProfessional\nAssociations\nAmerican Association for Advertising Agencies\nAmerican Institute of Certified Public Accountants\nAmerican Marketing Association\nAPICS (American Production and Inventory Control Society)\nAssociation for Financial Professionals\nCouncil of Supply Chain Management Professionals\nManufacturers’ Agents National Association\nNational Association for Business Economics\nNational Association of Professional Insurance Agents\nNational Association of Realtors\nSociety for Human Resource Management\nRelated\nResources\nBusiness and Finance Careers Information\nCareers in Logistics and Supply Chain Management\nEntrepreneur\nHealth Administrator\nLogistics Online\nMBA Programs Guide\nOfficial GMAT\nSmall Business Association\nStaffing as a Career\nWhat Can I Do With a Major in Business Analytics? ➔\nBest Jobs and Career Paths for\nDecision Sciences\nMajors?\nAverage\nDecision Sciences Major Salary\nSF State Decision Sciences Major Overview\nOccupational Outlook\nActuaries\nBuyers and Purchasing Agents\nLogisticians\nManagement Analysts\nMarket Research Analysts\nOperations Research Analysts\nStatisticians\nSurvey Researchers\nUnderwriters\nEmployment Opportunities\nI Crunch Data\nThis is Statistics\nProfessional Associations\nAmerican Statistical Association\nInternational Institute of Business Analysis\nDigital Analytics Association\nRelated Resources\nAnalytic Bridge\nAnalytics Career Advice\nMasters of Business Analytics\nCareer Cornerstone: Science, Technology, Engineering,. Mathematics, Computing, and Healthcare\nKD Nuggets\nModern Analyst\nSports Statistics\nTeradata\nWhat Can I Do With a Major in Economics? ➔\nBest Jobs and Career Paths for\nEconomics\nMajors?\nAverage\nEconomics Major Salary\nSF State Economics Major Overview\nOccupational Outlook\nActuaries\nBudget Analysts\nEconomists\nFinancial Analysts\nMarket Research Analysts\nOperations Research Analysts\nPostsecondary Teachers\nEmployment Opportunities\nEcon-Jobs\nUSA Jobs\nProfessional Associations\nAmerican Economic Association\nAmerican Society of Health Economics\nAssociation for Public Policy Analysis and Management\nAssociation for Social Economics\nInternational Economic Development Council\nNational Association for Business Economics\nNational Economists Club\nRelated Resources\nAEA Career in Economics Video\nBusiness and Finance Careers\nCareer Cornerstone Center: Science, Technology, Engineering and Mathematics, Computing, Healthcare\nInsurance Jobs\nCareers in Real Estate\nCongressional Budget Office\nEconomics E-Journal\nEconomist\nFederal Reserve System\nGo Government\nHealth Administrator\nMBA Programs Guide\nPartnership for Public Service\nPublicServiceCareers.org\nThe Official GMAT\nVault Professions\nWhat Can I Do With a Major in Finance? ➔\nWhat are Career Paths with an\nFinance\nDegree?\nAverage\nFinance Major Salary\nSF State Finance Major Overview\nOccupational Outlook\nBudget Analysts\nFinancial Analysts\nFinancial Managers\nInsurance Sales Agents\nInsurance Underwriters\nLoan Officers\nPersonal Financial Advisors\nReal Estate Brokers and Sales Agents\nSecurities, Commodities, and Financial Services Sales Agents\nEmployment Opportunities\nBank Jobs\nFinancial Job Network\nFinancial Planning Association – Job Board\nProfessional Associations\nAmerican Association of Finance and Accounting\nAmerican Finance Association\nAssociation for Financial Professionals\nCertified Financial Planners Board of Standards\nFinancial Industry Regulatory Authority\nFinancial Management Association\nInsurance Information Institute\nInternational Academy of Business and Financial Management\nInvestment Management Consultants Association\nNational Association of Personal Financial Advisors\nNational Association of Real Estate Brokers\nSecurities Industry and Financial Markets Association\nRelated Resources\nInsurance Jobs\nNational Association of Realtors\nE Financial Careers\nFinance Degree\nMBA Programs Guide\nMBA.com\nVault Industries\nWall Street Oasis\nWhat Can I Do With a Major in Hotel, Restaurant & Tourism? ➔\nWhat are Career Paths with a\nHospitality and Tourism Management\nDegree?\nAverage\nHospitality and Tourism Management Major Salary\nSF State Hospitality and Tourism Management Major Overview\nOccupational Outlook\nFood Service Managers\nLodging Managers\nMeeting, Convention, and Event Planners\nProperty, Real Estate and Community Association Managers\nEmployment Opportunities\nCasino Careers\nHospitality Careers Online\nOutdoor Industry Jobs\nResort Jobs\nProfessional Associations\nAmerican Culinary Federation\nAmerican Hotel and Lodging Association\nAmerican Hotel and Lodging Educational Institute\nThe Hospitality Industry Network\nHospitality Sales and Marketing Association International\nNational Concierge Association\nNational Restaurant Association\nTravel and Tourism Research Association\nRelated Resources\nAmerican Hotel and Lodging Educational Foundation\nHospitality Net\nTravel Industry Career Association\nBest Jobs and Career Paths for\nInformation Systems\nMajors?\nAverage\nInformation Systems Major Salary\nSF State Information Systems Major Overview\nOccupational\nOutlook\nComputer and Information Research Scientists\nComputer and Information Systems Managers\nComputer Programmers\nComputer Support Specialists\nDatabase Administrators\nInformation Security Analysts\nNetwork and Computer Systems Administrators\nSoftware Developers\nEmployment\nOpportunities\nComputer World – Careers\nComputerJobs.com\nComputerwork.com\nDice Tech Jobs\nJust Tech Jobs\nProfessional\nAssociations\nAssociation for Computing Machinery\nAssociation for Information Science and Technology\nAssociation of Independent Information Professionals (AIIP)\nAssociation of Records Managers & Administrators, Inc.\nIEEE Computer Society\nInformation Systems Security Association\nInstitute for Operations Research & The Management Sciences\nInternet Society\nLeague of Professional Systems Administrators\nSociety for Information Management\nRelated\nResources\nComputer Science Career Guide\nInstitute for the Certification of Computer Professionals\nSloan Foundation Careers in Science, Technology, Engineering and Mathematics\nWhat Can I Do With a Major in International Business? ➔\nBest Jobs and Career Paths for\nInternational Business\nMajor?\nAverage\nInternational Business Major Salary\nSF State International Business Major Overview\nGeneral / Government\nCentral Intelligence Agency\nDefense Intelligence Agency\nDisaster Relief Agencies\nGlobal Development Jobs\nGlobal Jobs\nGo Government\nHumanitarian Relief Organizations\nInternational Nonprofit Jobs & Internships\nInternational RelationsEDU\nNational Security Agency\nOverseas Jobs\nPeace Corps\nRiley Guide International Resources\nTransitions Abroad\nUN Careers\nUS AID\nUS Committee for Refugees and Immigrants\nUS Department of State\nUSA Jobs\nEducation / Journalism\nAmerican Institute for Foreign Study\nAmerican Translators Association\nCouncil on International Educational Exchange\nFulbright Scholars Program\nInternational Association of Teachers of English as a Foreign Language\nInternational Center for Journalists\nInternational Journalists Network\nInternational School Services\nNational Association of International Educators\nInternational Trade / Economics\nAcademy of International Business\nAmericas Society and Council of the Americas\nCenter for International Private Enterprise\nCenter for Strategic and International Studies\nCouncil for Foreign Relations\nEuro Pages\nInternational Trade Administration\nExport-Import Bank of the United States\nForeign Policy Association Students Corner\nInternational Chamber of Commerce\nUnited Nations\nUnited States International Trade Commission\nWorld Bank\nWorld Economic Forum\nWorld Trade Organization\nWhat Can I Do With a Major in Human Resource Management? ➔\nBest Jobs and Career Paths for\nLabor and Employment Studies\nMajors?\nAverage\nLabor and Employment Studies Major Salary\nSF State Labor and Employment Studies Major Overview\nOccupational Outlook\nAdministrative Services Managers\nCompensation and Benefits Managers\nHuman Resources Managers\nHuman Resources Specialists\nTraining and Development Managers\nEmployment Opportunities\nHuman Resources\nSHRM HR Jobs\nProfessional Associations\nAcademy of Human Resource Development\nAmerican Management Association\nAssociation for Talent Development\nAmerican Staffing Association\nAssociation for Talent Development\nInternational Association for Human Resource Information Management\nNational Human Resources Association\nSociety for Human Resource Management\nRelated Resources\nCareers in Human Resources\nHuman Resources Career Guide\nHR Certification Institute\nStaffing as a Career\nWhat Can I Do With a Major in Management? ➔\nBest Jobs and Career Paths for\nManagement\nMajors?\nAverage\nManagement Major Salary\nSF State Management Major Overview\nOccupational Outlook\nAdministrative Services Managers\nAdvertising Sales Managers\nConstruction Managers\nFinancial Managers\nFood Service Managers\nHuman Resources Managers\nHuman Resources Specialists\nIndustrial Production Managers\nInsurance Underwriters\nLoan Officers\nManagement Analysts\nProperty, Real Estate and Community Association Managers\nPurchasing Managers\nReal Estate Brokers and Sales Agents\nSales Managers\nSecurities, Commodities, and Financial Services Sales Agents\nTop Executives\nTraining and Development Managers\nWholesale Sales Managers\nEmployment Opportunities\nMonster Jobs\nSimply Hired\nTop USA Jobs\nProfessional Associations\nAmerican Association for Advertising Agencies\nAmerican Management Association\nAmerican Marketing Association\nAssociation for Financial Professionals\nCouncil of Supply Chain Management Professionals\nManufacturers’ Agents National Association\nNational Association of Professional Insurance Agents\nNational Association of Realtors\nNational Management Association\nSociety for Human Resource Management\nRelated Resources\nInsurance Jobs\nEntrepreneur\nExplore Health Careers (Health Administrator)\nHealth Administration Careers\nMBA Programs Guide\nSmall Business Association\nMBA.com\nVault Industries\nWhat Can I Do With a Major in Marketing? ➔\nBest Jobs and Career Paths for\nMarketing\nMajors?\nAverage\nMarketing Major Salary\nSF State Marketing Major Overview\nOccupational Outlook\nAdvertising Sales Agents\nAdvertising, Promotions, and Marketing Managers\nMarket Research Analysts\nPurchasing Managers\nReal Estate Brokers and Sales Agents\nSales Managers\nWholesale and Manufacturing Sales\nEmployment Opportunities\nMarketing Jobs\nMediabistro.com\nSalesJobs.com\nProfessional Associations\nAmerican Marketing Association\nBusiness Marketing Association\nDirect Marketing Association\nNational Association of Sales Professionals\nSales and Marketing Executives International\nRelated Resources\nInsurance Jobs\nCareers in Real Estate\nDo’s and Don’ts for Launching a Career in Sales\nMarket Research Careers\nMarketing Career Resource Guide\nMBA Programs Guide\nThe Official GMAT\nVault Industries\nWSJ Careers in Marketing",
    "url": "https://csld.sfsu.edu/node/36",
    "domain": "csld.sfsu.edu"
  }
]