[
  {
    "source": "http://sfsu.edu",
    "category": "general",
    "title": "San Francisco State University",
    "content": "San Francisco State Home\nBrighter futures ahead — enroll now!\nApplications for fall enrollment now open\nApply Now\nWelcome to San Francisco State University\nFor Visual and Performing Arts Degrees\nHispanic Outlook on Education Magazine\nLiberal & Creative Arts →\nIn the Nation for Social Mobility\nThe Wall Street Journal\nDean of Students →\nOf Students Are First in Their Family to Attend College\nInstitutional Analytics\nEducation Opportunities →\nLearn About SF State\nOur students know they belong to a diverse and inclusive community, free to explore and express their individuality.\nCampus Life →\nInnovation fuels our curriculum — our courses are culturally and socially enriching and unique to our university.\nAcademics →\nLocated in the hub of the Bay Area, we offer a powerful combination of education, art, culture, technology and career connections.\nLocation →\nWe are champions of equity and community inclusion and empower our students to pursue their educational dreams.\nStudent Services →\nAcademic Programs\nOur graduates are leaders in science, business, public service, journalism and the arts. SF State is part of the California State University (CSU), the largest system of higher education in the country granting bachelor’s and master’s degrees.\nExplore by Program Type\nFirst-Year or Transfer Students →\nGraduate Students →\nOnline and Continuing Education →\nAthletics\nSF State Athletics has a proud tradition of competitive success within NCAA Division II and the California Collegiate Athletic Association (CCAA). The Gators sponsor 10 intercollegiate sports teams: men’s and women’s basketball, men’s and women’s cross country, women’s soccer, softball, men’s and women’s track & field, volleyball and wrestling.\nAthletics →\nGain Real World Experience\nGo Beyond the Classroom\nParticipate in implementing the university's goals for international education and exchange.\nStudy Abroad →\nInternational Opportunities →\nExperiential Programs →\nConduct Research\nEngage in life-changing programs that have an impact both individually and to the broader community.\nResearch and Centers →\nSF State Community\nBe a Part of Our Community\nSF State educates and equips students to thrive in a global society. We deliver academic excellence by pursuing knowledge, inspiring creativity, supporting our diverse community and advancing social justice and positive change in the world.\nVisit SF State →\nAdmission Guide →\nExplore Our Campus with a Virtual Tour!\nExplore our campus from the comfort of your own home with our virtual tour! This interactive experience allows you to discover key facilities, learn about campus life and get a feel for the environment — all at your own pace.\nExplore Our Campus Now\nView ADA Accessible Tour\nVirtual Tour\nMake It Possible\nStudent success at SF State means holding our students to high expectations and offering them the support they need to reach them. As a campus with a social justice mission at our core, we hold excellence and equity to be fundamental and interlinking values: We want to see our students graduate with degrees that represent learning experiences of the highest possible quality, inclusive of all of our students.\nAffording SF State\nEvery SF State student should belong and matter, has the capacity to live a purposeful life and can positively impact the world.\nAffordability and Financial Aid →\nStart Your Next Chapter Here\nNo matter where you’re from, what you’ve learned or who you think you’ll be, we’re ready to be the next chapter in your story.\nRequest Information →\nApply to SF State\nJoin the nearly 24,000 students who enroll at SF State each year and become part of our network of more than 293,000 graduates contributing to the economic, cultural and civic life of the Bay Area and beyond.\nApply Now →\nUpcoming Events\nOct\n06\nChild and Adolescent Development + Special Education Blended Programs Information Session\nMon, Oct 06, 12:00 pm. - 01:00 pm.\nZoom\nOct\n07\nFrom Banned Books to Banned Histories: 57 Years of Struggle for Ethnic Studies\nTue, Oct 07, 02:00 pm. - 03:15 pm.\nLIB 280\nOct\n07\nDigital Media Studio & MakerSpace Open House\nTue, Oct 07, 02:00 pm. - 06:00 pm.\nLIB 260\nMore Events\nLatest News\nDiscover 2025: See what makes life brighter at SFSU on Oct. 18\nProspective students and families can explore campus, meet faculty and students, and learn how SFSU prepares graduates for…\nSFSU offers full scholarships for first-of-its-kind PK-12 certificate in climate justice education\nStudents participate in the inaugural cohort for the Graduate Certificate in PK-12 Climate Justice Education program that…\nSFSU is first CSU campus to join IBM Quantum Network\nIBM quantum resources open doors for hands-on learning and workforce readiness\nSan…\nSFSU alumna wins Creative Arts Emmy Award for hit documentary\nPoh Si Teng honored as executive producer of ‘Patrice: The Movie’\nSan Francisco…\nMore News\nTake the Next Steps\nRequest Information\nApply Now\nVisit SF State",
    "url": "http://sfsu.edu",
    "domain": "sfsu.edu"
  },
  {
    "source": "http://sfsu.edu/academics",
    "category": "general",
    "title": "Academics | San Francisco State University",
    "content": "Academics\nAreas of Study\nColleges\nDegree Planner\nRegister for Classes\nSF State offers bachelor’s degrees in 77 academic areas and master’s degrees in 63. It also has 16 credential programs, 57 certificate programs and doctorate, Ph.D. and clinical doctorate programs. Wherever your future lies, SF State can get you there.\nExplore Degrees\nLearn about our seven colleges\nLam Family College of Business\nCollege of Ethnic Studies\nCollege of Health and Social Sciences\nCollege of Liberal & Creative Arts\nCollege of Professional & Global Education\nCollege of Science and Engineering\nGraduate College of Education\nDegree Planner is a planning tool to assist students and advisors in mapping courses towards degree completion and to provide students with the best-recommended sequence of courses for success.\nSee the SF State Degree Planner\nThe registration guide will take you through enrollment step by step, while you can explore all your course choices using the class schedule.\nReview the Registration Guide\nClass Schedule\nAdditional Resources\nOffices\nStudent Affairs & Enrollment Management\nOffice of the President\nAcademic Affairs\nGraduate Studies\nResearch\nJ. Paul Leonard Library\nOffice of Research and Sponsored Programs\nInstitutional Research\nGraduate Research\nGlobal Museum\nSupport\nAdvising Hub\nTutoring\nAcademic Technology\nInformation Technology Services",
    "url": "http://sfsu.edu/academics",
    "domain": "sfsu.edu"
  },
  {
    "source": "http://sfsu.edu/alumni",
    "category": "general",
    "title": "Alumni | San Francisco State University",
    "content": "Alumni\nThe San Francisco State University alumni network is vast. As a graduate of SF State, you are part of a community of 280,000+ innovators, activists and leaders. More than 150,000 Gators are making their mark around the Bay Area and even more are impacting communities throughout the country and around the world. Working in education, public service, tech, entertainment, heath care and so much more, your peers have incredible stories to tell and knowledge to share. You have so much to be proud of.\nGet Started\nVisit the Alumni Association\nExplore Hall of Fame\nFind Alumni Events\nSF State Magazine\nA full-color glossy magazine published twice a year and mailed to alumni and friends of the University. The magazine has received numerous awards from the Council for the Advancement and Support of Education (CASE) for both overall excellence and magazine writing, including the Gold Medal of Excellence.\nRead the latest issue\nAdditional Resources\nCampus Services\nCareer Opportunities\nCareer Services & Leadership Development\nSF State Foundation\nUniversity Development\nTranscripts\nContinuing Education\nExtended Learning\nGraduate Studies\nElderCollege\nOpen University\nOsher Lifelong Learning Institute",
    "url": "http://sfsu.edu/alumni",
    "domain": "sfsu.edu"
  }
]