[
  {
    "source": "https://fiscaff.sfsu.edu/taxservice",
    "category": "general",
    "title": "Tax Services | Financial Services",
    "content": "Tax Services\nWelcome to the San Francisco State University Nonresident Alien Taxation Home Page. Here you will find campus policies, procedures and guidelines, how to contact us, and links to relevant resources. The information provided on this website is for informational purposes only. We are not responsible for the content of linked websites. The information we provide is subject to change without notice.\nLocation & Hours:\n1600 Holloway Avenue, Admin Building, 3rd floor,\nRM 350\n, San Francisco, CA 94132\nCeline is also available to meet via zoom\nPlease send an email to\nwenshu@sfsu.edu\nCeline Luo is not on campus on non-open office hours days.\nShe can be reached via email.\nContact:\nCeline Luo, Tax Specialist\nEmail:\nwenshu@sfsu.edu\nSFSU's University Tax Specialist is not a tax filer or preparer. For tax filing services, questions, or information please visit\nSFSU Volunteer Income Tax Assistance (VITA) Program\n. SFSU VITA provides tax preparation services within the VITA scope only and does not offer tax consulting beyond that, accept tax documents via email, or process tax returns online.\nImportant\nA.  If\nEmployment\nrelated, bring the following documents:\n1. Social Security Number\n2. Passport page showing name, number and photo\n3. U.S. Visa\n4. Form I-94 “Arrival & Departure Record“ (small white card inside your passport)\n5. Form I-20 or DS-2019 (primary purpose)\n6. Employment Authorization Document (work authorization card), if have\nB.  If\nRenewal of job on campus or a new or different job\n, bring new documents necessary to update your file.\nC.  If\nFinancial Aid Hold\nrelated bring documents requested in the email letter you received. The\nForeign National Information Form\nmust be completed prior to meeting the tax specialist along with bringing copies of the above documentation.\nU.S. Tax Information for Nonresident Aliens\nTax Publications, Forms, and Other Resources\nTax Frequently Asked Questions (FAQs)\nUnrelated Business Income Taxes (UBIT)",
    "url": "https://fiscaff.sfsu.edu/taxservice",
    "domain": "fiscaff.sfsu.edu"
  }
]