[
  {
    "source": "https://academic.sfsu.edu/",
    "category": "general",
    "title": "Academic Affairs | San Francisco State University",
    "content": "Academic Affairs at SF State\nWelcome to SF State where we produce change agents for the new millennium. We pride ourselves in cultivating socially engaged, activist minded graduates who believe that empowering themselves will transform the collective good. Our staff and faculty are committed to serving our diverse 25,000 students. We know that individual difference alongside our common goal towards equity drives the strength of our educational experience. Thus, if you’re quirky, independent-minded, and compassionate, I invite you to take advantage of all that our beautiful city has to offer and join our SF State family as a student, staff, or faculty member. We have a place for you.\nProvost Amy Sueyoshi\nMeet our Provost\nStudents, staff and faculty are invited to meet with Provost Amy Sueyoshi during her open office hours. All meetings will be at the Provost’s Office in ADM 455.\nReserve time to meet with our Provost\nHave a question for the Provost?\nAsk the Provost a question via Qualtrics. Select the link below to be directed to the Provost's question submission form.\nSubmit question for our Provost\nSpotlight on Academic Affairs\nScience & Engineering Innovation Center to open Spring 2024\nThe new Center will provide our students, faculty, and staff with state-of-the-art labs and classrooms, as well as spaces for advising and informal gatherings. The building will also serve as the new home for\nthe College of Professional & Global Education\n.\nLearn more here\nEarly Childhood Special Education, School of Social Work receive federal grant for Project ARISE proposal\nA cross-college collaboration and the first of its kind at SF State, “Project ARISE: Adversity and Resiliency Interventions for Social Emotional Development in Early Childhood” was funded by the U.S. Department of Education for $1,100,000 over five years.\nLearn more here\nWSJ rated Accounting undergraduate program 5th among public universities for post-graduate salary outcomes\nAn April 18 report in\nThe Wall Street Journal\nlists SF State as the No. 5 public college nationwide for accounting salaries for graduates. The ranking finds that SF State bachelor’s degree recipients in Accounting earn an average annual salary of $76,140 in their first 10 years.\nLearn more here\nImproved spaces to better serve our students\nSF State’s\nUndergraduate Advising Center\nand\nCareer and Leadership Development\nboth have newly renovated spaces to show off.\nLearn more here",
    "url": "https://academic.sfsu.edu/",
    "domain": "academic.sfsu.edu"
  },
  {
    "source": "https://academic.sfsu.edu/initiatives-and-priorities",
    "category": "general",
    "title": "Initiatives and Priorities | Academic Affairs and the Office of the Provost",
    "content": "Initiatives and Priorities\nFind out what Academic Affairs is doing to promote excellence and equity.\nIn Academic Affairs, educational excellence and equity are our top priorities. To learn more about these exciting programs, expand the accordions below or navigate to the respective page using the links.\nAcademic Master Plan\nVisit the Academic Master Plan Website\nCEETL\nVisit the CEETL Website\nFoundations of Excellence\nDuring 2016-2017, San Francisco State University conducted the Foundations of Excellence (FoE) first-year self-study. Faculty and staff from  Academic Affairs and Student Affairs & Enrollment Management provided input throughout the duration of the academic year to determine the barriers to success for our first-year students.\nTheir key recommendations fell into various categories: Academic and Social Engagement, Advising and Mentoring, Sense of Belonging, Organizational Structures and Bureaucracy, Communications and Professional Development for Faculty and Staff.  Among the high priority recommendations, the FoE steering committee recommended the institutionalizing of the first year experience collaboratively between Academic Affairs and SAEM.  In addition, this institutionalization of the first year experience is also part of efforts in terms of the campus Student Success and Graduation Initiative 2025.\nAmongst the high priority recommendations, the steering committee identified the following twelve as the highest priority recommendations:\nA first year faculty director from Academic Affairs and a first year director from Student Affairs should be appointed/hired.\nThe Academic Senate should create a first year experience steering committee consisting of campus members from Student Affairs, Academic Affairs and Associated Students. This committee should be chaired by the First Year Director from Student Affairs and the Faculty Director from Academic Affairs.\nThe Academic Senate should pass a resolution supporting a campus philosophy for the first year which aligns with our mission.\nA first year peer-mentoring program should be developed and supported financially.\nAn assessment plan should accompany any new FYE project.\nAll first year students should take a first year seminar. The FY Steering committee should investigate various models for such a seminar and make recommendations to the Academic Senate on the requirements for such a course.\nNew student orientation should be accessible for all incoming freshmen, in either an in person or virtual format.\nA communications plan for first year students and their families should be created.\nThe University should recognize and reward excellence in FY teaching. First year courses should  be desirable teaching assignments that are sought after by excellent teachers.\nProfessional Development should be made available for all faculty and staff who regularly  interact with first year students.\nThe Center for Equity and Excellence in Teaching and Learning (CEETL) should provide specific programming around engagement of first year students in the classroom.\nThe University must find ways to engage students outside the classroom. The academic and Nonacademic aspects of student life must be integrated.\nFor more information on First Year Experience at San Francisco State,\nvisit the FYE website\n.\nGrad Initiative 2025\nSF State's current graduation initiative includes:\nIncreasing our six-year graduation rate for first-time freshmen from 51% to 69%\nIncreasing our four-year graduation rate for first-time freshmen from 18% to 33%\nIncreasing our four-year graduation rate for transfer students from 76% to 86%\nIncreasing our two-year graduation rate for transfer students 37% to 49%\nEliminating the achievement gap\nTo meet the workforce demands of California’s economy, the CSU 2025 Initiative aims to graduate an additional 100,000 baccalaureate students, a total of more than one million, over the next ten years. SF State will contribute to this goal by increasing transfer and freshman graduation rates by an average of 11.25% and eliminating the opportunity gap.\nToward these ends, our campus plan is structured around six strategies:\nImproved course availability and curriculum;\nCoordinated, intrusive and strategic advising;\nBroad accessibility and visibility of student success data;\nHigh-quality student experience in the first year of college for incoming freshmen;\nEffective, targeted support services to achieve educational equity (directed specifically at our first-generation, low-income and underrepresented students, with special attention to men of color); and\nFaculty hiring and development\nGraduation Initiative 2025 is the CSU’s commitment to remove the obstacles to student success, enabling our students to experience transformation for themselves and a lasting impact on California.\nVisit the Graduation Initiative website to learn more.\nMetro Academies\nMetro is a campus-wide program that is based out of the College of Ethnic Studies. We offer learning communities (\"Academies\") in each of the colleges at SF State—Science & Engineering, Liberal & Creative Arts, Health & Social Sciences, Business, Education, and Ethnic Studies.\nLearn more about Metro\nRemaking Advising\nIn the Foundations of Excellence summary for advising and mentoring it notes many of our students declare a major prematurely, without adequate guidance about appropriate majors that would align with their goals and skills, contributing further to low engagement, underperformance, and attrition. Improving our lower-division curriculum, advising for undeclared students and career counseling will address this need. The goal of a peer mentoring program is to support First Year Students in their transition to SF State, encourage successful academic and personal development, promote student involvement and enrich the connections of SF State students to each other, the college and the SF State campus.\nAcademic Affairs, together, with support from SSGI funding, continues to invest numerous efforts into the Undergraduate Advising Center to help undergraduate students enjoy a successful college experience. There is a wide array of support available to our students so they have a clear academic path to  graduation.\nFor more information please visit the\nadvising website\n.\nSan Francisco State Scholars Program\nThe San Francisco State Scholars program provides undergraduate students with an accelerated pathway to a graduate degree.  Students in this program pursue a bachelor’s and master’s degree simultaneously. This program allows students to earn graduate credit while in their junior and/or senior year, reducing the number of semesters required for completion of a master’s degree. The San Francisco State University Scholars program offers students additional career prospects, intellectual growth and the opportunity to deepen skills and research competencies. In addition, Scholars program students will receive a unique form of mentorship that is not often expected at a large urban university.\nFor more information please visit the\nScholars program webpage\n.\nSF State Experimental College\nThe San Francisco State Experimental College (Exco) provides undergraduate students with an opportunity to design and teach a course based upon their own interests.  Exco student-teachers join a community of students who, together, deepen their understanding of the learning process through teaching other undergraduates who share their passions for the course topic.\nThrough a guided process of monitored syllabi development, student recruitment, peer mentorship, and weekly meetings, Exco student-teachers authentically develop skills in leadership, organizing, communication, research, and discussion-facilitation as well as discovering the joys of the creative process of lesson plan development.\nThe Teagle Foundation Report Release: In Search of Curricular Coherence\nThe mission of The Teagle Foundation is to advance the liberal arts, which we see as fundamental to meaningful work, engaged citizenship, and a fulfilling life. To translate our mission into practice, our grantmaking supports faculty who are committed to improving undergraduate education in the arts and sciences.\nWe have found that when courses proliferate without good reason, or students face a bewildering array of options to meet requirements, the curriculum can hinder rather than help them achieve a broad and deep education. The reform of curricula that may have become bloated or incoherent is therefore essential if students are to be well served.\nCurricular reform is never easy. Any serious effort involves many stakeholders and moving parts. Among other obstacles, institutions face financial constraints as they seek to improve learning, graduation rates, and the student experience. The typical additive approach to curricular design is not only unsustainable but may ill serve the goals of liberal arts education. Yet there are surprisingly few resources to help institutions navigate curricular reform, and faculty are rarely well prepared for their roles as stewards of the curriculum. As one Teagle grantee put it, \"I didn't get my Ph.D. in general education.\"\nWe hope that our latest evaluation report, \"\nIn Search of Curricular Coherence\n,\" which distills lessons learned from our \"\nFaculty Planning and Curricular Coherence\n\" initiative,  helps to close this gap in the literature. We partnered with Madeleine Green, who brought her deep experience from her 35-year career at the American Council of Education, to gather these lessons across\nour funded projects\nin this initiative. The projects focused on the role that curriculum plays as a driver of both quality and cost in higher education and how faculty could work together to create more coherent and efficient curriculum with goals, pathways, and outcomes that are clear to students. Participating faculty gained a wider perspective on their course offerings and how they strengthen--or detract from--the overall curriculum. The strategies they developed to promote curricular coherence took various forms, including efforts to curb course proliferation, develop themed and linked courses, and strengthen integrative advising in order to help students see the connections among their curricular and co-curricular experiences.\nDownload the report\nhere\n.\nLearn more about the Teagle Curriculum Redesign Initiative here.\nHere are two insights from the evaluation report:\nFaculty typically approach the charge of developing more coherent curriculum with one of two assumptions: that students must take the lead in integrating their curricular and co-curricular experiences, or that it is the responsibility of faculty to shape the curriculum into a coherent whole on behalf of students. These attitudes are not mutually exclusive, but because they are usually tacit rather than explicit in the institutional culture, they can make it difficult to achieve a shared understanding among faculty, and between faculty and students, of what a sensible undergraduate education should be.\nCurricular reform is a learning process for everyone involved. Institutions need to consider how their efforts to improve the experience of their students are tied to opportunities for faculty to develop their knowledge and understanding of how and what students should learn. Focusing on such questions can foster a climate of inquiry and learning, especially when institutions provide opportunities for a scholarly approach to the issues, involving colleagues within the department, the institution and across partner institutions.\nWe hope this report helps campuses overcome common barriers as they embark on their own curricular reform efforts. We extend our deepest appreciation to our grantees, who brought great creativity and dedication to their work, and without whom this report on lessons for the field would not be possible.\nLearn More:\nAcademic Master Plan\nCenter for Equity and Excellence in Teaching and Learning (CEETL)\nFoundations of Excellence\nGraduation Initiative 2025\nMetro Academies\nUndergraduate Advising Center (UAC)\nSan Francisco State Scholars Program\nSF State Experimental College\nThe Teagle Foundation Report Release: In Search of Curricular Coherence",
    "url": "https://academic.sfsu.edu/initiatives-and-priorities",
    "domain": "academic.sfsu.edu"
  },
  {
    "source": "https://academic.sfsu.edu/academic-field-trips",
    "category": "general",
    "title": "Academic Field Trips | Academic Affairs and the Office of the Provost",
    "content": "Academic Field Trips\nSan Francisco State supports experiences that enhance student learning outcomes and that provide educational and professional training in a field setting. Instructors are encouraged to provide the best experience possible. In addition, all SF State colleges, departments and individual faculty are required to comply with CSU directives (Executive Order 1062 of 2011) aimed at ensuring the safety and well-being of all field trip participants. Consequently, instructors and students must review or complete the following forms:\nFor Instructors\nCSU Field Trip Policy (EO 1062) provides general information about objectives of the policy.\nExecutive Order 1062 Field Trips.pdf\n134.85 KB\nField Trip Checklist is a reminder for instructors so that the proper forms are collected and submitted.\nA1_Field_trip_Checklist_Jan2012.pdf\n444.86 KB\nInstructional Plan form\n(REQUIRED\n) describes the activities and anticipated outcomes of the field trip(s) in a course. One form can be used for multiple field trips taken within a single course.\nA2_Instructional_Plan_fill.pdf\n144.55 KB\nField Trip Site Pre-Assessment form\n(REQUIRED)\nassesses and documents the safety of the field trip site.\nPreAssess_form_fill_Jan2014.pdf\n167.54 KB\nInitial Incident Report (as needed) will be completed if a non-auto accident or injury occurs during the field trip.\nIncident_Report_fill.pdf\n151.58 KB\nFor Students or Field Trip Participants\nField Trip Registration & Liability form\n(REQUIRED)\nprovides student contact information and medical disclosures. The Liability Form is an agreement that the student participates in the field trip voluntarily and does not hold the university liable in case of an accident, incident or illness.\nStudents who do not sign the Registration/Liability form cannot participate in the field trip.\nView the Field Trip Registration & Liability form\nView the Field Trip Liability form only (no registration form)\nInstructions for Field Trip Instructors\nInstructor reviews all forms for field trips.\nInstructor completes required \"Instructional Plan.\"\nInstructor completes required \"Site Pre-Assessment\" before field trip.\nInstructor obtains required \"Registration & Liability\" forms from all students and participants in field trip.\nIn case of a non-auto accident, instructor completes \"Initial Incident Report\" (if needed, submit to department chair as soon as possible).\nIn case of auto accident, instructor/driver completes Accident Information Card (at time of accident) AND Vehicle Accident Report (within 48 hours). For more information refer to\nDriver/Vehicle Registration & Safety\n.\nAfter field trip or end of semester (whichever is most appropriate), instructor submits bundle of forms (Instructional Plan, Pre-Assessment, Registration & Liability) to home department. Include any accident/incident reports (if they occur).\nDepartment must retain paper or electronic copy for one year.\nDepartment must submit electronic copy to Dean's Office (i.e., to associate dean) for five year archival storage.\nContact the associate dean of your college for more information.\nDocument Viewer Links:\nTo view .pdf files, you may download\nAdobe Reader\nTo view .doc files, you may download\nWord Viewer\nTo view .pptx files, you may download\nPowerPoint",
    "url": "https://academic.sfsu.edu/academic-field-trips",
    "domain": "academic.sfsu.edu"
  }
]