[
  {
    "source": "https://campusrec.sfsu.edu/",
    "category": "general",
    "title": "Campus Recreation | San Francisco State University",
    "content": "Be active. Be healthy. Be happy!\nWe inspire the lifelong holistic wellbeing and success of every student within our community.\nSign-in: Member Portal\nDownload our Mobile App!\nCampus Recreation at SF State\nWe look forward to you joining us at the Mashouf Wellness Center. If you have any questions, please reach out to us via email,\nrecsfsu@sfsu.edu\n, or by phone, (415) 405-9355, for assistance.\nFall 2025 Facility Hours\nMonday - Thursday:\n6:30 a.m. - 10 p.m.\nFriday-Sunday:\n9 a.m. - 5p.m.\nContact Us:\nMain Office:\nMashouf Wellness Center\nEmail:\nrecsfsu@sfsu.edu\nPhone:\n(415) 405-WELL (9355)\nAddress:\n755 Font Blvd., San Francisco, CA 94132\nWhat's happening?\nFall  2025 Group Fitness Schedule\nCheck out our Group Fitness Class Schedule! Join us for our new classes and make sure you register through the Member Portal.\nLearn more about Group Fitness\nVisit the Climbing Wall at the Mashouf Wellness Center.\nWe welcome all levels of experience. If you have questions or would like to learn more, check out our Climbing Wall info page for more information. We hope to see you soon.\nLearn More!\nOutdoor Resource Center\nGoing on one of our many Outdoor Trips or going on a hike or a camping trip? Check out our Outdoor Resource Center if you need some equipment. From tents to stoves, we have all your camping equipment rental needs.\nLearn more about the ORC\nOur Highlight Videos\nCheck out our Program Areas\nAquatics\nTake a dip in the Activity Pool, swim some laps in the Lap Pool or check out our upcoming events and information about our Aquatics Program.\nVisit our Aquatics Page\nFitness & Wellness\nCheck out our schedule of Group Fitness classes, learn about our Personal Training Program or learn more about Wellness.\nVisit our Fitness site\nSports\nJoin an Intramural Sports team or a Sports Club, check this semesters schedule or better yet, start your own with your friends.\nVisit our Sports site\nOutdoor Resource Center\nLearn the \"in's and out's\" of the great outdoors, rent out some equipment or take a hike with our trained and experienced trip leaders.\nVisit our ORC page",
    "url": "https://campusrec.sfsu.edu/",
    "domain": "campusrec.sfsu.edu"
  },
  {
    "source": "https://campusrec.sfsu.edu/App",
    "category": "general",
    "title": "Download the MWC app! | Campus Recreation",
    "content": "Download the MWC app!\nDid you know we have an official app on iOS and Android?\nThe Mashouf Wellness Center is excited to launch our Mobile app. Download our MWC mobile app on your phone or tablet today! Available in the iOS App Store and Google Play Store, search \"\nMashouf\"\nor click the links below!\niOS Download (iOS 11 and later):\n‎SF State Mashouf Wellness Center on the App Store (apple.com)\nAndroid (4.4 and later):\nSF State Mashouf Wellness Center - Apps on Google Play\nWhat can I do with the app?\nThe app is your one-stop hub for all things MWC. With it you can:\nCheck into the facility using a barcode\nCheck out equipment\nSign up for and reserve a spot in Group Fitness classes or other events\nCheck in to classes and other events\nFind out our building hours\nBrowse our calendar of events\nRead the latest MWC news\nand more!\nIf you have any questions, comments or concerns about the app, feel free to contact our Memberships and Outreach Coordinator Edward Viray at\neviray@sfsu.edu\n.",
    "url": "https://campusrec.sfsu.edu/App",
    "domain": "campusrec.sfsu.edu"
  },
  {
    "source": "https://campusrec.sfsu.edu/Employment",
    "category": "general",
    "title": "Employment | Campus Recreation",
    "content": "Employment\nJobs at Campus Recreation\nThe Campus Recreation Department at SF State is currently accepting applications for all positions. Positions are open to currently enrolled SF State students only and are\nNOT\nWork-Study jobs. As a member of the Campus Recreation Staff, you are expected to have a professional attitude, good communication and interpersonal skills, excellent focus (despite distraction) and the ability to evaluate a situation in order to make decisions.\nIf you require assistance in reading the information on a PDF file or in filling out a form, please contact Campus Recreation at\nrecsfsu@sfsu.edu\n.\nPlease consider reviewing the\nCareer Services Page\nfor tips on how to build a resume and prepare for an interview.\nDACA students are welcome and encouraged to apply.\nApplication for Employment\nTo Apply:\nAll active job postings are posted on Handshake. Filter by \"On-Campus Student Employment\" under Job Type to find opportunities\nNavigate to:\nhttps://sfsu.joinhandshake.com/\nClick ‘Jobs’ in the top left-hand corner.\nChoose the filters – ‘Part-Time’ and ‘On-Campus’.\nType ‘Campus Recreation’ in the filter on the left.\nClick ‘Search’ and results will yield all open positions within the Campus Recreation department.\nJob Requirements for all positions:\nFirst Aid, CPR, and AED Certified, or willing to obtain within three months of being hired.\nMust be a student at San Francisco State University enrolled in 6+ units, with minimum 2.0 GPA.\nEmployment may be dependent on passing a background check.\nAny questions, comments or concerns about Employment or the Employment Process can be directed to our Campus Recreation email at\nrecsfsu@sfsu.edu",
    "url": "https://campusrec.sfsu.edu/Employment",
    "domain": "campusrec.sfsu.edu"
  },
  {
    "source": "https://campusrec.sfsu.edu/Gymnasium",
    "category": "general",
    "title": "Gymnasium | Campus Recreation",
    "content": "The Gymnasium\nGym 100 – Main Gym\nThe Main Gym is home to our NCAA intercollegiate athletic teams as well as Campus Recreation programming. This indoor facility has a seating capacity of 1,000. The bleachers when opened require approximately 15 feet. This multi-use space is ideal for a variety of activities. Please note the Main Gym is NOT located in the Mashouf Wellness Center. The Main Gym can be configured in the following manner:\nRecreation/Athletic Activities\nBasketball - one NCAA full length court or two short courts.\nVolleyball – one NCAA full length court or two side by side courts.\nIndoor Soccer – one court.\nSpecial Events\nMartial Arts Tournaments\nAssemblies\nGraduation Celebrations\nNote:\nOther configurations within this facility are available upon request. Additional seating accommodations can be arranged depending upon the event.\nGym 100 J and Gym 100 C\nSectioned off smaller areas of the Main Gym perfect for fitness classes and small group activities.\nGym 147 – Small Gym\nThe Small Gym is an indoor facility with a seating capacity of 400-500 utilizing the entire space. There are no bleachers in this facility. The Small Gym consists of one non-collegiate sized basketball court or two shorter courts. This multi-activity space can be used for the following:\nRecreation/Athletic Activities\nBasketball - one non-collegiate court or two short courts.\nVolleyball - one NCAA full length court or two short courts.\nIndoor Soccer - one court.\nBadminton – Five net courts.\nSpecial Events\nMartial Arts Tournaments.\nAssemblies.\nGraduation Celebrations.\nGym 121 – Swimming Pool\nThe indoor heated pool is 6 lanes across and twenty-five yards in length (67 feet x 90 feet) with depths of 4’ to 10’. The pool bleachers have a seating capacity of 290",
    "url": "https://campusrec.sfsu.edu/Gymnasium",
    "domain": "campusrec.sfsu.edu"
  },
  {
    "source": "https://campusrec.sfsu.edu/CommunityResources",
    "category": "general",
    "title": "Community Resources | Campus Recreation",
    "content": "Community Resources\nWhether you’re just starting out or a preparedness pro, gathering your emergency supplies is easy. A good rule of thumb is to have supplies for about 3 days, or 72 hours. You’ll be surprised at how much you already have. If you need help getting started or need a crash course refresher on how to prepare, our Risky team has put together some information for you all to take advantage of.\nDisaster Preparedness\nDownload a Copy of Flyer\nDisaster Supply Kit Checklist:\nDon't get caught in the middle of a natural disaster without a kit stocked with the following items. Be sure to always check expiration dates of foods, batteries and kits stocked with all the necessities.\nCell Phone & Phone Charger (Click to Expand)\nIn order to stay informed, utilize your cell phone as a resource and help communicate safely in an emergency.\nFlashlight (Click to Expand)\nFlashlights are essential for navigating through a power outage.\nDust Mask (Click to Expand)\nProtect yourself and your health through a dust mask.\nExtra Batteries (Click to Expand)\nBatteries may be utilized in an array of options ranging from flashlight to cellphone.\nSafety Tools - Wrench + Pliers (Click to Expand)\nA basic toolkit with items like a hammer, wrench, and duct tape will help you turn off the gas, repair broken windows, or board up your home.\nWater (Click to Expand)\nStay hydrated throughout an emergency and keep up with saving gallons at home.\nWhistle (Click to Expand)\nA whistle can be used as communication and loud form of alert during a emergency situation.\nFood (Click to Expand)\nSeveral days’ supply of non-perishables is helpful as emergency snacks.\nStay Prepared\n8 Ways to Be Prepared!\nLuck favors the prepared and in a State like California that is prone to Earthquakes, Wildfires and the occasional devastating rainstorm, it is in everyone's best interest to be as prepared as possible and ready for the next disaster. Check out the list of our top ways to be prepared below!\n1. Identify Your Risk (Click to Expand)\nWhat are the hazards where you live or work? Find out what natural or human caused disasters pose a risk for you.\nDo you live near a flood plain, an earthquake fault, or in a high fire danger area?\nAre you prepared for an unexpected human-made disaster that can strike any time?\n2. Create a Family Disaster Plan (Click to Expand)\nYour family needs a plan that tells everyone: where to meet if you must evacuate, why you’ve identified.\n3. Practice Your Disaster Plan (Click to Expand)\nAfter you have sat down with your family and written your plan – practice it.\nStart by having family members meet at a designated spot outside your home – like you would after a fire or after the shaking stops. Know how to respond in the event of any disaster – whether to stay put indoors, or whether to evacuate your neighborhood by car.\n4. Build A Disaster Supply Kit for Your Home (Click to Expand)\nIf are stranded in your car or must be self-sufficient at home until help arrive, you need to have a disaster kit with you.\n5. Prepare Your Children (Click to Expand)\nTalk to your kids about what the risks are and what your family will do if disaster strikes.\n6. Don't Forget Those with Special Needs (Click to Expand)\nInfants, seniors, and those with special needs must not be forgotten.\nMake sure that supplies for your infant are in your kit and that seniors or those with special needs have medical supplies that they may require.\n7. Learn C.P.R. & First Aid (Click to Expand)\nGet trained in basic first aid and C.P.R., your training could save the life of a loved one or neighbor following a disaster.\n8. Eliminate Hazards in Your Workplace (Click to Expand)\nYou must secure the contents of your home or office to reduce hazards, especially during shaking from an earthquake or from an explosion.\nDownload a Copy of Flyer\nRisk Management & Safety Instructional Videos\nAny questions, comments or concerns regarding Risk Management Tips and Tricks can be directed to our Risk Management Student Managers at\ncrdrisk@mail.sfsu.edu\nor our Risk Management and Safety Coordinator Ben Forchini at\nforchini@sfsu.edu\nTo view PDF files, please\ndownload Adobe Reader",
    "url": "https://campusrec.sfsu.edu/CommunityResources",
    "domain": "campusrec.sfsu.edu"
  },
  {
    "source": "https://campusrec.sfsu.edu/GroupFitness",
    "category": "general",
    "title": "Group Fitness | Campus Recreation",
    "content": "Sign-up Today!\nGroup Fitness\nJoin us for an exciting lineup of group fitness classes that will keep you energized, motivated, and ready to conquer the season. From heart-pounding cardio to zen-inducing yoga, we've got something for everyone. Don't miss out on the fun – let's embrace the summer vibes while staying active together. Your journey to a stronger, healthier you starts here!\nOur Group Fitness classes are instructor-led workout sessions that involve a group of participants performing exercises together. These classes are held in our wonderful fitness studios and include a wide range of activities such as Aerobics, Zumba®, Yoga, Strength training, Cycling, and more. Group fitness classes can be a great way to stay motivated, meet new people, and achieve fitness goals in a supportive and fun environment.\nSign Up Today!\nGroup Fitness Schedule\nClick to Download\nMeet your Fitness Instructors\nClass Descriptions\nLes Mills Online Workouts\nHow to Sign-up for Group Fitness Classes\nTo sign-up for a Group Fitness class please follow these steps:\nSign-in to the Member Portal at\nhttps://member.campusrec.sfsu.edu/\nClick on the tab at the top left\nClick on Group Fitness\nClick on the class format you wish to register for\nFind the date and time and click \"Register\"\nClick Checkout and \"Yes\" if you are ready to proceed\nClick \"Confirmation\" to see a PDF Confirmation\nGroup Fitness Class Registration will open ONE WEEK before class time.\nThe Group Exercise Department utilizes a 10-minute rule, any person who is more than 10 minutes late will not be allowed into class.\n*Please visit our social media platforms for the most up-to-date Group Fitness schedule\nRegistration\nTo get into the class you must register in member portal. Registration opens 7 days before class starts, and you can register at any time. Arrive early to class because there is a 10-minute check in window. You will not be allowed into class if you are 5 or more minutes late. If you are late, your spot will be given to someone on the waitlist.\nWaitlist\nIf you were unable to register for a group fitness class due to a full class, you can join our waitlist. Come 10 mins before the class and check in with instructor/ fitness floor staff to be added to the waitlist. Folks on the waitlist must be in person. You will be added to the class 1min before class starts if there is room.\nCancellation Policy\nIf you are unable to come to class, please cancel your registration at least 24 hours in advance. Since we have limited spots available, cancelling your registration allows more spots available for people who want to attend the class. If you forget to cancel/no-show twice you will not be allowed to register and secure a spot in class for 2 weeks. Due to not being able to register online, if you want to attend a class you will have to come to MWC and join the in-person waitlist.\nHow to cancel a registration:\nVideo Link\nGroup Fitness Bonus Videos\nAny questions, comments or concerns can be directed to our Group Fitness Student Managers at\ngroupx@mail.sfsu.edu\nor to our Fitness and Wellness Coordinator Sabrina Sousa at\nssousa@sfsu.edu\nTo view PDF files, please\ndownload Adobe Reader\nAccommodations\nWe welcome anyone and Every(body) to participate in our Group Fitness programs. If you need any accommodations, please arrive early to discuss with the group fitness instructor. Also feel free to email\ngroupx@mail.sfsu.edu\n.\nGroup Fitness classes are open to all students and staff with an active membership to the Mashouf Wellness Center.",
    "url": "https://campusrec.sfsu.edu/GroupFitness",
    "domain": "campusrec.sfsu.edu"
  },
  {
    "source": "https://campusrec.sfsu.edu/MeetTheInstructors",
    "category": "general",
    "title": "Meet the Instructors",
    "content": "Meet the Instructors\nWe're excited to introduce you to our team of group fitness instructors! They're all passionate about helping you reach your fitness goals, and they're committed to providing you with a fun and challenging workout.\nWe offer a variety of group fitness classes to fit all fitness levels and interests. So, whether you're a beginner or a seasoned athlete, we have a class for you. Come meet all our instructors and pick your favorite class today!\nSign up for a class today!",
    "url": "https://campusrec.sfsu.edu/MeetTheInstructors",
    "domain": "campusrec.sfsu.edu"
  },
  {
    "source": "https://campusrec.sfsu.edu/Sports",
    "category": "general",
    "title": "Sports | Campus Recreation",
    "content": "About Sports\nSports Clubs\nIntramural Sports\nSF State Summer Kids Camp\nSports Clubs\nA Sport Club is a student organization formed by students motivated by a common interest and desire to participate in a sport or recreational activity. Recognized by the University through the Campus Recreation Department, SICC and Division of Student Affairs & Enrollment Management, a Sport Club exists to promote and develop interest in that sport or activity at the University. A Sport Club may be oriented toward competition, teaching, recreation and/or socialization. Sport Clubs are all student-based clubs. If you have an idea for a sport club and want to setup a meeting about starting you club, visit us at the navigation box above.\nIntramural Sports\nThe Intramural Sports program offers structured sport leagues for SF State students, faculty and staff geared to promote fair play, positive social interaction, effective communication, and healthy lifestyles in a safe and fun environment.\nParticipants can create teams made up friends and play against other teams created within the SF State community. IM Sports are typically offered in the evenings Monday through Thursday during both the fall and spring semesters. Seasons range from 8-10 weeks in length and consist of men's, women's and co-ed leagues offered at various competitive levels. Intramural Sports offered include basketball, outdoor soccer, indoor soccer, volleyball, and flag football. All games are officiated by trained referees and staff. For more information, visit us at the navigation box above.\nSF State Summer Kids Camp\nSan Francisco State Kid's Camp has a mission to provide a safe and high-quality summer experience that engages campers with recreation, field trips, and other interactive learning activities. Our diverse programming will educate at a beginner level, the dimensions of health and wellness in a fun summer environment. Campers benefit from diverse experiences and educational opportunities while under the supervision of diverse counselors. Our pre-planned activities keep campers busy and engages throughout their time as an SF State Kids Camp Camper. For more information, visit us at the navigation box above.",
    "url": "https://campusrec.sfsu.edu/Sports",
    "domain": "campusrec.sfsu.edu"
  },
  {
    "source": "https://campusrec.sfsu.edu/LDS",
    "category": "general",
    "title": "Leadership Development | Campus Recreation",
    "content": "Leadership Development\nCampus Recreation strives to give our student employees opportunities to both improve upon and gain new skills while working with us that they will be able to utilize in whatever future career they may choose.\nAll student employees must attend at least one Leadership Development Series (LDS) Workshop during both the fall and spring semester. Workshop topics focus on the following NACE Career Readiness Competencies:\nCritical thinking and problem solving\nOral and written communication\nTeamwork and collaboration\nInformation technology application\nLeadership\nProfessionalism and work ethic\nCareer management\nStudent employees also take part in two Gator GROW (Guided Reflection on Work) conversations each semester with their full-time supervisor. Gator GROW is focused on making student employment a “high impact practice” – one that requires students to reflect on their learning and connect what they are learning on the job with what they are learning in the classroom.\nAlthough, our Leadership Training is currently geared for our in-house student staff, we are always looking for possibilities to collaborate and share resources with partners across campus.\nLearning Exercise\nTeamwork Exercise\nAffirmation Activity\nGeneral Contact Info\nAny questions, comments, or concerns should be directed to the Outdoor & Leadership Development Program Student Managers by emailing\ncrleadership@sfsu.edu\nor by emailing our Outdoor and Leadership Development Coordinator, Jack Korpob at\npkorpob@sfsu.edu",
    "url": "https://campusrec.sfsu.edu/LDS",
    "domain": "campusrec.sfsu.edu"
  },
  {
    "source": "https://campusrec.sfsu.edu/WellnessDimensions",
    "category": "general",
    "title": "Dimensions of Wellness | Campus Recreation",
    "content": "Dimensions of Wellness\nThe\nwellness wheel\nillustrates a wellness model with eight dimensions: social, physical, emotional, occupational, spiritual, intellectual, environmental, and financial. All of the dimensions are interconnected and important to a well-rounded and balanced lifestyle. It reminds us we need to work in different aspects of our lives to increase our sense of well-being, focusing on just one area is not enough. When you lose balance within or between dimensions of the wheel, your sense of well-being decreases, and you can experience distress. For example, it can be easier to feel emotionally balanced when our sense of social connection or physical wellness are maintained.\nUsing the wellness wheel\nLearn about each dimension of wellness and related resources to help you take action:\nSocial\nWhat is it?\nEmotional connections and healing interactions with others.\nMeaningful relationships and interactions with others help you feel you are part of a greater community and not alone.\nThe quality of our relationships and our ability to interact with others in positive and meaningful ways.\nResources to maintain and restore your well-being:\nFeeling emotionally connected and having meaningful interactions is healing!\nArticle:\nHow to build meaningful connections\nLGBTQ+ Culture: Visit the\nQueer & Trans Resource Center\nto find real-time support and connection with the LGBTQ+ community at SF State.\nIf you’re facing an issue that is affecting your ability to succeed at SF State, you can get help from a Student Advocate.\nEmail the office\nto get in touch with an advocate who can remotely provide assistance and support.\nPhysical\nWhat is it?\nTaking care of your body – involving physical activity, making sure you have a balanced diet, and increasing awareness of physiological signs of stress.\nHealth and safety, movement, nutrition, and sleep\nResources to maintain and restore your well-being:\nPhysical exercise can be anything that makes your body move.\nHealth and safety\nHave a health concern? The Student Health Center\nmedical clinic\nis available to all students. The health center gives you access our highly skilled providers from the comfort of your home. Virtual visits is an easy way to connect with campus health resources, even though you might not be in San Francisco. Make an appointment by calling\n415-338-1251\nor visiting the website.\nYou might use nicotine products to cope with stress from school, work, or family expectations. The Student Health Center’s\ntobacco and vaping cessation counselors\ncan help you kick the habit. Services are free for all SF State students.\nMovement\nRegular exercise routines on YouTube (there are lots of options!). Try a\nGroup Fitness Class\nor check out\nP.E. with Joe.\nPractice\nrelaxation exercises\nto manage the physical symptoms of stress.\nGet outside! Take a daily walk or try jogging.\nNutrition\nHealth Promotion and Wellness can help you take charge of healthy eating. Make an appointment through the\nNutrition Clinic\nto meet with a Registered Dietitian Nutritionist\nThere are lots of online tools to help you make the best food selections based on your dietary needs and preferences. Check out\nMyPlate\n.\nEmotional\nWhat is it?\nHas to do with your emotional life - being aware and validating your feelings and emotional reactions to different situations.\nIncludes your ability to cope with stressors and difficult circumstances.\nResilience in times of uncertainty.\nResources to maintain and restore your well-being:\nPractice self-compassion\nPursue hobbies and interests\nPractice acceptance\nSF State Resources\nMake a 30-minute virtual appointment with a\nCounseling and Psychological Services (CAPS)\ncounselor. Schedule by calling 812-855-7688.\nThe\nEquity Programs & Compliance Department\nprovides support to students who are impacted by sexual assault, harassment, discrimination, relationship violence, stalking, or other threats to personal safety. Get in touch with a Confidential Victim Advocate (CVA) by\nemail\nor call (415) 338-2032\nSF State's Health Promotion & Wellness offers a safe, judgment-free space for\ndrug and alcohol use\nand recovery support through co. To connect with the team, call 812-856-3898 or\nemail\n.\nCommunity Resources\nCommunity Behavioral Health Services\nprovides mental health and substance use disorder treatment, education and support to communities. Get in touch by calling 800-355-6310.\nZuckerberg San Francisco General Hospital\noffers a wide range of services to support people with behavioral, psychiatric, and psychological needs. Learn more by calling 800-248-1199.\nSF Services\nprovides shelter, advocacy, housing, and legal services to survivors of domestic/dating violence, human trafficking, and sexual assault. Reach the 24/7 crisis line by calling 988.\nOccupational\nWhat is it?\nHas to do with making career and professional choices that could help you build an individual sense of fulfillment, and at the same time feeling you are contributing to the general society.\nContributing to your unique talents\nResources to maintain and restore your well-being:\nKeep perspective. One of the main characteristics of resilient people is that they maintain a “whole picture” perspective\nHere are some\ntips to foster and develop your resiliency\nContinue to reach out to your academic and career advisors\nSpiritual\nWhat is it?\nBeing a part of the common good.\nPurpose and living a life that has your values as the main compass to make decisions and choices.\nResources to maintain and restore your well-being:\nViktor Frankl\n. This psychiatrist created Logotherapy after he survived the horrors of a concentration camp. His insights about finding purpose in the middle of adversity are inspiring, validating, and empowering.\nMeditation can help reduce stress and calm anxiety. Try one of these free mobile apps to get started: Breathe2Relax, Headspace, Calm.\nGet a coloring book\nYoga\nPractice positive self-talk and thinking\nIntellectual\nWhat is it?\nThe ability to engage in creative and critical thinking.\nPlacing value on learning and intellectual curiosity.\nResources to maintain and restore your well-being:\nCreate a soothing workstation\nContact classmates and set up study sessions\nContact your instructor to problem-solve obstacles\nResearch topics that pique your interest\nEnvironmental\nWhat is it?\nAn understanding of the environment in a comprehensive way.\nIt includes your immediate physical environment, as well as your community and broader environment.\nMaking your workspace work for you.\nResources to maintain and restore your well-being:\nCreate a calming home environment\nEngage with nature through a walk or spending time outside\nExplore new areas within San Francisco\nFinancial\nWhat is it?\nCurrent financial situation and resources.\nNavigate through difficult times.\nResources to maintain and restore your well-being\nProblem-solving out loud with a supportive person can help decrease overwhelming feelings triggered by fear.\nExplore how you can help others! Solidarity is healing.\nSF State x iGrad Financial Wellness\nSF State Basic Needs has funding available to assist students who qualify and are facing a critical financial crisis.\nAre you in need of food resources?\nFeeding America\n: Find your Local FoodBank.\nGator Groceries\n: SF State's on-campus food pantry for students is open!\nSF/Marin Food Bank\n: San Francisco's community food pantry.\nAny questions, comments or concerns can be directed to our Wellness Student Leaders at\ncrdwell@mail.sfsu.edu\nor our Fitness and Wellness Coordinator Sabrina Sousa at\nssousa@sfsu.edu\n.",
    "url": "https://campusrec.sfsu.edu/WellnessDimensions",
    "domain": "campusrec.sfsu.edu"
  }
]