[
  {
    "source": "https://develop.sfsu.edu/marcus-scholars-research",
    "category": "general",
    "title": "Marcus Scholars' Research Addresses Pressing Issues of the World | University Development",
    "content": "Research Addresses Issues of the World\nThe student research fellowships and assistantships are made possible through the George and Judy Marcus Funds for Excellence in the Liberal Arts\nDonate to the CLCA\nMarcus Scholars' Research Addresses Pressing Issues of the World\nFor her fellowship, History major Kayla Ratliff, pictured above, studied homosexuality in 19th-century Japan. Photo by Sreang Hok.\nby Matt Itelson\nA new donor-funded College of Liberal & Creative Arts research program provided opportunities for 15 undergraduates this year to dig deep into the world’s most debated, pressing issues: politics, race, mental health, veterans, climate change, bullying, sexuality, and more. Working closely with faculty mentors throughout the entire year, students sharpened investigative skills and creative talents and helped build an understanding of a range of issues.\n“I was struck by both the sophisticated content of your research projects and the incredible poise you all showed in presenting your topics. Congratulations on completing these under very unusual circumstances — another reflection of your talents and determination.”\n-President Lynn Mahoney to the student research fellows & assistants\nThe student research fellowships and assistantships are made possible through the George and Judy Marcus Funds for Excellence in the Liberal Arts, established by alumni George and Judy Marcus with a $25-million donation in 2018. Marcus scholars have already been successful. The Council on Undergraduate Research’s annual Posters on the Hill conference accepted International Relations major Mikayla Cordero’s project on the rise of left-wing nationalism in Ireland. Cordero was among 60 students selected from 350 applications nationwide.\n“You represent the very best of SF State,” SF State President Lynn Mahoney said at a May 26 video conference where fellows and assistants presented their work. “I was struck by both the sophisticated content of your research projects and the incredible poise you all showed in presenting your topics. Congratulations on completing these under very unusual circumstances — another reflection of your talents and determination.”\nUnderstanding student veterans\nEarly in her research on student veterans, Marcus Undergraduate Research Fellow Janelle Scarritt discovered significant inaccuracies in sociology, psychology, and anthropology publications on the topic. Interviewing student veterans at SF State enabled her to discover fresh perspectives on their capacities and challenges.\n“This experience has shown me what it takes to pursue undergraduate research and that I am capable of doing it,” Scarritt said.\nAnthropology Assistant Professor Martha Lincoln was Scarritt’s faculty mentor. She compared the one-on-one mentorship with students afforded by the program to undergraduate research experiences at small liberal arts colleges.\n“It’s just incredibly rewarding to see students pursue intellectual goals that have personal significance to them,” Lincoln said.\n“The Value of a Life”\nFor Jamila Hayes’ Marcus Undergraduate Research Fellowship, she directed “The Value of a Life,” a documentary about the divergent life paths she and her brother have taken. Hayes is thriving — she just graduated this month — but her brother has fallen victim to addiction, incarceration, and mental illness. She said the film was her first opportunity to express her feelings about her brother.\n“The reality of our world is that if you are Black you will be treated worse than your white counterparts,” said Hayes, a Cinema major. “If you are Black, homeless and a drug addict, you are treated even worse and with even less respect. As a society, we need to work harder to stop perpetuating harmful ideologies that have such a negative impact on communities of people. I hope that my film will be a part of causing that change and that it will allow people to start having these conversations.”\nAs a faculty mentor, School of Cinema Director Celine Parreñas Shimizu challenged Hayes to situate the film’s approach. In preparation, Shimizu assigned readings of scholarly articles on prison systems and aesthetics. In the end, Shimizu herself gained valuable insight from Hayes.\n“I learned about the powerful personal understanding Jamila’s courageous filmmaking achieves about enduring pain, trauma, and abuse and the hope that comes from love, affection, and intimacy,” Shimizu said.\nPresidential mathematics\nFive students served as Marcus Research Assistants, helping faculty members’ scholarly pursuits. Elizabeth Wedel, with Political Science Assistant Professor Rebecca Eissler, explored how modern U.S. presidents establish agendas. Wedel, who will enter her senior year this fall, helped research and write case studies. She focused on instances of presidents coming into conflict with Congress and the Supreme Court.\n“My research on presidential agenda setting relies quite heavily on quantitative, mathematical analysis, so my goal for our partnership was to identify and research some historical cases to illustrate the theoretical dynamics at play,” Eissler says. “She brought a curiosity and fresh perspective to the selection of cases for us to research, which gave the project a greater clarity and understandability.”\nAlthough the COVID-19 pandemic affected students’ ability to conduct field research this spring, they were able to complete their projects. Hayes, for example, had to abandon plans to spend one day in San Francisco filming with her brother. Instead, she interviewed him in her apartment and used footage from one of their childhood homes.\nOverall, the Marcus fellowship has given Hayes advice to pass along to next year’s cohort.\n“When things become chaotic and confusing, remember what the purpose of your proposal was about,” she said. “Sometimes it’s helpful to go back to the basics in order to better understand where to go next.”\nStudents, and faculty win Marcus-funded research awards for 2020-21\nMarcus Research Fellowship winners\n“A Price on Pride: Understanding the Commoditization of the Queer Identity in San Francisco.” Student: Maximilian DeNembo (School of Design). Mentor: Hsiao-Yun Chu.\n“Defining Rurality: An Exploration of the Rural-Urban Connection in Different Parts of the United States.” Student: Fiona DeWitt (Political Science Department). Mentor: Rebecca Eissler.\n“Explorations of Gesticulation-Based Upper Limb Appliances.” Student: Levi Gilbert (School of Design). Mentor: Silvan Linn.\n“Everyday HEROs: Public Health Research during COVID-19 Shelter-in-Place.” Student: Gurjot Gill (Anthropology Department). Mentor: Peter Biella.\n“Objectivity and Epistemic Commitment: Polanyi’s Critique of Reductionism.” Student: Aydin Jang (Philosophy Department). Mentor: Arizoo Islami.\n“Korean American Cinema (the 1990s – Present): Confronting History and Myths in the Diaspora.” Student: B. Kim (School of Cinema). Mentor: Scott Boswell.\n“Attainability of Official CSU Intended Outcomes: A Student Experience-Based Study.” Student: Ysenia Martinez (School of Design). Mentor: Tara Lockhart.\n“Decline of the Latino Media in the San Francisco Bay Area.” Student: Adriana Morga Oregel (Journalism Department). Mentor: Laura Moorhead.\n“The Semiotics of Power: Linguistic Structures of Neoliberal Hegemony.” Student: Mikey Pagan (School of Humanities and Liberal Studies). Mentor: Teresa Pratt.\nMarcus Undergraduate Research Assistantship winners\nThree of the projects include two student assistantships.\n“A New Critical Edition of ‘Romeo and Juliet’: A Digital Humanities Project.” Mentor: Kurt Daw (School of Theatre and Dance).\n“Shakespeare’s ‘Lear’: A VR/Live Performance Hybrid.” Mentor: Elizabeth Hunter (School of Theatre and Dance).\n“Lexical Variation and Sociolinguistic Style in a Bay Area High School.” Mentor: Teresa Pratt (English Language and Literature Department).\n“The Unpublished Works of Elizabeth Anscombe.” Student: Ivan Manriquez Jr. Mentor: Jeremy Reid (Philosophy Department).\n“From the Left or the Right? Anti-Semitism in Germany Since 2002.” Mentor: Scott Siegel (International Relations Department).\nDonate to the CLCA\nReturn to the CLCA page\nFor more information about donating to the College of Liberal and Creative Arts, contact:\nSoo Kim\n(\nShe/Her/Hers\n)\nSenior Director of Development (Creative Arts)\nCollege of Liberal and Creative Arts\nsoo.kim@sfsu.edu\n(415) 338-7113\nRead more about Soo\nRelated News\nSFSU School of Design Students Take Climate Innovation to Global Stage\nSeptember 30, 2025\nAngela Tafur, First Kirkeberg Scholar, Leads with Purpose\nSeptember 30, 2025\nKenneth S. Fong (B.A., ’71; M.A., ’74), Ph.D.: Inspiring Discovery, Innovation, and Opportunity\nSeptember 30, 2025\nDenny Luther ’65: “SF State Did Me Right”\nMay 21, 2025",
    "url": "https://develop.sfsu.edu/marcus-scholars-research",
    "domain": "develop.sfsu.edu"
  },
  {
    "source": "https://develop.sfsu.edu/2024-SFSU-Impact-Report",
    "category": "general",
    "title": "University Impact Report 2024 | University Development",
    "content": "The Impact of Giving to San Francisco State University\nPowering ambition & talent with opportunity & access\nDonate Now\nUniversity Impact Report 2024\nJeff Jackanicz, Ph.D.\nVice President of University Advancement\nIt is my privilege to share with you\nSan Francisco State University’s 2023–24 Donor Impact Report\n, a celebration of the transformative power of philanthropy for our students, faculty, and the broader University community.\nThis year’s report brings your generosity to life, highlighting how private giving has enriched programs and initiatives across campus. Donor support is fueling the planned renovation of the campus planetarium, sparking curiosity and exploration, while the new Henri and Tomoye Takahashi Distinguished Endowed Chair in Nikkei Studies will advance cultural understanding and academic excellence. Additionally, scholarships and fellowships in a wide array of disciplines are empowering students to pursue their ambitions and make meaningful contributions to their fields.\nWe also marked the successful completion of our Catalyze the Future fundraising campaign, to raise funds for equipment and instructional use in our new Science & Engineering Innovation Center, a state-of-the-art facility designed to foster discovery, collaboration, and equity in STEM education.\nSan Francisco State is proud to rank amongst the nation’s leaders in driving social mobility, a recognition of our unwavering commitment to creating pathways to success for students from all backgrounds. It is your belief in our mission that fuels our work, and we remain grateful for it.\nOn behalf of the entire SF State community, thank you for your generosity and partnership. As the stories in this report reveal, your support leaves a lasting legacy for our students, our campus, and the world beyond.\nWarm regards,\nJeff Jackanicz, Ph.D.\nVice President of University Advancement\nSan Francisco State University\nYour Gift Makes Success Possible\nDonations to San Francisco State University create a chain reaction of success that reverberates across the community. Each dollar matters here, and together your support of our students, faculty, and programs creates a level of excellence that would not be possible without your investment.\nPlease continue scrolling down the page to view the impact report\n.\nSupporting Students\nMany SF State students need to work at jobs while balancing their course loads. One $1,000 scholarship equals approximately 60 hours at a minimum wage job – enough time for a student to complete the work of one class. Many students report a boost in confidence and a deepened sense of belonging at the University when they are awarded a scholarship.\nTotal scholarship money awarded = $3.36M\nNumber of scholarships awarded = 1,442\nNumber of new scholarships funded = 21\nData reflects fiscal year 2023-24\nAlumni Donors\nSF State has more than 356,000 alumni, the majority of whom live in the SF Bay Area. The University’s alumni work in every sector – from artists to healthcare providers to fintech executives. They often have a strong drive to help their community and a “giving back” ethic. Last year,\n53%\nof SF State donors were alumni, and many alumni give to the students who come after them in other ways, such as via career support and mentoring.\nAlumni donors = 1,687\nTotal donated by alumni = $4.5M\nData reflects fiscal year 2023-24\nImpact of Giving\nNumber of gifts to SF State = 5,018\nEndowment value of San Francisco State University Foundation = $174.85M\nTotal donated to the University = $21.7M\n3,176 total donors\n1,055 new donors\nData reflects fiscal year 2023-24\nCommencement 2024\nScholarship Awardees Amongst the Outstanding Graduates Honored at 2024 Commencement\nFour awardees of donor-funded scholarships were amongst the dozen outstanding graduates honored during SF State's 123rd Commencement ceremony in May 2024. They represented their more than 7,300 graduating peers in the Class of 2024.\nAs part of a longstanding tradition, each of the University’s six academic colleges selected an undergraduate and a graduate student to represent their classmates and wear their college’s academic hood during the ceremony. Four of the hood recipients were scholarships awardees:\nJazz Monique Hudson, Zen Lewis, Su Ilayada Ozcan, and Monique Scott\n. Click the button below to learn more about each of them.\nRead more about the outstanding graduates\nCollege of Liberal & Creative Arts\nDonor Spotlight | Kenny and Maria Chin: “Forget injuries; never forget kindness.” —Confucius\nKenny Chin (M.A., Political Science, ’78) had always envisioned entering politics once he retired, but, when the time came, he decided to invest in education instead. “The best path forward for me is to help young people, to open curious minds,” says Kenny.\nGuided by their shared values of compassion and love, Kenny and his wife Maria have made three major gifts to the College of Liberal & Creative Arts, funding the Chin-Plaisance Colloquium Series as well as scholarships in International Relations and Philosophy.\nRead about the Chins\nDawn-Elissa Fischer | Anthropology Professor Creates Awards in Honor of Scholar and Civil Rights Attorney\nWith two generous donations to SF State, Anthropology professor Dawn-Elissa Fischer, Ph.D., has established the Marcyliena Morgan Scholarship and the Walter P. Riley Radical Change Scholarship.\nProfessor Fischer created the awards to respectively honor Morgan, a Harvard University professor and renowned scholar of hip-hop, and Riley, an Oakland civil rights attorney and activist. With both awards, SF State students will gain opportunities to meet mentors, join professional networks and establish their own.\nRead about Dawn-Elissa Fischer's scholarships\nCollege of Ethnic Studies\nHenri and Tomoye Takahashi Charitable Foundation Awards $4.2M in Landmark Gift\nSan Francisco State University received a $4.2 million gift from the Henri and Tomoye Takahashi Charitable Foundation, $4M of which is an endowed gift to establish the Henri and Tomoye Takahashi Distinguished Chair in Nikkei Studies.\nThis faculty position is the first endowed chair in the University’s College of Ethnic Studies. It is also the first in the Asian American Studies department, which is the oldest and largest in the country and is at the forefront of curriculum development used by schools and universities nationwide.\nRead about the Takahashi Endowed Chair\nLam Family College of Business\nDonor Spotlight | Jeff Franco: From Unprepared Undergrad to Advocate for Diversity in Accounting\nAfter graduating from SF State with an Accounting degree, Jeff Franco (B.S., ’83) worked for many years as the lead recruiter for the tax department of the San Francisco office of Ernst & Young, where he noticed a lack of diversity among the applicants he interviewed. When he retired, Jeff wanted to help address this lack of diversity in the accounting field, so he established the Franco Family Accounting Scholarship for economically disadvantaged accounting students at SF State who have demonstrated a commitment to enhancing diversity.\nRead about Jeff Franco\nVIDEO | Student Spotlight | Alfred Ceballos\nLearning has been a passion for Alfred Ceballos ever since he was a child in East Los Angeles, but he had to work through many challenges before enrolling as an undergraduate in the Lam Family College of Business. In this moving two-minute video, he tells his story and discusses the huge impact that scholarships have had on his journey as a first-generation college student.\nWatch Alfred Ceballos' video\nCollege of Science & Engineering\nScience & Engineering Innovation Center (SEIC) & Catalyze the Future Campaign\nThe University’s Catalyze the Future campaign successfully raised $25 million for technology and instructional resources for the new Science & Engineering Innovation Center. This funding from alumni, friends, and science and engineering companies will significantly increase the already formidable career achievements of our STEM graduates and further strengthen SF State's record of contributing to a skilled and diverse regional workforce pipeline for the Bay Area’s bioscience and tech industries.\nHeising-Simons Foundation Awards $1.5M to Renovate and Upgrade Campus Planetarium\nAfter 50 years of training future science educators and aspiring stargazers, the Charles F. Hagar Planetarium will receive a major modernization thanks to a $1.5M grant from the Heising-Simons Foundation. “This planetarium has inspired so many young people to look up, to ask questions, and to pursue their dreams,” says Planetarium Director Adrienne Cool. “With this donation, whole new vistas will open up.\"\nRead about the Heising-Simons Foundation's grant\nBristol Myers Squibb Supports Diversity in Sciences at the College of Science & Engineering\nThrough its corporate giving program, Bristol Myers Squibb (BMS) funds the BE-STEM scholarship program at SF State, fostering the next generation of STEM researchers. The grants are awarded to students who participate in the College of Science & Engineering's Black Excellence in STEM (BE-STEM) club and conduct research in a lab.\nRead about BMS's grants\nDonor Spotlight | The Haferniks and the Ripleys Honor the Inclusivity and Excellence of the Biology Department\nJohn Hafernik, Jr., Ph.D., an emeritus professor of Biology who taught at SF State for 40 years, and his wife Johnnie Hafernik, Ed.D., generously endowed a scholarship fund for graduate students in the Department of Biology.\nAlumni Doug Ripley (B.A., ’67; M.A., ’69) and Arlene Ripley (B.A., ’69) also became legacy donors, establishing an endowment in the department. The Ripleys' current donations are earmarked to projects that the department would not be able to fund otherwise.\nRead about the commitment of both couples to this unusual department that combines community-building, diversity, and academic excellence to educate students.\nRead about the Haferniks and Ripleys\nStudent Spotlight | Rising Star: Student Researcher Berenice Baca Achieves Firsts in Sea Star Research\nWith faculty support, scholarship award-winning student Berenice Baca (B.S., Biology, ’23) expanded her undergrad class project into a graduate research project, achieving the seemingly impossible feat of raising the six-rayed sea star Leptasterias specimens for an entire year.\nBerenice and biology professor Sarah Cohen's lab even worked with KQED to feature Leptasterias in a new episode of its science video series “Deep Look,” presented by PBS Digital Studios. (Click over to the article to see the video, which has nearly a quarter-million views on YouTube.)\nRead about Berenice Baca\nGator Athletics\nDonor Spotlight | From Mat to Mission: Keith Spataro’s Journey of Impact\nSF State alum Keith Spataro (B.A., Kinesiology/Physical Education, ’95) carries his Gator pride with him every day. Keith has devoted his career to higher education, building programs, and helping students achieve their potential. His journey is deeply intertwined with his time as a student-athlete at SF State, where he discovered the determination and community spirit that continue to inspire his philanthropy today as a donor to the Spataro Alumni Wrestling Scholarship.\nRead about Keith Spataro\nGraduate College of Education\nStudent Spotlight | Investing in the Future: The Transformative Role of Scholarship Donors in Marci Lapriore’s Journey\nMarci Lapriore, a graduate student in the Educational Leadership doctoral program at SFSU’s Graduate College of Education and a community college educator herself, grew up in a community where poverty was the common thread and the prospect of higher education seemed daunting. She paid for her bachelor's and master's degrees with credit cards and student loans, not knowing what scholarships were.\nMarci has been the recipient of donor-funded scholarships while pursuing her doctorate, and says SF State's donors “feel like extended family.”\nRead about Marci Lapriore\nCollege of Health & Social Sciences\nBecton, Dickinson and Co. (BD) Funds Nursing Fellowship\nLast year, 20 graduate students — including Liliana Ascencio, pictured at left — learned they were each to be awarded a $2,500 fellowship funded by Becton, Dickinson and Company (BD), a supplier of medical products, capabilities, and solutions. Graduate students are often ineligible for certain types of financial aid and have additional costs like parking and equipment needed for clinical internships, which makes this fellowship vitally important. The fellowship fund is the first gift of its kind made by BD to the University.\nRead about the BD Nursing Fellowship\nStudent Spotlight | Juan Carlos Arredondo Earns Top CSU Award, Says “Education Radically Transformed” His Life\nDespite lifelong challenges, Juan Carlos Arredondo (B.A.. ’24) earned a bachelor’s degree in Social Work from SF State last spring, graduating with a 4.0 GPA. He returned to SF State in fall 2024 to pursue a master’s degree in Social Work, to advance his career in supporting migrant communities. On top of that, he earned one of the most prestigious student accolades: the California State University (CSU) awarded Arredondo the Trustees’ Award for Outstanding Achievement, the highest recognition of student achievement granted by the CSU. Arredondo also won the highly competitive Willie L. Brown , Jr. Fellowship, which landed him an internship with San Francisco’s Human Services Agency.\nRead about Juan Carlos Arredondo\nAlum Spotlight | The Power of Support: Megan Rogers’ Story of Resilience\nWhen Megan Rogers (B.S., Public Health, ’24) walked across the stage to receive her degree from SF State, it symbolized resilience, transformation, and the impact of community. A fourth-generation San Franciscan, Megan’s path to SF State was anything but straightforward. When she returned to college decades after initially withdrawing from a UC, Megan discovered a vibrant and supportive community at SF State — a “sanctuary,” she recalls.\nScholarships played a pivotal role in Megan’s ability to thrive at SF State, where she picked up a Studio Art minor, participated in a pilot Art Handling program, and drafted legislative policy.\nRead about Megan Rogers\nStudent Affairs & Enrollment Management\nDonor Spotlight | San Francisco Soul Sisters: Leslie Hughes and Karla Yates Reyff\nLeslie Hughes (B.A., ’66; Credential, ’67), and Karla Yates Reyff (B.A., ’76; M.A., ’81) became fast friends decades ago in kindergarten. Both SF State alumni, they have inspired each other to become devoted donors to the University, especially to the Guardian Scholars Program (GSP), which supports former and current foster kids in their educational journeys at the University. Learn more about their dedication to their alma mater and to each other.\nRead about Leslie Hughes and Karla Yates Reyff\nDonor Spotlight | Michael Bien: Project Rebound Receives Major Gift from Civil Rights Lawyer\nIn a tribute to his late wife Jane E. Kahn, Michel Bien recently donated a major gift to support formerly incarcerated graduate students in SF State’s Project Rebound program. “Jane believed that we need to allow people to bring their best self forward, to give them an opportunity to rejoin society in a meaningful way,” says Michael. “Project Rebound connects to individual human beings in a way that makes a difference in their lives.”\nRead about Michael Bien and Jane Kahn\nDonor Spotlight | Katherine and Gaylen Eslinger Endow a Scholarship for Metro College Success Students\nWhile alumna Katherine Eslinger (B.A., ’84) was raised to value education, getting one did not always come easy for her or her family. Now retired, she and her husband Gaylen have honored Katherine's journey and family through a planned gift to endow the George & Helen Kallianis Memorial Scholarship, which awards an annual scholarship to a Metro student. Metro supports first-generation, low-income, and/or historically underrepresented students.\nRead about the Eslingers\nOther University Advancement Initiatives\nSan Francisco Foundation Announces Scholarship Program for Black Students at SF State\nThe San Francisco Foundation (SFF) has announced a new scholarship program for San Francisco State University students who identify as Black and demonstrate financial need. The San Francisco Foundation Black Excellence Scholarship for SF State will offer $2,500 scholarships to 35 SF State students each year.\n“SF State students are a vibrant part of the Bay Area community,” said Fred Blackwell, CEO of the San Francisco Foundation. “By creating this scholarship program, we are helping to ensure that all SF State students have a fair chance to complete their studies and contribute their talents to an inclusive, thriving Bay Area.”\nLearn about the SFF Black Excellence Scholarship\nSF State Eligible for Cy Pres Awards\nCy pres awards are funds generated by a class action lawsuit that cannot be awarded or are unclaimed. Courts can designate a nonprofit as the recipient of these funds, as long as the nonprofit’s mission furthers the purposes of the underlying causes of action, or promotes justice for all citizens and/or consumers in the State of California. With a focus on academic excellence, community service, and equity and inclusion, San Francisco State University has many programs that would qualify for cy pres awards.\nLearn about Cy Pres awards and SF State\nFor more information about donating to SF State, contact:\nAnjali Billa\n(\nShe/Her/Hers\n)\nAssociate Vice President\nUniversity Development\nanjalibilla@sfsu.edu\n(415) 405-3625\nRead more about Anjali\nRelated News\nSFSU School of Design Students Take Climate Innovation to Global Stage\nSeptember 30, 2025\nAngela Tafur, First Kirkeberg Scholar, Leads with Purpose\nSeptember 30, 2025\nKenneth S. Fong (B.A., ’71; M.A., ’74), Ph.D.: Inspiring Discovery, Innovation, and Opportunity\nSeptember 30, 2025\nDenny Luther ’65: “SF State Did Me Right”\nMay 21, 2025",
    "url": "https://develop.sfsu.edu/2024-SFSU-Impact-Report",
    "domain": "develop.sfsu.edu"
  },
  {
    "source": "https://develop.sfsu.edu/node/294",
    "category": "general",
    "title": "Michael Bien Establishes Scholarship Fund for Project Rebound students in memory of his late wife Jane E. Kahn | University Development",
    "content": "Michael Bien Establishes Scholarship Fund for Project Rebound students in memory of his late wife Jane E. Kahn\nAuthor:\nUniversity Development\nApril 19, 2024\nMichael Bien and the late Jane E. Kahn\nJane E. Kahn (1954-2018) was an illustrious civil rights lawyer who fought tirelessly to improve the rights and well-being of incarcerated people in California and beyond. She often partnered with her husband and fellow attorney Michael Bien, whom she met in her first year as an undergraduate at Brandeis University. Together, they diligently advocated for the protection of the basic and constitutional rights of incarcerated people, resulting in major reforms to the California penal system. Jane’s wins included a landmark 2011 Supreme Court ruling requiring a significant reduction of the overcrowded California prison population to allow systemwide improvements in mental and health care.\nCivil rights attorney Jane E. Kahn (1954-2018)\nAfter a struggle with cancer, Jane passed away at the end of 2018 at the age of 64. Michael continues the couple’s trailblazing work through class action lawsuits that are designed to protect the disenfranchised and make our society more equitable. “Jane had always been interested in law as a vehicle for social change and for improving society,” says Michael. “She cared a lot about improving the lives of incarcerated people and formerly incarcerated people and worked to make sure that they had reentry opportunities and a fair shot. She was a real believer in education as a tool for people to transition back to society and to have the tools to succeed when they come out of prison.” Jane served on the Board of the Prison University Project at San Quentin—now renamed Mount Tamalpais College—and Michael has continued to support the College with gifts in Jane’s memory.\nJane and Michael were dedicated donors to San Francisco State University’s Project Rebound program before she died. Project Rebound is one of the first in the country to provide currently and formerly incarcerated people with alternatives to the revolving door of the criminal justice system. Working inside prisons and on campus, it provides tools and resources to scaffold incarcerated and formerly incarcerated students in pursuing college and graduate degrees. It is very successful, with high graduation rates and low recidivism amongst its students and alumni.\nIn 2023, Michael deepened his commitment to Project Rebound and made a generous gift to provide scholarships for Project Rebound students by establishing the Jane Kahn Endowed Memorial Fund. The fund will further Jane’s legacy by providing formerly incarcerated graduate school students—who are often less eligible for grants and loans than undergraduates—with scholarships.\n“Jane believed that we need to allow people to bring their best self forward, to give them an opportunity to rejoin society in a meaningful way,” says Michael. “Project Rebound connects to individual human beings in a way that makes a difference in their lives. In a broader sense, it helps defeat the myth that people who have been found guilty of doing something bad at one point in their lives should be ‘thrown away.’ People can change, and we have to give them the tools to do that, and to rejoin and be contributing members of society.”\nAfter decades of advocating for systemic change, supporting Project Rebound has a poignancy for Michael. He hopes that his gift will inspire others to give to the program as well. “By supporting these students, we’re showing them that society has not given up on them,” says Michael. “And then they become great messengers in turn to their peers and to people that they can reach, that there is a path forward, you're important people in society and people believe in you.”\n“I hope that others who have the means to give will see this program as deserving of their support. That they will join us in supporting Project Rebound because I know the need is much greater than what we can address with this one gift.”\nFOR MORE INFORMATION ABOUT DONATING TO PROJECT REBOUND:\nContact Anjali Billa, Associate Vice President of University Development, at\nanjalibilla@sfsu.edu\nTags\nProject Rebound\nscholarship\nCivil Rights\nRelated News\nSFSU School of Design Students Take Climate Innovation to Global Stage\nSeptember 30, 2025\nAngela Tafur, First Kirkeberg Scholar, Leads with Purpose\nSeptember 30, 2025\nKenneth S. Fong (B.A., ’71; M.A., ’74), Ph.D.: Inspiring Discovery, Innovation, and Opportunity\nSeptember 30, 2025\nDenny Luther ’65: “SF State Did Me Right”\nMay 21, 2025",
    "url": "https://develop.sfsu.edu/node/294",
    "domain": "develop.sfsu.edu"
  },
  {
    "source": "https://develop.sfsu.edu/Dennis-Luther",
    "category": "general",
    "title": "Denny Luther ’65: “SF State Did Me Right” | University Development",
    "content": "Denny Luther ’65: “SF State Did Me Right”\nAuthor:\nJim Muyo, University Development\nMay 21, 2025\nPhoto Credit:\ncourtesy of the SFSU College of Science & Engineering. Dennis and Barbara Luther at a student research showcase.\nWith a life that has spanned continents, Dennis “Denny” Luther (B.A., Business Administration, ’65) helps students chart their own paths through his family's philanthropic support\nFrom humble beginnings in Placerville, Calif., to the glitz of San Francisco, a two-year stint in the Army in Alaska in the ’60s, living in a van while touring throughout Europe in the ’70s, and finally landing back in San Francisco, the global trek of Dennis “Denny” Luther ’65 is as impressive as his career trajectory and as noble as his desire to help students secure an SFSU education.\nMind you, Denny’s is no ordinary story. Rather, it’s one filled with calculated choices. His decision to attend SFSU ultimately led to a successful career as a computer programmer who, along with his business partner, built, grew, and sold their company. Denny will be the first to tell you that he wasn’t sure how it was going to turn out. In fact, he had doubts that he would even be successful in college and beyond. That success, though, is well proven, and Denny is happy to share the fruits of that success by lending a helping hand to students in need.\nDespite his claim that he was not a great student, Denny applied to and was accepted at San Jose State, Fresno State, and SF State. “I picked San Francisco. That’s where the Giants and Niners were and that’s where you could see a good Broadway play,” he says with a laugh.\nTurned out to be a great decision. Focusing his studies on business and inspired by his success in classes in Statistics and Programming, Denny graduated with a degree in Business Administration with an emphasis in Quantitative Management. From SFSU, Denny was off to his Army stint where he served as editor of the base newspaper in Alaska. He returned to California and was hired as a salesman for Univac as business computing gained wider acceptance.\nSales, however, were not Denny’s strength. Discouraged, he was about to quit Univac, but his manager saw something in him that stood out and Denny was moved over to support businesses that bought or leased Univac computers. This gave Denny the chance to develop his programming skills to the point where he was teaching companies with computers how to program them to maximize their efficiency. Soon, however, the appeal of travelling across Europe captured his attention, so Denny gave up his Univac job.\nAfter living in a van as he traversed through London, Amsterdam, France, Germany, Spain, and Morocco, Denny returned to San Francisco and connected with an SFSU fraternity brother, Tom Luther (no relation), and tended bar in his restaurant a few nights a week. In the upper floors of the building that housed the restaurant, Denny’s future business partner and former IBM salesman Jack Baird was making a living as a computer programming consultant, focusing on getting doctors, dentists, medical groups, and hospitals to sign up for medical and dental billing services. The benefit for the businesses was that with the computerized billing systems, they would get paid in just a week instead of the traditional 30 to 45 days.\nDennis and Barbara Luther\nDennis and Barbara Luther at a student research showcase\nDenny and Baird teamed up and gained more clients to handle electronic billing to Medicare, Medi-Cal, and other large insurers. Their business, Data Systems Group, caught on, and was purchased by Bluebird, which has since been acquired by Experian Healthcare.\nAs Denny says, “My party line is I woke up on January 1, 2013 with money in the bank and time on my hands.” As part of the sale, Denny set up a donor advised fund (DAF). A devout Christian, Denny and his wife Barbara share a passion for tithing and they have chosen, through their DAF,\nto set up a scholarship for SFSU undergraduate students who are majoring in Computer Science, are the first generation in their family to go to college, and who have demonstrated financial need.\n“It breaks my heart,” Denny said when asked about his motivation for setting up the scholarship. “College is so damned expensive, and you can’t go there on your own. I’m hoping that this will help them through school and they’ll have a college degree and one thing will lead to another, and then to another.”\nMuch like one thing led to another and another for Denny, he’s hoping that recipients of the Luther Family Scholarship will find the financial support he and Barbara offer impactful to put them on the course to life-changing learning experiences.\n“It breaks my heart. College is so damned expensive, and you can’t go there on your own. I’m hoping that this will help them through school and they’ll have a college degree and one thing will lead to another, and then to another.\"\n—Dennis Luther (B.A., Business Administration, ’65)\nDenny is grateful that he attended SFSU, something he calls a wonderful experience. “I still have friends from State. I wasn’t sure that I had the wherewithal to be a college student, but then in my sophomore year I got a B in biology and said, ‘Well, I can do this!’”\nNot only could he do it, but Denny did it very well. And, today he stands by the words on the customized donor brick he placed outside of the Nassar Family Gym: “Denny Luther ’65, SF State Did Me Right.”\nDonate to the College of Science & Engineering\nFor more information, contact:\nDavid Fierberg, MNA, CFRE\nExecutive Director of Development\ndfierberg@sfsu.edu\n(415) 405-3966\nRead more about David\nTags\nscholarship\ndonor\nLFCoB\nbusiness\nCoSE\nCompSci\nalum\nRelated News\nSFSU School of Design Students Take Climate Innovation to Global Stage\nSeptember 30, 2025\nAngela Tafur, First Kirkeberg Scholar, Leads with Purpose\nSeptember 30, 2025\nKenneth S. Fong (B.A., ’71; M.A., ’74), Ph.D.: Inspiring Discovery, Innovation, and Opportunity\nSeptember 30, 2025\nDenny Luther ’65: “SF State Did Me Right”\nMay 21, 2025",
    "url": "https://develop.sfsu.edu/Dennis-Luther",
    "domain": "develop.sfsu.edu"
  },
  {
    "source": "https://develop.sfsu.edu/soo-kim",
    "category": "general",
    "title": "Soo Kim | University Development",
    "content": "Soo Kim\n(\nShe/Her/Hers\n)\nSenior Director of Development (Creative Arts)\nCollege of Liberal and Creative Arts\nPhone:\n(415) 338-7113\nEmail:\nsoo.kim@sfsu.edu\nLocation:\n1600 Holloway Ave, ADM 153\nSoo Kim joined San Francisco State University as the Senior Director of Development for the College of Liberal and Creative Arts in 2024. Prior to San Francisco State, Soo served at Swords to Plowshares as the Assistant Director of Fund Management and Communications, where she worked closely with corporate and individual donors to secure critical funds for underserved veterans in the San Francisco Bay Area. Her career also includes positions in various schools and museums, in the United States and abroad,  where she held roles in both faculty and administrative capacities. Soo holds a BA in history from Pomona College, a Master of Arts and PhD candidacy in Art History from UC Berkeley, and a master’s degree in Nonprofit Administration from University of San Francisco’s School of Management.",
    "url": "https://develop.sfsu.edu/soo-kim",
    "domain": "develop.sfsu.edu"
  },
  {
    "source": "https://develop.sfsu.edu/campaign",
    "category": "general",
    "title": "BOLD Thinking Campaign | University Development",
    "content": "Donate to SFSU\nBOLD Thinking Campaign\nBOLD Thinking\nThe Campaign for San Francisco State University\nSimply enrolling in a university is bold for many students at San Francisco State University, who may be the first in their family to attend college, a full-time student with a full-time job, or even former prison inmates. Our\nBOLD Thinking\ncampaign, active from August 2013 through December 2019, raised $156.7 million to provide these students with the support and inspiration they need to join the ranks of our distinguished alumni and lead fulfilling lives.\nAs we renew our commitment to addressing our student body's basic needs, providing up-to-date facilities and buildings on our campus, and maintaining our position as a top university for upward mobility, our philanthropic partnerships will continue to be of primary importance.\nThank you to the 20,000 donors who supported San Francisco State University in the campaign! YOU made the BOLD Thinking campaign a success.\nCampaign duration: August 1, 2013 to December 31, 2019 | Total raised: $156,729,451 | 4% over goal\nGeorge and Judy Marcus\nDefining The Future\nWith a $25 million gift from alumni George & Judy Marcus, the College of Liberal & Creative Arts expanded undergraduate research, hired four new faculty chairs, and enhanced the Creative Writing and Cinema Programs.\nRead About the Marcus Funds' Impact\nDonors to the BOLD Thinking campaign:\nGROUPS $86.2 million: 31% foundations, 5% other groups, 18% corporations\nINDIVIDUALS $70.5 million: 31% alumni/ae, 1% parents & students, 3% faculty and staff, 11% friends\nVisionary Donors\nMore than 20,000 donors contributed to the BOLD Thinking campaign. 9,000 donors to the campaign gave to the University for the first time\n20,000 donors including 9,000 new donors\nLeft to right: Doug Galen, Chris Larsen, Quang Lam, Lyna Lam, President Lynn Mahoney, Ph.D.\nInspiring Innovation\nAlumnus Chris Larsen, wife Lyna Lam, and Rippleworks Foundation's $25 million gifts were one of the largest made with digital assets in history. The donation has brought cutting-edge business programs to the newly-named Lam Family College of Business.\nRead More About the Larsens\nMajor Areas of Campaign Support\n$54.2M Programs Support\n$52M Faculty Support\n$46.1 Student Support\n$4.4M Facilities & Equipment\nA World-Class University\nFrom endowing scholarships to new building construction, the comprehensive BOLD Thinking campaign transformed the entire University\nEnsuring Student Sucess\nA $10M grant from Genentech supports STEM students so they can work in labs and complete their degrees.\nRead about Genentech's Gift\n7 Faculty Chairs Endowed by Campaign\n180 New Scholarships Endowed by Campaign\nTHANK YOU!\nWe thank you and all who have generously supported the BOLD Thinking campaign.\nAs the success of the BOLD Thinking campaign signifies, your passion and generosity have fueled an incredible culture of philanthropic giving at San Francisco State University. As we build a bold new future for the University, we are inspired by the generous support that you and our community of donors have given to our programs and students. Your support and partnership are crucial to our students’ accomplishments and ability to become leaders in their fields. Your investment gives life to their dreams and strengthens their capacity to make progressive change in a dynamic world. We hope you’ll continue to join us in the important work of building a stronger Bay Area and California, one student at a time.\nLynn\nMahoney, Ph.D.\nPresident\nSan Francisco State University\nJeff Jackanicz\nPresident\nSan Francisco State University Foundation\nKimberly\nBrandon\nChair\nSan Francisco State University Foundation\nJohn\nGumas\nCampaign Chair\nSan Francisco State University Foundation\nCampaign Committee\nJohn Gumas (B.S.,'84), Chair\nSheldon Axler, Ph.D.\nDan Corvin (B.A.,'72)\nNancy Fudem\nTrevor Getz, Ph.D.\nMark Johnson, M.F.A.\nAlex MacBride (B.F.A., '75)\nJudy Marcus (B.A.,'72)\nNeda Nobari (B.S.,'84)\nMarsha Rosenbaum (M.A.,'72)\nDavid L. Simon (B.A.,'72)\nCamilla Smith\nYim-Yu Wong, Ph.D.\nDarlene Yee-Melichar, Ed.D., FAGHE, FGS\nLearn more about the BOLD Thinking campaign:\nCampaign Priorities\nLearn about the focus areas of our campaign to raise $150 million to secure San Francisco State University's place as a world-class university.\nExplore Priorities\nCampaign Initiatives\nFrom scholarships to state-of-the-art buildings, our campaign\nis deeply impacting San Francisco State University.\nExplore Initiatives\nWhy Give to SF State?\nContributing to San Francisco State University changes lives and enriches the community through supporting SF States' diverse and resourceful graduates.\nWhy Give?\nCampaign Leadership\nLearn about our Leadership and Campaign Cabinet.\nExplore Leadership\nRelated News\nSFSU School of Design Students Take Climate Innovation to Global Stage\nSeptember 30, 2025\nAngela Tafur, First Kirkeberg Scholar, Leads with Purpose\nSeptember 30, 2025\nKenneth S. Fong (B.A., ’71; M.A., ’74), Ph.D.: Inspiring Discovery, Innovation, and Opportunity\nSeptember 30, 2025\nDenny Luther ’65: “SF State Did Me Right”\nMay 21, 2025",
    "url": "https://develop.sfsu.edu/campaign",
    "domain": "develop.sfsu.edu"
  },
  {
    "source": "https://develop.sfsu.edu/student-affairs-enrollment-management-news",
    "category": "general",
    "title": "Student Affairs & Enrollment Management News | University Development",
    "content": "Student Affairs & Enrollment Management News\nSan Francisco Soul Sisters\nAlumnas Leslie Hughes’ and Karla Yates Reyff’s paths intertwined in life in so many ways it seems they were destined to be friends. Later in life, that friendship was cemented in their becoming donors to SFSU.\nRead about Karla and Leslie\nKathy Kwan: Supporting the Leaders of Tomorrow\nKathy Kwan’s philanthropic foundation, the Eustace-Kwan Family Foundation, donated $1 million to SF State’s Career Services & Leadership Development program, which will help them to offer career services to students and alumni.\nRead About Kathy Kwan & CSLD\nFrom Foster Care to On the Air: Bonta Hill, Warriors Pre/Postgame host & SFSU Guardian Scholars Alum\nHear directly from Bonta how the Guardian Scholars Program empowered him to obtain an SF State degree and grow beyond his wildest dreams in a successful sports radio and television career.\nWatch Bonta Hill's Video\nSF State Builds on Successful Fundraising Campaign for Student Emergencies\n“It takes a village to have helped me, and that's what SF State was able to provide.”\n—Juthaporn Chaloeicheep (B.A., ’20)\nRead About the Hope Crisis Fund\nThe Guardian Scholars Program Helps Students Change the Course of Their Lives\nSF State's Guardian Scholars Program helps young people transition from foster care into college, with a range of programs and support.\nRead About the Guardian Scholars\nDonor Profile: Marianne Bacigalupi\nThe Bacigalupi University Scholarship Endowment supports current & former foster care students in the Guardian Scholars Program. For many students, these awards bring a feeling of belonging and of being cared for in addition to financial support, which often makes Marianne tear up.\nRead About Marianne Bacigalupi\nRelated News\nSFSU School of Design Students Take Climate Innovation to Global Stage\nSeptember 30, 2025\nAngela Tafur, First Kirkeberg Scholar, Leads with Purpose\nSeptember 30, 2025\nKenneth S. Fong (B.A., ’71; M.A., ’74), Ph.D.: Inspiring Discovery, Innovation, and Opportunity\nSeptember 30, 2025\nDenny Luther ’65: “SF State Did Me Right”\nMay 21, 2025",
    "url": "https://develop.sfsu.edu/student-affairs-enrollment-management-news",
    "domain": "develop.sfsu.edu"
  },
  {
    "source": "https://develop.sfsu.edu/node/302",
    "category": "general",
    "title": "San Francisco Soul Sisters | University Development",
    "content": "Alumni Leslie Hughes and Karla Yates Reyff inspire each other to give to SF State\nSan Francisco Soul Sisters\nAbove L to R: Teenage Karla Yates Reyff and Leslie Hughes\nBy Gail Mallimson, University Development\nLeslie Hughes’ and Karla Yates Reyff’s paths intertwined in life in so many ways, it seems they were destined to be friends. The two first met decades ago, in Mrs. Pera’s kindergarten class at St. Vincent de Paul School in San Francisco’s Marina District and were friends through elementary and middle school. After that they lost touch, but over the years they ran into each other in San Francisco and resumed their friendship, which is now tight and steadfast.\nSurprisingly, Leslie and Karla did not meet while attending their alma mater, SF State, because they were there many years apart. Despite this, they have inspired each other to become devoted donors to the University, especially to the Guardian Scholars Program (GSP), which supports former and current foster youth in their educational journeys at the University. Leslie and Karla are now united in their commitment to help foster students who lack a solid support system to graduate and succeed.\nAfter grade school, Leslie attended Lowell High School and then SF State, where she studied Spanish, English, and education – subjects that she was passionate about. She earned a B.A. in 1966 and a Standard Secondary Credential in 1967, which launched her career as a teacher. She taught in San Francisco public schools for 42 years until she retired in 2009. Leslie still lives in San Francisco, just a couple of miles away from the neighborhood she grew up in.\nKarla attended San Jose State University and Indiana University of Pennsylvania after high school but left before receiving a degree from either institution. Eventually, she got divorced and returned to San Francisco with her young son Blaise in tow. As a single mom, her experience at SF State was focused on practicality and expediency, but she knows that the degree she received allowed her to pursue a rewarding career at the U.S. Department of Industrial Relations. “It was a really good job,” says Karla. “And I got the ticket from San Francisco State.”\nAbove L to R: Teenage Leslie Hughes & Karla Yates Reyff\nBoth women made lifelong friends at SF State, and Karla enjoyed an added benefit from her time there. After she retired in 1996, she searched for the opportunity to try something new. A credential she received from a night class in adult education at SF State more than 40 years before allowed her to start a second career in substitute teaching, which she enjoyed and found fulfilling.\nLeslie kept an affiliation with SF State and some faculty members whom she studied with. When she sat down with a lawyer to create an estate trust about 20 years ago, she decided to make a large planned gift to the University. Her development officer introduced her to the Guardian Scholars Program, which impressed her so much that she also became an annual donor.\nWhen Karla’s mother passed away, she inherited some money and started to look for a place to donate her required IRA distribution. Leslie suggested the Guardian Scholars Program to Karla and she immediately fell in love with the program. She has given annually to GSP for several years and has also made a large bequest in her will.\nWhile Karla and Leslie’s legacies will live on at the University through their generous giving and their lasting friendship, they have also passed the baton to Karla’s son Blaise, whom she raised while she was a student at SF State. Blaise graduated with a B.A. in History from SF State in 2004 and is now a high school history teacher at a private high school in San Francisco. “He’s pretty proud of graduating from SF State,” says Karla. “I always told him that he needed a degree for a career, and he loves his job now. So that’s another reason to be grateful to SF State.” “We’ve both gotten so much from the University,” says Leslie. “It feels good to pay it forward.”\nPictured at right:\nLeslie Hughes & Karla Yates Reyff today\nDonate to the Guardian Scholars Program\nFor more information about the Guardian Scholars Program, contact:\nAnjali Billa\n(\nShe/Her/Hers\n)\nAssociate Vice President\nUniversity Development\nanjalibilla@sfsu.edu\n(415) 405-3625\nRead more about Anjali\nRelated News\nSFSU School of Design Students Take Climate Innovation to Global Stage\nSeptember 30, 2025\nAngela Tafur, First Kirkeberg Scholar, Leads with Purpose\nSeptember 30, 2025\nKenneth S. Fong (B.A., ’71; M.A., ’74), Ph.D.: Inspiring Discovery, Innovation, and Opportunity\nSeptember 30, 2025\nDenny Luther ’65: “SF State Did Me Right”\nMay 21, 2025",
    "url": "https://develop.sfsu.edu/node/302",
    "domain": "develop.sfsu.edu"
  },
  {
    "source": "https://develop.sfsu.edu/node/289",
    "category": "general",
    "title": "Cy Pres Fund Allocation to San Francisco State University | University Development",
    "content": "Cy Pres Fund Allocation to San Francisco State University\nCy pres awards are funds generated by a class action lawsuit that cannot be awarded or are unclaimed. Under the cy pres doctrine, courts can designate a nonprofit as the recipient of these funds, as long as the nonprofit’s mission furthers the purposes of the underlying causes of action, or promotes justice for all citizens and/or consumers in the State of California.\nCy pres awards must be directed towards a nonprofit that supports projects benefitting either the class or “similarly situated persons” who were served by the class action lawsuit; an organization that promotes the law consistent with the objectives and purposes of the underlying cause of action; a child advocacy program; or a legal services organization for the indigent.\nWith a focus on academic excellence, community service, and equity and inclusion, San Francisco State University has many programs that would qualify for cy pres awards. This site outlines several of the programs at San Francisco State University that would be suitable awardeesfor cy pres awards. With seven colleges and dozens of areas of study and concentration, the University offers numerous opportunities for funding.\nDOWNLOAD SF STATE CY PRES BROCHURE\nCy Pres Fundable Areas at SF State\nEnvironment\nSatisfies cy pres requirements for the following types of cases: Environmental justice Environmental pollution Toxic & nuclear pollution Climate: greenhouse gas emissions Water: toxic contamination Wildlife destruction Ecosystem destruction Hazardous waste.\nCy Pres Environment\nBusiness & Fraud\nSatisfies cy pres requirements for the following types of cases:\nDefective products; Consumer frau; Unfair business practices; False advertising; Deceptive advertising; Bait and switch marketing; Insurance, mortgage, billing, bank fraud; Breach of contract; Financial reporting; Telemarketing frau; Breach of data privacy; Ponzi scheme; Defective cars; Prize promotion fraud.\nCy Pres Business\nLabor Disputes\nSatisfies cy pres requirements for the following types of cases:  Wage and hour violations; Meal break violation; Illegal procedures regarding layoffs; Misclassification lawsuits; Overtime pay denial; Unpaid business expense; Failure to provide pay stubs; Disability discrimination; FMLA lawsuits; Sexual harassment, Failure to promptly deliver wages; Race discrimination.\nCy Pres Labor\nHealth, Equity, Criminal Justice Disputes\nSatisfies cy pres requirements for the following types of cases:\nUnlawful promotion of prescription drugs by pharmaceutical companies; Unlisted drug side effects that cause significant harm; Death or permanent injury caused by medical devices; Medical tort; Defective products in healthcare; Criminal justice disputes; Defective baby and bath products; Malpractice & medical care.\nCy Pres Health Equity\nFor more information about cy pres funds at SF State, contact:\nAnjali Billa\nAssociate Vice President of University Development & Comprehensive Campaigns\nanjalibilla@sfsu.edu\n(415) 405-3625\nRead more about Anjali\nRelated News\nSFSU School of Design Students Take Climate Innovation to Global Stage\nSeptember 30, 2025\nAngela Tafur, First Kirkeberg Scholar, Leads with Purpose\nSeptember 30, 2025\nKenneth S. Fong (B.A., ’71; M.A., ’74), Ph.D.: Inspiring Discovery, Innovation, and Opportunity\nSeptember 30, 2025\nDenny Luther ’65: “SF State Did Me Right”\nMay 21, 2025",
    "url": "https://develop.sfsu.edu/node/289",
    "domain": "develop.sfsu.edu"
  },
  {
    "source": "https://develop.sfsu.edu/node/131",
    "category": "general",
    "title": "Funding Scholarships | University Development",
    "content": "Donate to Scholarships\nFunding Scholarships\nMarci Lapriore,\na graduate student in the Educational Leadership doctoral program at SFSU’s Graduate College of Education and a community college educator herself, grew up in a community where poverty was the common thread and the prospect of higher education seemed daunting. She has been awarded donor-funded scholarships while pursuing her doctorate, and says SF State's donors “feel like extended family.”\nLearning has been a passion for\nAlfred Ceballos\never since he was a child in East Los Angeles, but he had to work through many challenges before becoming an undergraduate in the Lam Family College of Business. In this two-minute video, he tells his story and discusses the important impact that scholarships have had on his journey as a first-generation college student.\nDonate to Scholarships\nMake a huge impact on a student's life\nReceiving a scholarship can make a huge difference in students' ability to attend SF State and focus on their studies. One $1,000 scholarship provides the same financial support as 54 hours of minimum wage work in San Francisco — approximately the same investment of time needed for a student to take one class.\nThe diverse student body at San Francisco State University includes many students who are the first in their families to attend college. Making the University accessible through scholarships to students in need is a priority for the University. There are many established scholarship funds to support, from athletics to general needs. Many of our scholarships are endowed funds that grow over time to keep pace with the economy and raised tuition and fees.\nIn addition to supporting existing scholarship funds, some donors choose to establish\nnewly named scholarship endowments\n. Currently, a $200,000 endowment will generate enough income to cover most of a student's annual tuition, fees, and some living expenses. $25,000 is the minimum donation to establish any named endowed fund.\nEmail us\nto inquire about creating or funding a scholarship.\nEstablishing a scholarship fund\nThe assistance helps students focus on their studies and reduces the number of outside jobs they work, which can have a negative impact on graduation rates. To attract more scholarships, the University encourages alumni and friends to name these funds. Given students’ needs, the minimum to endow a named scholarship fund is $25,000—however, you may “adopt a student” by naming an annual current fund scholarship with a minimum donation of $5,000.\nPaying your donation over time\nPledged gifts are gratefully accepted and the University will make it easy by sending you pledge reminders at your request. Two-to three-year pledges are encouraged, and up to five years are allowed for $25,000 or more gifts.\nReceive information about your scholarship recipient\nProvided your donation is at the minimum level required to establish a named fund (see above), you will be informed about the recipients of your endowed scholarship. While some donors prefer to remain anonymous, and we work hard to ensure this for those who do, we encourage donors to let us publicize their identities to inspire others. Donors who identify themselves also have the opportunity to learn about the beneficiaries of their generosity. The University has scholarship and donor relations offices that work with scholarship recipients to assist them in personally acknowledging donors.\nDespite supporting himself and putting himself through college, scholarship recipient\nChristian Camaño\nis double-majoring in Computer Science and Mathematics for Advanced Study, with a minor in Anthropology, and is avidly pursuing a future as a researcher in applied mathematics. He’s also very proactive as a mentor and runs an online forum for 400+ San Francisco State math students.\nHassan Malik Russell,\na graduate student in the M.S. Counseling program, speaks about the financial and emotional impact of receiving a scholarship. Hassan currently works at a high school in Richmond, and is obtaining a master's degree to achieve his dream of becoming a school counselor.\nOlivia Gillett\n, recipient of the Scholarship for Diversity in Interior Design & Architecture, speaks about how winning and receiving the award changed her life in this inspiring video.\nErykah Butler\nloves being a special education preschool teacher in Oakland. Her experience as a graduate student in the Graduate College of Education is building on that experience and deepening her commitment to being a teacher. In 2023, she was awarded the Graduate College of Education Scholarship, which has had a big impact on her ability to pursue her educational journey.\nAt the start of his educational journey,\nDaniel Hernandez\njoined his father in working construction to pay tuition and bills. Today, he is an undergraduate in SF State's Bilingual Spanish Journalism program — the first program of its kind at a public university in the U.S. — focusing on producing journalism that is relevant to his community. Recipient of the Otto J. Bos Memorial Scholarship and the Vincent Constantino Scholarship, he no longer works in construction and can focus on his award-winning journalism.\nDonate to Scholarships\nIf you would like to give to scholarships in a particular college or program, please contact:\nAnjali Billa\n(\nShe/Her/Hers\n)\nAssociate Vice President\nUniversity Development\nanjalibilla@sfsu.edu\n(415) 405-3625\nRead more about Anjali\nRelated News\nSFSU School of Design Students Take Climate Innovation to Global Stage\nSeptember 30, 2025\nAngela Tafur, First Kirkeberg Scholar, Leads with Purpose\nSeptember 30, 2025\nKenneth S. Fong (B.A., ’71; M.A., ’74), Ph.D.: Inspiring Discovery, Innovation, and Opportunity\nSeptember 30, 2025\nDenny Luther ’65: “SF State Did Me Right”\nMay 21, 2025",
    "url": "https://develop.sfsu.edu/node/131",
    "domain": "develop.sfsu.edu"
  }
]