[
  {
    "source": "http://faculty.sfsu.edu/~ak",
    "category": "general",
    "title": "Anagha Kulkarni | Faculty Sites",
    "content": "Anagha Kulkarni\n()\nProfessor\nCollege of Science and Engineering\nEmail:\nak@sfsu.edu\nPhone Number:\nLocation:\nAt SF State Since:\n2013\nOffice Hours:\nBio:\nAnagha Kulkarni is a Professor of\nComputer Science\nat\nSan Francisco State University\n. Her research training is in natural language processing (NLP), information retrieval (IR), and machine learning (ML); broadly Artificial Intelligence (AI). She applies her training and experience to investigate multidisciplinary problems in the fields of\npublic health\n,\nwomen's health\n,\nSTEM retention\n, and\nmedicine\n. Dr. Kulkarni holds a PhD in Language Technologies from Carnegie Mellon University, MS in Computer Science from University of Minnesota, Duluth, and Bachelor’s in Computer Engineering from Government College of Engineering, Pune. Dr. Kulkarni’s work has been supported by federal agencies (NSF, NIH), industry partners (Genentech Inc., Diffbot Inc.), and nonprofit organization (Genentech Foundation, SKERI).\nDr. Kulkarni has been a CS educator for over a decade and currently leads the following student, faculty, and professionals training programs that are aimed at increasing retention, diversity and student success:\nAI-STAARS\n,\nBPC-A FLC\n,\nPINC\n,\nGen-PINC\n,\ngSTAR\n, and\ngSTAR Pro\n.\nNews\n(May 2024) The Gen-PINC program received a grant renewal award of $2M from Genentech Foundation to continue and expand the impact of this incredible student training program.\nRead an article about this renewal (and another program renewal)\n.\n(May 2024) Gian Baldonado's poster featuring our work on the TACCIT project received 2nd place at the annual CoSE Student Project Showcase.\n(December 2023) We received a grant renewal award from Genentech Inc. to continue our work on developing curriculum for\nprofessionals in Biotech industry\n.\n(November 2023) The 2023-24 cohort of\nAI-STAARS\nScholars has been selected.\n20 Computer Science Freshmen are receiving $190,414 in scholarships through the AI-STAARS program\nwhich is supported by the NSF S-STEM initiative.\n(October 2023) We received a grant award from Smith-Kettlewell Eye Research Institute to continue our ongoing collaborative work with\nDr. Chandna's lab\non developing computaitonal solutions for problems related to\nHigher Visual Function Deficits and Cerebral Visual Impairment\n.\n(June 2023) We have launched a new professional certificate program titled:\nData Science and Machine Learning for Biotechnology Professionals\n, in collaboration with Genentech Inc. and CPaGE. The first cohort of 24 Genentech employees is currently getting reskilled through this program, and poised to graduate in May 2024!\n(August 2023) 19 SF State students from bio/biochem majors have embarked on our certificate program titled\nData Science and Machine Learning for Biotechnology\nto earn high-demand computational skills.\n(August 2022) We are part of a multi-institutional grant award from NSF that is focussed on developing\nsocially responsive computing curriculum for early CS courses\n.\n(June 2022) Our new biotech certificate program in collaboration with Genentech was featured in\nSFSU News\n. Several graduates from this program are landing amazing summer internships (Genentech, BioMarin, UCSF).\n(May 2022)\nSFSU News featured an article\nabout our tool,\nQMOHI: Quantitative Measures of Online Health Information\n, and its application to a hyper-relevant topic, contraception.\n(February 2022) Our tool,\nQMOHI: Quantitative Measures of Online Health Information\n, was published in\nJMIR Formative Research\n. Our collaborative work that uses QMOHI to study access to contraception information on student health center websites was\npublished recently\n.\nFollow our\nGen-PINC\nstudents' achievements\nhere\n.  We are so proud of you, students!\nThe\nweb-app we have developed for Higher Visual Function Question Inventory\nis out.  This is a joint work with\nChandna Lab at SKERI.\nPublications\n(\n*\nindicates undergraduate and graduate student co-authors.)\nGautam, A., Kulkarni, A., Hug, S., Lehr, J., & Yoon, I. (2024). Socially Responsible Computing in an Introductory Course. To appear in SIGCSE 2024.\nNarins, L.D.*, Scott, A.T.*, Gautam, A., Kulkarni, A., Castanon, M.*, Kao, B.*, Ihorn, S., Siu, Y.T., Mason, J., Blum, A., and and Yoon, I., (2023). Validated Image Caption Rating Dataset. Appears in NeurIPS 2023 Datasets and Benchmarks Track.\nShimizu M.* and Kulkarni A. (2023) Quantitative Measures of Online Health Information (QMOHI): Broadening the impact through improved usability, applicability, and effectiveness. Appears in 2023 IEEE 11th International Conference on Healthcare Informatics (ICHI). IEEE.\nScott, A.T.*, Narins, L.D.*, Kulkarni, A., Castanon, M.*, Kao, B.*, Ihorn, S., Siu, Y.T. and Yoon, I., (2023). Improved Image Caption Rating–Datasets, Game, and Model. In Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing Systems (pp. 1-7).\nIhorn, S., Kulkarni, A., & Yoon, I. (2023). Sustaining and expanding student training and support efforts beyond the NSF support period. In ASEE: American Society for Engineering Education, July 25-28, 2023, Baltimore, MD.\nGautam, A., Kim, M.,  Ihorn, S., Yoon, I., & Kulkarni, A. (2023) Foundational strategies to support students with diverse backgrounds and interests in early programming. In ASEE: American Society for Engineering Education, July 25-28, 2023, Baltimore, MD.\nZimmerman, T., Esquerra, R., Chan, Y.H.M., Kulkarni, A., Adelstein, N., Albright, A., Luo, J., Dean, Z., Ahmed, S., Phillips, M. and Bianco, S., (2023). Teaching Image Processing and Optical Engineering to University Biology Students. The Biophysicist, 4(1), pp.38-57.\nhttps://doi.org/10.35459/tbp.2022.000240\nKakar V, Kulkarni A, Holschuh C, Smirnova A, Modrek S. (2022) Contraception information on the websites of student health centers in the United States.\nContraception. 2022 Jan 25:S0010-7824(22)00011-7\n.\nKulkarni A, Wong M, Belsare T*, Shah R*, Yu Yu D*, Coskun B*, Holschuh C, Kakar V, Modrek S, Smirnova A. (2022) Quantifying the Quality of Web-Based Health Information on Student Health Center Websites Using a Software Tool: Design and Development Study.\nJMIR Form Res 2022;6(2):e32360\nModrek, S., Wong, M., Kulkarni, A., Holschuh, C., & Kakar, V. (2022). Medication abortion: State of information on Student Health Center websites. Journal of American College Health, 1-5.\nhttps://doi.org/10.1080/07448481.2022.2155472\nReyes, R.J., Hosmane, N., Ihorn, S., Johnson, M., Kulkarni, A., Nelson, J., Savvides, M., Ta, D., Yoon, I. and Pennings, P.S., (2022). Ten simple rules for designing and running a computing minor for bio/chem students. PLOS Computational Biology, 18(7), p.e1010202.\nhttps://doi.org/10.1371/journal.pcbi.1010202\nWong M., Ghahghaei S., Chandna A., Kulkarni A. (2021) Scalable Non- invasive Pediatric Cerebral Visual Impairment Screening with the Higher Visual Function Question Inventory (HVFQI). In Proceedings of ACM-BCB (Poster presentation).\nWong M., Laxmeshwar N., Joshi R., Kulkarni A. (2021) Browsing Weighted Interactome Models using GeneDive. In Proceedings of ACM-BCB (Poster presentation).\nKulkarni A., Ihorn S., Tate C., Nelson J., Hosmane N., Adelstein N., Pennings P.,  Jacques T., Yoon I. (2021). Peer Mentoring in an Interdisciplinary Computer Science Training Program: Mentor and Student Perspectives and Lessons Learned. In Proceedings of the American Society for Engineering Education Annual Conference.\nWong M, Previde P*, Cole J*, Thomas B*, Laxmeshwar N*, Mallory E., Lever J., Petkovic D., Altman R., Kulkarni A. (2021)  Search and visualization of gene-drug-disease interactions for pharmacogenomics and precision medicine research using GeneDive. Journal of Biomedical Informatics.\nNayak, K.*, Krishna S.*, Kulkarni A. (2020) Using Text Analytics on Reflective Journaling to Identify Cultural Capitals for STEM Students. In the Proceedings of the 19th IEEE International Conference On Machine Learning And Applications.\nIhorn, S., Yoon, I., & Kulkarni, A. (2020) Student psychological traits and diversity in computer science education. Poster at the annual meeting of the Association for Computing Machinery’s Special Interest Group for Computer Science Education (SIGCSE), Portland, OR.\nLowell M.* Motamarry S.* and Kulkarni A. (2019) ARtPM: Article Retrieval for Precision Medicine. Journal of Biomedical Informatics, 103224.\nCosta J.* and Kulkarni A. (2018) Leveraging Knowledge Graph for Open-domain Question Answering. In the Proceedings of 2018 IEEE International Conference on Web Intelligence. December 2018. Santiago, Chile.\nKulkarni A., Yoon I., Pennings P., Okada K., and Domingo C. (2018) Promoting Diversity in Computing. In the Proceedings of 23rd Annual ACM Conference on Innovation and Technology in Computer Science Education. July 2018. Larnaca, Cyprus.\nYoon I., Pennings P., Kulkarni A., Okada K., and Domingo C. (2018) Promoting Inclusivity in Computing (PINC) via Computing Application Minor. In the Proceedings of Collaborative Network for Engineering and Computing Diversity Conference. April 2018. Arlington, Virginia, USA.\nPithyaachariyakul C.* and Kulkarni A. (2018) Automated Question Answering System for Community-based Questions. In the Proceedings of the Thirty-Second AAAI Conference on Artificial Intelligence, Student Abstract and Poster Program. February 2018. New Orleans, USA.\nPrevide P.*, Thomas B.*, Wong M., Mallory E.*, Petkovic D., Altman R., and Kulkarni A. (2018) GeneDive: A Gene Interaction Search and Visualization Tool to Facilitate Precision Medicine. In the Proceedings of Pacific Symposium on Biocomputing, Vol 23, pp. 590-601. January 2018. Hawaii, USA.\nChuang M.* and Kulkarni A. (2017) Improving Shard Selection for Selective Search. In the Proceedings of the Asia Information Retrieval Societies Conference. November 2017. Jeju, Korea.\nChuang M.* and Kulkarni A. (2017) Balancing Precision and Recall with Selective Search. In the Proceedings of the Annual International Symposium on Information Management and Big Data. September 2017. Lima, Peru.\nPithyaachariyakul C.*, Khvalchik M.*, Kulkarni A. (2017) Automated Question Answering System. In the Proceedings of the Annual International Symposium on Information Management and Big Data. September 2017. Lima, Peru.\nKhvalchik M.*, and Kulkarni A. (2017) Open-domain Non-factoid Question Answering. In the Proceedings of the International Conference on Text, Speech, and Dialogue. August 2017. Prague, Czechia.\nKhvalchik M.*, Pithyaachariyakul C.*, and Kulkarni A. (2017) Answering the Hard Questions. In the Proceedings of the Language, Data, and Knowledge. June 2017, Galway, Ireland.\nWei W.*, Kulkarni A., Wong M. (2017) PF-Words: Biomedical Literature Based Protein Function Search. In the Proceedings of the International Conference on Bioinformatics and Computational Biology. March 2017, Honolulu, HI, USA.\nSaylor B.*, Kulkarni A., Martinez N., and Yoon I. (2016) Optimizing Ecological Sustainability by Integrating Intuition and Machine Learning via Gamification. In the Proceedings of the International Conference on Computational Sustainability. July 2016, Ithaca, NY, USA.\nKhvalchik M.* and Kulkarni A. (2016) San Francisco State University at LiveQA Track of TREC 2016. In the Proceedings of the Twenty-Fifth Text REtrieval Conference (TREC 2016). National Institute of Standards and Technology, special publication.\nChuang M*. and Kulkarni A. (2016) San Francisco State University at Total Recall Track of TREC 2016. In the Proceedings of the Twenty-Fifth Text REtrieval Conference (TREC 2016). National Institute of Standards and Technology, special publication.\nKulkarni A. and Callan J. (2015) Selective Search: Efficient and Effective Search of Large Textual Collections. ACM Transactions on Information Systems, 33(4). ACM. 2015.\nKulkarni A. (2015) ShRkC: Shard Rank Cutoff Prediction for Selective Search. In the Proceedings of the International Symposium on String Processing and Information Retrieval, pages 337—349, Sept 2015, London, UK.\nKulkarni A. (2015) Searching Large Textual Dataset With Limited Computational Resources. In the Proceedings of the Grace Hopper Conference. Oct 2015, Houston, USA.\nBhandari A.*, Klinkhammer J.*, and Kulkarni A. (2014) San Francisco State University at TREC 2014: Clinical Decision Support System Track and Microblog Track. In Proceedings of the Twenty-Third Text REtrieval Conference (TREC 2014). National Institute of Standards and Technology, special publication. 2015.\nKulkarni A. (2013) Efficient and Effective Large-scale Search. Carnegie Mellon Unversity.\nKulkarni A., Tigelaar A., Hiemstra D. and Callan J. (2012) Shard Ranking and Cutoff Estimation for Topically Partitioned Collections: In the Proceedings of the ACM Conference on Information and Knowledge Management, pages 555—564, Oct 2012, Maui, USA.\nKulkarni A., Teevan J., Svore K. and Dumais S. (2012) Creating Temporally Dynamic Web Search Snippets: In the Proceedings of the Poster Session of Annual International ACM SIGIR Conference on Research and Development in Information Retrieval, pages 1045-1046, Aug 2012, Portland, USA.\nKulkarni A., Teevan J., Svore K. and Dumais S. (2011) Understanding Temporal Query Dynamics: In the Proceedings of the ACM International Conference on Web Search and Data Mining, pages 167-176, Feb 2011, Hong Kong.\nKulkarni A. and Callan J. (2010) Document Allocation Policies for Selective Searching of Distributed Indexes: In the Proceedings of the ACM Conference on Information and Knowledge Management, pages 449-458, Oct 2010, Toronto, Canada.\nKulkarni A. and Callan J. (2010) Topic-based Index Partitions for Efficient and Effective Selective Search: In the Proceedings of SIGIR 2010 Workshop on Large-Scale Distributed Information Retrieval, July 2010, Geneva, Switzerland.\nKulkarni A. and Pedersen T. (2008) Name Discrimination and E-mail Clustering Using Unsupervised Clustering of Similar Concepts: Journal of Intelligent Systems (Special Issue: Recent Advances in Knowledge-Based Systems and Their Applications), 17(1-3), 37-50, 2008.\nKulkarni A. and Callan J. (2008) Dictionary Definitions based Homograph Identification using a Generative Hierarchical Model: In the Proceedings of the Association for Computational Linguistics: Human Language Technologies, pages 85-88, June 15-20, Columbus, Ohio, USA.\nKulkarni A., Heilman M., Callan J. and Eskenazi M. (2008) Word Sense Disambiguation for Vocabulary: In the Proceedings of the International Conference on Intelligent Tutoring Systems, pages 500-509, June 23-27, 2008, Montreal, Canada.\nKulkarni A., Callan J. and Eskenazi M. (2007) Dictionary Definitions: The Likes and the Unlikes: In the Proceedings of the SLaTE Workshop on Speech and Language Technology in Education, October 1-3, 2007, Farmington, PA, USA.\nPedersen T. and Kulkarni A. (2007) Unsupervised Discrimination of Person Names in Web Contexts: In the Proceedings of the Conference on Intelligent Text Processing and Computational Linguistics, pages 299-310, February 18-24, 2007, Mexico City.\nPedersen T. and Kulkarni A. (2007) Discovering Identities in Web Contexts with Unsupervised: In the Proceedings IJCAI-2007 Workshop on Analytics for Noisy Unstructured Text Data, January 8, 2007, Hyderabad, India.\nKulkarni A. and Pedersen T. (2006) How many different \"John Smiths\", and who are they?: In the Proceedings of the Student Abstract and Poster Session of the Twenty-First National Conference on Artificial Intelligence, pages 1885-1886, July 16-20, 2006, Boston, Massachusetts.\nPedersen T. and Kulkarni A. (2006) Automatic Cluster Stopping with Criterion Functions and the Gap Statistics: In the Proceedings of the Demonstration Session of the Human Language Technology Conference and the Annual Meeting of the North American Chapter of the Association for Computational Linguistic, pages 276-279, June 6, 2006, New York City.\nPedersen T., Kulkarni A., Angheluta R., Kozareva Z. and Solorio T. (2006) Improving Name Discrimination: A Language Salad Approach: In the Proceedings of the EACL 2006 Workshop on Cross-Language Knowledge Induction, April 3, 2006, Trento, Italy.\nPedersen T. and Kulkarni A. (2006) Selecting the \"Right\" Number of Senses Based on Clustering Criterion Functions: In the Proceedings of the Posters and Demo Program of the European Chapter of the Association for Computational Linguistics, pages 111-114, April 3-7, 2006, Trento, Italy.\nPedersen T., Kulkarni A., Angheluta R., Kozareva Z. and Solorio T. (2006) An Unsupervised Language Independent Method of Name Discrimination Using Second Order Co-Occurrence Vectors: In the Proceedings of the Conference on Intelligent Text Processing and Computational Linguistics, Lecture Notes in Computer Science, Springer, pages 208-222, February 19-25, 2006, Mexico.\nKulkarni A. and Pedersen T. (2005) Name Discrimination and Email Clustering using Unsupervised Clustering and Labeling of Similar Contexts: In Proceedings of the Indian International Conference on Artificial Intelligence, pages 703-722, December 20-22, 2005, Pune, India.\nPedersen T. and Kulkarni A. (2005) Identifying Similar Words and Contexts in Natural Language with SenseClusters: In AAAI ’05: Proceedings of the National Conference on Artificial Intelligence, pages 1694-1695, July 2005, Pittsburgh, PA, USA. (Intelligent Systems Demonstration)\nKulkarni A. and Pedersen T. (2005) SenseClusters: Unsupervised Clustering and Labeling of Similar Contexts: In Proceedings of the Demonstration and Interactive Poster Session of the Annual Meeting of the Association for Computational Linguistics, pages 105-108, June 26, 2005, Ann Arbor.\nKulkarni A. (2005) Unsupervised Discrimination and Labeling of Ambiguous Names: In Proceedings of the Student Research Workshop of the 43rd Annual Meeting of the Association of Computational Linguistics, June 25-30, 2005, Ann Arbor, MI, USA.\nPedersen T., Purandare A., and Kulkarni A. (2005) Name Discrimination by Clustering Similar Contexts: In Proceedings of the Conference on Intelligent Text Processing and Computational Linguistics, Lecture Notes in Computer Science, Springer, pages 226-237, February 13-19, 2005, Mexico.",
    "url": "http://faculty.sfsu.edu/~ak",
    "domain": "faculty.sfsu.edu"
  }
]