[
  {
    "source": "http://comdis.sfsu.edu",
    "category": "general",
    "title": "Welcome | Department of Speech, Language and Hearing Sciences",
    "content": "Our Students\nApply Now\nWelcome\nThe SF State Speech, Language and Hearing Sciences department is based on the following core values: collaboration, compassion, resilience, inquiry and investigation, life-long learning, professionalism, multiculturalism, leadership, mentorship, advocacy and internationalism.  Please see our\nSLHS Department Strategic Plan\nas well as our\nPosition Statement on Supporting Students who are Non-native Speakers of Standard American English\n.  You can also download our\nprevious CD Program Strategic Plan\n.\nFor a shorter, more concise version of our Strategic Plan, please download our\nStrategic Plan Executive Summary\n.\nStudent interns in the SLHS department are placed in internships all over the culturally and linguistically rich San Francisco Bay Area, including urban, suburban and rural schools, private practices, rehabilitation facilities, skilled nursing facilities, acute care medical settings and more. The SLHS department has access to over 20 school districts and 36 medical facilities that are available for placing SF State speech-language pathology interns through established memoranda of understanding (MOUs). Internship experiences range from low-income schools with predominantly English-language learners to rehabilitation centers with war veterans, to clients with voice disorders, to patients with head injuries.\nOffice Hours\nMonday\n– 9 a.m - 5 p.m. remote office hours\nTuesday\n– 10:00 a.m. - 5:00 p.m.\nWednesday\n– 10:00 a.m. - 5:00 p.m.\nThursday\n– 10:00 a.m. - 5:00 p.m.\nFriday\n– 9 a.m. - 5 p.m. remote office hours\nClosed for lunch 12-12:30 p.m.\nContact Information\nEmail\n:\nslhsinfo@sfsu.edu\nPhone\n: (415) 338-1001\nMission\nVision\nAccreditation\nThe Master of Science (M.S.)\neducation program in Speech Language Pathology\n{residential} at San Francisco State University is accredited by the\nCouncil on Academic Accreditation in Audiology and Speech-Language Pathology\nof the American Speech-Language-Hearing Association, 2200 Research Boulevard #310, Rockville, Maryland 20850, 800-498-2071 or 301-296-5700.\nThe current accreditation cycle by CAA is 2025 – 2033.  Our curricula prepare students to meet the standards of ASHA certification, California state licensure in speech-language pathology, and the California Speech-Language Pathology Services Credential. Please visit our\nProspective Students\npage for more information about how to apply to our program.\nMore information about accreditation\nStudent Outcome Data\nApplying to the Master's Program\nSpotlight\nThe Nicholas Certo Speech, Language and Hearing Clinic\nThe SLHS department operates the Nicholas Certo Speech, Language, and Hearing Clinic, offering affordable, high-quality speech-language services to the San Francisco Bay Area. This clinic serves as a training facility for master's-level clinicians, with graduate students conducting screenings, diagnostic evaluations, and therapeutic services for clients of all ages. All services are overseen by a licensed, ASHA-certified faculty member, ensuring professional standards and educational excellence.\nTo learn more, visit our\nClinic\npage.\nQuestions About Applying?\nExplore San Francisco State University's Department of Speech, Language, and Hearing Sciences (SLHS) for detailed guidance on applying to undergraduate and graduate programs. Whether you're seeking prerequisites, post-baccalaureate options, or information about careers in speech-language therapy, this page is a key resource for prospective students. Discover course offerings, application requirements, and career pathways to help you navigate your future with us.\nFor more details, visit our\nProspective Students\npage.\nMeet Our Faculty\nMeet the dedicated faculty and staff of SF State's Department of Speech, Language, and Hearing Sciences. This page provides an overview of the department’s professors, advisors, and clinical instructors who guide students in their academic and professional journeys. Learn about their backgrounds, specialties, and contact information to connect with the experts shaping the future of speech-language pathology and audiology.\nFor more details, visit our\nFaculty and Staff\npage.\nHuge congratulations to John Kim, MS, CCC-SLP!  He passed his qualifying exams as a part of the SFSU-UCB Joint Doctoral Program requirements, and will now move on to his dissertation!!!\nNote: The following PDFs are in the process of being made full accessible. If you have difficulty reading the PDFs, please contact the SLHS Department at\nslhsinfo@sfsu.edu\nor (415) 338-1001.\nFor PDF files, you'll need Adobe Acrobat 5.0 or above to view it. If you need Adobe Acrobat Reader it's available\nfree from Adobe\n.\nSFSU SLHS Strategic Plan Executive Summary 2024.pdf\n70.55 KB",
    "url": "http://comdis.sfsu.edu",
    "domain": "comdis.sfsu.edu"
  },
  {
    "source": "http://comdis.sfsu.edu/auditory-research-lab",
    "category": "general",
    "title": "Auditory Research Lab | Department of Speech, Language and Hearing Sciences",
    "content": "Auditory Research Lab\nWelcome to the SFSU-UCSF Auditory Research Lab at San Francisco State University\nThe work of our laboratory is to study how speech recognition in background noise depends on the frequency and timing elements of the noise in individuals with normal hearing and those with hearing loss.\nMission & Vision\nOur mission is to work with individuals with normal hearing and those with hearing loss in determining which aspects of everyday noise cause the most difficulty with communication.  From the knowledge, the goal is to develop therapy or training strategies to improve speech understanding in noisy environments.\nResearch\nPeople\nPublications/References\nParticipate\nDiversity, Equity & Inclusion\nGoal of the lab\nStudies of the auditory system have revealed that it is designed to suppress unwanted background noise such that pertinent environmental and speech signals can be heard with as much accuracy as possible.  However, speech clarity in noisy environments remains an elusive ability for most listeners.  Thus, the accurate recognition of speech in noisy conditions is an important yet not fully understood task performed by the auditory system even for normal hearing listeners.  Further, even mild hearing loss will create a clear deterioration of this ability. One contention is that signal-in-noise (SIN) processing depends on the type of noise that interferes with the speech recognition ability (Oxenham & Kreft, 2016; Schubotz et al., 2016). Recent studies in humans and animals demonstrate that the specific spectral and temporal composition of background noise is a key-determinant in the efficacy of SIN processing (Hochmuth et al., 2015; Oxenham and Kreft, 2016; Homma et al, 2020). In the current study our goals are two-fold: 1) to determine which temporal and spectral modulations present in the noise impede the SIN processing in normal hearing subjects and 2) to explore the influence of different spectro-temporal noise conditions in mild to moderate hearing loss.\nScientific Background\nDetecting acoustic signals in background noise is an important everyday communicative task.  However, the question of how that is accomplished is not fully understood. Of special significance is that speech recognition ability sharply declines in patients with even mild to moderate hearing loss (Wardenga et al., 2015). More research needs to be conducted to determine what aspects of the composition of background noises may increase or decrease the ability to understand speech in the presence of noises.  Previous studies have shown that different types of noise routinely used in audiological assessments, such as pink noise, ICRA noise, multi-talker babble noise, speech noise or white noise, result in differing abilities to recognize speech depending on the character of the noise (Schubotz et al., 2016; Oxenham and Kreft, 2016). However, what is causing these differences due to the nature of each noise is not well understood.  This study will examine the role of more precisely defined spectrotemporal noise compositions on speech recognition in normal and hearing-impaired listeners. This will be done by using a recently developed and validated sentence-in-noise test (Kollmeier et al., 2015) that has been adapted for many languages, including American English (Kiolbasa, 2015). A main advantage of this test is that it uses a randomized selection from a matrix of key words that create grammatically correct but unpredictable sentences (e.g., Hochmuth et al., 2012; Kollmeier et al., 2015). As a consequence, the Matrix test can be repeated many times without learning effects.\nMarcia Raggio, Lab Co-Director (SFSU)\nmraggio@sfsu.edu\nEducation\n1992 PhD, University of California, San Francisco\n1980 M.S., San Francisco State University\n1978 B.A., San Francisco State University\nResearch Interests\nMarcia Raggio, PhD, FAAA is the co-director of the SFSU Auditory Research Lab.  Her research interests involve aspects of the auditory cortical processing of complex signals with a particular interest in how the brain processes speech and noise simultaneously and which aspects of the noise create greater or lesser difficulty.\nChristoph Schreiner, PhD, MD (UCSF), Lab Co-Director\nChristoph.schreiner@ucsf.edu\nEducation\n1977 PhD, University of Göttingen\n1981 MD, University of Göttingen\n1974, M.A, University of Göttingen\nResearch Interests\nMy main scientific goal over the last few decades has been to better understand the cellular properties of auditory cortical neurons in a range of species from rodents, carnivores to nonhuman primates. While we gained much knowledge of neuronal properties in responses to sounds it has become apparent that studying neurons in isolation is not sufficient to account for the processing principles that govern behavior and perception. An increasingly influential hypothesis in neuroscience posits that `cell ensembles', computational units of the brain that consist of multiple, synchronously activated neurons, are essential to consolidate and mediate complex information processing beyond the aggregate power of single cells. We have established in a series of studies the high degree of synchronization of neuron pairs in the inferior colliculus and the auditory cortex (Atencio and Schreiner, 2013; Atencio et al., 2016). In addition, we have identified the presence and basic properties of multi-neuronal ensembles in the auditory cortex (See et al., 2018) and their distinctions in sound encoding to single neurons (See et al., 2020). My goal is to explore further the structure and function of cell ensembles in the auditory forebrain, in particular regarding information extraction and transmission during basic auditory tasks, such as signal detection and discrimination. These studies are necessary to understand the principles inherent in normal hearing as well potential detriments in hearing ability if the operation of cell ensembles is disrupted, e.g., by altered input due to peripheral auditory impairments, aging, or other neuropathological influences.\nLab Assistant Students\nKeleigh Alderman\nHope David\nAndrew Hoffman\nLamont Lee\nPriscilly Medrano\nRylie Velez\nMartha Vergaray\nBeitel RE, Vollmer M, Raggio MW, Schreiner CE. Behavioral training enhances cortical temporal processing in neonatally deafened juvenile cats. J Neurophysiol. 106(2):944-59, 2011.\nBeitel RE, Snyder RL, Schreiner CE, Raggio MW, Leake PA. Electrical cochlear stimulation in the deaf cat: comparisons between psychophysical and central auditory neuronal thresholds. J Neurophysiol. 83(4):2145-62, 2000.\nHochmuth, S., T. Brand, M. A. Zokoll, F. Z. Castro, N. Wardenga, and B. Kollmeier. A Spanish Matrix Sentence Test for Assessing Speech Reception Thresholds in Noise. International Journal of Audiology 51 (7): 536–544, 2012.\nHochmuth, S., T. Jürgens, T. Brand, and B. Kollmeier.Talker-and Language-Specific Effects on Speech Intelligibility in Noise Assessed with Bilingual Talkers: Which Language is More Robust against Noise and Reverberation? International Journal of Audiology 54 (Suppl. 2): 23–34, 2015.\nHomma NY, Atencio CA, Schreiner CE Plasticity of Multidimensional Receptive Fields in Core Rat Auditory Cortex Directed by Sound Statistics. Neuroscience. 467:150-170, 2021.\nHomma NY, Hullett PW, Atencio CA, Schreiner CE Auditory Cortical Plasticity Dependent on Environmental Noise Statistics. Cell Report 30(13):4445-4458.e5, 2020.\nKiolbasa, A.M. Evaluation of the American English Matrix Test with cochlear implant patients. Dissertation, Washington University School of Medicine, 2015.\nKollmeier, B., A. Warzybok, S. Hochmuth, M. A. Zokoll, V. Uslar, T. Brand, and K. C. Wagener. The Multilingual Matrix Test: Principles, Applications, and Comparison across Languages: A Review. International Journal of Audiology 54 (Suppl. 2): 3–16, 2015.\nOxenham A.J, Kreft H.A. Speech Masking in Normal and Impaired Hearing: Interactions Between Frequency Selectivity and Inherent Temporal Fluctuations in Noise. Adv Exp Med Biol. 894: 125–132, 2016.\nRaggio MW, Schreiner CE. Neuronal responses in cat primary auditory cortex to electrical cochlear stimulation. III. Activation patterns in short- and long-term deafness. J Neurophysiol. 82(6):3506-26, 1999.\nRaggio MW, Schreiner CE. Neuronal responses in cat primary auditory cortex to electrical cochlear stimulation: IV. Activation pattern for sinusoidal stimulation. J Neurophysiol. 89(6):3190-204, 2003.\nSchubotz, W., T. Brand, B. Kollmeier, and S. D. Ewert. 2016. Monaural Speech Intelligibility and Detection in Maskers with Varying Amounts of Spectro-Temporal Speech Features. The Journal of the Acoustical Society of America 140 (1): 524–540, 2016.\nWardenga N, Batsoulis C, Wagener KC, Thomas Brand T, Lenarz T., Maier H, Do you hear the noise? The German matrix sentence test with a fixed noise level in subjects with normal hearing and hearing impairment. Int J Audiol. 54 Suppl 2:71-9. 2015.\nWould you like to participate in our Auditory Research Lab?\nWe are seeking people with Normal Hearing and those with Mild-Moderate Sensorineural Hearing Loss.  Reach out if you are interested in participating or would like to learn more about the work of our lab.\nIf you’re interested in participating in our Auditory Research Lab as a student or subject, please contact Dr. Raggio at\nmraggio@sfsu.edu\n.\nDiversity and Inclusions Statement\nOur lab will equally support and promote multiculturalism, inclusivity, opportunity, respect, and dignity for all of our members, patients, families.",
    "url": "http://comdis.sfsu.edu/auditory-research-lab",
    "domain": "comdis.sfsu.edu"
  },
  {
    "source": "http://comdis.sfsu.edu/contact-us",
    "category": "general",
    "title": "Contact Us | Department of Speech, Language and Hearing Sciences",
    "content": "Contact Us\nSLHS Office Hours:\nMonday – 9 a.m - 5 p.m. remote office hours\nTuesday – 10:00 a.m. - 4:30 p.m. & 5 - 6:30 p.m. remote hours\nWednesday – 10:00 a.m. - 4:30 p.m. & 5 - 6:30 p.m. remote hours\nThursday – 10:00 a.m. - 4:30 p.m. & 5 - 6:30 p.m. remote hours\nFriday – 9 a.m. - 5 p.m. remote office hours\n1600 Holloway Avenue\nBurk Hall, 114\nSan Francisco, CA 94132\nMonday - Friday 9 a.m. to 5 p.m.\nDirections\nPhone: (415) 338-1001\nslhsinfo@sfsu.edu",
    "url": "http://comdis.sfsu.edu/contact-us",
    "domain": "comdis.sfsu.edu"
  },
  {
    "source": "http://comdis.sfsu.edu/accreditation",
    "category": "general",
    "title": "Accreditation | Department of Speech, Language and Hearing Sciences",
    "content": "Accreditation\nThis website has been designed to meet the requirements of accreditation for the Master of Science (M.S.)\neducation program in Speech Language Pathology\n{residential} at San Francisco State University, which is accredited by the\nCouncil on Academic Accreditation in Audiology and Speech-Language Pathology\n(CAA) of the American Speech-Language-Hearing Association (ASHA), 2200 Research Boulevard #310, Rockville, Maryland 20850, 800-498-2071 or 301-296-5700.\nThe current accreditation cycle by CAA is 2025 – 2033. Furthermore, the Speech, Language and Hearing Sciences (SLHS) credential program at San Francisco State is accredited by the\nCalifornia Commission on Teacher Credentialing\n(CCTC).\nThe speech-language pathology curriculum is designed to train competent, culturally sensitive speech-language pathologists who can appreciate and understand the importance of research in clinical practice. In order to accomplish this goal, a multitude of academic and clinical experiences are provided to the students under the direction of skilled instructors, clinical researchers and supervisors both on and off campus. The development of clinical skills requires academic knowledge, the ability to understand and engage in research and a sensitivity to clients' needs, values and cultures.\nThe SLHS department curriculum includes all academic and clinical experiences necessary for American Speech and Hearing Association (ASHA) certification in speech-language pathology, the State of California Speech-Language Pathology Services Credential (SLPSC) and the State of California license to practice speech-language pathology. Students are required to complete all academic courses. The practice of speech-language pathology in the state of California requires a license issued by the Speech-Language Pathology and Audiology Examining Committee Medical Board of California. Exempted settings are public schools and federal facilities. The academic and clinical requirements for the state license are similar to those of ASHA requirements in speech-language pathology.\nThis website serves as a repository and information resource in which our program processes and evidence are organized for each of the six CAA Accreditation Standards.\nProgram Structure\nThe speech-language pathology curriculum is designed to train competent, culturally sensitive speech-language pathologists who can appreciate and understand the importance of research in clinical practice. To accomplish this goal, the students are provided with many academic and clinical experiences under the direction of skilled instructors, clinical researchers and supervisors both on and off campus. Developing clinical skills requires academic knowledge, understanding and engaging in research and sensitivity to clients' needs, values and cultures.\nOur curricula prepare students to meet the standards of American Speech and Hearing Association (ASHA) certification in speech-language pathology, California state licensure in speech-language pathology and the California Speech-Language Pathology Services Credential.\nA total of 35 units of academic courses are required for the Master of Science degree in speech-language pathology. Clinical practica totals six units. Internships totaling 14 units are based on the number of experiences necessary for the student to obtain the 375 clinical clock hours plus 25 observation hours required for ASHA certification and California state licensure. Students should plan to complete these requirements over a minimum of 5 full-time semesters, which includes a summer session. The program is delivered in a face-to-face/residential modality, with modifications available to students in internship placements located outside of the San Francisco Bay Area (during the second year of the program).\nStudents who wish to pursue a specialization may need to take up to 15 additional units, which will result in an additional one to two semesters of graduate work.\nMission\nThe mission of the Department of Speech, Language and Hearing Sciences (SLHS) at San Francisco State University is based on our commitment to antiracism and other forms of anti-discrimination as fundamental to our professions and essential to our preparation of professionals to:\nIdentify, challenge and dismantle institutional, environmental, sociocultural, informational, attitudinal and linguistic barriers to accessible, equitable and transformative communication for individuals with communication disabilities and those whose right of expression are diminished or silenced;\nDevelop, model, disseminate and adopt best practices in the provision of equitable, competent, compassionate and culturally/linguistically responsive services to individuals with communication disabilities across the lifespan and\nTo promote linguistic diversity and recognize the use of different languages and Englishes among our students and professionals as an asset to our academic and professional community.\nVision\nThe vision of the SLHS department at SF State is to be a leader in the field of Speech, Language and Hearing Sciences for advancing critical thinking, equity and scientific rigor. We aspire to meet the challenges of creating pathways for recruiting, supporting, retaining and nurturing highly qualified students and professionals who represent diverse histories, identities, life experiences and perspectives. The SLHS administration, faculty, student body and professional partners represent a community of practice that respects and supports individuals with communication disabilities; that integrates research with clinical practice; that embodies equity; and that fosters an inclusive student/professional community in service of accessible communication for all.\nStrategic Initiatives\nStrategic initiative 1: Acquire, incorporate and develop university resources and address systemic inequities to support a growing department.\nStrategic initiative 2: Refine curriculum to reflect social justice, equity and anti-racism through evidence-based practice and cutting-edge clinical research.\nStrategic initiative 3: Meet the urgent need for diverse racial/ethnic, cultural, disability and socioeconomic representation in our student body and in the field at large, especially traditionally underrepresented and marginalized groups.\nStrategic initiative 4: Deepen the integration of technology into teaching, clinical work and research to support diversifying student body and access equity.\nImprovement Cycle\nIt is integral to the Mission, Vision and Strategic Initiatives of the Department of Speech, Language and Hearing Sciences (SLHS) at San Francisco State University to have cycles of evaluation embedded at key points throughout the academic year.\nThe evaluation process includes:\nA yearly evaluation process\nMultiple sources of data from all stakeholders\nKey student assignments embedded within clinical, academic and professional practice competencies\nTimely provision of student support\nOur improvement cycle is based on tools such as “Plan-Do-Study-Act.” More information about our continuous improvement process can be found on the\nData Kitchen\nwebsite.",
    "url": "http://comdis.sfsu.edu/accreditation",
    "domain": "comdis.sfsu.edu"
  },
  {
    "source": "http://comdis.sfsu.edu/faq",
    "category": "general",
    "title": "Frequently Asked Questions | Department of Speech, Language and Hearing Sciences",
    "content": "Frequently Asked Questions\nThank you for your interest in the Master of Science Degree in Communicative Disorder in the Department of Speech, Language and Hearing Sciences (SLHS). Here you will find information about how to apply to the program, what qualifications are desired, information for those without an undergraduate degree in SLHS, and more. We also welcome you to contact us with additional questions or schedule a meeting with an advisor by emailing\nslhsinfo@sfsu.edu\n, calling (415) 338-1001, or visiting Burk Hall 114.\nWhat is required to earn a bachelor's degree in the Department of Speech, Language and Hearing Sciences?\nThe undergraduate degree, Bachelor of Science in the Department of Speech, Language and Hearing Sciences, requires a minimum of 120 units. Individuals entering the undergraduate SLHS department must hold the status of junior and declare SLHS their major in order to take undergraduate coursework.\nAll undergraduate students, regardless of their intention to become an audiologist or speech-language pathologist, take the same coursework. There are 12 core courses required for the major.\nThe B.A. is not a terminal degree. The Master of Science degree is required for employment as a speech-language pathologist. Graduation from the B.A. program does not guarantee admission into the master's program in speech-language pathology. Entrance into the master's program is highly competitive.\nDo I have to have an undergraduate degree in The Department of Speech, Language and Hearing Sciences (SLHS) to enter the Master's Program? What if I have a degree in another area? Can I take undergraduate SLHS courses through Open University (College of\nStudents who plan to apply to graduate study in preparation for working as a speech-language pathologist must have completed an undergraduate degree in the Department of Speech, Language and Hearing Sciences or the equivalent. We value students with backgrounds from other fields and strongly encourage you to apply after you've completed the equivalent of a bachelor's degree curriculum in SLHS. The SLHS program at SF State does not have a formal post-baccalaureate program, but if there are spots in our undergraduate courses, you're welcome to take those courses through our College of Extended Learning:\nhttps://cel.sfsu.edu/openuniversity/register#restrictions\n.\nIn order to apply for the Master of Science degree in the Department of Speech, Language and Hearing Sciences (SLHS) at San Francisco State University, applicants must posses a bachelor’s degree in the Department of Speech, Language and Hearing Sciences or the equivalent. Those applicants who have completed 12 undergraduate courses, as listed on the\nSFSU SLHS website\n, are considered to have met the equivalent of the bachelor’s degree curriculum.\nFor those who do not possess a bachelor’s degree in the Department of Speech, Language and Hearing Sciences, students must have completed a total of 9 courses in order to enroll in our program as a graduate student. Those courses include the following:\nSLHS 651 Anatomy and Physiology of the Speech Mechanism\nSLHS 655 Language Development\nSLHS 658 Developmental Speech-Language Disabilities\nSLHS 659 Voice and Speech Science\nSLHS 661 Neurolinguistics\nSLHS 664 Clinical Phonetics\nSLHS 652 Audiology\nSLHS 654 Audiometry\nSLHS 657 Aural Rehabilitation\nIn order to\nsubmit\nan application to the SLHS Graduate Program, we require that applicants have completed a minimum of 3 courses from the above list\nprior to\nthe fall semester in which the student is applying. We also require the student to be in the process of completing at least 3\nadditional\ncourses from the list during the fall semester in which the student is submitting an application. Transcripts with final fall semester grades for these 3 courses must be submitted no later than January 15. Lastly, applicants must submit proof of spring enrollment in the\nfinal\n3 courses (completing the 9 course requirement) as a part of the application package, no later than January 15. Remaining prerequisite courses not completed or available to candidates must be completed as part of the graduate program.\nAs mentioned before, the SLHS program at SF State does not have a formal post-baccalaureate program, but if there are spots in our undergraduate courses, you're welcome to take those courses through our College of Extended Learning:\nhttps://cel.sfsu.edu/openuniversity/register#restrictions\n.\nAdditional options for completion of undergraduate courses may be found on the\nAmerican Speech-Language Hearing Association website\n.\nWhat are the requirements to apply to the graduate program?\nThe general requirements for admission to graduate studies at all California State University campuses are in accordance with University regulations as well as Title 5, Chapter 1, Subchapter 3 of the California Code of Regulations. Specifically, a student shall (1) have completed a four-year college course of study and hold an acceptable baccalaureate degree from an institution accredited by a regional accrediting association, or shall have completed equivalent academic preparations as determined by appropriate campus authorities; (2) be in good academic standing at the last college or University attended; (3) have attained a grade point average of at least 3.0 (A = 4.0) in the last 60 semester (90 quarter) units attempted; and (4) satisfactorily meet the professional, personal, scholastic, and other standards for graduate study, including qualifying examinations, as appropriate campus authorities may prescribe. In unusual circumstances, a campus may make exceptions to these criteria.\nEach department and program at the University can set additional admission requirements. The SLHS department requires a departmental application containing the following:\nOfficial transcript\nMinimum three letters of recommendation\nMinimum 3.0 grade point average (GPA) in academic major\nStatement of Purpose\nApplicants will be required to submit evidence of one of the following as a part of their application for admission to our M.S. in the Department of Speech, Language and Hearing Sciences:\nASHA Standard IV-A Requirement:  Upon completion of degree requirements, applicants must have demonstrated knowledge of the biological sciences, physical sciences, statistics, and the social/behavioral sciences, in order to apply for the Certificate of Clinical Competence (CCC) from the American Speech-Language-Hearing Association (ASHA). The SFSU Department of Speech, Language and Hearing Sciences requires that courses in these areas be completed or enrolled in upon application to the graduate program, and must be verified in academic transcripts. Course syllabi may be requested as well to confirm fulfillment of ASHA Standard IV.\nAccording to ASHA’s 2020 Standards, acceptable courses in biological sciences should emphasize a content area related to human or animal sciences (e.g., biology, human anatomy and physiology, neuroanatomy and neurophysiology, human genetics, veterinary science).Acceptable courses in physical sciences must be physics or chemistry. Acceptable courses in social/behavioral sciences should include psychology, sociology, anthropology, or public health. A stand-alone course in statistics is required. Research methodology courses in communication sciences and disorders (CSD) may not be used to satisfy the statistics requirement. A course in biological and physical sciences specifically related to CSD may not be applied for certification purposes to this category unless the course fulfills a university requirement in one of these areas.  Please see details about ASHA Standard IV-A at this link:\nhttps://www.asha.org/certification/course-content-areas-for-slp-standar…\nApplicants who do not meet one of these requirements will be denied admission.\nHow are applicants scored by the review committee?\nAt least two faculty members individually review each applicant's file and rate the applicant using the rubric at this\nlink\n.\nRatings of all faculty members are combined and the applicants are rank ordered.  The top 100 applicants are invited for a group interview.\nAlthough 95% of all applicants meet our minimal acceptable standards, the actual acceptance rate is lower, with GPAs generally at 3.5 or higher, due to limited seats available in our program.  We admit 40 graduate students each fall semester.\nSample SFSU Graduate Admission Application Scoring Rubric from Fall 2021.pdf\n488.47 KB\nWhat are the academic and clinical practica requirements for the M.S. degree in speech-language pathology?\nSan Francisco State University is accredited by the Accrediting Commission for Senior Colleges and Universities of the Western Association of Schools and Colleges (WASC). The Department of Speech, Language and Hearing Sciences is accredited by the Council on Academic Accreditation (CAA) in Speech-Language Pathology, the California Commission on Teacher Credentialing (CCTC), and the National Council for Accreditation of Teacher Education (NCATE).\nThe Master of Science degree program for speech-language pathology includes 38 units of core academic courses and 20 units of clinical practica as recommended/required by the Council for Clinical Certification (CFCC) of the American Speech-Language-Hearing Association (ASHA), the California Board of Medical Quality Assurance, and the California Commission on Teacher Credentialing, respectively.\nHow long will it take to complete the graduate program?\nThe length of the program is related to full-time or part-time enrollment. For example, full-time enrollment is equal to about 15 units each semester. With an undergraduate degree in the Department of Speech, Language and Hearing Sciences, the full-time classified graduate student should complete the requirements for the Master of Science degree in two years (5 semesters).\nHow many students are enrolled in the program and what is the average class size?\nThere are approximately 160 students enrolled in the SLHS department (approximately 80 undergraduate students and 80 graduate students). Our students are representative of the rich diversity of the San Francisco Bay Area. The size of undergraduate courses averages 30 students. The size of graduate courses averages 20 students. On-campus clinics are limited to 6 students per clinical supervisor.\nTell me about the on- and off-campus clinical experiences in speech-language pathology\nA minimum of 400 clock hours in a minimum of three types of clinical settings serving adults and children with a variety of communicative disorders is required by ASHA. Graduate students typically take a clinic every semester of their enrollment in the SLHS department.\nGraduate students are required to complete two clinics on campus, one with a child client and one with an adult client. Off-campus clinical practica occur during the student's seocnd year, with one semester at a puiblic school, and one semester in a hospital/ rehabilitation/ community or other setting.\nWhen I complete the graduate program, what qualifications will I possess?\nDEGREE.\nGraduates of the SLHS department possess a Master of Science degree in the Department of Speech, Language and Hearing Sciences, with a specialty in speech-language pathology.\nASHA CERTIFICATION.\nIn addition, graduates are eligible for the Certificate of Clinical Competence (CCC) in speech-language pathology by the American Speech-Language-Hearing Association (ASHA). Although not a legal requirement, ASHA certification is recognized by employers throughout the nation as a symbol of professional training and competence, particularly for speech-language pathologists. Please visit\nASHA's website\nfor more information.\nASHA requires that, after graduation, the individual undergo a 9-month full-time clinical fellowship (CF) experience, in which he or she is employed while being supervised by someone who holds ASHA certification. Upon completion of the CF experience, coupled with state licensure (see below), the individual can practice independently.\nCALIFORNIA STATE LICENSURE.\nThe practice of speech-language pathology in the state of California requires a license issued by the Speech-Language Pathology and Audiology Board (SLPAB). Exempt settings are public schools and federal agencies. The academic and clinical requirements for state licensure essentially parallel those for ASHA certification. Following graduation, the individual undergoes a Required Professional Experience (RPE) for 9 month's full-time employment while supervised by someone who holds CA state licensure. After the RPE is completed, the individual can practice independently.\nSPEECH-LANGUAGE PATHOLOGY SERVICES CREDENTIAL (SLPSC).\nThe SLPSC is issued by the CA Commission on Teacher Credentialing (CCTC) for individuals intending to practice speech-language pathology in the public schools. Recent legislation allows speech-language pathologists who possess a CA state license to work in the schools as consultants without the SLPSC. Be advised, however, that many school districts are choosing to hire only individuals who hold the SLPSC. Therefore, it is recommended that graduate students complete the requirements for the SLPSC.\nOnce the graduate has completed the requirements for the Speech-Language Pathology Services Credential with or without Special Class Authorization, the credential(s) will be awarded following proof of receipt of the Master of Science degree, a passing score on the Praxis II Speech-Language Pathology Test, and completion of a 36-week, full-time, mentored clinical experience or equivalent supervised practicum.\nWhat are the special areas of expertise and research for the SLHS faculty and advisers?\nIn addition to academic teaching, most full-time SLHS faculty supervise on- and off-campus clinical practica. Faculty who teach a disorder seminar usually are responsible for supervising therapy for the clients with the disorder. SLHS faculty are engaged in scholarly and clinical research activities within faculty-developed research labs. These activities provide a well-rounded mix of academic and reality-based experiences that are shared with the SLHS students.\nThe SLHS department benefits from the academic and clinical expertise of a number of part-time lecturers and supervisors. For more information, visit the\nFaculty and Staff\npage.\nWhat are the costs for the program and what financial support is available?\nInformation regarding tuition (residency requirements, out-of-state tution, etc.) can be accessed at the\nOffice of Student Financial Aide\n.\nA variety of scholarships are opportunities are available within the SLHS department and beyond. For more information, visit the\nSLHS department scholarship information page\n.\nWhen are classes offered and will I be able to work and complete the program?\nAll of the undergraduate and graduate courses in the Department of Speech, Language and Hearing Sciences are offered once per year. The classes are arranged in a yearly sequence so that fall semester courses are prerequisites for spring semester courses. Second year undergraduate/graduate courses require completion of the first year coursework. Therefore, it is not advised to apply to the SLHS department in the spring semester without prior coursework in SLHS.\nAll undergraduate and graduate coursework in the SLHS department is offered in 3 hour blocks, once a week, during the daytime (e.g., 9:30 - 12:15 p.m. or 12:30 - 3:15 p.m.) The average full-time courseload is four classes, so a student's schedule may require them to be on campus all day Monday (2 classes), Tuesday morning (1 class), and Thursday afternoon (1 class), for example. On-campus clinics are offered twice a week in 90-minute blocks, usually in the late afternoon (e.g., 4:00 - 5:30 p.m., or 5:30 - 7:00 p.m.).\nMany of the current students in the SLHS department balance part-time employment and their academic pursuit, but working more than 10 hours a week is not recommended. Taking less than a full-time academic load will lengthen the estimated time required to complete the master's degree. (See #5 & #6 above).\nHow many coursework units in the Department of Speech, Language and Hearing Sciences will I be able to transfer into the program at SFSU?\nAll undergraduate coursework in the Department of Speech, Language and Hearing Sciences taken at other CAA-accredited SLHS programs is transferable.\nA maximum of 6 semester units in graduate coursework in the Department of Speech, Language and Hearing Sciences taken at other CAA-accredited SLHS programs is transferable into the master's program at SFSU.\nCan I take prerequisite courses in the SLHS department as a non-matriculated student?\nWe are currently able to accommodate students who are not in the SLHS department, although we have limited seating and priority is given to SLHS students. You may also want to pursue taking such coursework online. The SFSU SLHS department does not offer online coursework; however, there are other ASHA accredited universities that do. Visit\nEdFind\nfor a current listing of those programs and search for programs in speech-language pathology that have \"distance education availability\".\nHow can I learn more about the SLHS department and San Francisco State University?\nAfter exploring the remainder of this website, you may want to contact the SLHS office (415.338.1001 or\nslhsinfo@sfsu.edu\n) to make an appointment to meet with an adviser. Or you may\ncontact the appropriate SLHS faculty\ndirectly.",
    "url": "http://comdis.sfsu.edu/faq",
    "domain": "comdis.sfsu.edu"
  }
]