[
  {
    "source": "https://fellowships.sfsu.edu/",
    "category": "general",
    "title": "Fellowships Office Programs | Fellowships Office Programs",
    "content": "Fellowships Office Programs\nThe\nFellowships Office\nprovides resources and support to undergraduates, graduate students, and recent alumni interested in applying for nationally competitive and CSU fellowships and awards.\nFellowships Office\nThe\nGraduate Fellowships Hub\noffers the same resources as the Fellowships Office website, but relevant to graduate students only.\nGraduate Fellowships Hub\nThe California State University's\nCalifornia Pre-Doctoral Program\noffers mentoring and funding to undergraduate and graduate students interested in attaining a Ph.D. Funding may be used to visit graduate programs, attend professional conferences, and apply to Ph.D. programs. Pre-Doctoral Scholars may also apply for a fully-funded summer research experience with a top scholar in their field.\nCalifornia Pre-Doctoral Program\nThe California State University's\nChancellor's Doctoral Incentive Program (CDIP)\noffers mentoring, funding for research and conferences to students entering Ph.D. programs, who want to teach in the CSU. CDIP Fellows are also eligible for low-interest, potentially forgivable, loans.\nDoctoral Incentive Program (CDIP)\nSearch the\nFellowships Database\nfor fellowships, research experiences, artist residences, and selected scholarships and might be a good fit for you.\nSearch for Opportunities\nFellowship programs that require students to apply through the campus will have\ncampus deadlines that are earlier than the CSU or national deadline\n. Review\nCampus Deadlines\nto find out if your program requires you to apply through San Francisco State, and if so, by when.\nCampus Deadlines\nEach semester the Fellowships Office offers\ninformation workshops on fellowship programs,\nincluding the\nCalifornia Pre-Doctoral Program\nand the\nFulbright U.S. Student Program\n.\nFellowship Presentations\nEach semester the Fellowships Office offers\nworkshops on special topics in\ngraduate level academic writing\n.\nGraduate Writing Workshops\nLearn about San Francisco State Fellowship Recipients\nMeet Our Fellows\nProfiles of Selected Fellowship Winners by Population\nFlipbooks\nDevelop Your Fellowship Candidacy: Advice for Undergraduates\nRoadmap for Undergraduates\nDevelop Your Fellowship Candidacy: Advice for Graduate Students\nRoadmap for Graduate Students",
    "url": "https://fellowships.sfsu.edu/",
    "domain": "fellowships.sfsu.edu"
  },
  {
    "source": "https://fellowships.sfsu.edu/fellowships-office",
    "category": "general",
    "title": "Fellowships Office | Fellowships Office Programs",
    "content": "Fellowships Office\nFellowships Explained\nSearch for Fellowships\nGraduate Fellowships Hub\nCSU Programs for PhD-Bound Students\nMake an Appointment\nThe Director of the Fellowships Office is available to assist undergraduates, graduate students and recent alumni in applying for nationally competitive fellowships, scholarships and grants, as well as system-wide awards offered by the California State University system. Use our left navigation to\nSearch for Fellowships\n.\nFor graduate-level fellowships only, visit the\nGraduate Fellowships Hub\nwebsite.\nCHANCELLOR'S DOCTORAL INCENTIVE PROGRAM\nThe Fellowships Office also coordinates programs that support CSU students who plan to pursue research doctorates:\nCALIFORNIA PRE-DOCTORAL PROGRAM\nIf you are new to fellowships, see\nFellowships Explained\nto learn about the opportunities fellowships offer, which may include generous funding for graduate studies, research experience and prestigious internships in the U.S. and abroad.\nFor a behind-the-scenes look at what applying for a fellowship is like, review student reflections on “The Writing Wall” where\nApplicants Share Their Experiences\n. Successful fellowship applicants have strong records of academic or artistic achievement, leadership, and public service activities.\nARE YOU READY TO COMPETE FOR A FELLOWSHIP?\nTo assess your current preparation to apply for nationally competitive fellowships, please review these criteria to see if they describe you:\nPreparing to apply well for national fellowships and CSU awards takes planning and sustained effort. Please consult our “Mentoring in a Box” pages, which provide extensive advice and resources on\nBecoming a Strong Candidate\n.\nFeel free to make an appointment to explore the possibility of pursuing a nationally competitive award in your field, or to determine what fellowships might be a good fit for you.\nTo make an appointment, email Dr. Joy Viveros,\nfellows1@sfsu.edu\n. By the morning of the appointment, please submit an online\nIntake Questionnaire\n.\nResources for Applicants\nApplicants Share Their Experiences\nBecoming a Strong Candidate\nMeet Our Fellows\nWorkshops\nCampus Deadlines\nContribute to This Site\nWhy Should You Apply for a Fulbright?\nFulbright Program Video\nQuick Links\nFunding for Admitted Students\nScholarships Search Strategy\nFinancial Aid - Scholarships Search\nStudy Abroad\nFinancing Study Abroad\nTranscripts\nFellowships Office\nDr. Joy Viveros\nDirector\nPhone:\n415\n.\n405.2128\nFax:\n415.405.0340\nReception:\nThe Hub, ADM 254\n1600 Holloway Avenue\nSan Francisco, CA 94132\nFor an appointment, please email Dr. Viveros\nEmail:\nfellows1@sfsu.edu",
    "url": "https://fellowships.sfsu.edu/fellowships-office",
    "domain": "fellowships.sfsu.edu"
  }
]