[
  {
    "source": "https://techgovernance.sfsu.edu/",
    "category": "general",
    "title": "Technology Governance | Technology Governance",
    "content": "SF State Technology Governance\nBridging the gap between technology governance and the university's strategic plan\nTechnology Governance\nOverview\nThe Technology Governance Committee was established at SF State in 2022 with the support of Academic Technology (AT) and Information Technology Services (ITS). As technology continues to play an integral role in every aspect of academia, from administrative processes to classroom instruction, having a robust governance framework ensures the responsible and effective use of technology resources. With clear policies and guidelines in place, the University can safeguard sensitive data, protect against cyber threats, and maintain compliance with relevant regulations. Moreover, technology governance fosters a culture of innovation and collaboration, enabling faculty and staff to explore cutting-edge solutions that enhance the learning experience for our students. By streamlining decision-making processes and promoting best practices, San Francisco State University can stay at the forefront of technological advancements and achieve its mission of providing high-quality education to students while adapting to the dynamic technological landscape and strategic goals.\nHave feedback for IT Governance at SF State?\nShare Feedback (via Qualtrics)\nSurvey: What should the TGC focus on for 24-25?\nCharge\nThe Technology Governance Committee is charged with empowering shared technology governance to identify and advocate for opportunities through leveraging limited campus technology resources in support of University strategic goals.\nPurpose\nTechnology Governance will advise President, Vice President of Academic Affairs/Provost, and the Vice President of Administration and Finance/Chief Financial Officer (CFO) on policies, procedures, and priorities for Information Technology (IT) at San Francisco State University. The goal of Technology Governance is to support and maximize optimal use of IT to achieve the University’s mission, support the community members, and fulfill campus strategic priorities.  The Technology Governance objectives are to:\nRecommend the University’s long-range technology strategy and goals to the Cabinet:\nDevelops criteria for IT projects that will be reviewed within the IT Governance structure. Criteria will ensure alignment with:\nUniversity and divisional strategic planning\nResource availability\nLeadership readiness and support for change\nEstablishes common framework and processes for review of IT investment proposals\nDevelops metrics to measure project progress and health\nConsiderations of feedback from governance subcommittees\nPrioritize large-scale University technology projects\nPromote positive technology engagements for students, faculty, and staff\nApprove changes in policies, standards, and procedures impacting information technology and information security\nApprove major or impactful changes in the delivery of technology solutions and services\nUnderstand initiatives proposed and/or mandated by the Chancellor’s office, which may result in dissemination for in-depth review and analysis to appropriate subcommittee\nConduct reviews of the University’s technology project portfolio and monitors its alignment with University goals, available resources, and acceptable levels of risk\nComposition/Membership\nThe committee is sponsored by the Provost and the CFO. Committee membership is comprised of leadership within campus academic and business divisions as well as representatives from staff and the Associated Student President. Academic Technology and Information Technology Services leadership are Ex Officio members.\nMeetings\nMeetings are held monthly or as needed. Agendas and supporting documentation are provided to committee members in advance to any regularly scheduled meeting.\nPolicy Responsibility\nThe Technology Governance Committee is responsible for approving changes in policies, standards, and procedures pertaining to information technology and information security which also includes adopting frameworks and guidelines that maintain an effective distribution of responsibilities for all enterprise and local technology service providers.",
    "url": "https://techgovernance.sfsu.edu/",
    "domain": "techgovernance.sfsu.edu"
  },
  {
    "source": "https://techgovernance.sfsu.edu/about-techgovernance",
    "category": "general",
    "title": "About | Technology Governance",
    "content": "About\nAcademic Technology (AT) and Information Technology Services (ITS) started collaborating on a campus-wide, shared technology governance body in early 2022. This effort improves alignment between campus technology and the University's strategic priorities in support of student success.\nTechnology Governance Charter.docx\n39.44 KB\nWhy Shared Technology Governance?\nAwareness\nRaise awareness of campus technology portfolio of services and solutions\nIdentify opportunities for collaboration and areas of duplication\nAlignment\nLink investments to strategic priorities\nPrioritize within and across technology portfolios\nManage risk and return\nAccountability\nProvide feedback on technology services and solutions\nMeasure and evaluate outcomes of major projects\nFoster alignment across campus technology providers in support of strategic goals\nEncourage confidence in the process through transparency and consistency\nAdoption\nSponsor projects\nEnable change management strategies\nPromote technology strategies\nShared Technology Governance powerpoint presentation for stakeholders (select the link to download).\nShared Technology Governance.- Building Bridges .pptx\n9.91 MB",
    "url": "https://techgovernance.sfsu.edu/about-techgovernance",
    "domain": "techgovernance.sfsu.edu"
  },
  {
    "source": "https://techgovernance.sfsu.edu/membership",
    "category": "general",
    "title": "Technology Governance Membership | Technology Governance",
    "content": "Technology Governance Membership\nDepartment\nDesignee\nTitle\nEmail\nAcademic Affairs -\nCollege Dean\nCarmen Domingo\nDean, College of Science & Engineering\ncdomingo@sfsu.edu\nAcademic Affairs -\nCollege of Business\nKirill Chernomaz\nAssociate Professor, Economics, College of Business\nkirillch@sfsu.edu\nAcademic Technology\nAndrew Roderick (Ex Officio)\nAssistant Vice President, Academic Technology\nroderick@sfsu.edu\nAcademic Senate\nMichael Goldman\nProfessor, Academic Senate\ngoldman@sfsu.edu\nAssociated Students\nVACANT\nAssociated Students\nCEETL\nAnoshua Chaudhuri\nSenior Director of the Center for Equity and Excellence in Teaching and Learning\nanoshua@sfsu.edu\nStaff Representative\nJennifer Daly\nAdministrative Analyst/Specialist, Dean's Office-LCA\njndaly@sfsu.edu\nAdministration & Finance -\nFinancial Services\nTammie Ridgell\nAssociate Vice President of Financial Services & Executive Director of UCorp, University Corporation\nridgell@sfsu.edu\nAdministration & Finance-\nAudit & Advisory Services\nJesus Garcia\nExecutive Director, Audit & Advisory Services\njgar@sfsu.edu\nUCORP\nRicardo Angeles\nAssociate Director, Administration & Programs , University Corporation\nangelesr@sfsu.edu\nAdministration & Finance -\nBudget & Operations\nElena Stoian\nExecutive Director, Budget & Operations\nestoian@sfsu.edu\nAdministration Finance -\nHousing, Dining, & Conference Services\nJeny V. Patino\nAssociate Vice President, Housing, Dining & Conference Services\njvpatino@sfsu.edu\nAdministration & Finance -\nInformation Technology Services\nNish Malik  (Ex Officio)\nSenior Associate Vice President and Chief Information Officer\nnish@sfsu.edu\nAdministration & Finance -\nProcurement\nSteven Chang\nInterim Director of Procurement & Support Services , Financial Services\nstevenchang@sfsu.edu\nStudent Affairs\nMia Reisweber\nInterim Assistant Dean of Students for Student Engagement\nmreisweber@sfsu.edu\nEnrollment Management\nDenise Peña\nDirector, Financial Aid , Division of Enrollment Mgmt.\ndenisepena@sfsu.edu\nUniversity Advancement\nCraig Relyea\nAVP Strategic Marketing & Communications , Strategic Marketing & Comm\ncrelyea@sfsu.edu",
    "url": "https://techgovernance.sfsu.edu/membership",
    "domain": "techgovernance.sfsu.edu"
  }
]