[
  {
    "source": "https://adminfin.sfsu.edu/incident-management",
    "category": "general",
    "title": "Incident Management | Quality Assurance",
    "content": "Incident Management\nDivision:\nAdministration & Finance\nDepartment:\nInformation Technology Services\nContact Information:\nNish Malik / Senior Associate Vice President (AVP) and Chief Information Officer (CIO) / (415) 405-4105 /\nnish@sfsu.edu\nEffective Date:\nThursday, August 4, 2011\nRevised Date:\nFriday, August 1, 2025\nAuthority:\nISO Domain 16: Incident Management Policy\nObjective:\nThis Policy describes the process used to report events which have the potential to negatively impact the confidentiality, integrity, or availability of SFSU information assets. The reporting process described by this document is part of SFSU's\nstructured approach\n(PDF) to managing incidents.\nStatement:\nThe incident response cycle begins when a suspicious event is observed. Individuals in functional campus areas must either contact their local IT service desk or (in their absence) communicate directly with the\ncentral ITS service desk\nto initiate the\nprocess of handling the incident\n. Depending on the nature of an incident (e.g. burglary, robbery) the end user may also need to contact\nCampus Police\nand file a report.\nInformation security incidents are considered high priority and take precedence over normal SFSU business operations. Managers who supervise functional campus areas must be prepared to manage work priorities, applying their judgment to the scope and impact of an incident in accordance with direction provided by the Information Security Officer.\nThe\nIncident Response Roles and Responsibilities\ndocument (PDF) outlines the duties of the San Francisco State University community regarding the handling of information security incidents with an emphasis on decentralized IT support.\nIn cases where confidential (e.g.\nLevel 1 or Level 2\n) data may be involved, the initial IT point of contact in the corresponding functional campus area must complete an\nIncident Response Form\nand escalate the issue to the ITS Security Team in accordance with the instructions on the Incident Response Form. Isolated, low impact, events that do not put confidential data at risk generally can be handled without using this form.\nImplementation\nResponsibility for implementing this Policy will rest with Information Technology Services (ITS).  Submit any apparent violation of this Policy to the appropriate administrative authority (vice president, dean, director, department, or program chair) or to\nservice@sfsu.edu\n.\nNon-Compliance\nNoncompliance with applicable policies and/or practices may result in suspension of network access privileges. In addition, disciplinary action may be applicable under other University policies, guidelines, implementing procedures, or collective bargaining agreements.",
    "url": "https://adminfin.sfsu.edu/incident-management",
    "domain": "adminfin.sfsu.edu"
  }
]