[
  {
    "source": "https://its.sfsu.edu/buyIT",
    "category": "general",
    "title": "IT Purchasing with BuyIT | Information Technology Services",
    "content": "IT Purchasing with BuyIT\nRelated links\nAbout the BuyIT process\nGo to BuyIT\nIntroduction to BuyIT\nHow to Search for the Pre-Approved BuyIT List\nHow to Request and Track a Product on BuyIT\nHow to Favorite a Product\nSF State BuyIT requests, whether purchased or free, are required to be reviewed for operational support,\naccessibility,\nand\ninformation security\nrequirements prior to acquisition and use.\nAll technology purchases require the BuyIt process to be completed before approving the acquisition. In the case of pre-approved technology, the required BuyIT process has already occurred.\nServices involving an IT component, such as consulting services requiring access to the University systems and/or data, also require a BuyIT process to be completed.\nThe BuyIt process is used to (1) reduce IT costs by leveraging existing technology purchases and contracts; (2) determine whether the technology meets CSU/ campus standards (3) meet compliance requirements with CSU policies and SF State practice directives, e.g., accessibility and IT security which helps to reduce the risk of data breaches resulting in harm to CSU or individuals and any damages arising out of these breaches, and (4) ensure campus resources are available to support the chosen technology.\nThe longtime campus\nTechnology Acquisition Request (TAR)\nprocess was officially relaunched in summer 2024! We are thrilled to introduce a new streamlined interface and process under a new name: BuyIT.\nAs part of a California State University requirement, SF State technology acquisitions, whether purchased or free, must be reviewed prior to acquisition and use for operational support,\naccessibility\n, and\ninformation security\nrequirements.\nAfter an extensive assessment of the process and its requirements, including user focus group feedback sessions, the project team developed an application to support the new IT purchasing process. The new application provides a consistent and simplified experience that is intended to get even easier as we streamline application functionality.\nThis change was part of a year-long collaborative effort between Academic Technology (AT), Information Technology Services (ITS), and other campus partners, including Procurement and the Disability Programs and Resource Center (DPRC). We also benefitted from campus input through focus groups and a staff and faculty user group whose input has been critical to this process improvement initiative.\nHow does IT purchasing work?\nPhase 1: Campus IT Support Team Review\nSupport and service level models needed\nIntegrations\nIT process alignment\nIdentifying potential redundant technology\nIdentification of timing constraints, if applicable\nIf Campus IT Support does not approve the BuyIT request, the acquisition may not proceed until approval is granted.\nPhase 2: Accessible Technology Review\nIf the request does not pass the\naccessibility review\n, the acquisition will not move forward.\nVoluntary Product Accessibility Template (VPAT)\nA VPAT, or\nVoluntary Product Accessibility Template\n, is a self-assessment document completed by a vendor that provides relevant information on how their product or service claims to conform to Accessibility Standards.\nPhase 3: Information Security Team Review\nIndicate additional compensating controls, if needed, and determine if supplemental IT contractual terms are necessary.\nThe acquisition will not move forward if the request does not pass the security review.\nCloud Computing Acquisitions Documents\nThe vendor will be asked to provide one of the following cloud security assessment documents:\nA\ncurrent SSAE-16 SOC 2 Type II\n(or equivalent third-party audited security standard).\nA current\nCloud Security Alliance Consensus Assessment Initiative Questionnaire\n(CSA CAIQ).\nAn industry-recognized current security certification or accreditation (e.g.,\nFedRAMP authorized\n,\nISO270xx\n, etc.).\nThe\nHigher Education Cloud Vendor Assessment Tool\n(HECVAT).\nBased upon the type of data being stored in the cloud solution, only one of the following documents identified in the table below is necessary to meet the requirement.\nType of data by classification and type of documentation\nType\nData Classification\nType of Documentation Accepted\nSoc2 Type2\nISO 270xx Certification\nFEDRAMP Authorized\nHECVAT Full\nHECTVAT Lite\nOther CSA CAIQ, or BuyIt questionnaire\nLevel 1\nx\nLevel 2 – high record count\nx\nLevel 2 – small record count\nx\nPublic\nx\nFor more information, see:\nICSUAM 8065.S003 Information Security Asset Management – Cloud Storage & Services\nRisk Acceptance Form\nA risk acceptance form is used to document non-compliance with CSU policy. The form lists any mitigating controls that are used to reduce the risk, and indicates when the risk will be remediated or next reviewed. An administrator capable of assuming the risk and the Information Security Officer must approve the risk acceptance. The Information Security team can assist with preparing the form.\nContracts\nSupplemental IT contractual terms are CSU boilerplate contractual language that addresses information security risks and can be tailored to the technology acquisition scope. The Information Security team determines if the acquisition requires any supplemental IT contractual terms to protect CSU liability. In most cases, supplemental IT contractual terms are not necessary for hardware purchases. In many cases, they are required for cloud services, software, and other IT services.\nWhen supplemental IT contractual terms are identified for an acquisition, the term numbers should be forwarded to\nProcurement and Support Services\nso they can be included and/or negotiated with the vendor.\nIf you have already submitted a requisition, forward the approved BuyIt request to Procurement and identify the supplemental IT contractual term numbers that were provided in your approved BuyIt request. If you have not submitted a requisition, include the approved BuyIT request and supplemental IT contract term numbers in the comment section when you submit your requisition.\nPhase 4: Completion and Approval\nWhen Phases 1, 2, and 3 have been completed and approved, the requesting department submits a requisition to the Procurement department with the BuyIT approval letter and\nother pertinent information\n. The letter must be submitted at the time of the Pcard reconciliation. Pcard use is only allowed for purchases under the direction of Procurement.",
    "url": "https://its.sfsu.edu/buyIT",
    "domain": "its.sfsu.edu"
  },
  {
    "source": "https://its.sfsu.edu/about",
    "category": "general",
    "title": "About ITS | Information Technology Services",
    "content": "Get Help\nAbout ITS\nOur Mission\nInformation Technology Services advances the mission of SF State by ensuring reliable systems and network infrastructure, excellent technology support, and promoting and assisting technology enablement to support SF State's long-standing commitments to teaching, learning, and social justice.\nOur Goals\nMonitor and implement emerging trends and best practices in the higher education IT industry in order to ensure that SF State remains current as we administer the university's IT applications and infrastructure.\nCoordinate service strategy and portfolio management through the alignment of campus IT project intake and prioritization. These processes support the proactive management of the ITS service portfolio, aligning our community's needs with our overall strategy.\nSet strategy, harmonize processes, and invest in people through a more unified and consistent approach. This will include the integration and coordination of internal governing processes and a university IT governance framework, furthering our mission of enabling data-driven decision making.\nAlign application development functions to further consolidate enterprise application development activities. Our goal is to better leverage our capabilities while allowing for flexibility where most needed to ensure the optimal delivery of IT applications and services.\nAdvance campus information security while focusing on end user experience and services to provide the highest quality user-facing services and their associated enabling functions.\nExplore the Department\nBusiness Services\nResponsible for all administrative and business-oriented aspects of ITS. Visit our Business Services page for all business questions.\nServices Page\nCloud and System Services\nProvides the technology infrastructure and core applications that are key to running campus technology services, maintains the campus servers, data center, on-premises and cloud servers, private and public cloud infrastructure, and supports identity and access management.\nEnterprise Resource Planning and Business Intelligence\nImplements and maintains Enterprise Resource Planning systems such as Campus Solutions (CS), Common Financial Systems (CFS), and Human Resources Management System (HRMS). Supports the University Data Warehouse, Data Mart, and the CFS Data Warehouse.\nInformation Security\nOversees SF State's efforts to protect its computing and information assets and to comply with information-related laws, regulations, and policies. The Information Security Officer (ISO) provides information security training, evaluations, and best practice recommendations for the campus network and community. In addition to these services, the ISO also coordinates the university's information security incident response. To learn more, please visit the Incident Management webpage.\nIncident Management\nNetwork and Telecommunications\nManages the university's network and telecommunications infrastructure, including wireless, wired, remote network access, and telecommunications systems and services.\nProject Management Office (PMO)\nResponsible for intake, assessment, and portfolio management of projects involving ITS resources.\nProject Management Information\nService Management\nA single point of contact for all issues, problems, or questions related to technology services and computing at SF State. One can seek assistance by submitting an online Service Request Ticket via\nemail\n, walk-in, visiting our\nvirtual service desk\n, or through the\nSF State mobile app\n. The Service Desk is located in LIB 360 E in the Library and is open from 8:00 a.m. - 5:00 p.m., Monday through Friday.\nService Request\nWeb and Mobile Applications\nManages the website content management platform and designs and develops campus websites. Provides custom application development services as well as primary development of the\nSF State Mobile App\n. Supports cloud and on-premise applications including document management, student housing, CSU eLearning, and student identity card systems.\nITS Organization",
    "url": "https://its.sfsu.edu/about",
    "domain": "its.sfsu.edu"
  },
  {
    "source": "https://its.sfsu.edu/projects",
    "category": "general",
    "title": "ITS Project Management Office | Information Technology Services",
    "content": "ITS Project Management Office\nThe ITS Project Management Office (PMO) is responsible for intake, assessment, and portfolio management of projects involving ITS resources.\nThe PMO:\nManages enterprise-wide IT projects that support the University's strategic goals and priorities\nProvides transparency and maintains governance of the current project portfolio\nDisseminates relevant information to stakeholders, end users, leadership, and project team members\nEstablishes best practices for project management including project initiation, planning, execution, monitoring and controlling, and project closing\nCollaborates with project teams to understand project scope, timeline, and budget\nView current projects\nView projects currently managed by the ITS PMO\nProject Status\nITS Project Request\nRequest ITS project resources\nProject Request\nProject Management Resources\nView project forms, templates, tools, and terminology\nProject Resources\nQuestions regarding projects? Contact the PMO at\nitspmo@sfsu.edu\n.",
    "url": "https://its.sfsu.edu/projects",
    "domain": "its.sfsu.edu"
  }
]