[
  {
    "source": "https://affordablelearning.sfsu.edu",
    "category": "general",
    "title": "Welcome | Affordable Learning",
    "content": "Welcome\nWelcome to the Affordable Learning community at San Francisco State University, a collaborative effort between Academic Technology, Disability Programs Resource Center (DPRC), J. Paul Leonard Library, and the SF State Bookstore.\nWe know every dollar counts and can make a significant impact in the access to education for our students, as well as faculty scholarship, research and creative activities. We are here to help familiarize our campus community with the wider California State University (CSU)\nAffordable Learning Initiative\n, and encourage faculty across campus to participate in the SF State Affordable Learning Initiative. We provide academic resources and cultivate a learning culture that benefits all members of our campus community.\nCreate a more equitable and inclusive classroom.\nStudents and Courses Impacted!\nFaculty Saved Students\n$8+ Million\nStudents Impacted\n14,153\nCourses Impacted\n116\nAffordable Learning Success Stories\nWebAssign Saves Physics and Astronomy Students $75K+ Per Year\nWe switched to a digital package of a new e-textbook which will come bundled together with access to WebAssign. The cost is $125 for all three semesters of the sequence. If students need to repeat a course, they do not have to pay again.”\n—\nWeining Man and Joseph Barranco\n, Physics & Astronomy\nClick here to watch Weining Man's and Joseph Barranco's video.\nQuick Links\nStudent Resources Hub\nOur Affordable Learning community is here to help provide guidance to students in locating more affordable and high-quality course materials.\nFaculty Resources Hub\nAffordable Learning provides faculty with opportunities to choose from and implement more affordable, contemporary and high-quality course materials.\nResearch/Funding/Grants\nAffordable Instructional Materials (AIM) grants are awarded to faculty who\nadopt, adapt\nand\nauthor\n(\nAAA\n), OER resources for free or low-cost materials.\nZero Cost Course Materials\nSF State is proactively developing solutions through teaching initiatives that encourage faculty adoption of low or zero-cost course materials.",
    "url": "https://affordablelearning.sfsu.edu",
    "domain": "affordablelearning.sfsu.edu"
  }
]