[
  {
    "source": "https://ueap.sfsu.edu/resources-and-information",
    "category": "general",
    "title": "Resources and Information | Undergraduate Education and Academic Planning",
    "content": "Articulation\nResources and Information\nCourse Equivalency for Major Requirements\nIdeally, your transfer courses will satisfy as many lower division requirements as possible. If your Transfer Credit Report doesn’t indicate that a transfer course is directly equivalent to an SF State course requirement for your major, contact a faculty major advisor, who will assist you by processing a course substitution if appropriate. Start by visiting\nthis list of all departments\n, find your major department’s website, and look for information or links regarding advising.\nSF State Bulletin (catalog) - key links for current academic year\nCourse descriptions\nGE courses --\nLower Division\nor\nUpper Division\nCourses satisfying the U.S. History, U.S./CA government, and CA State/Local Government requirements\n[scroll to end of page]\nBulletin - past years\nCredit for standardized external examinations - AP/CLEP/IB credit archive from past Bulletins (catalogs)\n2023-2024\n2022-2023\n2021-2022\n2020-2021\n2019-2020\n2018-2019\n2017-2018\n2016-2017\n*\nSome course credit effective for AP taken in 2016-2017 is not displayed in this document. Refer to 2017-2018 archive link.\n2015-2016\n*\nNew course credit effective for AP taken in 2015-2016 is not displayed in this list. Refer to 2016-2017 archive link.\n2014-2015\n2013-2014\n2012-2013\n2011-2012\n2010-2011 and previous\nCourse syllabi/outlines - SF State department websites\nEarth and Climate Sciences\nEngineering- Civil\nEngineering- Computer\nEngineering- Electrical\nEngineering- Mechanical\nCampus contact list for transfer credit and articulation\nView contact information for campus offices supporting specific aspects of transfer credit\n, such as transcripts, questions about credit evaluations and reports, implementation of published articulation, etc.\nSF State Transfer website\nTransfer students and members of the SF State campus community:\nlearn about the SF State transfer student experience and transfer-supportive resources.\nCalifornia State University (CSU) - General Education\nExecutive Order 1100 -\nGeneral Education Breadth Requirements(link is external)\n( applicable to students enrolling Fall 2021 and after)\nIntersegmental General Education Transfer Curriculum - IGETC - Standards(link is external)\nGuiding Notes for General Education Course Reviewers(link is external)\nPolicy Framework Governing the CSU\nCSU Fully Online Course Program - Available for Cross-Campus Enrollment\nInformation and background:\nFully Online Courses for Concurrent Enrollment(link is external)\n(March 2015)\nCSU Fully Online\nCalifornia Community Colleges\nChancellor's Office - California Community Colleges(link is external)\nPress Release - ADTs, December 2015\nTransfer-related analysis and research\nCSU Institutional Research and Analyses - Student Information Dashboard(link is external)\nCalifornia State Legislative Analyst's Office (link is external)\nCampaign for College Opportunity(link is external)\nRP Group(link is external)\nSF State Office of Institutional Research",
    "url": "https://ueap.sfsu.edu/resources-and-information",
    "domain": "ueap.sfsu.edu"
  },
  {
    "source": "https://ueap.sfsu.edu/dates",
    "category": "general",
    "title": "Dates and Deadlines | Undergraduate Education and Academic Planning",
    "content": "Dates and Deadlines\nWhat would you like to do?\nCourses\nUse the\nCourse Form\nfor course revisions, new course proposals or to add a new topic to a topics course.\nPropose a new course or a new topic for topic courses\nConsult your chair or director about internal deadlines and review processes. These deadlines allow for college review, academic planning review, graduate studies review (for graduate courses), course review committee review, implementation and scheduling before the class schedule goes live.\nAll deadlines are the date by which you must hit the Save and Submit button at the bottom of the course form in CourseLeaf.\nFor courses effective spring 2026 or summer 2026:\nSeptember 5, 2025\nNew courses will be available to schedule after October 6, 2025. Spring schedule expected to publish October 27, 2025. Summer schedule expected to publish March 9, 2026.\nFor courses effective summer 2026 or fall 2026:\nFebruary 6, 2026.\nNew courses will be available to schedule after March 4, 2026. Summer schedule expected to publish March 9, 2026. Fall schedule expected to publish March 30, 2026. Extra steps will be needed to schedule the course for the summer. Consult with department, school or college schedulers to schedule summer courses.\nPropose a GE, SF State Studies or American Institutions designation for a course.\nGE, SF State Studies and American Institutions (AI) designations can be proposed for both new and existing courses. New courses must be approved as a course before starting the GE/SF State Studies/AI review process. Approval of a course as a new course does NOT mean the requested GE, SF State Studies or AI designations were approved.\nGE/SF State Studies/AI cannot be applied to a course until the fall term of the academic year following approval.\nProposals must be fully approved by the BRCC committee by the 3rd week in March to be implemented in the next fall term.\nAll deadlines are the date by which you must hit the Save and Submit button at the bottom of the course form in CourseLeaf.\nFor potential fall 2026 implementation\nFirst time requests and revisions: October 3, 2025\nRevisions only: February 13, 2026\nReview Timeline for the Baccalaureate Requirements Certification Committee (BRCC)\nBRCC reviews proposals in the order received, prioritizing reviews of revised proposals followed by new requests until February 19, 2026.\nBetween February 13, 2026 and March 20, 2026, BRCC reviews only revised proposals to meet deadlines for fall 26 implementation.\nAny proposals submitted after February 13, 2026 will move to the fall 2027 review cycle. That review begins after March 20, 2026 and continues to the end of the academic year.\nRevise a course\nConsult your chair or director about internal deadlines and review processes. These deadlines allow for college review, academic planning review, graduate studies review (for graduate courses) and implementation before the class schedule goes live.\nAll deadlines are the date by which you must hit the Save and Submit button at the bottom of the course form in CourseLeaf.\nFor revisions effective spring 2026 (spring schedule live October 27, 2025)\nOctober 6, 2025\nFor revisions effective summer 2026 (summer schedule live March 9, 2026)\nOctober 6, 2025\nFor revisions effective fall 2026 (fall schedule live March 30, 2026)\nMarch 9, 2026\nRevisions are accepted and reviewed on a rolling basis up to the deadlines.\nPropose a GWAR course.\nFor fall 26 implementation:\nGWAR proposals are accepted and reviewed on a rolling basis until October 3, 2025.\nReview timeline by the Committee on Written English Proficiency\nCWEP begins review in the fall term.October 6, 2025\nAll revisions must be made and approved by CWEP before March 20, 2026.\nCWEP may have capacity to review proposal submitted after October 3rd but before the end of the fall semester.\nProposals submitted once the spring semester begins will be reviewed for a fall 27 implementation.\nPrograms\nUse the\nProgram Form\nto propose or revise programs. Additional templates may be required.\nRevise an existing program's requirements.\nDeadlines refer to the date by which departments or schools must submit the proposal by clicking the Save and Start Workflow button at the bottom of the program form in CourseLeaf. Consult your chair or director about internal deadlines and review processes.\nThe process to revise an existing program’s requirements is the same whether revisions are considered substantive or minor, but only substantive revisions are required to go through the full campus review process.\nSubstantive revisions include changes in the structure of the program, changes to required courses especially if these changes require new courses or significant course revisions, changes in the number of units in the program by 9 units or 20% of the total, whichever is less. If there is any question about whether or not the changes are substantive, assume they are and submit early.\nMinor revisions include changing the courses in current lists or curricular areas, changing the number of units in the program by less than 9 units or fewer than 20% of the total.\nRevisions for fall 2026 Implementation\nProposals for revisions are accepted and reviewed on a rolling basis up to the deadline. Early submissions are strongly encouraged especially for graduate programs which have an extra level of review.\nDeadline: October 10, 2025\nRevisions received by Academic Planning after the deadline may not be reviewed in time for fall 2025 implementation. Deadlines allow for review by Academic Planning with time for any revisions needed before proposals go to the next level of review.\nRevise an existing program's name, type (e.g., B.A. vs. B.S.), modality (e.g., face-to-face vs. online), or support (state-funded vs. self-supported).\nDeadlines refer to the date by which departments or schools must submit the proposal by clicking the Save and Start Workflow button at the bottom of the program form in CourseLeaf. Consult your chair or director about internal deadlines and review processes.\nAdditional information or templates may be required. Contact\nClaude Bartholomew (link sends e-mail)\nfor templates and with questions.\nRevisions for Fall 26 Implementation\nThe deadline for initial submission for fall 26 was in April 2025.\nRevisions to proposals submitted in April 2025:\nSeptember 12, 2025\nRevisions submitted after this date may not be reviewed in time for fall 26 implementation.\nRevisions for Fall 27 Implementation\nReview by Academic Planning will be done before the end of the spring semester. Campus review takes place in fall 26.\nDeadline: April 10, 2026\nRevisions to proposals submitted by April 10, 2026:\nSeptember 11, 2026\nRevisions submitted after this date may not be reviewed in time for fall 27 implementation.\nElevate an existing concentration to a full degree.\nDeadlines refer to the date by which departments or schools must submit the proposal by clicking the Save and Start Workflow button at the bottom of the program form in CourseLeaf. Consult your chair or director about internal deadlines and review processes.\nAdditional templates or information will be required. Contact\nClaude Bartholomew (link sends e-mail)\nfor templates and with questions.\nFall 26 Implementation\nRevisions to proposals submitted in April 2025:\nSeptember 12, 2025\nRevisions submitted after this date may not be reviewed in time for fall 26 implementation.\nFall 27 Implementation\nReview by Academic Planning will be done before the end of the spring semester. Campus review takes place in fall 26.\nDeadline: April 10, 2026\nRevisions to proposals submitted by April 10, 2026:\nSeptember 11, 2026\nRevisions submitted after this date may not be reviewed in time for fall 27 implementation.\nPropose a new degree program.\nProspectus for a new degree program in the CSU Academic Master Plan\nProposing a new full degree program is a two- to three-year process, which begins by submitting a prospectus for campus-level and Chancellor’s Office review and approval by the CSU Board of Trustees (BOT) to be added to the CSU Academic Master Plan (year one of the process).\nContact\nClaude Bartholomew (link sends e-mail)\nfor the prospectus template and with any questions.\nSubmit the prospectus to college by September 1, 2025. Deadline from colleges to academic planning is October 1, 2025.\nTo propose a new degree program already approved by the CSU Board of Trustees\nDeadlines refer to the date by which departments or schools must submit the proposal by clicking the Save and Start Workflow button at the bottom of the program form in CourseLeaf. Consult your chair or director about internal deadlines and review processes.\nAdditional templates or information will be required. Contact\nClaude Bartholomew (link sends e-mail)\nfor templates and with questions. New degrees require full approval on campus (year two of the process), WSCUC notification and review by the Chancellor’s office before the degree can implemented on campus.\nFall 26 Implementation\nThe deadline for fall 26 was in April 2025.\nRevisions to proposals submitted in April 2025:\nSeptember 12, 2025\nRevisions submitted after this date may not be reviewed in time for fall 26 implementation.\nFall 27 Implementation\nReview by Academic Planning will be done before the end of the spring semester. Campus review takes place in fall 26.\nDeadline: April 10, 2026\nRevisions to proposals submitted by April 10, 2026:\nSeptember 11, 2026\nRevisions submitted after this date may not be reviewed in time for fall 27 implementation.\nPropose a new concentration, minor, or certificate, or a self-support version of an existing program.\nDeadlines refer to the date by which departments or schools must submit the proposal by clicking the Save and Start Workflow button at the bottom of the program form in CourseLeaf. Consult your chair or director about internal deadlines and review processes.\nAdditional templates or information will be required. Contact\nClaude Bartholomew (link sends e-mail)\nfor templates and with questions.\nConcentrations, certificates and self-support versions of programs will require notification and/or review by WSCUC and/or the Chancellor’s office before the program can implemented on campus.\nFall 26 Implementation\nThe deadline for fall 26 was in April 2025.\nRevisions to proposals submitted in April 2025:\nSeptember 12, 2025\nRevisions submitted after this date may not be reviewed in time for fall 26 implementation.\nFall 27 Implementation\nReview by Academic Planning will be done before the end of the spring semester.\nCampus review takes place in fall 26.\nDeadline: April 10, 2026\nRevisions to proposals submitted by April 10, 2026:\nSeptember 11, 2026\nRevisions submitted after this date may not be reviewed in time for fall 27 implementation.\nSuspend or discontinue a major, minor or certificate\nDeadlines refer to the date by which departments or schools must submit the proposal by clicking the Save and Start Workflow button at the bottom of the program form in CourseLeaf. Consult your chair or director about internal deadlines and review processes.\nGiven the CSU application cycle, the earliest term for which programs will be suspended or discontinued will be the spring term.\nStudents will be able to apply and be admitted to majors in the fall term.\nStudents admitted in the fall will need to be taught out or advised about other majors available to them.\nDeadline: February 13, 2026 for spring 27 suspension or discontinuance\nBulletin\nUpdate roadmaps\nWe're happy to update roadmaps as needed throughout the year, contact\nClaude Bartholomew (link sends e-mail)\nwith updates.\nAcademic planning updates roadmaps based on course changes every year and after each program proposal is fully approved in collaboration with the department.\nUpdate faculty information\nThe faculty listings in the bulletin are populated from a database within CourseLeaf. Please contact\nClaude Bartholomew (link sends e-mail)\nwith any updates.\nUpdate contact information\nIf a contact changes outside of the bulletin editing cycle, it's important that the bulletin is updated to reflect accurate information for the campus community. Please contact\nClaude Bartholomew (link sends e-mail)\nwith updates.\nDuring the bulletin editing cycle (September-February), those with editing access will be able to update contacts for the coming year.\nUpdate program or department information\nInformation on the \"overview\" tabs for department and program pages can be edited during the regular bulletin editing cycle (September – February). To make changes outside of the editing period, contact\nClaude Bartholomew (link sends e-mail)\n.\nUpdate program requirements\nAny changes to the program requirements must be proposed through the\nCourseLeaf Programs site\nby the deadlines listed in the Programs area above. Please contact\nClaude Bartholomew (link sends e-mail)\nfor assistance.\nUpdate course descriptions\nAll course revisions must be proposed through the\nCourseLeaf Courses site\nby the deadlines listed in the Courses area above. Please contact\nClaude Bartholomew (link sends e-mail)\nfor assistance.",
    "url": "https://ueap.sfsu.edu/dates",
    "domain": "ueap.sfsu.edu"
  },
  {
    "source": "https://ueap.sfsu.edu/exco",
    "category": "general",
    "title": "Experimental College | SF State's Experimental College",
    "content": "Read/Subscribe to  current EXCO newsletter\nExperimental College\nSpring 2026 Applications Open Now! Deadline is Oct. 31.\nMission Statement\nThe Experimental College at San Francisco State University is committed to fostering an inclusive and equitable educational environment where freedom in teaching and learning is paramount. We inspire students and educators to embrace diverse and flexible teaching methods, fostering creativity, experimentation, and critical pedagogy in a supportive environment free from traditional methodologies and censorship.\nWe prioritize creating networks between EXCO participants and respected subject-matter experts in the community. By fostering these partnerships, we enable students and educators to undertake endeavors not traditionally possible within conventional academic structures.\nWe hope that the ideas and concepts developed here will be extended into the broader curriculum. As a college within the college, EXCO acts as a model for the university to integrate these innovative approaches into mainstream academic programs. We strive to push the boundaries of education, nurturing dynamic, inclusive, and relevant curricula that is responsive to the needs of our community.\nOur Goals\nPrimarily, we exist to serve students (or else nothing else matters). We exist to serve the needs of SF State students, this means EXCO is whatever students want it to be, and whatever they make it.\nFirst of all, we must offer student-taught classes; this means we need to recruit and train student teachers for future semesters, according to common pedagogical and progressive education practices.\nWe also need to maintain administrative (and general) approval and support. Generally, we should try to make friends on campus and not enemies…as much as possible.\nWe also ought to affect some lasting change or changes on campus.\nThe experiment of the original experimental college was that students could run a better and more useful school than the administrators could; obviously, this has subjective meaning having to do with the goals of the institution, and one’s idea or goal of education. The original EXCO existed as a College within a College, with the goal of affecting change in the bigger College. EXCO existed to fill a gap in the traditional system.\nWe believe that the institution is here to educate students. Meaning help them progress through curriculum that they want to learn, at their own pace, for their own benefit. Progressive education practices are proven to help accomplish this: students learn faster and retain more when they have hands on experience. When they play an active role in decision-making they are more interested in the material. EXCO teaches students the skills that empower them to learn for themselves long after they leave SF State, and remember what they learned while they were here.\nBy modeling progressive education, we hope to influence the bigger University to adopt our principles. In this way we are also contributing to the progressive education movement.\nTAKE A STUDENT-LED COURSE\nSee a list of our current or upcoming courses\nTEACH AN EXCO COURSE\nComplete our teacher application to teach your own course.",
    "url": "https://ueap.sfsu.edu/exco",
    "domain": "ueap.sfsu.edu"
  },
  {
    "source": "https://ueap.sfsu.edu/exco/node/24",
    "category": "general",
    "title": "EXCO Teacher Application Spring 2026 | SF State's Experimental College",
    "content": "EXCO Teacher Application Spring 2026\nApplication Period open NOW! Deadline is October 31! [link here]\nWhy teach an EXCO course?\nThere are as many different reasons to teach an EXCO class as there are students who have taught or want to teach. Here are just a few:\nDo you want to challenge yourself to develop organizational and leadership skills?\nHave you wanted to pursue in more depth a part of a course you have taken (answer questions that were raised in the course but not answered?).\nIs there a topic you are passionate about and want to learn more?\nIs there a topic you know little about but want to learn more?\nWould you like to belong to a community of learners who want to change society for the better?\nMission Statement\nThe Experimental College at San Francisco State University is committed to fostering an inclusive and equitable educational environment where freedom in teaching and learning is paramount. We inspire students and educators to embrace diverse and flexible teaching methods, fostering creativity, experimentation, and critical pedagogy in a supportive environment free from traditional methodologies and censorship.\nWe prioritize creating networks between EXCO participants and respected subject-matter experts in the community. By fostering these partnerships, we enable students and educators to undertake endeavors not traditionally possible within conventional academic structures.\nWe hope that the ideas and concepts developed here will be extended into the broader curriculum. As a college within the college, EXCO acts as a model for the university to integrate these innovative approaches into mainstream academic programs. We strive to push the boundaries of education, nurturing dynamic, inclusive, and relevant curricula that is responsive to the needs of our community.",
    "url": "https://ueap.sfsu.edu/exco/node/24",
    "domain": "ueap.sfsu.edu"
  },
  {
    "source": "https://ueap.sfsu.edu/exco/exco/teach",
    "category": "general",
    "title": "EXCO Teacher Application Spring 2026 | SF State's Experimental College",
    "content": "EXCO Teacher Application Spring 2026\nApplication Period open NOW! Deadline is October 31! [link here]\nWhy teach an EXCO course?\nThere are as many different reasons to teach an EXCO class as there are students who have taught or want to teach. Here are just a few:\nDo you want to challenge yourself to develop organizational and leadership skills?\nHave you wanted to pursue in more depth a part of a course you have taken (answer questions that were raised in the course but not answered?).\nIs there a topic you are passionate about and want to learn more?\nIs there a topic you know little about but want to learn more?\nWould you like to belong to a community of learners who want to change society for the better?\nMission Statement\nThe Experimental College at San Francisco State University is committed to fostering an inclusive and equitable educational environment where freedom in teaching and learning is paramount. We inspire students and educators to embrace diverse and flexible teaching methods, fostering creativity, experimentation, and critical pedagogy in a supportive environment free from traditional methodologies and censorship.\nWe prioritize creating networks between EXCO participants and respected subject-matter experts in the community. By fostering these partnerships, we enable students and educators to undertake endeavors not traditionally possible within conventional academic structures.\nWe hope that the ideas and concepts developed here will be extended into the broader curriculum. As a college within the college, EXCO acts as a model for the university to integrate these innovative approaches into mainstream academic programs. We strive to push the boundaries of education, nurturing dynamic, inclusive, and relevant curricula that is responsive to the needs of our community.",
    "url": "https://ueap.sfsu.edu/exco/exco/teach",
    "domain": "ueap.sfsu.edu"
  },
  {
    "source": "https://ueap.sfsu.edu/accreditation/wasc",
    "category": "general",
    "title": "WSCUC Institutional Accreditation | Undergraduate Education and Academic Planning",
    "content": "WSCUC Institutional Accreditation\nSan Francisco State University receives institutional accreditation from the Western Association of Schools and Colleges (WASC)\nSenior College and University Commission (WSCUC)\n.  WSCUC is one of six regional associations that accredit public and private schools, colleges, and universities in the United States. WSCUC accredits institutions in California, Hawaii and the Pacific.  WSCUC is recognized by the U.S. Department of Education as certifying institutional eligibility for federal funding in a number of programs, including student access to federal financial aid.\nAbout SF State\nSF State receives 8-year reaccreditation\nCiting SF State’s work to promote student well-being and success through faculty and staff resourcefulness and responsiveness that sets a community standard for support, WSCUC has reaffirmed the accreditation of the University for 8 years.\nWASC Reaccreditation Decision Letter (July 2023)\n2022-23 Reaccreditation Review\nWSCUC Accreditation Team Report May 2023\nSF State WSCUC Institutional Report September 2022\nWASC Mid-Cycle Review Letter\n– October 2018 (PDF)\nWASC Interim Report Action Summary\n– July 2018\nWASC Interim Report\n– June 2018 (PDF)\nReaffirmation process\n2030-31 Reaccreditation Review\nInterim Report Due March 1, 2027\nReaccreditation offsite review fall 2030 and accreditation visit spring 2031\n2022 WSCUC Standards\n2013 Reaccreditation Archive\nWASC Reaccreditation Letter\n– July 2013 (PDF)\nWASC Visiting Team EER Site Visit Final Report\n– March 2013 (PDF)\nStage I - WASC Proposal\nStage II - Student Learning in a Changing University\nStage III - Educational Effectiveness Review\nInventory of Concurrent Accreditation and Key Performance Indicators\n(PDF)\n2001 Reaccreditation Archives",
    "url": "https://ueap.sfsu.edu/accreditation/wasc",
    "domain": "ueap.sfsu.edu"
  },
  {
    "source": "https://ueap.sfsu.edu/exco/courses/courses_F2022",
    "category": "general",
    "title": "EXCO Past Courses Fall 2022 | SF State's Experimental College",
    "content": "EXCO Past Courses Fall 2022\n___________________________________________________________________\nCritical Character Study within Anime\nThis class would be a critical character study of Anime characters throughout various genres of anime. There are very interesting and deep meanings behind characters, from their ideologies, symbolism, and real world inspiration of philosophers. In this class, I would go week by week dissecting these various characters for analysis and to prompt discussions on what these characters truly represent. We would go over philosophy, symbolism, story arcs, relations with real world people, and overall discussions of the anime.\n___________________________________________________________________\nWriting on the Muni\nWrite poetry with creative writing junior Adrian Jose Fernandez, traveling to different locations around San Francisco each class. Learn about the history of our city by actually visiting important locations while also writing poetry on and about what you see. The original Philz, balmy alley, Views of Alcatraz, ocean beach bonfires, the Castro, Haight and Ashbury. Practice writing poetry in an outdoor, group setting in the most evocative city in all of California.\n___________________________________________________________________\nPeace and equality of men and women and the Baha'i Faith\nThis class will introduce students to the Baha'i faith and its principles and its aim for world peace and equality of men and women.\n___________________________________________________________________\nGenealogy - the study and tracing of lines of descent or development\nThis course will be giving students the opportunity to exercise their free will and their freedom to choose. This Genealogy course will help guide students with the process of acquiring insight into one's own character and the understanding of oneself or one's own motives or character. The college experience is to build and strengthen character.\n___________________________________________________________________\nCritical Analysis of Contemporary Cinematic Expression\n\"Critical Analysis of Contemporary Cinematic Expression” is a film course where we will analyze movies from a span of genres. From foreign to musical to independent and B-Movie, we will be viewing movies that touch on social and interpersonal issues of the human experience. This class will be designed to be inclusive and recognize and appreciate all walks of life while being considerate and acknowledging the different lifestyles and belief systems that we may share. While some movies share similar themes, many of them will focus on specific themes that will be discussed as a class after the viewing. Some categories and titles we may start with are Foreign: Portrait of A Lady on Fire (2019) (French); Musical: Cats Don’t Dance (1997); and Psychological: Swallow (2019).\n___________________________________________________________________\nSleep Health and Hygiene\nAs college students, we struggle so much with balancing work, school and our personal lives that oftentimes we forget about the importance of sleep and we tend to experience sleep deprivation. Through this course we will discuss the importance of sleep hygiene, the anatomy of sleep, sleeping disorders and dreaming. We will also use our five senses to explore the best methods to have a healthier sleeping schedule. Additionally, we will explore sleep as a form of self-care and we will practice many techniques that will help us balance our lives and sleep.\n___________________________________________________________________\nPhilosophy and Star Wars\nHave you ever wondered if you would be a Jedi or a Sith? Or whether Darth Vader was destined to become evil? Ever made real life references to Star Wars? This course is for you. The goals of this course are to introduce topics in Philosophy by using Star Wars as the anchor to make deep abstract thought more accessible and relatable in a clearway. From Ethics to Metaphysics to Eastern Philosophy students will ponder the philosophical aspects of Star Wars through thought provoking readings and engaging discussions.\n___________________________________________________________________\nExamining Selected African American Short Stories and Poems\nThis course will explore a few aspects of black literature. This will range readings that deal with black womanhood, religion in black literature, and the idea of \"passing\" in black culture. Through this class students are expected to read the assigned readings for each author, but they are also encouraged to read any other short stories/poems that they may come across during their time in the course. This course offers students a chance to look at the literature of authors they might not have read from before, as well as have an open space to discuss the themes/ideas that they felt were conveyed throughout the readings.\n___________________________________________________________________\nBDSM 101\nBDSM 101 will help students explore their personalities and sexuality in a safe, controlled space. We will dive into the deepest, darkest corners of the BDSM lifestyle and speak with people who have 60+ years of experience within the community. This class will push students to the edge of their comfort zone and encourage them to reevaluate what their boundaries truly are.\n___________________________________________________________________\nSFSU Pre-Med Course\nThis course will help serve as a guide for all the Pre-med students who are interested in pursuing a career in medicine, specifically going to medical school and becoming a doctor. It will give students an insight into the the different specialties in medicine. Students will learn about the life of doctors, nurses, PAs and what their daily routine looks like in a typical day, as well as explore various social issues in the field.\n___________________________________________________________________\nBasic Music Theory\nThough basic, this course delves into advanced concepts such as diatonic harmony--which is a fancy way of saying a group of chords which relate to a specific key. Learning how to achieve the ability to build diatonic harmony is lined out in a step-by-step process of memorizing the 12 tones of Western music and the Major Scale formula. From there, we will venture into chord construction, intervalic relationships, as well as complete small exercises which strengthen and reinforce our knowledge.\n___________________________________________________________________\nLucid Dreaming\nThis course is designed to facilitate understanding of the benefits of Lucid Dreaming while exploring mindful approaches to sleep and dreaming. We take a look at the history and science of Lucid Dreaming and talk about, and practice, a variety of effective induction techniques. We will be learning how to take note of our sleep cycles so that we can identify the most favorable times in the night to attempt lucid dreaming induction. We will be incorporating mindfulness and meditation to help our lucid dreaming training. Students will be able to identify the difference between lucid and non-lucid dreaming, understand how mindfulness helps both nighttime and daytime lucidity, and how to practice lucid dreaming safely, and without sacrificing their restorative sleep. At the end of the course, students will be able to create their own personalized lucid dreaming training program.\n___________________________________________________________________\nAdventures in San Francisco\nSan Francisco has a lot of little-known places. We will explore many of them in this course. Impress your friends with this knowledge.\n___________________________________________________________________\nIntroduction to New Queer Cinema\nThis course will give a broad overview of New Queer Cinema (NQC)—1990s independent queer film. We will discuss the social and political contexts from which the genre emerged (the AIDS epidemic, Reagan’s administration), seminal films, NQC in international contexts, and the influence of NQC on contemporary queer film. The course will include films by key NQC filmmakers Cheryl Dunye, Gregg Araki, Gus Van Sant, and others.\n___________________________________________________________________\n[Writer's Workshop]\nThis course will develop my own writing through helping others develop theirs. I also hope to foster a comfortable environment that will help students have an easier time with sharing their work in class.\n___________________________________________________________________",
    "url": "https://ueap.sfsu.edu/exco/courses/courses_F2022",
    "domain": "ueap.sfsu.edu"
  },
  {
    "source": "https://ueap.sfsu.edu/GE_Fall_2025/Front_Page_GE_CEaLO",
    "category": "general",
    "title": "General Education Fall 2025 and Beyond | Undergraduate Education and Academic Planning",
    "content": "General Education Fall 2025 and Beyond\nGeneral Education Course Expectations and Learning Outcomes\nSF State Studies Course Expectations and Learning Outcomes\nAmerican Institutions Course Expectations and Learning Outcomes\nWhat changes were made to General Education (GE) and why?\nThe GE program was revised across the CSU system to reduce the number of GE units from 48 to 43, effective fall 25. This change was made to align the freshman admit GE pattern with the  Cal-GETC transfer student pathway. Cal-GETC defines the lower-division GE requirements for students at community colleges for either the CSU or the UC system.\nAt the lower-division, the GE requirement for life-long learning and development (area E) was removed from GE, and the requirement in Arts and Humanities (C1 and C2) was reduced from 9 units at the lower-division to 6 units. Students will still take one course in the Arts and one course in the Humanities. The lower-division Physical and Biology Life Sciences requirement was changed from a 6 - 7 unit requirement to a 7 unit requirement.\nAt the upper-division, students still take one course in Arts and Humanities, one course in Behavioral and Social Sciences and one course in either Physical/ Biological Sciences or Mathematical Concepts/Quantitative Reasoning.\nAdditionally, the course learning outcomes for GE and SF State Studies were changed for SFSU courses. The learning outcomes are not mandated by the CSU but are designed by SFSU faculty. Requests to have courses meet GE, SF State Studies, or American Institutions requirements must address how learning outcomes are taught and assessed in the course.\nWhat are the new GE areas and labels?\nAll of the GE labels and many of the area names were changed. The table below summarizes the changes:\nCurrent GE Areas and Labels\nNew GE Areas and Labels Effective Fall 25\nRequirements Effective Fall 25\nA1: Oral Communication\n1C: Oral Communication\n1 course, 3 units\nA2: Written English Communication\n1A: English Composition\n1 course, 3 units\nA3: Critical Thinking\n1B: Critical Thinking\n1 course, 3 units\nB1: Physical Science\n5A: Physical Science\n1 course, 3 units\nB2: Life Science\n5B: Biological Science\n1 course, 3 units\nB3: Laboratory Science\n5C: Laboratory (see note below)\n1 course, 1 unit\nB4: Quantitative Reasoning\n2: Mathematical Concepts and Quantitative Reasoning\n1 course, 3 units\nC1: Arts\n3A: Arts\n1 course, 3 units\nC2: Humanities\n3B: Humanities\n1 course, 3 units\nC1 Arts or C2 Humanities\n-\nRemoved from GE\nD1: Social Sciences\nD2: US History\n4: Social and Behavioral Sciences (see note below)\n2 courses, 6 units\nE: Lifelong Learning and Development\n-\nRemoved from GE\nF: Ethnic Studies\n6: Ethnic Studies\n1 course, 3 units\nUD-B: Upper-Division Physical and/or Life Sciences\n2UD: Upper-division Mathematical Concepts/Quantitative Reasoning\nor\n5UD: Upper-division Science\n1 course, 3 units\nUD-C: Upper-Division Arts and/or Humanities\n3UD: Upper-division Arts or Humanities\n1 course, 3 units\nUD-D: Upper-Division Social Sciences\n4UD: Upper-Division Social and Behavioral Sciences\n1 course, 3 units\nArea 5C note: Area 5C courses must be associated with an area 5A or 5B lecture. The lab can either be a standalone 1 unit course with a 5A or 5B lecture pre- or co-requisite, or the lab and lecture can be a single 4 unit course (3 units lecture, 1 unit laboratory).\nArea 4 Note: Students must take area 4 courses from at least two different departments or with two different subjects. Students admitted as freshmen will take one lower division area 4 course that also meets the US History requirement.\nWhat’s the impact of these GE changes on continuing students?\nContinuing students will see GE and SF State Studies areas in their degree progress reports (DPRs) with the pre-fall 2025 areas and labels. They will continue to be able to search for courses in the online class schedule using old labels and see lists of courses in the degree planner under the those labels. They should consult the front page of their degree progress report to view their GE bulletin year. In addition to using the online class schedule search, they can also reference the bulletin to find courses that meet GE for their bulletin year.\nWith the removal of area E from GE and the reduction of area C from three courses to two, some continuing students received a waiver for those requirements effective fall 25. Specifically, any active student in spring 25 who had not completed an area E course and who was not enrolled in an area E course in spring 25 had that requirement waived in their DPR. Similarly, a third area C course was waived for some continuing students to effectively limit the area C requirement to one C1 course and one C2 course. Students who have completed two or more courses in just one area of C did not receive a waiver because they still need to complete one course in the other area of C. Students who receive a waiver will see a note about it in the GE area in their DPR.\nWhy were GE and SF State Studies learning outcomes changed at SFSU?\nWith the change in the GE labels, this seemed like a good time to evaluate the certification and recertification work that has been going on since the last revisions to GE in 2014. One area of concern was the very long review time needed to get a course certified in GE. The faculty committee doing these reviews found the learning outcomes put in place in 2014 to be complicated, unclear, and, in some cases, not assessable. This made it difficult for proposers to know how to respond to prompts and for reviewers to evaluate their responses, resulting in slow reviews and multiple requests for revisions.\nThe learning outcomes were revised to be reduced in number and to use assessable language to describe the student learning expected. Faculty proposing a course for GE must explain in the proposal how the course aligns with the expected outcomes within the context of the discipline being taught.\nLearning outcomes were revised for each GE area and the four SF State Studies areas.\nI already have a GE, SF State Studies, or American Institutions course. Do I need to do anything in response to the changes in GE?\nAll courses already in GE remain in the same area, although the GE labels will change in the bulletin, course catalog, and class schedule effective fall 25. For example, if you have a C1 Arts course, it will now be a 3A Arts course. The old designations are kept in the background so that the course will satisfy C1 for continuing students and 3A for new students entering in fall 2025 and beyond.\nYou need to update course syllabi with the new GE and SF State Studies labels, names, and learning outcomes. Additionally, you may need to realign your course to meet the new outcomes. Please have this updated starting with the fall 25 semester.\nIf you have any information on department or school websites that reference GE courses or areas, those also need to be updated with the new GE labels and names. Likewise, plan to update any advising information that reference GE for incoming fall 2025 students. Older materials for continuing students can reference the old GE labels.\nCourses in GE are periodically assessed for recertification. At that point, the department offering the course must show how it aligns with the revised learning outcomes and how well students are learning those outcomes to remain certified in the area of GE. Recertification is done by the Baccalaureate Requirements Assessment Committee (BRAC), a Senate committee with faculty representatives from colleges.\nI have a course being reviewed for GE with the current learning outcomes. Do I need to start the proposal over?\nNo. Courses that are already submitted or being reviewed for GE or SF State Studies will be evaluated against the pre-fall 2025 outcomes with the original proposal, but will receive the new GE label when approved by the committee. However, please align the course with the new learning outcomes when you begin teaching it. The course will be recertified in the future against the new learning outcomes.\nI want to propose a course for GE, SF State Studies, or American Institutions for the first time. How do I do that?\nRequests to certify a course for GE, SF State Studies, or American Institutions are proposed in the course record in CourseLeaf and reviewed by the Baccalaureate Requirements Certification Committee (BRCC), with faculty representatives from each college.\nThere are expectations associated with each GE, SF State Studies, or American Institutions course. You’ll find these expectations on the Course Expectations and Learning Outcomes page. Please read them and design the course with these expectations in mind.\nIn the course record, you will be asked to respond to three prompts for each learning outcome. Answers to these prompts should closely align with the learning outcome; the more focused and specific the answers, the easier it will be for BRCC to determine that the course will fulfill the learning outcome.\nThe prompts focus on the materials you will use to teach the learning outcome, the activities students will do to develop skills or understanding associated with the learning outcome, and the student work and approach you will use to assess student learning of the outcome.\nFor each learning outcome, you will be asked to respond to these three prompts:\nIn several sentences, please explain how you as an instructor will provide the foundational knowledge and skills that align with the goals of this SLO.\nWhat materials (e.g., readings, lectures, movies, presentations, laboratories, performance techniques) will you provide to students so that they can meet this SLO?\nDo not replicate your syllabus here, but only include materials directly aligned to the SLO in the appropriate part of the proposal.\nWhat specific activities will the students engage in so that they can build the skills or understanding that will allow them to meet this SLO?\nThese might include reflections, discussions, essays, short writing pieces, quizzes, projects, blog posts, laboratory experiments, performances, presentations.\nBe sure to describe at least one activity and how it aligns with the specific learning outcome.\nDescribe the graded assignment(s) or student work that you will use to assess how well students have met the learning outcome.\nBe sure to explain how the student work maps to the learning outcome and demonstrates that students have met its goals.\nPlease include at least one example of a prompt or question that you would ask the students to respond to.\nWe do not need your entire assignment instruction sheet or grading rubric, just the section(s) that specifically align with the learning outcome.\nIndicate how much all graded assignment(s)/activities aligned with the SLO will count towards the final grade.\nWhat are my obligations to have a course meet GE, SF State Studies, or American Institutions requirements?\nTwo major obligations must be met for courses that meet GE, SF State Studies, or American Institutions requirements. The syllabus must include information about these requirements, and the department must assess student learning in the course when requested as part of the recertification process.\nSyllabus Requirements\nCourses approved in an area of GE, SF State Studies, or American Institutions must include in the course syllabus:\nThe area of general education, SF State Studies, or American Institutions that the course fulfills, i.e. This course satisfies General Education Area 3UD Arts and Humanities and Global Perspectives for SF State Studies.\nThe university-approved student learning outcomes (SLOs) for each of the areas fulfilled by the course (see learning outcomes section)\nThe activities and/or assignments the students complete to demonstrate they have met the SLOs.\nIt is the responsibility of the department, school, college, or program that offers the course to ensure that instructors of the course are aware of the GE, SF State Studies, or American Institutions areas fulfilled by the course and that the syllabus reflects this information.\nThank you for communicating to students what they can expect to learn in your course!\nParticipation in student learning assessment for recertification:\nOnce a course has been approved for GE, SF State Studies, or American Institutions, it will undergo periodic recertification. The standard interval between reviews is five years. The department, school, college, or program that offers the course is responsible for conducting the assessment and submitting the requested recertification report.\nCalls for recertification will be announced in the spring semester, and departments will engage in that work during the following academic year. Please be aware that anonymous examples of student work may be requested as evidence that learning outcomes are being met. If no report is received for a course, it will no longer satisfy the requirement being recertified.  The department may decide to request certification for the course at a future date as a new request.\nActive scheduling required for GE courses:\nThere is an expectation that courses in GE are offered on a frequent basis for student planning. Courses approved for GE that have not been offered within a five-year period shall have their GE status removed and the course will be deactivated. The department may decide to reactivate the course and request certification at a future date as a new request.\nSubstantive Course Revisions:\nAny course that undergoes substantial revision to titles or descriptions requires reevaluation to retain an existing area of GE.",
    "url": "https://ueap.sfsu.edu/GE_Fall_2025/Front_Page_GE_CEaLO",
    "domain": "ueap.sfsu.edu"
  }
]