[
  {
    "source": "https://equity.sfsu.edu/",
    "category": "general",
    "title": "Equity & Community Inclusion | San Francisco State University",
    "content": "Equity & Community Inclusion\nBackground & Context for the Division of Equity & Community Inclusion\nThe\nDivision of Equity & Community Inclusion\nopened at SF State in academic year 2017-18! It sits within Student Affairs & Enrollment Management.   This  division is responsible for leading, coordinating, implementing and evaluating a broad range of sustained programs, initiatives, events and activities designed to:\nfacilitate intercultural/intergroup dialogue,\npromote equity and inclusion,\nadvance social justice, and\nimprove campus climate for all of our students.\nAmong several desired outcomes, most notably Equity & Community Inclusion works collaboratively with campus partners (including student clubs and organizations) to close the educational equity gap in support of our\nGraduation Initiative 2025\ngoals, as well as fuel and support our diverse students’ hopes and dreams to graduate and go on to make a positive impact in their communities and on the world.\nMeet the team leading and facilitating these campus efforts!\nPrograms & Units\nThe units comprising this new division include:\nASPIRE & Oceania Scholars\nBlack Unity Center\n(\nView the proposal for this Center(PDF)\n)\nDream Resource Center\nOffice of Diversity & Student Equity\nand Interfaith Programs (Muslim & Jewish Student Life)\nLatinx Student Center\nLocated: Student Services Building, Room 206\nLocation\nWe are joined in this space by\nASPIRE, Oceania Scholars,\nthe\nBlack Unity Center.\nThe\nDream Resource Center,\nInterfaith Programs Unit, Latinx Center and LGBTQIA+ Student Life\nare located on the second floor of the Student Services Building (\nSSB 206\n).\nThe\nAssociate Vice President for Equity & Community Inclusion\nis located in Student Services Building, Room 403 (\nSSB 403\n).\nOpportunities for Input & Involvement\nAn\nAd Hoc Work Group on Equity & Social Justice Educational Outreach\nis convened each Summer to develop an education, training and outreach plan for each academic year.  Visit their webpage for more info.\nPlease help\nEquity & Community Inclusion\nidentify priorities for the Divison, as well as submit suggestions to improve campus climate.  We would appreciate your input, thoughts and reflections.  Please submit by clicking on the\nEquity & Community Inclusion Comment Form\nlink\n.\nIf you would like to become involved with\nEquity & Community Inclusion\n’s efforts, or if you are a student club/organization that would like to become affiliated with this new division, please email\nequity@sfsu.edu\n.\nAn important way to become involved is to commit to a process of lifelong learning.  Visit our page on\nResources for Self-Learning\nto begin.\nThe Equity & Community Inclusion Unit\nis open to all, and anyone interested in our activities and resources is welcome regardless of race, sex, color, ethnicity or national origin.",
    "url": "https://equity.sfsu.edu/",
    "domain": "equity.sfsu.edu"
  },
  {
    "source": "https://equity.sfsu.edu/meet-the-team",
    "category": "general",
    "title": "Equity & Community Inclusion Team | Equity & Community Inclusion Unit",
    "content": "Equity & Community Inclusion Team\nBelow you will find short narratives about our team in Equity & Community Inclusion. Visit us in Village C, Rooms 140, 141, and 142; and also in Student Services Building, Room 206.\nDr. Frederick Smith, Associate Vice President, Equity & Community Inclusion\nDalyce Brown, Outreach, Recruitment & Retention Specialist, Black Unity Center\nBriana M. Williams, Administrative Analyst, Equity & Community Inclusion\nAnnie Sterns,  Coordinator, Jewish Student Life and Interfaith Programs\nGriselda Madrigal Lara, Coordinator, Dream/AB540 Resource Center\nJeremy Khuth Director, ASPIRE\nTupou Latukefu, Oceania Scholars Program Coordinator\nEmmanuel Padilla, Director, Latinx Student Center\nAssociate Vice President, Division of Equity & Community Inclusion / Student Affairs & Enrollment Management\nDr. Frederick Smith serves as Associate Vice President,\nEquity & Community Inclusion\n. He joined SF State in July 2019. Prior to SF State, Fred worked at Cal State LA, where he served as the Director of the Cross Cultural Centers. He earned his doctorate in Educational Leadership for Social Justice at Loyola Marymount University in May 2018. His dissertation title is\nThe Politics of Ethnic Studies, Cultural Centers, and Student Activism: The Voices of Black Women at the Academic Borderlands\n.\nDr. Smith's research and professional interests focus on higher education and include: co-curricular learning experiences, the role of ethnic studies and cultural centers in student identity development and confidence building, campus climate experiences of historically marginalized and minoritized communities, retention and graduation of students of color in higher education (at Cal State LA, he initiated and led the Men of Color Success Network Initiative and the Women and Femmes of Color Annual Conference), and collaborations between student affairs and academic affairs staff and faculty for student success.  Dr. Smith brings rich experience developing collaborative programs, events, services, dialogues, and celebrations that bring the campus community together.\nOutside of higher education, Fred is a novelist. His five novels,\nBusy Ain't The Half Of It\n,\nIn Case You Forgot\n,\nPlay It Forward\n,\nRight Side of the Wrong Bed\n(a Lambda Literary finalist), and\nDown For Whatever\n, focus on queer characters of color in Los Angeles.\nFred earned a Bachelor of Journalism degree in Television News and Reporting at the Missouri School of Journalism. He earned a Master of Education in Higher Education at Loyola University Chicago. Fred is originally from Detroit, Michigan.\nDalyce is the Outreach, Recruitment & Retention Specialist at the Black Unity Center and also the advisor for BSU. She’s here to support students, connect you with resources, and keep you updated on campus events and opportunities. If you ever need guidance, a campus plug, or just someone to help you get connected.\nemail:\ndalycebrown@sfsu.edu\nAdministrative Analyst/Specialist I, Division of Equity & Community Inclusion\nBriana is the Administrative Analyst/Specialist I for the\nDivision of Equity & Community Inclusion\n. Briana is an alum of California State University East Bay with a Bachelor’s Degree in Communication and an emphasis in Public Relations. Born in San Jose, California, she has been a Bay Area native her whole life. During her time at CSUEB, she worked with the planning committee for Black Student Union, as well as personal outreach in the East Bay community. Fun Fact: Briana loves Afro beats and reggae; she can dance all night long.\nIn her role as the Jewish Student Life and Interfaith Programs, Annie provides coordination and oversight for culturally responsive programs and services which promote educational access and success of all students at SF State, in particular, students who identify as Jewish and those interested in Jewish culture and faith. Annie also serves as a first-responder to assist and support students who report experiencing anti-Semitism, as well as make appropriate referrals to relevant resources on campus, serve as an advisory in navigating campus processes/procedures, and recommend actions for institutional/systemic change as warranted, based on patterns in student reporting.\nEmail:\nanniestearns@sfsu.edu\nor schedule an appointment at\ncalendly.com/anniestearns\nGriselda Madrigal Lara was born in a small town in Michoacan, Mexico. Griselda migrated to California when she was eight years old and grew up in Sonoma County. Griselda holds a Bachelor of Arts in Chicana/o & Latina/o Studies and Master of Arts in Mexican American and Latina/o Studies from the University of Texas at Austin. She is a first-generation college graduate who is passionate about dismantling academic barriers for underserved students. In her free time, Griselda loves to create art, listen to audiobooks, and care for her pug Benita.\nJeremy Khuth (he/him/his)\njoined SF State on July 10, 2023, as the Director of ASPIRE (AAPI Student Services). Born and raised in Oakland, Jeremy is a child of Cambodian refugees and a first-generation Cambodian-American. He earned his B.A. in Asian American Studies from UC Santa Barbara and an M.A. in Counseling from San Jose State.\nJeremy has held roles across UC Santa Barbara, San Jose State, Laney College, and California College of the Arts, working in areas such as peer mentoring, academic advising, disability support services, student health insurance, teaching, and residential education.\nOutside of work, Jeremy enjoys cooking (he calls himself an avid chef!), exploring new skills, and engaging in health and wellness. He’s also a fan of movies, TV series, music, and sports.\nEmail:\njkhuth@sfsu.edu\nTupou Latukefu (she/her)\nis the new Oceania Scholars Program Coordinator at SF State. A Bay Area native with roots in Tonga, Tupou earned her degree in Ethnic Studies from UC Berkeley after starting at City College of San Francisco. She has extensive experience supporting Pacific Islander students and youth through leadership, mentorship, and community programs at CCSF, UC Berkeley, and the Samoan Community Development Center. In her role, she is dedicated to creating culturally relevant programming that enhances retention, success, and graduation for Pacific Islander students.\nEmail:\nlatukefu@sfsu.edu\nEmmanuel Padilla joins us after 5 years of working at UCSF’s Center for Science, Education and Outreach (a department under the office of diversity and outreach). Prior to UCSF, he was in the classroom for three years, and worked for UC Davis providing college outreach to Sacramento.  Emmanuel was the first in his family to go to college and is driven to provide access to students who share a similar, yet unique story. A native San Franciscan, Emmanuel fuels his drive by creating connections, trust, and accountability with students, colleagues, and the community. Emmanuel loves to use humor with everyone to create safe spaces and allow folks to be folks.\nEmail:\nemmanuelpadilla@sfsu.edu\nThe Equity & Community Inclusion Unit\nis open to all, and anyone interested in our activities and resources is welcome regardless of race, sex, color, ethnicity or national origin.",
    "url": "https://equity.sfsu.edu/meet-the-team",
    "domain": "equity.sfsu.edu"
  },
  {
    "source": "https://equity.sfsu.edu/Resources-for-Self-Learning",
    "category": "general",
    "title": "Resources for Self-Learning | Equity & Community Inclusion Unit",
    "content": "Resources for Self-Learning\nCome back to visit this site often, as more resources will be added on an ongoing basis.  If you have suggestions for resources to add to this page, please email us at\nequity@sfsu.edu\n.\nMultimedia Resources for Those New to Equity, Inclusion & Social Justice Work\nThis is a list of resources to introduce you to some of the key concepts that guide the work of promoting equity, inclusion and social justice.  They are meant to promote self-reflection and critical thinking and by no means constitute a comprehensive list.\nPaul Gorski blog on diversity versus social justice:\nhttps://acpacsje.wordpress.com/2013/02/19/social-justice-not-just-another-term-for-diversity-by-paul-c-gorski\nPaul Gorski article on decolonizing intercultural education:\nhttp://www.edchange.org/publications/decolonizing-final.pdf\nAAC&U’s project on making excellence inclusive:\nhttps://www.aacu.org/making-excellence-inclusive\nAAC&U’s self-study guide on inclusive excellence:\nhttps://www.aacu.org/sites/default/files/CommittingtoEquityInclusiveExcellence.pdf\nRosetta Lee essay on growth mindset in cultural competency:\nhttps://uminntilt.com/2015/10/19/growth-cultural-competency-conversations\nPeggy McIntosh essay on white privilege:\nhttps://nationalseedproject.org/white-privilege-unpacking-the-invisible-knapsack\nTeaching Tolerance’s overview on unconscious bias:\nhttps://www.tolerance.org/professional-development/test-yourself-for-hidden-bias\nNPR’s interview with Claude Steele on stereotype threat:\nhttp://www.npr.org/templates/story/story.php?storyId=125859207\nChimamanda Ngozi Adichie’s TEDTalk on the danger of a single story:\nhttps://www.ted.com/talks/chimamanda_adichie_the_danger_of_a_single_story\nNational Organizations\nThese non-profit national organizations are committed to social justice advocacy and education and can provide a wide array of opportunities for further learning and exploration.  This is no way intended to be a comprehensive list and we will add to this list on an ongoing basis. (Note: SF State does not necessarily endorse or support the views of these organizations.  These resources are provided to promote self-learning and critical analysis.)\nAlcohol Rehab Guide\nAmerican Association for Access, Equity and Diversity\nAmerican Association of People with Disabilities\nAmerican Civil Liberties Union\nAnti-Defamation League\nCampus Pride\nCATALYST\nCenter for the Study of Race & Equity in Education\nDisability Rights Education & Defense Fund\nDiversity Collegium\nFord Foundation\nHuman Rights Campaign\nInstitute for Women’s Policy Research\nLGBT Rehab Centers\nLouis D. Brandeis Center\nLumina Foundation\nMen Can Stop Rape\nMexican American Legal Defense and Educational Fund\nNational Coalition Building Institute\nNational Congress of American Indians\nNational LGBTQ Task Force\nNational Women’s Law Center\nSouthern Poverty Law Center\nThe Innocence Project\nThe Representation Project\nTransgender Law Center\nThe Equity & Community Inclusion Unit\nis open to all, and anyone interested in our activities and resources is welcome regardless of race, sex, color, ethnicity or national origin.",
    "url": "https://equity.sfsu.edu/Resources-for-Self-Learning",
    "domain": "equity.sfsu.edu"
  },
  {
    "source": "https://equity.sfsu.edu/Office-of-Diversity-Student-Equity-and-Interfaith-Programs",
    "category": "general",
    "title": "Office of Diversity, Student Equity and Interfaith Programs | Equity & Community Inclusion Unit",
    "content": "Office of Diversity, Student Equity and Interfaith Programs\nThe mission of the Office of Diversity, Student Equity, and Interfaith Programs is to ensure all students graduate by providing tailored, personalized support and removing barriers to graduation.\nThe goals to achieve this vision are to:\nProvide resources and services that directly support the identity development, graduation and retention of SF State Students;\nEnsure all students have a space on campus they can gather support,  guidance, and affirmations of the intersectionality of their identities;\nFoster the creation of inclusive spaces for students, including Latinx Student Services, PRIDE (LGBTIQ+), Interfaith Programs Unit, and other intercultural spaces\nConnect students to faculty, staff, and resources across campus while providing support where gaps exist.\nResources:\nThe Dream Resource Center\nInterfaith Programs\nLGBTQIA+ Student Life\nLatinx Student Services\nPlease contact Christian Lozano Cuellar, Director, Office of Diversity, Student Equity, and Interfaith Programs, if you have any questions regarding Jewish Student Life, Interfaith Programs Unit, LGBTQIA+ Student Life, and Latinx Student Services at SFSU.\nchristianlozano@sfsu.edu\nLocation:\nStudent Services Building, Room 206\nPhone\n: (415) 338-7290\nEmail\n:\nc\nhristianlozano@sfsu.edu",
    "url": "https://equity.sfsu.edu/Office-of-Diversity-Student-Equity-and-Interfaith-Programs",
    "domain": "equity.sfsu.edu"
  },
  {
    "source": "https://equity.sfsu.edu/programmatic-structure",
    "category": "general",
    "title": "Programmatic Structure | Equity & Community Inclusion Unit",
    "content": "Programmatic Structure\nIntellectual Stimulation\nInvited Speakers\nDiscussions/Film\nLecture Discussion\nPreparation for the Future\nGrad School Preparation\nCareer Preparation\nAffirmation\nRites of Passage\nCelebrations of Black Student Success\nSkill Building/Resources\nLibrary Workshop\nFinancial Aid Workshop\nWriting Workshop\nArt and Performance\nSpoken Word\nDance\nMusic\nCommunity Service/Internship\nInternships\nVolunteerism\nWhere To Find Us\nLocation:\nThe Village at Centennial Square, Building C, Suite 142\nHours:\nMonday through Friday, 8am – 7pm. (However, during this current period of SF State remote instruction and services, in response to COVID-19, office hours and staff availability are very limited. You may email a question or an online appointment request at\nb\nlackunitycenter@sfsu.edu\n. Thank you.)\nPhone:\n(415) 405-4442\nEmail:\nblackunitycenter@sfsu.edu",
    "url": "https://equity.sfsu.edu/programmatic-structure",
    "domain": "equity.sfsu.edu"
  },
  {
    "source": "https://equity.sfsu.edu/Black-Unity-Center",
    "category": "general",
    "title": "Welcome to the Black Unity Center | Equity & Community Inclusion Unit",
    "content": "Welcome to the Black Unity Center\nYOUR HOME AWAY FROM HOME\nOPEN TO ALL STUDENTS\nThe Black Unity Center started as one of six Black Student Union Demands developed in 2015. This serves as a space for student engagement and achievement! The vision of the Center is to advance educational equity for students of African descent by serving as a unifying force for many efforts to ensure the highest potential for and self-determination by students, using an Afrocentric paradigm. UBUNTU!\nMission Statement :\nThe center's mission is to foster a sense of belonging and provide academic support through a culturally inclusive lens through cross-campus community collaborations and an intersectional, African-centered environment, with transformative, impactful and socially conscious programs that allow them to grow academically, interpersonally, culturally and professionally, in order to advance their recruitment, matriculation, retention and graduation.\nServices We Offer\nResource Referral (Mental Health, Financial Assistance, Etc)\nAcademic Advising\nCommunity Roundtables\nFinancial Aid Literacy Appointments\nGraduation Support\nStudent Clubs & Orgs Connections\nSnacks\nWhere to Find Us\nLocation:\nThe Village at Centennial Square, Building C, Suite 142\nHours:\nMonday through Friday, 9am – 5pm.\nPhone:\n(415) 405-4442\nEmail:\nblackunitycenter@sfsu.edu\nInstagram:\nBlackUnitySFSU\nVirtual Tour Down Below:\nLaunch Experience\nAccessible San Francisco State University - Housing Virtual Tour\nDonate Here\nUpcoming Events\nMELANIN MARCH\nFuture Students (First Steps)\nFinancial Aid & Scholarships\nBlack Student Clubs, Orgs & Events\nResource Referrals (Community Partners)\nMental Health Resources  & Wellness Coach\nJobs, Internship & Volunteer Work\nBlack in the Bay Community Events\nGraduate Students\nUmoja Tours\nAre you looking to begin your journey here at SF State?\nBook a meeting or email Dalyce if you seek unique information regarding areas such as Black campus life, academics, student services, and questions regarding:\nAdmissions requirements\nCal State Apply application process\nPre-admissions transcript evaluations\nFirst Steps:\nFreshman:\nFreshman Application Checklist\nFreshman Application Guide 2024-20\n25\nApplication Fee Waiver Checklist\nTransfers:\nASSIST website\n- California Schools\nArticulation website\n- Non-Californian Schools\nTransfer Application Checklist\nApplication Fee Waiver Checklis\nt\nLower Divison:Basic Requirements\nAttended a college or university after high school graduation\nHave not yet earned 60 transferable units\nGraduation from high school (diploma or GED)\nAchievement of specified GPA in A-G courses:\n2.50 or greater for California residents or graduates of a California high school\n3.00 or greater for Non-California residents or graduates of a high school outside of California\nGood standing at the last college or university attended\nCompletion, with a grade of C- or better, of a course in:\nWritten Communication (GE Area A2)\nMathematics or quantitative reasoning (GE Area B4)\nUpper Divison:\nBasic Requirements: See Lower Divison\nComplete 60 or more transferable semester units/ at least 60 transferable semester (90 quarter) units\nComplete General Education requirements;\n30 semester (45 quarter) units of CSU General Education (GE) courses: Four basic skills courses (Golden 4) must be completed with a grade of C- or better\nOral Communication (Area A1):\npublic speaking course\nWritten Communication (Area A2):\nEnglish composition course\nCritical Thinking (Area A3):\nlogic or critical thinking course\n(Engineering majors exempt from critical thinking)\nQuantitative Reasoning (Area B4):\nmath course\nMaster's & Grad Students:\nGraduate Programs\nApplication Fee Waiver Checklist\nInternational:\nProspective students interested in applying to SF State may email\nworld@sfsu.edu\nand visit:\nhttps://oip.sfsu.edu/future\nInternational Application Checklist\nApplication Fee Waiver Checklist\nClick Here:\nSchedule a meeting\nEmail:\ndalycebrown@sfsu.edu\nMake an Appointment Here\nON CAMPUS SCHOLARSHIPS:\nCheck Out Website for more:\nhttps://sfsu.academicworks.com/\n--\nDEADLINE VARIES\nOff-Campus/Alternative Scholarships\nScholarships - NAACP\n--\nDEADLINE VARIES\nUnited Negro College Fund\nSTUDENT ORGS & CLUBS EVENTS\nLooking for Community? SF State has tons of Black student clubs and organizations to choose from!\nFind your tribe!\nStart Here:\nThe Black Chat\n(GroupMe)\n​​​​​Black Student Union\n(BSU)\nAfro-LatinX\nSister, Sister\nHaus Blaque\nNational Society of Black Engineers\n(NSBE)\nBlack Student Business Association\nBlack Film Club\nDancing Divas\nBe-Stem\nBlack Residents United in Housing (B.R.U.H)\nAfrican Student Association (ASA)\nHaus Blaque\nImpact Movement\nSorority/Fraternity Life\nDivine 9/NPHC\nAlpha Kappa Alpha\nKappa Alpha Psi\nOmega Psi Phi\nDelta Sigma Theta\nZeta Phi Beta\nAlpha Phi Alpha\nPhi Beta Sigma\nSigma Gamma Rho\nIota Phi Theta\nCommunity-Based Organizations\nBlack to the Future Form\nFamily Support & Advocacy\nWorkforce Development\nEducation\nViolence Prevention\nMental Health & Wellness\nAlkeme\nAn organization centering the Black experience with content, tools and resources tuned for our joy, our history, and our growth.\nBlack Women’s Health Imperative\nOrganization advancing health equity and social justice for Black women through policy, advocacy, education, research and leadership development.\nBrother, You’re on My Mind\nAn initiative launched by Omega Psi Phi Fraternity, Inc. and NIMHD to raise awareness of the mental health challenges associated with depression and stress that affect Black men and families. Website offers an\nonline toolkit\nthat provides Omega Psi Phi Fraternity chapters with the materials needed to educate fellow fraternity brothers and community members on depression and stress in Black men.\nOn Campus: Wellness Coach & CARES Well-Being Case Manager - Kenya Sullivan\nWe're all about caring for our mental health at the Black Unity Center. Kenya Sullivan's got your back and is here to discuss any life challenges or community issues weighing you down. He focuses on assisting students in reducing distress levels and addressing concerning behaviors to provide support and reduce barriers to student success.\nLocation: Zoom\nOff-Campus Mental Health Services & Resources\nInclusive Therapist\n( Reduced Fee Teletherapy)\nThe Steve Fund\nA organization focused on supporting the mental health and emotional well-being of young people of color.\nBlack Men Heal\nLimited and selective free mental health service opportunities for Black men.\nTherapy for Black Girls:\nAn online space dedicated to encouraging the mental wellness of Black women and girls. Offers listing of mental health professionals across the country who provide high quality, culturally competent services to Black women and girls, an informational podcast and an online support community.\nMelanin and Mental Health\nConnects individuals with culturally competent clinicians committed to serving the mental health needs of Black & Latinx/Hispanic communities. Promotes the growth and healing of diverse communities through its website, online directory and events.\nBlack Mental Health Alliance\n- (410) 338-2642\nProvides information and resources and a “Find a Therapist” locator to connect with a culturally competent mental health professional.\nTherapists of Color\nLoveland Foundation Therapy Fund\nWith the barriers affecting access to treatment by members of diverse ethnic and racial groups, the Loveland Therapy Fund provides financial assistance to Black women and girls seeking therapy nationally.\nFamily Paths\n(Formerly Parental Stress Service) A non-profit organization of mental health professionals and dedicated volunteers that provides a number of mental health and supportive services to low income, multi-stressed individuals and families in Alameda County of the San Francisco Bay Area. Services include a 24-hour Parent Support Hotline, a Foster Parent Advice Line, CalWORKs Case Management, Positive Parenting Classes, and Family Yoga. They also provide counseling for children, adolescents, adults and families.\nMake an Appointment Here\nON-CAMPUS\nOFF-CAMPUS JOBS/INTERNSHIPS\nImprove Your Tomorrow -\nAre you ready to be a superhero for young men & women of color in your community, the nation, and beyond? If so, we're seeking awesome mentors who share our values of teamwork, character, service, and liberation. This epic opportunity Includes a year-long paid fellowship for college students and early-career pros of any gender. Let's start a movement!\nBi-Weekly Stipend\n$680 = 20 hours per week\n$850 = 25 hours per week\n$1,360 = 40 hours per week\nLearn More:\nhttps://www.improveyourtomorrow.org/\nFind More Jobs:\nCurrently Hiring\nUCSF CFAR Scholars Program Internship\nHYPER REU program Internship\nSmall Business Coordinator\nUniversity Instructors,  Elementary Teachers (K-8), Special Education Teachers (K-12), Middle School Science Teachers, High School English Teachers\nSummer Camps\nAnd More!\nApply Here:\nhttps://career.sfsu.edu/hot-jobs\nApply Here!\nSAN FRANCISCO EVENTS\nDate:\nLocation:\nTime\n:\nOAKLAND EVENTS:\nHAYWARD EVENTS:\nScholarships: Academic works\nIda Sweeney LeBlanc Scholarship\nEvery Tuesday and Friday, we’d love for you to join us on a legacy tour celebrating the Black Campus Movement, highlighting Black student life and achievements.  You’ll get to explore the Black Unity Center, visit the College of Ethnic Studies, and discover the powerful history that has shaped our campus.\nWe can’t wait to see you there! Let’s celebrate the history, the culture, and the community together.\nIf you need alternative times or dates please email Dalyce Brown at\ndalycebrown@sfsu.edu\nBook a tour here:\nhttps://forms.gle/cmrdtHhavqBnXeyr5\n.\nCONTACT US:\nBucket Manyweather, Engagement Specialist\nbucketmanyweather@sfsu.edu\nDalyce Brown,\nOutreach & Recruitment Specialist\ndalycebrown@sfsu.edu\nThe Black Unity Center is open to all, and anyone interested in our activities and resources is welcome regardless of race, sex, color, ethnicity or national origin.",
    "url": "https://equity.sfsu.edu/Black-Unity-Center",
    "domain": "equity.sfsu.edu"
  },
  {
    "source": "https://equity.sfsu.edu/latinx-student-center",
    "category": "general",
    "title": "Latinx Student Center | Equity & Community Inclusion Unit",
    "content": "Latinx Student Center\nThe Latinx Student Center provides a space for students to create community and be reminded of why they are here.\nOur Mission\nThe mission of the Latinx Student Center is to authentically establish visibility for Latinx-identifying students. The vision is for students to have autonomy when they come into the center, where they step into their comfort zones and develop a sense of agency needed to navigate higher education. Autonomy, authenticity and humor is the energy one feels at the center. The goal is for that energy to be translated to other parts of campus.Students need to be affirmed.\nBe it first-year students, transfer students or re-entry students, students need to be seen as people. Navigating higher education is confusing for all, especially those that identify as first-generation and/or first in their family to attend college. Thus, the Latinx Student Center is important to create a confidence and reaffirm identities.\nOur Services\nWe offer several resources to students, including (but not limited to):\nStudy/Meeting Spaces\nDesktop Access\nFree Printing\nOpen Kitchen\nCommunity Library\nEvents & Workshops\nOur Team\nEmmanuel Padilla - Director\nAlex Gómez - Lead Student Assistant\nScholarships\nThe\nYasmyn Victoria for Social Justice Scholarship\nwas established in memory of\nJasmyn Victoria Martínez-Bará\nwho graduated from San Francisco State University with honors in 2016. The scholarship provides financial assistance to students who have a commitment to social justice, aspirations for a career in law, and a desire to support their community like Jasmyn Victoria.\nLearn more about the scholarship and about Jasmyn\n.\nContact Us\nThe Latinx Student Center is located in Village C, Room 140.\nOur building is located across from the Student Services Building, and also hosts the Office of International Programs & local US Bank Branch. Make a right at the entrance and you'll find us, as well as\nAA&PI Student Services\n(Room 141) and the\nBlack Unity Center\n(Room 142)!\nEmail:\nlatinxstudentcenter@gmail.com\nFollow:\nInstagram\nTikTok\nDiscord\nMailing Address:\n750 Font Blvd, Room 140\nSan Francisco, CA 94132\nThe Latinx Student Center is open to all, and anyone interested in our activities and resources is welcome regardless of race, sex, color, ethnicity or national origin.",
    "url": "https://equity.sfsu.edu/latinx-student-center",
    "domain": "equity.sfsu.edu"
  },
  {
    "source": "https://equity.sfsu.edu/Bias-Incident-Education-Team-at-SF-State",
    "category": "general",
    "title": "Bias Incident Education Team at SF State | Equity & Community Inclusion Unit",
    "content": "Bias Incident Education Team at SF State\nWelcome and Introduction\nWelcome to the webpage for the Bias Incident Education Team (BIET) at San Francisco State University.\nThis team works in collaboration with the\nOffice of Title IX and Discrimination, Harassment, Retaliation (DHR)\nto ensure that reports submitted are addressed by the appropriate area on campus. This page should provide basic information about the BIET and information about how to submit a report. At any time while reviewing this page, you are welcome to\nSUBMIT A REPORT\n(right click to open in new window). Please note, the Office of Title IX and DHR may review reports submitted to the Bias Incident Education Team to ensure the appropriate response.\nSF State and the Bias Incident Education Team are supporters of academic freedom, free speech, and free expression. Everyone at SF State has a right to a safe learning, living, and working environment. SF State views bias-related incidents as antithetical to our university community values of inclusion, belonging, and mattering. We have a collective responsibility to contribute toward an inclusive and welcoming campus environment for students, staff, faculty, administrators, and guests at SF State. We each play a critical role in maintaining a safe and respectful campus community. The Bias Incident Education Team is an important part of campus climate work at SF State.\nThe BIET's role on campus is educational. The team does not have a role or capacity to discipline or sanction anyone connected to reports submitted and no one is required to meet with the team. The goal of the team is to provide educational awareness and assist campus community members with strategies that will empower them to address bias incidents they encounter or observe.\nWhat is the Bias Incident Education Team (BIET)?\nThe Bias Incident Education Team reviews and addresses bias-related incidents and reports that deserve attention, but may not necessarily rise to the level of\nTitle IX / DHR\n(Discrimination, Harassment, Retaliation) or\nLabor / Employee Relations / HR\n(Human Resources). The BIET reviews incidents and determines an action plan rooted in individual and group education and learning.\nThe BIET accepts reports from SF State students, staff, faculty, administrators, and guests.\nThe BIET provides an outlet for people to share, document, and make known bias-related incidents they observe or experience. Ultimately, the BIET is one element of the collaborative processes at SF State to address and improve campus climate issues.\nWhat is a bias incident?\nSomething a person does, says, or expresses that is motivated by bias related to one or more identities, such as citizenship, disability, ethnicity, gender, national origin, race, sexual orientation, or more. While a bias incident may constitute protected expression, the incident may also promote mental stress, harm, or violence that can leave recipient(s) or observer(s) feeling unsafe, unwelcomed, and unincluded in the SF State community.\nWhy report bias incidents?\nReporting bias incidents helps us collect data about experiences that contribute negatively to the SF State campus climate. Reporting bias incidents helps foster a culture of accountability. Reporting bias incidents helps the BIET address incidents and provide educational action plans for the individuals, groups, or departments connected to bias-related incident. Reporting helps SF State understand where and how people experience bias on campus. Ultimately, reporting helps SF State become a more welcoming and inclusive campus.\nIf you witness or are made aware of bias-related incidents, we encourage you to\nSUBMIT REPORT\n(right click to open in new window). If you are uncomfortable submitting a bias incident report, ask a trusted colleague or friend to do it for you. You are also welcome to reach out to the\nchair/convener of the BIET, Frederick Smith\n, or any member of the BIET, listed in the next section.\nWho serves on the BIET?\nThe BIET consists of a group of SF State staff, faculty, and administrators from various parts of campus.\nThe current BIET members include:\nArlene Daus-Magbual\n, Director, Asian American & Pacific Islander Student Services\nCarleen Mandolfo\n, Associate Vice President, Faculty Affairs and Professional Development\nDemond Blanton\n, Manager, Workers' Compensation and Loss Control Programs\nFrederick Smith\n, Assistant Vice President, Equity & Community Inclusion (convener of the BIET)\nLarry Birello\n, Interim Manager, Student Rights & Responsibilities\nPatrick McFall\n, Coordinator, Academic Support and Leadership Development, Residential Life\nReggie Parson\n, Assistant Vice President, Campus Safety\nRick Nizzardini\n, Clinical Counselor, Counseling & Psychological Services and Residential Life\nTeddy Albiniak\n, Faculty, Communication Studies, and Chair, Academic Senate\nWhat if my situation might be beyond the scope of the BIET?\nThe BIET will review any report submitted. Because we work collaboratively with multiple campus partners, we may consult with or refer to departments that may be better equipped to address the issues raised in your report.\nTo that end, if you believe the incident you want to report goes beyond the scope of the BIET, we encourage you to connect with the following SF State resources:\nIf your situation involves an immediate/urgent emergency related to physical or medical safety, please contact the\nSF State University Police Department\n.\nIf your situation involves an immediate/urgent mental health emergency, please contact the\nSF State Counseling & Psychological Services\n.\nIf your report goes beyond the scope of the BIET, we will consult with some of the following campus partners:\nEmployment conduct issues (students, staff, faculty):\nSF State Labor & Employee Relations\n.\nStudent conduct:\nOffice of Student Conduct\nConduct related to CSU Executive Orders:\nSF State Office of Title IX and DHR (Discrimination, Harassment, or Retaliation)\nIf you would like a confidential consult about the incident of concern at SF State, we encourage you to contact the\nUniversity Ombudsperson\n.\nSubmit a report\nIf you want to submit a report to the Bias Incident Education Team, please click:\nSUBMIT REPORT\nAfter submitting, here are some next steps and what you can expect:\nSomeone will review your submission within 2 - 3 business days. If submitted during or before a weekend, there could be a longer review period.\nIf requested, a member of the Bias Incident Education Team will respond shortly after receiving and reviewing the report.\nThe BIET member will assess your report and situation, offer support, and then work with the BIET to determine an action plan.\nAt the conclusion of all available action steps, the BIET will sent a final letter/email to the person who initially submitted the bias incident reporting form. The final letter will include action steps (depending on confidentiality restrictions) and an opportunity to meet with a member of BIET to ask any remaining questions.\nAnyone who submits a report can ask questions about the status of the BIET work with the case at any time.\nWe acknowledge it takes courage to submit a report to the Bias Incident Education Team. Thank you.\nThank you\nThank you for taking time to learn more about the SF State Bias Incident Education Team. We appreciate your partnership in making SF State safe, inclusive, and welcoming for everyone who is a part of our campus community. If you have questions, please\nreach out to the BIET chair/convener, Frederick Smith\n.\nThe Equity & Community Inclusion Unit\nis open to all, and anyone interested in our activities and resources is welcome regardless of race, sex, color, ethnicity or national origin.",
    "url": "https://equity.sfsu.edu/Bias-Incident-Education-Team-at-SF-State",
    "domain": "equity.sfsu.edu"
  },
  {
    "source": "https://equity.sfsu.edu/La-Bienvenida-Project",
    "category": "general",
    "title": "La Bienvenida Project | San Francisco State University",
    "content": "La Bienvenida Project\nWith SF State's Division of Equity & Community Inclusion, in collaboration with the First-Year Experience Initiative, was awarded funding through the CSU Chancellor's Office's \"2019 Student Cohort Transition Programs\". Funding was used to develop an outreach and orientation media campaign that welcomes Spanish-speaking first-year student and their families to the SF State Community. The video production series is titled La Bienvenida Project, which translates to \"The Welcome\". The goal of the project is to provide Spanish-language resources and information for first-time students and their families to serve as both an online resource and enhancement for campus workshops and presentations.\nLa División de Equidad e Inclusión de la Communidad de San Francisco State University, en colaboración con la Iniciativa de Experienia del Primer Año, recibió fondos a través de los \"Programas de Transicion de Estudiantes de la Oficina del Canciller de CSU de 2019\". Los fondos se utilizaron para desarrollar una campaña de orientación en los medios de comunicaion que da la bienvenida a los estudiantes de primer año de habla hispana y sus familias a la comunidad de San Francisco State University. La serie de producción de videos se titula Poyecto La Bienvenida, que se traduce a \"The Welcome\". El Objectivo del proyecto es proporcionar recursos e información en español para los estudiantes preimerizos y sus familias para que sirvan como un recurso en linea y para talleres y presentaciones en el campus.\nSF State La Bienvenida - Introducción/Introduction & Inscripción/Enrollment\nSF State La Bienvenida - Ayuda Financiera/Financial Aid\nSF State La Bienvenida - Vivienda & Transporte/Housing & Transportation\nSF State La Bienvenida - Bienestar Integral/Wellness\nSF State La Bienvenida - Vida Estudiantil/Student Life\nIf you have any questions feel free to contact\nequity@sfsu.edu.\nSi tiene preguntas no dude en contactarnos en\nequity@sfsu.edu.\nThe Equity & Community Inclusion Unit\nis open to all, and anyone interested in our activities and resources is welcome regardless of race, sex, color, ethnicity or national origin.",
    "url": "https://equity.sfsu.edu/La-Bienvenida-Project",
    "domain": "equity.sfsu.edu"
  }
]