[
  {
    "source": "http://cpdc.sfsu.edu/",
    "category": "general",
    "title": "Capital Planning, Design and Construction | Capital Planning, Design and Construction",
    "content": "Capital Planning, Design and Construction\nCapital Planning, Design and Construction manages programming, planning, architecture, engineering, and construction of new and remodeled buildings and landscapes that support the campus community.\nCPDCs team of architects, design and sustainability professionals, space analysts, construction project managers, construction inspectors, and cost control and contract specialists represent the interests of the campus, working with the university community, the CSU Office of the Chancellor, and state and local agencies to coordinate and manage the development of capital projects and public-private partnerships.\nCPDC is a division of\nAdministration and Finance\n, a cabinet area focused on creating the spaces and opportunities that support the university’s mission.\nProject Request\nBuilding Permits\nCurrent Projects\nStonestown Planning Update\nBrookfield Properties, the owners of Stonestown, is planning a major redevelopment of the property, which will include housing, retail, public spaces and new transit connections, streets and paths of travel.\nLearn more about the Stonestown Redevelopment Project",
    "url": "http://cpdc.sfsu.edu/",
    "domain": "cpdc.sfsu.edu"
  },
  {
    "source": "http://cpdc.sfsu.edu/capital-program",
    "category": "general",
    "title": "Capital Program | Capital Planning, Design and Construction",
    "content": "Capital Program\nCapital Outlay Plan\nThe primary objective of the Multi-Year Capital Plan for the California State University (CSU) is to:\nProvide facilities appropriate to the CSU’s approved educational programs,\nTo create environments conducive to learning, and\nTo ensure that the quality and quantity of facilities at the 23 campuses serve the students equally well.\nCPDC collaborates across cabinet areas to prepare and submit a Multi-Year Capital Plan (formerly the annual Five-Year Plan) to the university president for submission to the Chancellor’s Office. The plan includes new buildings and renovations, infrastructure improvements, and preventative and deferred maintenance.\nBasis of the Multi-Year Capital Plan\n(CSU)\nMulti-Year Capital Plan 2021/2022 through 2025/2026\n(CSU)\nPlease note that\nnot all of the approved projects are funded\ndue to the limited resources available. Projects included in the current version of these lists that are in italics have previously received approval from the Board of Trustees, and projects in red italics have received prior approval from both the Board of Trustees and Department of Finance. Because these projects have already been approved, they are included in the current Multi-Year Capital Plan in order to identify their need for funding and provide information on the current outstanding sytemwide priority needs and not for specific project approval.\nSpace and Facilities Database (SFDB)\nThe California State University\nSpace and Facilities Database\n(SFDB)​ is a CSU systemwide inventory of campuses’ physical resources that serves as the official CSU central record for current physical inventory. CPDC coordinates campus facility planning through the development and management of the SFDB. This database, updated annually, is a key component in determining the need for capital improvement projects as well as equitable space distribution across campus. The campus physical master plan and the various capital improvement projects are based, in part, on information obtained from the SFDB.\nEach campus maintains its own space and facilities inventory that provides planning and management data. The data provided by each campus during an annual reporting period to the SFDB, which is maintained at the Chancellor’s Office, provides information about facilities and rooms within the facilities.\nThe SFDB serves as the campuses’ official record of existing spaces. The SFDB is used in the\nanalysis of space needs\nanalysis of the capital outlay budget change proposals (COBCP)\nspace utilization and other space and facilities-related issues and reports\ncustodial funding basis\nprivate-use reporting\nAny proposed changes to space that will change the use, size, or capacity must be coordinated with CPDC. Authorization to change a space must be received prior to the start of any projects that will impact the activity the space was built to accommodate.\nSpace Standards\nThe CSU Space Standards are based on the state's guidelines to help the campus plan and budget for physical capacity space during the programming of a new facility. Space Standards can help define the room use and assignable square footage of lecture, teaching lab, and office spaces and can be applied to analyze the space needs and entitlement of the campus.\nReference\nSpace Standards Chart\nSUAM Section VI\nQuestions?\nRon Kirkpatrick\n,\nDirector of Capital Planning and Special Projects\nNicholas Holmes\n, Associate Planner / Project Manager",
    "url": "http://cpdc.sfsu.edu/capital-program",
    "domain": "cpdc.sfsu.edu"
  },
  {
    "source": "http://cpdc.sfsu.edu/completed",
    "category": "general",
    "title": "Completed Projects | Capital Planning, Design and Construction",
    "content": "Completed Projects\nMashouf Wellness Center\nLEED Platinum\n// The platinum sustainability rating is the highest given out by the\nLeadership in Energy and Environmental Design (LEED) program\nof the\nUS Green Building Council (USGBC)\n. To learn more about the benefits of green building,\nclick here\n.\narchitect: WRNS Studio\nlandscape architect: WRT\ngeneral contractor: CW Driver Companies\nopened: fall semester 2017\nLearn more about the Mashouf Wellness Center\nUniversity Club\ncompleted: Summer 2020\narchitect: Dilworth Eliot Studio\ngeneral contractor: Eternal Construction\nMore Projects\nSecure Bike Parking\nThe campus recently added secure, covered bicycle parking at Thornton Hall for bicycle commuters. The project was funded by an SFCTA grant and was initiated by the Office of Sustainability and Parking and Transportation.\nThe bike cage houses 110 bicycles and contains a bicycle repair station.\nCesar Chavez Student Center Improvements\nInformation coming soon.",
    "url": "http://cpdc.sfsu.edu/completed",
    "domain": "cpdc.sfsu.edu"
  }
]