[
  {
    "source": "https://bursar.sfsu.edu/students",
    "category": "general",
    "title": "Student Home | Bursar's Office",
    "content": "Student Home\nThis page contains all student information ranging from academic calendar dates/deadlines for each semester, financial aid, fees, payment methods, 1098-T tax information, refund guidelines, FAQs, forms/documents, and policies/procedures.\nQuick Navigation\nBursar Home\nBursar Updates\nInternational Students\nImportant Academic Year Information\nFall 2025 - Summer 2026 Academic Year\nThis page contains important calendar dates and tuition/fee costs regarding Fall 2025 - Summer 2026.\nFall 2025 - Summer 2026\nFall 2024 - Summer 2025 Academic Year\nThis page contains important calendar dates and tuition/fee costs regarding the upcoming Fall 2024 - Summer 2025 academic year.\nFall 2024 - Summer 2025\nPrior Years\nThis page contains tuition/fee costs regarding all semesters from Spring 2018 to Fall 2024.\nSpring 2018 to Fall 2024\nStudent FAQs and Common Inquiries\nThis section contains questions frequently asked by students for the Bursar Office and COVID-19's impact on fees and refunds as well as common student inquiries. Please check these pages out first before submitting any service ticket through the service portal.\nRegistering for the upcoming semester but have a financial hold?\nIf you cannot pay the outstanding balance in full you must pay down to the $1000 threshold and the hold will release the next day.\nPlease note:\nStudent with the bad debt (Collections/Write off) service indicator on their account does not qualify. Balance must be paid in full.\nIf the semester you are registering for has passed the tuition fee payment deadline, late fee will apply. Balance must be paid in full in order to add classes.\nIf you are receiving financial aid you must have enough aid to cover your fees  in full, if not, you must pay the difference in order to add classes.\nStudent FAQ\nStudent Inquiries\nCOVID-19 FAQ\nAll of the frequently asked questions the Bursar's Office gets from students can be found here.\nCheck this page first to see if your question has already been asked there.\nStudent FAQ\nAll of the most common student inquiries the Bursar's Office gets from students can be found here.\nCheck each relevant section first to see if your inquiry has already been asked there before submitting a service ticket through the service portal.\nCommon Student Inquiries\nSubmit A Ticket\nThis page contains frequently asked questions for refunds and student fees regarding COVID-19.\nCheck here to see if any of your refund and fee questions related to COVID-19 have been answered here.\nCOVID-19 FAQ\nFinancials\nThis section contains student related financial information ranging from financial aid, how student fees are used, student fee payment methods, drop for non payment information, fee refunds, 1098-T tax information, and special circumstances for fees and payment.\nFinancial Aid Information\nStudent Fee Payment Methods\nRefund Guidelines\n1098-T Tax Information\nSpecial Circumstances\nForms, Documents, and Policies\nA list of all bursar forms, documents, policies, and procedures can be found through these two pages.\nForms and Documents\nAll forms and documents for students relating to the Bursar's Office can be found here.\nCheck this page out if you need to fill out a form and don't know where to send it.\nForms and Documents\nPolicies and Procedures\nAll policies and procedures for students relating to the Bursar's Office can be found here.\nMake sure to check out each individual policy page for more information.\nPolicies and Procedures",
    "url": "https://bursar.sfsu.edu/students",
    "domain": "bursar.sfsu.edu"
  },
  {
    "source": "https://bursar.sfsu.edu/",
    "category": "general",
    "title": "Welcome to the Bursar's Office | Bursar's Office",
    "content": "Students\nFaculty and Staff\nWelcome to the Bursar's Office\nWhat Does The Bursar's Office Do?\nThe Bursar's Office, also known as Student Financial Services, is responsible for accepting and processing tuition and fees along with other miscellaneous fee payments.\nIn addition to fee collections, the Bursar's Office manages student and third-party invoicing, installment payment plans, financial aid disbursements, refunds, and the collection of outstanding amounts due to the University.\nThese services enable the campus community to more effectively pursue their mission of teaching, learning, research and outreach.\nCOVID-19 FAQ\nStudents\nFaculty & Staff\nA list of Bursar Services\nOnline\n1. Service Ticket\nSubmit a service ticket in the\nservice portal\naccording to the categories available.\nIf your question is not covered under those categories, select \"Bursar: Other\" as the category.\nTypical response time is 1 - 2 business days.\n2. Student Fee Online Payment\nAvailable 24/7!\nLearn how to pay student fees online with the\nHow to Make a Payment video tutorial\n.\nAdministration Building\nAdministration Building Services\nServices\nHours\nLocation\nStudent Check Pickup\nMonday - Friday\n9:00 AM - 5:00 PM\n(Closed 12:00 PM - 1:00 PM)\nADM 155 (1st Floor Lobby)\nUCorp\nMonday - Friday\n9:00 AM - 5:00 PM\n(Closed 12:00 PM - 1:00 PM)\nADM 155 - Window D (1st Floor Lobby)\nStudent Services Building\nStudent Services Building Cashiering Service\nService\nHours\nLocation\nCashiering In-Person Payment\nAnd\nDepartment Deposits\nMonday - Friday\n9:00 AM - 5:00 PM\nSSB (1st Floor)\nSF State Fee Disclaimer\nThe CSU makes every effort to keep student costs to a minimum. Fees listed in published schedules or student accounts may need to be increased when public funding is inadequate. Therefore, CSU must reserve the right, even after fees are initially charged or initial fee payments are made, to increase or modify any listed fees.\nAll listed fees, other than mandatory systemwide fees, are subject to change without notice, until the date when instruction for a particular semester or quarter has begun. All CSU listed fees should be regarded as estimates that are subject to change upon approval by the Board of Trustees, the Chancellor, or the Presidents, as appropriate.\nChanges in mandatory systemwide fees will be made in accordance with the requirements of the Working Families Student Fee Transparency and Accountability Act (Sections 66028 - 66028.6 of the Education Code).\nService Ticket\nFor complex issues and/or avoid phone wait time, a service ticket is recommended.\nHours:\nMonday - Friday\n8:30 AM - 5:00 PM\nTypical response time:\n1 - 2 business days.\nSubmit Online Ticket In Service Portal\nGeneral Information\nPhone Number:\n(415) 338-1281\nPhone Hours:\nMonday - Friday\n9:00 AM - 4:00 PM\n(Closed 12:00 PM - 1:00 PM)\nMailing Address:\nSF State Bursar's Office\n1600 Holloway Ave, ADM 155\nSan Francisco, CA 94132\nQuick Links\nBursar Updates\nStudent FAQ\nDirect Deposit Sign Up\n1098-T Tax Information\nCollege of Professional & Global Education (CPaGE)\nDivision of Graduate Studies\nFinancial Aid Home\nFiscal Affairs Home\nOneCard Office\nRegistrar's Office",
    "url": "https://bursar.sfsu.edu/",
    "domain": "bursar.sfsu.edu"
  }
]