[
  {
    "source": "http://ceetl.sfsu.edu/",
    "category": "general",
    "title": "Welcome to CEETL | Center for Equity and Excellence in Teaching and Learning (CEETL)",
    "content": "Welcome to CEETL\nThe Center for Equity and Excellence in Teaching and Learning (CEETL) fosters an inclusive and welcoming teaching & learning community for faculty and the campus community to engage across disciplines. Our CEETL educational program offerings, initiatives, and resources promote learning environments that value diverse perspectives, experiences, and contributions. Through fostering partnerships across campus schools, departments, and offices, we provide institutional support at all levels of teaching and champion opportunities for reflection, connection, innovation, and inspiration.\nEngage in Peer-Supported Teaching & Learning Communities:\nEvents\nCourses and Programs\nConsultations\nSign up to be on our mailing list\nSign up for our Fall 2025 Programs & Courses\nAnnouncements\nAI Teaching Squares this Fall!\nAcademic Technology (AT) and the Center for Equity and Excellence in Teaching and Learning (CEETL) invited participation in GenAI teaching squares for fall 2025 that will provide opportunities for small groups of faculty to collaborate in the following activities:\nReflect on a Self-assessment of AI Readiness\nSeek and Share AI literacy trainings and resources\nCreate and share course and curriculum materials\nReflect on the use of AI in community with colleagues\nWe would like to meet faculty where they are. We do not suggest that faculty use or not use AI in their teaching and learning. We just ask faculty to take this opportunity to educate themselves and learn in community and develop well-reasoned and ethical uses of AI in teaching and learning. Thus, we encourage  AI-enthusiasts as well as AI-skeptics to join the squares. All lecturer faculty and tenure/tenured track faculty are eligible to participate in a GenAI teaching square. GenAI teaching square participants will receive a $500 stipend for completing the teaching square and meeting expectations.\nVisit\nhttps://ceetl.sfsu.edu/aigrant\nto learn more about the grant and teaching squares.\nWe had an overwhelming response and have closed the registration for teaching squares. Please email us at\nceetl@sfsu.edu\nif you are interested. It will help us plan the next round of engagement.\nFaculty Career Development\nNational Center for Faculty Development & Diversity (NCFDD)\nExtensive resources are available to support faculty research, scholarship and creative activities (RSCA), with a special focus on supporting BIPOC and women faculty.\nActivate your FREE membership today!\nSeek Support Services\nSee How We Can Help\nCEETL offers individual and group consultations to lecturer faculty, T/TT faculty, staff, and departments on a variety of topics related to teaching and learning.\nSchedule a one-on-one consultation.\nStay Connected With CEETL's Community\nInstagram\nLinkedIn\nYoutube\nCEETL Circles Newsletter\nResources\nCourses\nAnti-Oppression\nServices\nEvents",
    "url": "http://ceetl.sfsu.edu/",
    "domain": "ceetl.sfsu.edu"
  },
  {
    "source": "http://ceetl.sfsu.edu/node/148",
    "category": "general",
    "title": "All Anti-Oppressive Teaching Resources | Center for Equity and Excellence in Teaching and Learning (CEETL)",
    "content": "All Anti-Oppressive Teaching Resources\nAsian & AAPI\nBlack Lives Matter\nDisability Resource\nAnti-Racist\nLatinx Solidarity Statement & Teaching Resources\nSolidarity Statement in Support of Dalit and Caste Oppressed Communities\nTeaching Support in the context of the Israel-Hamas War",
    "url": "http://ceetl.sfsu.edu/node/148",
    "domain": "ceetl.sfsu.edu"
  },
  {
    "source": "https://ceetl.sfsu.edu/conversations-about-challenging-topics",
    "category": "general",
    "title": "Conversations About Challenging Moments | Center for Equity and Excellence in Teaching and Learning (CEETL)",
    "content": "Conversations About Challenging Moments\nTools to help lead thoughtful conversations in your courses\nEducators have a responsibility to embody the values and behaviors we want to see in the world. One way to do this is by creating opportunities for their students to express and process their feelings during a traumatic event. Even though instructors may feel overwhelmed to have these difficult conversations or may feel they don’t align with the content, we do need to acknowledge that the outside world affects the classroom. We need to find a way to facilitate and guide students but also respect those who may not want to engage.\nWe have some theoretical concepts and resources to support and guide you to facilitate difficult conversations in your classroom.\nPre- and Post-election Resources\nAcknowledging current events is important. You may not be an expert but students may need to be grounded to be ready for your content for that day. We suggest that you find a moment to acknowledge any discomfort or distractions, and use mindfulness to center students before starting class, especially on those difficult and tumultuous days. Our campus values free speech and we want to ensure that no student feels unheard or shut down. It may be important to have some community agreements in the classroom to enable respectful dialogue.\nWe will continue to build this section but these are some resources for election-related conversations.\nPost-election Advice for the classroom from a teacher\n5 Ways to integrate the 2024 Election into the Classroom\nTalking across Divides: 10 Ways to Encourage Civil Classroom Conversation on Difficult Issues\nNavigating challenging conversations with students in this particularly fraught time.\nExplaining the Exploding Clown Car\nTeaching Resources to Help Students Make Sense of the Rampage at the Capitol\nResources For Challenging Moments\nMaking Space for Difficult Discussions\nMaking the most of \"Hot Moments\" in the classroom\nResources for Supporting Our Campuses in Politically Fraught Times\nTeaching in the Age of Disinformation\nManaging Hot Moments in the Classroom: Concrete Strategies for Cooling Down Tension\nResponding to Microaggressions in the Classroom: Taking ACTION\nWhat to do Before, During, and After Difficult Dialogues About Diversity\nOn “Difficult’ Conversations\nPedagogies of Care: Open Resources for Student-Centered and Adaptive Strategies in the New Higher-Ed Landscape\nResponding to Microaggressions in Online Learning Environments During a Pandemic\nPedagogy of Discomfort\nBoler, Megan. (1999). \"A Pedagogy of Discomfort.\" Feeling Power: Emotions and Education.  Routledge: NY, NY.\nBird, F. B., & Waters, J. A. (1989). The Moral Muteness of Managers. California Management Review, 32(1), 73-88.\nhttps://doi.org/10.2307/41166735\nZembylas, Michalinos (2018). Affect, race, and white discomfort in schooling: decolonial strategies for ‘pedagogies of discomfort’. Ethics and Education 13 (1):86-104.\nResources to Manage Disruptive Behavior\nStudents may display disruptive behaviors in the classroom for which there may not be apparent causes. These are some resources to help you manage such situations. You can also reach out for 1:1 consultations with CEETL or\nDean of Students\n(Action Care Team or Student Conduct).\nBest Practices for Managing Disruptive Behavior\nAddressing Student Needs: Dealing with Disruptive Behavior in the Classroom\nWorking with students on the Autism Spectrum\nSupporting Neurodivergent Students in the College Classroom\nStrategies for preventing disruption and disrespect in the classroom\nPreventing Peer-to-Peer disrespect\nMaking the most of hot moments\nDealing with the unexpected\n(strategies for both online and in-person courses)\nConversations About Race\nTalking about Race\nEngaging With Students in Conversations About Race\n‘We Can’t Ignore This Issue’: How to Talk With Students About Racism\nDiscussing Race, Racism, and other Difficult Topics with Students\nTeaching Race: Pedagogy and Practice\nHow to Talk with Students about Racism\nPedagogical Strategies to Discuss Institutional Legacies of Racism with Students\nActivities For the Classroom\nSpecific Tools for Difficult Dialogues\nThe Day After: An Activity\nCreating a Safe Space in Your Class During a Crisis\nFeedback\nDid you find these resources helpful? Please write to\nceetl@sfsu.edu\nand let us know.",
    "url": "https://ceetl.sfsu.edu/conversations-about-challenging-topics",
    "domain": "ceetl.sfsu.edu"
  },
  {
    "source": "https://ceetl.sfsu.edu/leadership",
    "category": "general",
    "title": "Leadership | Center for Equity and Excellence in Teaching and Learning (CEETL)",
    "content": "Leadership\nCurrent Leadership\nAnoshua Chaudhuri\nSenior Director of Teaching and Learning Programs and Services\nCEETL serves a vital role on our campus, as a source of community, and teaching and learning support to faculty; and of course as a crucial means of enabling our students to succeed in the classroom, and beyond.  Dr. Chaudhuri joined this position having directly served our students for 20 years and proven herself as a respected and effective leader.\nDr. Chaudhuri is the Senior Director of the Center for Equity and Excellence in Teaching and Learning, a full professor and former department chair of the Economics department at San Francisco State University. She received a Ph.D. in Economics from the University of Washington, Seattle, and an M.A. in Economics from the Delhi School of Economics. Dr. Chaudhuri’s research has been at the intersection of health, development, and family economics, evaluating the impacts of policies and programs on community and household health outcomes with a focus on children and the elderly. She has over 25 publications in peer-reviewed journals and books. She continues to collaborate with community agencies in participatory research projects and has received many engaged scholarship awards and high-impact teaching awards as she involves her students in these research projects. She has taught courses in Health Economics Research, Economics of Gender, and Microeconomics and has been a dedicated user of community service learning in her classroom. Dr. Chaudhuri's campus work has included promoting faculty diversity and student success. Dr. Chaudhuri serves on the Board of SF State’s University Corporation as Board Chair and as an advisory board member of the non-profit mental health agency, Richmond Area Multi-services or RAMS. She received the 2023-25 Lam Larsen Distinguished Service Professor award from the Lam Family College of Business for all her contributions to the campus and community, through her teaching, research, and service.\nFormer Leadership\nCrystal Wong\nInterim Senior Director of Teaching and Learning Programs and Services | 2022 - 2023\nCrystal O. Wong, EdD, has been teaching in the writing program at San Francisco State University since 2007. Prior to that, she taught in a variety of educational institutions, from elementary schools to adult literacy programs and community colleges. A first-generation college graduate, Dr. Wong received a B.A. in Music, B.A. in Liberal Studies, M.A. in English, and an Ed.D. in Educational Leadership. She has published articles and led workshops on student engagement, learning, and assessment, and has received the university-wide First-Year Teaching Award and the Liberal & Creative Arts Excellence in Teaching Award. Dr. Wong has a passion for learning and effective teaching and is an advocate for social justice, inclusivity, and equity for marginalized students.\nMaggie Beers\nAssistant Vice-President for Teaching and Learning | 2018-2022\nMaggie Beers received her B.A. and M.A. in Spanish and Latin American Literature from UC Santa Barbara and her Ph.D. from the Faculty of Education at the University of British Columbia, where she investigated ways to prepare teachers to use audiovisual media, educational technology, and digital ethnography methods to define and teach culture from a social justice perspective in modern language courses. With more than 20 years’ teaching and 10 years' administrative experience in public post-secondary institutions in the US, Canada, Spain, and France, Maggie passionately provided faculty and students universal access to a wide range of teaching strategies and experiences in support of student success, many of which are enabled by technology. During her time at SFSU, Maggie supported the committed CEETL staff and faculty to develop and expand our faculty development programs and services in support of effective, equitable, and inclusive teaching and learning with (or without) technology. Maggie is currently the Associate Chief Information Office at University of California, San Francisco.",
    "url": "https://ceetl.sfsu.edu/leadership",
    "domain": "ceetl.sfsu.edu"
  }
]