[
  {
    "source": "https://health.sfsu.edu/content/myhealth",
    "category": "student_health",
    "title": "myHealth | Gator Student Health Center",
    "content": "myHealth\nSTUDENT SERVICES\nmyHealth\nis a secure and confidential system that allows you to access your medical information and messages to and from your Student Health Services providers.\nThrough myHealth you can:\nMake\nappointments\nonline\nView and cancel scheduled appointments\nView and edit your Student Health Services profile\nReceive messages from your health provider\nView your itemized charges for services and medications\nPrint out a list of immunizations received at Student Health Services\nComplete online forms, questionnaires and surveys\nDownload handouts sent to you by your provider\nSecure Messaging via myHealth\nIf a provider sends you a message, you will receive an email notification to your SF State email (@mail.sfsu.edu). The email lets you know there is a confidential message from the health center and includes a link to myHealth.\nSTUDENTS and EMPLOYEES\nLog in to myHealth\nUPLOAD Instructions\nTo upload Immunization records\nLog into myHealth\nSelect Forms & Immunization Requirements\nUpload a picture of your immunization records under\nImmunization Documents.\nAfter uploading or submitting your records, click in the name of each immunization” (Be sure to include the\ndate of each vaccination dose/titers\n.\nClick done.\n**PROBLEMS with uploading:  email\nstudenthealthservices@sfsu.edu\n, please include your full name and University ID# in your email.\nTo request an exemption:\nLog in to myHealth (button above); follow prompts.\nNavigate to \"Downloadable Forms\" in menu on the left.\nFollow instructions to download the Certification form in myHealth,  fill it out, check appropriate 'exemption request' box and then \"Upload\" your completed form using the button in myHealth.\nFor medical exemptions, upload an additional document with your medical reasons for requesting an exemption. Include your name and University ID#.  Upload it using the button in myHealth.\nClick \"Save\" (Note: Status will be \"non-compliant\" until request is approved.)\nCheck back in \"Medical Clearances\" in 7-10 days to see if your uploads have been verified and your status updated to \"Compliant.\"",
    "url": "https://health.sfsu.edu/content/myhealth",
    "domain": "health.sfsu.edu"
  }
]