[
  {
    "source": "http://slhs.sfsu.edu",
    "category": "general",
    "title": "Welcome | Department of Speech, Language and Hearing Sciences",
    "content": "Our Students\nApply Now\nWelcome\nThe SF State Speech, Language and Hearing Sciences department is based on the following core values: collaboration, compassion, resilience, inquiry and investigation, life-long learning, professionalism, multiculturalism, leadership, mentorship, advocacy and internationalism.  Please see our\nSLHS Department Strategic Plan\nas well as our\nPosition Statement on Supporting Students who are Non-native Speakers of Standard American English\n.  You can also download our\nprevious CD Program Strategic Plan\n.\nFor a shorter, more concise version of our Strategic Plan, please download our\nStrategic Plan Executive Summary\n.\nStudent interns in the SLHS department are placed in internships all over the culturally and linguistically rich San Francisco Bay Area, including urban, suburban and rural schools, private practices, rehabilitation facilities, skilled nursing facilities, acute care medical settings and more. The SLHS department has access to over 20 school districts and 36 medical facilities that are available for placing SF State speech-language pathology interns through established memoranda of understanding (MOUs). Internship experiences range from low-income schools with predominantly English-language learners to rehabilitation centers with war veterans, to clients with voice disorders, to patients with head injuries.\nOffice Hours\nMonday\n– 9 a.m - 5 p.m. remote office hours\nTuesday\n– 10:00 a.m. - 5:00 p.m.\nWednesday\n– 10:00 a.m. - 5:00 p.m.\nThursday\n– 10:00 a.m. - 5:00 p.m.\nFriday\n– 9 a.m. - 5 p.m. remote office hours\nClosed for lunch 12-12:30 p.m.\nContact Information\nEmail\n:\nslhsinfo@sfsu.edu\nPhone\n: (415) 338-1001\nMission\nVision\nAccreditation\nThe Master of Science (M.S.)\neducation program in Speech Language Pathology\n{residential} at San Francisco State University is accredited by the\nCouncil on Academic Accreditation in Audiology and Speech-Language Pathology\nof the American Speech-Language-Hearing Association, 2200 Research Boulevard #310, Rockville, Maryland 20850, 800-498-2071 or 301-296-5700.\nThe current accreditation cycle by CAA is 2025 – 2033.  Our curricula prepare students to meet the standards of ASHA certification, California state licensure in speech-language pathology, and the California Speech-Language Pathology Services Credential. Please visit our\nProspective Students\npage for more information about how to apply to our program.\nMore information about accreditation\nStudent Outcome Data\nApplying to the Master's Program\nSpotlight\nThe Nicholas Certo Speech, Language and Hearing Clinic\nThe SLHS department operates the Nicholas Certo Speech, Language, and Hearing Clinic, offering affordable, high-quality speech-language services to the San Francisco Bay Area. This clinic serves as a training facility for master's-level clinicians, with graduate students conducting screenings, diagnostic evaluations, and therapeutic services for clients of all ages. All services are overseen by a licensed, ASHA-certified faculty member, ensuring professional standards and educational excellence.\nTo learn more, visit our\nClinic\npage.\nQuestions About Applying?\nExplore San Francisco State University's Department of Speech, Language, and Hearing Sciences (SLHS) for detailed guidance on applying to undergraduate and graduate programs. Whether you're seeking prerequisites, post-baccalaureate options, or information about careers in speech-language therapy, this page is a key resource for prospective students. Discover course offerings, application requirements, and career pathways to help you navigate your future with us.\nFor more details, visit our\nProspective Students\npage.\nMeet Our Faculty\nMeet the dedicated faculty and staff of SF State's Department of Speech, Language, and Hearing Sciences. This page provides an overview of the department’s professors, advisors, and clinical instructors who guide students in their academic and professional journeys. Learn about their backgrounds, specialties, and contact information to connect with the experts shaping the future of speech-language pathology and audiology.\nFor more details, visit our\nFaculty and Staff\npage.\nHuge congratulations to John Kim, MS, CCC-SLP!  He passed his qualifying exams as a part of the SFSU-UCB Joint Doctoral Program requirements, and will now move on to his dissertation!!!\nNote: The following PDFs are in the process of being made full accessible. If you have difficulty reading the PDFs, please contact the SLHS Department at\nslhsinfo@sfsu.edu\nor (415) 338-1001.\nFor PDF files, you'll need Adobe Acrobat 5.0 or above to view it. If you need Adobe Acrobat Reader it's available\nfree from Adobe\n.\nSFSU SLHS Strategic Plan Executive Summary 2024.pdf\n70.55 KB",
    "url": "http://slhs.sfsu.edu",
    "domain": "slhs.sfsu.edu"
  },
  {
    "source": "http://slhs.sfsu.edu/gray-matter-lab",
    "category": "general",
    "title": "Gray Matter Lab | Department of Speech, Language and Hearing Sciences",
    "content": "Gray Matter Lab\nWelcome to the Gray Matter Lab\nOur mission is to enhance the quality of life for individuals with aphasia and their support networks, while also fostering the growth of future professionals through research mentorship and clinical training.\nMission & Vision Statements\nOur mission is to serve historically marginalized and underrepresented communities (e.g., BIPOC, LBGTQ+, linguistically diverse) and lead the way in developing evidence-based therapy methods for bilingual and multilingual populations with aphasia.\nOur vision is that BIPOC and linguistically diverse populations with aphasia will receive the highest quality of therapy in order to increase communicative effectiveness and quality of life experiences.\nAnti-Racist Statement\nThe Gray Matter Lab pledges our continued commitment to serve Black, Indigenous, and people of color (BIPOC) and bilingual and multilingual populations that have been historically marginalized and underserved. We are committed to offering BIPOC and linguistically minoritized community members a safe space that is inclusive, respectful, and improves the quality of their lives.\nThe Gray Matter Lab stands in solidarity with Black Lives Matter. Inequalities and prejudices toward Black lives have long been systematically enshrined in the societal and legislative backbones of our nation. We denounce these inequalities and the systematic racism that Black people have long endured. The murders of Breonna Taylor, George Floyd, Ahmaud Arbery and many other black lives that have fallen victim to racism and oppression.\nWe strive to equally support and promote multiculturalism, inclusivity, opportunity, respect, and dignity for all of our members, patients, families, and others who might interact with our lab. Likewise, we recognize and aim to celebrate diversity and honor equality.\nResearch\nThe long-term goal of our research is to improve the quality of life of monolingual and bilingual people with aphasia.\nCultural Responsiveness and Equity in Aphasia Treatment\nMost of the treatment research in aphasia is based on English speaking adults from western countries. However, many people in the world speak languages other than English, and more than half the world is bilingual. Within the United States, this population is rapidly increasing, and people with aphasia who are seeking language rehabilitation services have the right to receive language treatment in their preferred language. To best serve culturally and linguistically diverse persons with aphasia, it is critical that speech and language pathologists have access to evidence-based treatment materials that are culturally and linguistically appropriate.\nAbSANT (abstract semantic associative networking training) is a naming intervention developed for English speaking persons with aphasia. In this project, we are examining the efficacy of AbSANT with Spanish speaking persons with aphasia.\nWe are currently recruiting Spanish speaking adults (monolingual or bilingual) with any type of aphasia. If interested in learning more, please contact Dr. Teresa Gray at\ngraymatterlaboratory@gmail.com\n.\nProject collaborator: Dr. Chaleece Sandberg, Penn State University\nBilingual abstract semantic associative network training (BAbSANT)\nThe purpose of this study is to determine the effects of training abstract word retrieval in bilingual people with aphasia. Previous work has found that training abstract words results in improvement to abstract words and concrete words in monolingual patients with aphasia. Outcomes regarding bilingual populations are unclear. The goal of this project is to help to guide clinical decisions for monolingual and bilingual persons with aphasia.\nWe are currently recruiting bilingual (any language combination) adults with aphasia.  Individuals can be balanced or unbalanced bilinguals with any type of aphasia.  If interested in learning more, please contact Dr. Teresa Gray at\ngraymatterlaboratory@gmail.com\nProject collaborator: Dr. Chaleece Sandberg, Penn State University\nCulturally responsive conversation groups for Black adults with aphasia\nAlthough Black people have a higher prevalence of stroke than any other racial group, they are less likely to receive speech and language services. In addition, Black, Indigenous, and People of Color (BIPOC) are historically excluded from speech, language, and hearing sciences research. Based on our preliminary data, Black adults with aphasia have reported that participating in a Black conversation group is beneficial to their well-being because it creates a safe space where they feel more comfortable to freely express themselves, e.g., use African American English without being judged and talk about the Black experience in America. Further, the majority of aphasia treatment research is based on White people, but racial minorities comprise 40% of the population. Thus, for speech and language pathologists to best serve their diverse patient population, it is critical that we better understand treatment methods that address diversity.\nIn this study we host a Black conversation group (led by Black student clinicians) so that Black people with aphasia are in the majority, compared to the typical aphasia group where Black PWA are in the minority. We are evaluating the efficacy of this group to ascertain why and how this group is beneficial for improved communication for Black PWA.\nWe are currently recruiting Black adults with aphasia. If interested in learning more, please contact Dr. Teresa Gray at\ngraymatterlaboratory@gmail.com\n.\nCollaborator: Dr. Jamie Azios, University of Louisiana at Lafayette\nParticipate\nTherapy Services\nDiversity, Equity & Inclusion\nResources\nEspañol\nOur Team\nWould you like to participate in our research projects?\nPeople with aphasia\nWe are currently recruiting monolingual and bilingual (any language combination) adults with aphasia to participate in a naming study.\nAre you over 18 and interested in receiving language therapy? We’d love to hear from you!\nWe look forward to hearing from you!\nContact: Teresa Gray, Ph.D., CCC-SLP. Call or email: (415) 405-3488,\ngraymatterlaboratory@gmail.com\nStudents, SLPs, and community members\nWe are currently looking for research assistants and collaborators.\nEmail Dr. Gray at\nteresag@sfsu.edu\nto chat more about the on-going projects in the lab.\nSF State: Gray Matter Lab's Conversation Club\nThis group meets on Fridays via Zoom. We would love to see you!\nThe Conversation Club is open to individuals with aphasia or a related neurogenic communication disorder. We discuss current events, hobbies and interests. There is no charge to attend. If you are interested, please contact us! Contact the Gray Matter Lab at\ngraymatterlaboratory@gmail.com\n.\nSF State: El Club de Conversación en español\nParticipe en nuestro Club de Conversación en español para adultos con afasia!\nEl Club de Conversación da la bienvenida a aquellos con afasia o un trastorno relacionado de la comunicación neurogénica. Hablamos sobre eventos de actualidad, pasatiempos e intereses. Es gratis atender las juntas. Si está interesado, puede contactarnos! Póngase en contacto con \"Gray Matter Lab\" en\ngraymatterlaboratory@gmail.com\n.\nSF State: Gray Matter Lab's Conversation Club for Black adults with aphasia, led by Black student clinicians\nThis group meets on Fridays via Zoom. We would love to see you!\nJoin our online conversation club for Black adults with aphasia run by Black student clinicians. Come and improve your communication skills, be supported by peers, and have fun!\nSF State: Speech, Language and Hearing Sciences Clinic\nAre you interested in receiving individual or group therapy services? The SF State Speech, Language and Hearing Sciences Clinic offers speech and language therapy for individuals with aphasia, TBI, apraxia, and other communication impairments. For more information, see:\nhttp://slhs.sfsu.edu/clinic\nor contact the clinic directly: phone: (415) 338-1001 or email:\nslhsinfo@sfsu.edu\n.\nCity College of San Francisco\nCCSF offers various communication courses for stroke and TBI survivors. For more information contact Joyce Foreman:\njforeman@ccsf.edu\n.\nThe Aphasia Center of Oakland\nThe Aphasia Center of California provides a variety of services (e.g., conversation groups, book clubs, recreational groups, education and training) that enhance communication and quality of life for individuals with aphasia. For more information, see:\nhttps://aphasiacenter.net/about-us/overview/\nor contact the center directly: phone: (510) 336-0112.\nThe Gray Matter Lab is a place of learning and progress, where we seek to promote equity in all that we do. In this way, the lab has dedicated itself to providing all patients and students with the means they need to be successful in our lab. While we continue to seek more ways to support students and patients to create a diverse and inclusive lab space, our on-going action items that promote equity in our work include the following:\nLoan laptops and other electronics to patients who do not have access to materials necessary for remote therapy services;\nIntentionally recruit students who are bilingual, first generation, BIPOC, or who otherwise might face barriers to joining a research lab in order to ensure our lab reflects the population we serve at large (Chaudhary, 2020);\nLead informed antiracism discussions within our lab to provide a safe space for these issues to be discussed and to provide training on culturally responsive care for future clinicians (Chaudhary, 2020);\nAddress any racism or microaggressions that occur in our lab;\nWrite and submit grants that advance diversity, equity, and inclusion;\nUpdating patient onboarding documents to be more accessible and inclusive;\nUpdating diagnostic materials so that they are more inclusive of diverse populations. Regarding standardized assessments, we will adhere to publication guidelines (e.g., Boston Naming Test);\nReading scientific articles by Black researchers.\nWhile this list is not comprehensive in any way, the Gray Matter lab acknowledges that being anti-racist takes deliberate effort to root out any vestiges of systemic racism within institutions in order to stand and fight against them and so we will continue to provide an equitable space for all.\nApps/Software\nTavistock Aphasia Software Finder\nApps and software programs in English for people with aphasia.\nAphasia Apps List\nProvides a person with aphasia with information about phone applications that can help them communicate – multilingual, some apps are free\nMultilingual Therapy Materials\nCaregivers\nAphasia Recovery Connection\nMeet others with aphasia and their caregivers & families\nHelp new group friends stay in touch\nLearn the latest information about aphasia\nHelp each other through difficult times\nNational Aphasia Assocation\nOnline aphasia communities provide resources to Facebook support groups (Aphasia Recovery Connection), and blogs with stories of people with aphasia and their road to recovery (Aphasia Hope Foundation).\nMore on Aphasia\nAphasia Access\nAphasia Access: Transforming services and environments so people with aphasia can participate more fully in life.\nAphasia Institute\nThe first step in restoring confidence and improving coping skills for those affected by aphasia, showing clients and their families that it can be possible to live successfully with aphasia.\nTerapia de Habla\nBuscamos sobrevivientes de accidentes cerebrovascular MONOLINGÜES EN ESPAÑOL\nEstamos investigando como las personas con afasia aprenden palabras y mejoran la capacidad de hablar!\nTiene entre 18 y 90 años?\nPara más información, envíe un correo electronico a\ngraymatterlaboratory@gmail.com\ny pregunte por Maryvi o la Dra. Gray\nSF State: El Club de Conversación en español\nParticipe en nuestro Club de Conversación en español para adultos con afasia!\nEl Club de Conversación da la bienvenida a aquellos con afasia o un trastorno relacionado de la comunicación neurogénica. Hablamos sobre eventos de actualidad, pasatiempos e intereses. Es gratis atender las juntas. Si está interesado, puede contactarnos! Póngase en contacto con \"Gray Matter Lab\" en\ngraymatterlaboratory@gmail.com\n.\nGML Terapia en Español Bilingual Naming Therapy\nInformación: La Vida Tras Un Ataque Cerebral\nLa Vida Tras Un Ataque Cerebral\nPara más información\nLab Director\nTeresa Gray\nteresag@sfsu.edu\nEducation\n2015 Ph.D., Boston University\n2008 M.A., San Jose State University\n2000 B.A., University of California at Santa Cruz\nResearch Interests\nTeresa Gray, Ph.D., CCC-SLP is the director of the Gray Matter Lab. Her research interests are focused on exploring the relationship between lexical access and verbal and nonverbal control mechanisms in aphasia and improving the effectiveness of language intervention for bilingual populations with aphasia. Her clinical expertise includes assessing and providing language and executive function treatments for monolingual and bilingual populations with aphasia and traumatic brain injury.\nLearn about our student team members\nPublications\nGray, T., Palevich, J., & Sandberg, C. (2024). Bilingual Abstract Semantic Associative Network Training (BAbSANT): A Russian–English case study. Bilingualism: Language and Cognition, 27(2), 229–245. doi:10.1017/S1366728923000500\nSandberg, C. W., Khorassani, H., Gray, T., & Dickey, M. W. (2023). Novel participant-level meta-analytic evidence for AbSANT efficacy.\nFrontiers in Rehabilitation Sciences\n, 4; 1-22. doi 10.3389/fresc.2023.1017389\nSandberg, C. W., Zacharewicz, M., & Gray, T. (2021). Bilingual Abstract Semantic Associative Network Training (BAbSANT): A Polish-English Case Study.\nJournal of Communication Disorders\n, 106143.\nPeñaloza, C., Scimeca, M., Gaona, A., Carpenter, E., Mukadam, N., Gray, T., Shamapant, S., & Kiran, S. (2021). Telerehabilitation for word retrieval deficits in bilinguals with aphasia: Effectiveness and reliability as compared to in-person language therapy.\nFrontiers in neurology\n,\n12\n, 598.\nGray, T. (2020). The relationship between semantic control, language control, and nonverbal control in bilingual aphasia.\nBehavioral Sciences, 10(\n10), 155.\nSandberg, C., & Gray, T., (2020). Abstract Semantic Associative Network Training (AbSANT): A replication and update of an abstract word retrieval therapy program.\nAmerican Journal of Speech-Language Pathology\n.\nDekhtyar, M., Kiran, S., & Gray, T. (2020). Is bilingualism neuroprotective for patients with aphasia.\nNeurpsychologia\n, 139(2). doi: 10.1016/j.neuropsychologia.2020.107355\nSandberg, C., Gray, T., & Kiran, S. (2019). Development of a Free Online Interactive Naming Therapy for Bilingual Aphasia.\nAmerican Journal of Speech-Language Pathology\n.\nGray, T., & Kiran, S. (2018). The effect of task complexity on linguistic and non-linguistic control mechanisms in bilingual aphasia.\nBilingualism: Language and Cognition\n, 1-19.\nGray, T., Navarro, J., Fragoso, N., Conner, O. (2018). Codeswitching in bilingual aphasia. Frontiers in Psychology Conference Abstract: 56th Annual Academy of Aphasia meeting. doi: 10.3389/conf.fnhum.2018.228.00100\nKiran, S., & Gray, T. (2018). Chapter 10: Understanding the nature of bilingual aphasia: Diagnosis, assessment, and rehabilitation. In J. Rothman & L. Serratrice (Eds.),\nStudies in Bilingualism\n. John Benjamins Publishing Company.\nGray, T. (2017). Bilingual Aphasia: An intervention roadmap and the dynamic interplay between lexical access and language control.\nPerspectives: Neurophysiology and Neurogenic Speech and Language Disorders\n.\nGray, T., & Kiran, S. (2016). The relationship between language control and cognitive control in bilingual aphasia.\nBilingualism: Language and Cognition\n, 19(03), 433-452.\nGray, T. & Kiran, S. (2016). Control mechanisms in aphasia. Frontiers in Psychology Conference Abstract: 54th Annual Academy of Aphasia Meeting. doi: 10.3389/conf.fpsyg.2016.68.00085\nKiran, S., Sandberg, C., Gray, T., Ascenso, E., & Kester, E. (2013). Rehabilitation in bilingual aphasia: Evidence for within-and between-language generalization.\nAmerican Journal of Speech-Language Pathology\n, 22(2), S298.\nGray, T. & Kiran, S. (2013). A theoretical account of lexical and semantic deficits in bilingual aphasia.\nJournal of Speech Language and Hearing Research\n, 56, 1314-1327.\nConference Presentations\n2025\nBallerda, S., Ventura, A., Sandberg, C., Gray, T. (2025, May).\nTranslanguaging in aphasia: An innovative framework for Tagalog-English bilingual recovery.\nProposal accepted as a presentation at the Asian Pacific Islander 2025 Research and Clinical Symposium, online.\nSandberg, C., Gray, T., Osfoori, P., & Dickey, M. (2025, March).\nMeta-analysis of Bilingual Abstract Semantic Associative Network Training (BAbSANT) efficacy.\nProposal accepted as a platform presentation at\nClinical Aphasiology Conference, Albuquerque, NM.\nGray, T., Ballerda, S., Ventura, A., Balk, G., Medina, S., Van Wiggeren, N., & Sandberg, C. (2025, March).\nTranslanguaging in aphasia: An innovative framework for multilingual language recovery.\nPoster presented at the Aphasia Access Leadership Conference, Pittsburgh, PA.\nZimmerman, R., Brown, W., Mendez, D., Cunnigen, D., Dade, S., Delgado, G., Stevenson, L., Azios, J., & Gray, T. (2025, March). As a Black person […] you have to know yourself well enough to accept whatever you’re given. Poster presented at the Aphasia Access Leadership Conference, Pittsburgh, PA.\n2024\nGriffith, D., Coleman, B., Mendez, D., Siah, S., Cunnigen, D., Delgado, G., Meschack, B., Stevenson, L., & Gray, T. (2024, March).\nHow do SLPs improve speech and language rehabilitation outcomes for Black adults with aphasia?\nPoster presented at the California Speech and Hearing Association annual conference, San Francisco, CA.\nMorales, M., Domingo, D., Rojas, A., Mares, K., Medrano, P., Sandberg, C., & Gray, T. (2024, March).\nAbstract semantic associative network training (AbSANT) administered to Spanish speaking persons with aphasia.\nPoster presented at the California Speech and Hearing Association annual conference, San Francisco, CA.\nRoman, L., Ballerda, S., Razón, M., Veluya, J., Sandberg, C., Gray, T. (2024, March).\nThe effect of training abstract words in a bilingual context with a Tagalog-English person with aphasia.\nPoster presented at the California Speech and Hearing Association annual conference, San Francisco, CA.\n2023\nRowell, A, Thompson, T., Mendez, D., Cunnigan, D., Stevens, L., & Gray, T. (2023, March).\nReworking the Recipe: How to create and support a BIPOC aphasia conversation group.\nPoster presented at the 5th Aphasia Leadership Summit, Raleigh-Durham, NC.\nMorales, M., Tampa, K., & Gray, T. (2023, March).\nEstablishing and supporting a culturally and linguistically responsive Spanish speaking aphasia conversation group.\nPoster presented at the 5th Aphasia Leadership Summit, Raleigh-Durham, NC.\nOlivares, B., & Gray, T. (2023, March).\nTask switching in bilingual aphasia.\nPoster presented at the California Speech and Hearing Association, Anaheim, CA.\n2022\nSandberg, C., Gray, T., Khorassani, H., & Dickey, M.W. (2022). Meta-analysis of AbSANT efficacy. Frontiers in Psychology Conference Abstract: 60\nth\nAnnual Academy of Aphasia meeting.\nLundeen, E., Dinsmore, K., Sandberg, C., & Gray, T. (2022). Exploring cognitive control in bilingual aphasia. Frontiers in Psychology Conference Abstract: 60th Annual Academy of Aphasia meeting.\nVeluya, J.O., Sandberg, C.W., & Gray, T. (June, 2022).\nThe Effect of Training Abstract Words in a Bilingual Tagalog-English Aphasia Treatment.\nProposal accepted as a poster presentation at the International Aphasia Rehabilitation Conference, Philadelphia, PA.\nKhorassani, H., Morales, M., Sandberg, C.W., & Gray, T. (June, 2022).\nCaregiver-Led Word Retrieval Training Using a Free Online Interactive Naming Therapy Website for Persons With Aphasia.\nProposal accepted as a poster presentation at the International Aphasia Rehabilitation Conference, Philadelphia, PA.\nKhorassani, H., Morales, M., Sandberg, C.W., & Gra",
    "url": "http://slhs.sfsu.edu/gray-matter-lab",
    "domain": "slhs.sfsu.edu"
  },
  {
    "source": "http://slhs.sfsu.edu/scholarships",
    "category": "financial_aid",
    "title": "Grant, Scholarship, and Fellowship Opportunities | Department of Speech, Language and Hearing Sciences",
    "content": "Grant, Scholarship, and Fellowship Opportunities\nTraining Grants\nFederally funded training grants are available for graduate students in the SF State CD Program to receive stipend support while obtaining a specialization in\nAugmentative and Alternative Communication (AAC)\nand\nAutism and Neurodiversity.\nCollege of Education Scholarships\nThe Graduate College of Education offers a number of\nscholarships\n.\nASHA Foundation Scholarships\nThe American Speech-Language-Hearing Association (ASHA) Foundation offers many\nscholarships\nfor students and scholars.\nCampus Scholarship Listing\nA listing of\nscholarships\noffered across colleges at SF State is available for review.\nChicana/Latina Foundation Scholarship Program\nEach year the Chicana Latina Foundation awards merit-based\nscholarships\nto Latina college students, valued at $1,500 dollars each. All of the scholarship awardees attend a leadership institute retreat each semester where they are immersed in topics such as public policy, community advocacy, financial literacy and leadership skill development. There is also a strong focus on cultural connection as well as personal care and growth.\nGeneral Scholarship Listing\nA listing of scholarships offered across the country that may be applicable to students at SF State is available at\nFinancial Aid\n.\nAcademic Honors and Fellowships Office\nAn Academic Honors and Fellowships Advisor is available to assist undergraduates and recent alumni in applying for nationally competitive\nscholarships and fellowships\n, as well as system-wide scholarships and fellowships offered by CSU. The opportunities provided by these fellowships include generous funding for graduate studies, as well as research experience and prestigious internships in the U.S. and abroad.\nCalifornia Pre-Doctoral Program\nThe\nCalifornia Pre-Doctoral Program\nis designed to diversify the pool of university faculty by supporting the doctoral aspirations of students who are upper division undergraduates or graduate students on a California State University campus, economically or educationally disadvantaged, with focused research interests, and an interest in a university faculty career. Students who are chosen for this prestigious award are designated Sally Casanova Pre-Doctoral Scholars as a tribute to Dr. Sally Casanova, for whom the scholarship is named.",
    "url": "http://slhs.sfsu.edu/scholarships",
    "domain": "slhs.sfsu.edu"
  }
]