[
  {
    "source": "https://upd.sfsu.edu/clery-information",
    "category": "general",
    "title": "Clery Information | University Police Department",
    "content": "Clery Information\nThe issue of campus safety is a significant concern to many students and their families when choosing postsecondary educational institution(s). To help inform students and their families about campus safety, the federal Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act (Clery Act) requires all institutions that participate in federal student aid programs under Title IV of the Higher Education Act of 1965 to publish annual security reports disclosing specified campus crime statistics and campus security policies. The Clery Act requires these institutions to report statistics related to certain crimes, which include criminal homicides, sex offenses, robberies, and aggravated assaults, as well as to disclose or have in place a number of policies that address in part how they will respond to and prevent crimes.\n2025 Annual Security Report\n2025 Campus Safety Plan\nView the \"Systemwide Hate Crimes Report\"\nhere\n.\nSFSU Campus Security Authorities Brochure\nCampus Security Authority (CSA) Incident Reporting Form\nAdobe Acrobat Reader\nis required to view PDF files. This is a free program available from the\nAdobe web site\n. Follow the download directions on the Adobe web site to get your copy of Adobe Acrobat Reader.",
    "url": "https://upd.sfsu.edu/clery-information",
    "domain": "upd.sfsu.edu"
  },
  {
    "source": "https://upd.sfsu.edu/i-9-verification",
    "category": "general",
    "title": "Student I-9 Verification and Hire Process | University Police Department",
    "content": "Student I-9 Verification and Hire Process\nGraduate Assistant (GA) or Graduate Teaching Assistant (GTA)\nGA and GTA will complete the I-9 with their hiring departments.\nAuxiliary Positions\nComplete I-9 with the on-campus employer.\nAuxiliary positions refer to positions at Sodexo, Associated Students, Inc., University Cooperation (U-Corp), SFSU Bookstore, or any other on-campus commercial employers.\nRemember, NO STUDENT MAY BEGIN WORK until after their I-9 verification has been completed.\nI-9 Verification is not available on holidays, or when the campus is closed. Please check the online calendar for upcoming holidays and dates when the campus will be closed.\nResident Student I-9 Verification and Hire Process\nStep 1 - Send and email to Student_i-9@sfsu.edu with the following information\nYour full and complete first and last name as it appears on your identification\nSF State student email\n(No personal emails)\nYour SF State Student ID Number #\nStep 2 - I-9 Tracker profile will be created by I-9 Verification Specialist from Campus Safety\nAn automated message from I-9 Tracker will be sent to your SF State student\nemail.  Please check your spam or junk folder if you do not see it in your inbox. Log into I-9 Tracker and complete Part 1 (Section 1).\nStep 3 – A second email will be sent to your SF State student email with instructions on how to complete your Form I-9 (Part 2).\nThe instructions email will include what documents are acceptable to verify your identity and employment eligibility, and where to go in person to present your documents on-campus:\nYou will need to present one or more acceptable documents that are listed\nhere\n.\nYou must present original documents; scans or photos of your documents are not accepted\n.\nStudents can verify their identification and supporting documents\nin person\nat Campus Safety (UPD) located on-campus at 100 North State Drive, San Francisco, California, 94132. (See map below).\nDrop-in hours are available Monday through Thursday (M/T/W/Th) from 8:30AM to 3:00PM.\nYou can also make an appointment for I-9 verification online by going to the following link and selecting the appointment calendar:\nCalendly - Fingerprint or I-9 Appointment Calendar\n.\nStep 4 - After your I-9 form has been completed and your documents verified, notify the hiring department.\nThe\nhiring department\nwill provide the student with all the required payroll forms below via DocuSign for completion. The hiring department is the program or department that offers the position.\nW-9 form\n(CSU Student Payroll Action Request)\nCSU Form SSA-1945 - Information About Social Security\nAffordable Care Act (ACA) Form\nCANRA Form (Child Abuse and Neglect Reporting Act)\nStep 5 – Hiring department will complete and submit a new hire E-trac to complete the hire process.\nGetting Paid:\nHow to Report Student Time Guide\nReport your time Guide\nHourly Payroll Calendar 2023\nF-1 and J-1 Visa Status I-9 Verification and Hire Process\nStep 1 - Send an email to Student_i-9@sfsu.edu with the following information:\nYour full and complete first and last name as it appears on your identification\nSF State student email\n(No personal emails)\nYour SF State Student ID Number #\nStep 2 - I-9 Tracker profile will be created by I-9 Verification Specialist from Campus Safety\nAn automated message from I-9 Tracker will be sent to your SF State student\nemail.  Please check your spam or junk folder if you do not see it in your inbox. Log into I-9 Tracker and complete Part 1 (Section 1).\nCheck box #4 (Alien Authorized to Work) in section 1 of the I-9 form. The end date of your study program is the date you are authorized to work until. This is the date that should be entered in section 1 (part 1) of the Form I-9.\nStep 3 – A second email will be sent to your SF State student email with instructions on how to complete your Form I-9 (Part 2).\nThe instructions email will include what documents are acceptable to verify your identity and employment eligibility, and where to go in person to present your documents on-campus:\nYou will need to present one or more acceptable documents that are listed\nhere\n.\nYou must present original documents; scans or photos of your documents are not accepted\n.\nStudents can verify their identification and supporting documents\nin person\nat Campus Safety (UPD) located on-campus at 100 North State Drive, San Francisco, California, 94132. (See map below).\nDrop-in hours are available Monday through Thursday (M/T/W/Th) from 8:30AM to 3:00PM.\nYou can also make an appointment for I-9 verification online by going to the following link and selecting the appointment calendar:\nCalendly - Fingerprint or I-9 Appointment Calendar\n.\nStep 4 - After your I-9 form has been completed and your documents verified, notify the hiring department.\nThe\nhiring department\nwill provide the student with all the required payroll forms below via DocuSign for completion. The hiring department is the program or department that offers the position.\nW-9 form\n(CSU Student Payroll Action Request)\nCSU Form SSA-1945 - Information About Social Security\nAffordable Care Act (ACA) Form\nCANRA Form (Child Abuse and Neglect Reporting Act)\nStudents must have SSNs and receive the \"payroll action request form\" from their on-campus employers to complete the step below:\nEmail Celine Luo, the Tax Specialist at\nwenshu@sfsu.edu\nwith the following information:\nFull name\nSF State ID\nSF State student email (No personal emails)\nStudents will receive email instructions from the Tax Specialist to access Sprinta Calculus, a tax compliance system. Students will need to upload the required documentation at Sprinta Calculus.\nATTENTION:\nSF State Tax Specialist does not provide tax preparation assistance to students.\nSprinta Calculus is a tax compliance system, it is different from Sprintax, the U.S. income tax software.\nSF State does not provide access to Sprintax. Students are encouraged to contact the Volunteer Income Tax Assistance Program (VITA) for tax preparation assistance.\nOnce student has completed their\nW-9 form\n(CSU Student Payroll Action Request), they will need to go to the Registrar’s Office to present the W-9 form and Social Security Card to be entered in the Campus Solutions system.\nStep 5 – Hiring department will complete and submit a new hire E-trac to complete the hire process.\nGetting Paid:\nHow to Report Student Time Guide\nReport your time Guide\nHourly Payroll Calendar 2023",
    "url": "https://upd.sfsu.edu/i-9-verification",
    "domain": "upd.sfsu.edu"
  },
  {
    "source": "https://upd.sfsu.edu/police-reports",
    "category": "general",
    "title": "Police Reports | University Police Department",
    "content": "Police Reports\nTo request a copy of your police report, we ask that the involved party, or an authorized representative, complete the SF State University Police Department ‘Police Report Request’ form. It is available online as a downloadable PDF at the bottom of this page, or at the UPD. We ask that the form be filled out as completely as possible to find the requested record, as well as avoid any delay or denial of the request. After review, if you are denied the request, you will be informed by phone, mail, or in person. If approved, routine requests are generally responded to or processed within 10 calendar days and made available for pickup or mailing. In rare cases, if more time is needed to process approved requests, you will be notified of the reason for delay and the estimated time of completion.\nSome cases may only be picked up by the victim or authorized representative (w/documentation) in person do to the sensitive nature of the report. Such cases require proper identification of the victim (government ID, passports, etc.), or a signed authorization from the victim if allowing a representative to retrieve their case.\nSome report requests or information may be denied to certain individuals based on exemptions defined in the California Public Records Act under 6254(f) of the California Government Code. In those instances, a copy of a public log incident may be available instead. If you were arrested in a case, you may get a copy of your report through the district attorney’s office, the discovery process, or by court subpoena.\nBy Mail\nYou can download and mail a completed request form to the University Police Department at:\nSan Francisco State University Police Department\nAttention Records\n1600 Holloway Ave.\nSan Francisco, CA 94132\nIf you are an authorized representative of a victim/involved party, please provide documentation of such with your request.\nIn Person\nThe request form can also be dropped off at or filled out at the University Police Department in person. Please note, in person requests do not guarantee a report will be released the same day.\nIf you are an authorized representative of a victim/involved party, please provide documentation of such with your request.\nBy Email\nThe request form can also be emailed to the University Police Department at\nupdrecords@sfsu.edu\n.\nMedia Requests\nAll media requests for information or statistics should go through:\nStrategic Marketing and Communications:\nmarcomm@sfsu.edu\nStudent Affairs & Enrollment Management:\nvpsaem@sfsu.edu\nUniversity Police Department:\nupd@sfsu.edu\nIf you have any questions, contact the Records Department at (415) 338-2095 and listen to the instructions. Staff work days or hours may very due to scheduling but requests will be reviewed in a timely manner.\nPolice Report Request Form\n1.14 MB\nAdobe Acrobat Reader\nis required to view PDF files. This is a free program available from the\nAdobe web site\n. Follow the download directions on the Adobe web site to get your copy of Adobe Acrobat Reader.",
    "url": "https://upd.sfsu.edu/police-reports",
    "domain": "upd.sfsu.edu"
  },
  {
    "source": "https://upd.sfsu.edu/employment-opportunities",
    "category": "general",
    "title": "Employment Opportunities | University Police Department",
    "content": "Employment Opportunities\nThe University Police Department is currently accepting applications at this time. We are currently accepting\nresumes\nfor qualified applicants interested in the following positions:\nStaff Employment:\nPolice Officer Job #547836\nPolice Dispatcher II Job #545616\nCommunity Service Officer (Full Time) Job #552070\nFor more information, please go to\nJob Opportunities\nStudent Employment:\nStudent Community Service Partner (SCSP): Handshake Job ID - 8561418.\nFor more information, please go to\nJoin Handshake\nPlease apply online by selecting one of the links below:\nStaff/Management Opportunities (Current SF State Employee - login required)\nStaff/Management Opportunities\n(Job Seeker/External Applicant)",
    "url": "https://upd.sfsu.edu/employment-opportunities",
    "domain": "upd.sfsu.edu"
  },
  {
    "source": "https://upd.sfsu.edu/contact-us",
    "category": "general",
    "title": "Contact Us | University Police Department",
    "content": "Contact Us\nThe SF State University Police Department is located on the Lake Merced Blvd side of the campus on North State Drive. We are located past Annex I and Annex 2 on the left-hand side as you are driving in from Lake Merced Blvd.\nMailing address:\nSan Francisco State University, Police Department\n1600 Holloway Avenue\nSan Francisco, CA., 94132\nSFSU PD located on North State Drive\nView Larger Map\nDirections\nTake 101 South to I-280 toward Daly City. Take the San Jose Avenue/Mission Street exit (immediately after the Ocean Avenue exit), bearing right onto Sagamore.\nKeep right on Brotherhood Way and turn right onto Lake Merced Blvd.\nAs you pass the Residence Halls, turn right onto North State Drive, which is just prior to the light at Winston.\nThe University Police Department is located on the left hand side. Park in the visitor parking (2 stalls located in front of the UPD and 1 stall located in front of Parking & Transportation)..\nContact Phone List\nOffice\nPhone Number\nEmergency\n911\nGeneral Business/Information Line (24 hours a day)\n(415) 338-7200\nAnonymous Crime Tip Line\n(415) 338-3030\nGeneral FAX\n(415) 338-1926\nCitation Processing\n(415) 338-7827\nEmployment Information / Administrative Services\n(415) 338-1180\nInvestigations\n(415) 405-3875\nOffice of the Chief\n(415) 338-2747\nParking and Transportation\n(415) 338-1441",
    "url": "https://upd.sfsu.edu/contact-us",
    "domain": "upd.sfsu.edu"
  },
  {
    "source": "https://upd.sfsu.edu/archived-timely-warnings",
    "category": "general",
    "title": "Archived Timely Warnings | University Police Department",
    "content": "Archived Timely Warnings\nFor ease of navigation, Timely Warnings from previous years have been divided into their respective Calendar Year. Please refer to the Archived Timely Warning options below.\nArchived Timely Warning - 2023\nArchived Timely Warning - 2022\nArchived Timely Warning - 2021\nArchived Timely Warning - 2020\nArchived Timely Warning - 2019",
    "url": "https://upd.sfsu.edu/archived-timely-warnings",
    "domain": "upd.sfsu.edu"
  },
  {
    "source": "https://upd.sfsu.edu/transparency",
    "category": "general",
    "title": "Transparency | University Police Department",
    "content": "Transparency\nCSU POLICING: REIMAGING OUR ROLE\nCalifornia State University campus police are committed to providing a safe and secure environment for all members of the Cal State community. With an overarching objective of building community trust and establishing a guardian mentality, every officer is committed to creating a campus culture that contributes to the intellectual, social and personal development of CSU students. To that end, campus police are reimagining our responsibilities and roles, using the 21st Century Policing Report as a guiding document.\nCSU Police Department Policies\nThe California State University (CSU) police department policies are developed using Lexipol, a comprehensive policy management system based on constitutional law and nationally recognized best practices. As the industry standard used by most law enforcement agencies in California, Lexipol ensures our policies remain current, legally sound, and operationally effective.\nAll publicly accessible law enforcement policies are posted here to promote transparency and accountability. These policies are routinely reviewed and updated to reflect changes in state and federal law, as well as emerging standards in professional policing.\nTo view the latest policies, please visit the\nCSU Law Enforcement Policy\npage.\nBody Worn Camera FAQ\nSan Francisco State University Police Department (UPD) has equipped its uniformed patrol officers with body-worn cameras (BWC). The use of BWCs benefits members of the SF State community and UPD by increasing accountability and transparency while strengthening the trust with the community that UPD has the pleasure of serving.\nUPD Body-worn Cameras FAQ\n217.09 KB\nRegulated Tools and Equipment\nIn July 2022, the California State University (CSU) Board of Trustees approved the system-wide Regulated Tools and Equipment policy, as recommended by the chiefs of police representing all 23 CSU Police Departments. The policy was adopted and published as outlined by Assembly Bill 481 and requires every law enforcement agency in California to publish certain information annually regarding specified equipment.\nRegulated Equipment- CA Assembly Bill 481 report- 2024. Final\n293.42 KB\nPublic Safety Advisory Committee\nThe purpose of the University Public Safety Advisory Committee is to promote safety throughout the University campus and increase awareness of safety conditions and programs among all members of the University community.\nUniversity Police Department Feedback Form\nAdobe Acrobat Reader\nis required to view PDF files. This is a free program available from the\nAdobe web site\n. Follow the download directions on the Adobe web site to get your copy of Adobe Acrobat Reader.",
    "url": "https://upd.sfsu.edu/transparency",
    "domain": "upd.sfsu.edu"
  }
]