[
  {
    "source": "https://tutoring.sfsu.edu/",
    "category": "general",
    "title": "Tutoring & Academic Support | San Francisco State University",
    "content": "Tutoring and Academic Support at SF State\nSupporting the academic success of all San Francisco State students\nMake a One-Time Appointment\nRequest Weekly Appointments\nTutoring & Academic Support Center\nThe Tutoring and Academic Support Center (TASC) supports students enrolled in Fall 2025 courses both on campus (in LIB 220) and online (via Zoom) for the duration of the semester (August 25, 2025 - December 17, 2025).\nTASC will be closed for the following holidays\nMonday, September 1, 2025: Labor Day\nTuesday, November 11, 2025: Veterans Day\nThursday, November 27, 2025 - Friday, November 28, 2025: Fall Break\nServices\nModalities\nDates and Hours\nDrop-in\nIn-person (LIB 220)  &\nOnline (\nClick here to join via Zoom\n)\nAugust 25, 2025 - December 17, 2025\nMon-Thu 9am-5pm, Fri 10am-2pm\nAppointments\nIn-person (LIB 220)\nTBD - December 17, 2025\nMon-Thu 9am-5pm, Fri 10am-2pm\nAppointments\nOnline (via Zoom, link to be emailed)\nTBD - December 17, 2025\nMon-Thu 8am-8pm, Fri 10am-2pm\nOther Tutoring Resources for Students\nSOAR TRIO\nEducational Opportunity Program (EOP)\nNews\nFirst Year Writing Raffle - Spring 2025 winners!\nThis spring, TASC and the English Department co-sponsored another round of our raffle for students in A2 first-year writing…\nNew issue of our newsletter\nWe are exited to share with you the latest issue of The TASC Tutoring Times newsletter. The newsletter features articles wri…\nAcademic Skills Workshops in Spring 2025\nTASC is excited to announce a series of four academic skills workshops in April and May.  Click here for more info. Topics i…\nA2 Raffle Winners!\nThis fall, TASC and the English Department co-sponsored our first ever raffle for students in A2 first-year writing courses.…\nMore News",
    "url": "https://tutoring.sfsu.edu/",
    "domain": "tutoring.sfsu.edu"
  },
  {
    "source": "https://tutoring.sfsu.edu/faculty",
    "category": "general",
    "title": "Resources for Faculty/Staff | Tutoring",
    "content": "Resources for Faculty/Staff\nTASC works with faculty and staff to support student learning. We work collaboratively with our campus community to meet the needs of SF State students.\nSyllabus Blurb\nLet your student know about TASC resources! Copy and paste this\nblurb about TASC\ninto your syllabus or Canvas site.\nRequest a Class/Program/Group Visit\nTASC loves to get the word out about how we support SF State students. We'd be happy to arrange a visit to your class, program, or group to talk about our services and how to utilize them.\nTo request a visit, please complete the form below or email us at\ntutoring@sfsu.edu\n. If you email, be sure to include the course/program/group for which you are seeking a visit and good days/times.\nRequest a Class Visit\nRefer a Student\nTo refer a student to tutoring at TASC, please email\ntutoring@sfsu.edu\nor complete the appropriate form linked below.\nIf you email, include the course for which you are referring the student (BUS 300, CHEM 115, ENG 201, etc.), and any pertinent information about the referred student. Be sure to provide the student name and ID as well.\nWe hire tutors every semester. If you have worked with a student who you think would make a great tutor, please recommend them by emailing us or filling out the appropriate form, also linked below.\nRefer a Student for Tutoring\nRecommend a Prospective Tutor\nLearn About Embedded Tutoring\nExperienced TASC tutors are embedded in classes across campus. They help facilitate learning, both in the classroom and at the tutoring center.\nIf you are interested in having an embedded tutor, write us an email at\ntutoring@sfsu.edu\n. Please include the course for which you are seeking an embedded tutor (DS 412, BIOL 100, ENG 114, etc.) so TASC reception can direct your email to the appropriate TASC faculty.\nOne of our faculty directors will reach out to provide information about our embedded tutor programs and find out more about your goals.\nRequest Info on Embedded Tutoring",
    "url": "https://tutoring.sfsu.edu/faculty",
    "domain": "tutoring.sfsu.edu"
  }
]