[
  {
    "source": "https://dos.sfsu.edu/",
    "category": "general",
    "title": "Division of Student Life (DSL) | Dean of Students (DOS)",
    "content": "Division of Student Life & Dean of Students\nA campus community\nwhere every student\nbelongs\nand the student experience\nmatters\n.\nContact the Dean\nDivision of Student Life (DSL)\nThe Division of Student Life (DSL) believes that\nevery\nSF State student should\nbelong\nand\nmatter\n, has the capacity to\nlive a purposeful life\n, and can\npositively impact the world\n. To that end, the Division of Student Life (DSL) team at SF State facilitates\nstudent-centered learning\nthrough personal, professional, community, and academic engagement, culminating in a transformational experience.\nDEPARTMENTS\nBasic Needs\nFood + Shelter + Success, SF State's Basic Needs Initiative, supports students’ ability to reach their full potential at SF State by providing food, housing, and financial crisis support programs, services, and referrals.\nCampus Recreation\nSupports students being able to find their community while aiding their student success.\nStudents are calling it:\n\"The center of student life on campus\"\n\"Not just a gym - but a place that focuses on my overall holistic health.\"\n\"A new place to go de-stress and reenergize in between my courses.\nResidential Life\nResidential Life is committed to providing an on-campus living/learning environment that complements the overall mission of San Francisco State University and the Division of Student Affairs Enrollment Management.\nNew Student & Family Programs\nNew Student and Family Programs believes through meaningful and sincere connections, new students and their families benefit from engaging with a community of peers, staff, and faculty who facilitate the transition and support the adjustment to a university.\nStudent Activities & Events\nStudent Activities & Events partners with students to support organizations and clubs, facilitate programs and events that create community, develop the whole person, and foster a deep sense of connection to each other and our campus.\nAssociated Students\nEmpowering university voices through advocacy, events, and representation of student interests and rights. Associated Students often partners closely with the Division of Student Life.\nCase Management\nThere are means to provide support to students who may be experiencing difficulties in navigating the university environment or being successful as a student. Currently, the group of administrators who serve in this rotation represent several areas within the Student Affairs & Enrollment Management (SAEM) Cabinet area. Each administrator comes with a wealth of professional knowledge and experience and engages in ongoing training to continue to provide the best service to students who are looking for support and guidance.\nSAFE Place\nThe SAFE Place is the confidential resource for survivors of gender-based violence. To get connected with a confidential advocate, please email\nsafeplace@sfsu.edu\nor drop in to SSB 403 to immediate assistance. If you need after-after hours support, please reach out to our community partner SFWAR at 415-647-7273. Learn more about the SAFE Place\nhere\nStudent Conduct\nEnsuring campus integrity by upholding standards, promoting accountability, and fostering a respectful environment.\nPROGRAMS\nDean-on-Call\nExplore the resources available for students facing challenges in university life. Our rotating team of caring staff from Student Affairs & Enrollment Management brings diverse expertise and ongoing training to offer top-tier support and guidance tailored to student needs.\nNew Student Programs\nNew Student Orientation is your opportunity to connect with your peers and learn about the many dimensions of student life. From your major and academic department to first-year programs and resource centers on campus, to social events and how students have fun in the city, you'll be prepared to take on your first semester at SF State!\nGator Mascot Program\nMeet Ali the Gator Mascot, the heart of campus spirit! With Ali as our mascot, we're dedicated to bringing campus life and engagement to every corner of our university community.\nRequest Ali for an Event!\nGatorFest!\nGatorFest! is our official welcome festival on campus. GatorFest! brings weeks of celebration and invites students to join over 8 weeks of engaging programming and numerous events. Connect with fellow students, embrace campus life, and discover San Francisco's vibrant culture.\nStudent Engagement\nEmbark on a journey of campus engagement with our diverse programs! From student leadership programs like The Institute and Catalyst to the New Student Pinning Ceremony and Ali Awards, along with the Fraternity and Sorority Councils, Student Leader Activity Board, Registered Student Organization Summit, and dynamic student leadership programs, there's something for everyone to connect, grow, and thrive.\nPresidential Scholars\nMeet the scholars of the most elite scholarship at San Francisco State University. This scholarship, and the Scholars representing the University and this program, are distinguished in their academics and leadership.\nRESOURCES & SERVICES\nClub & Organization Registration\nWith more than 250 clubs and organizations, students can discover a diversity of opportunities to connect with peers, facilitate programs and events that create community, develop the whole person, and foster a deep sense of connection to each other and our campus.\nHOPE Crisis Fund\nHOPE connects SF State students experiencing a financial crisis that could potentially derail their educational success, with resources, referrals, and solution pathways. HOPE’s goals are to help students overcome an unexpected financial crisis and remain on track to graduate.\nHOPE is a collaboration between the Dean of Students Office, Financial Aid, and Food+Shelter +Success, SF State’s Basic Needs Initiative.\nFreedom of Expression & TPM\nThe First Amendment and freedom of expression on college campuses are core to a creative, thoughtful, and respectful discourse where conflicting viewpoints are debated and discussed.\nWe encourage all of campus to learn about freedom of expression and free speech at SF State.\nFamily Communications\nLook out for a variety of resources that will introduce you to the engaging environment provided by SF State. Two of these resources, the New Student & Family Programs website, and the Division of Student Life website, are informative platforms where you can learn about student events, getting involved, family programming, and the Dean of Students services.\nAction Care Team\nThe Action Care Team (ACT) focus is assisting students who may be in distress. We coordinate resources and implement a centralized response, with the goal of providing the student the support they need and keeping the SF State community healthy and safe.\nReporting Student Conduct\nAnytime there are concerns about student behavior or violations of the Student Code of Conduct, current students, staff, faculty or community members can report concerns to the Office of Student Conduct.",
    "url": "https://dos.sfsu.edu/",
    "domain": "dos.sfsu.edu"
  },
  {
    "source": "https://dos.sfsu.edu/deans-certification",
    "category": "general",
    "title": "Dean's Certification | Dean of Students (DOS)",
    "content": "Dean's Certification\nA Dean's Certification (also sometimes identified as a College Officials Report) is verification that you, as a SF State student, have not been subject to any disciplinary actions or proceedings. These letters are usually required by graduate and professional schools, state bar associations, government agencies, or independent agencies when applying for admission or employment. Most of these institutions will provide you with a form for you to fill out and the Office of the Dean of Students to complete. Our office will fill out the form, or attach our own letter when applicable.\nDean's Certifications may be requested in-person, by mail (1600 Holloway Ave, 403 Student Services Building, San Francisco, CA 94132), fax (415-338-0900), or email us at:\ndos@sfsu.edu\nIf ordering\nin-person\n, you may stop by the office at 403 Student services Building. Please bring a copy of your unofficial transcript and any accompanying forms from the institutions for which you are requesting Dean's Certification.\nIf ordering by\nmail, fax, or email,\nplease include a copy of your unofficial transcript and a letter from you which includes:\nYour full name while attending SF State\nUniversity ID number (or date of birth if you do not remember your UID)\nPhone number and email address\nName(s) and address(es) of the Institutions who should be sent Dean's Certification\nIndicate if Dean's Certification should be mailed, faxed, or held for in-person pickup.\nYour letter must also include the statement: \"I authorize the Office of the Dean of Students at San Francisco State University to release the information necessary to complete the aforementioned college questionnaire(s).\"\nThe letter\nMUST\nbe signed and dated. Any Dean's Certification requests without the above statement accompanied by your signature will not be processed and completed.\nIt will take approximately 2-3 business days to complete the Certification forms and get them in to the US mail or sent by fax. If you would like to pick them up, be sure to indicate that on your request and we will hold them for you.\nIf you have any questions about this process, you may call (415) 338-2032 during normal business hours, Monday through Friday from 8:30am to 5:00pm.",
    "url": "https://dos.sfsu.edu/deans-certification",
    "domain": "dos.sfsu.edu"
  },
  {
    "source": "https://dos.sfsu.edu/message-from-deanofstudents",
    "category": "general",
    "title": "Message from the Dean of Students | Dean of Students (DOS)",
    "content": "Message from the Dean of Students\nWelcome to San Francisco State University’s Division of Student Life! We're thrilled to have you as a part of the vibrant Gator community here at SF State. Whether you're embarking on your academic journey, collaborating as a campus partner, or supporting your student, the Division of Student Life and Dean of Students team is committed to providing unwavering support. From orientation and engagement to guidance, advocacy, and accountability, we're here to ensure your success throughout your time with us. Our departments – including Dean of Students, Campus Recreation, New Student & Family Programs, Residential Life, Student Activities & Events, and the Office of Student Conduct – contribute to a vibrant campus life. Discover the wealth of programs, services, and resources that will enrich your experience.\nAs a former first-generation college student, I understand the unique blend of excitement and challenges you may encounter. Reach out to our Dean on Call for assistance whenever needed. To students, I encourage you to embrace the SF State experience by creating memorable moments, exploring new interests, and engaging in leadership, volunteering, and scholarship. To campus partners, I look forward to collaboration that enhances our community. And to student supporters/parents, I assure you of our commitment to your student's well-being and success. I invite you to share your journey with us at SF State as my team stands ready to support you. Looking forward to meeting you all around campus!\nIn Gator Spirit,\nDean Miguel",
    "url": "https://dos.sfsu.edu/message-from-deanofstudents",
    "domain": "dos.sfsu.edu"
  },
  {
    "source": "https://dos.sfsu.edu/presidential-scholars",
    "category": "general",
    "title": "Presidential Scholars Program | San Francisco State University",
    "content": "Apply to Presidential Scholars\nThe Presidential Scholars Program\nThe Presidential Scholars Program (PSP) is the most elite scholarship at San Francisco State University. Eligible incoming first-year students can compete for this scholarship. When awarded, it covers tuition, fees and on-campus housing for students for the entire four-year SFSU academic experience.\nThe Mirzakhani Scholarship is an expansion of the Presidential Scholars Program that launched in fall 2025 and is funded by alumna Neda Nobari (B.S., '84). The scholarship honors the legacy of Professor Maryam Mirzakhani, the first woman and first Iranian to win the prestigious Fields Medal. The PSP expansion is given to incoming first-year students studying in one of the many STEM fields through the College of Science & Engineering at SFSU.\nWe invite you to learn more about our elite Presidential Scholars Program, including the Mirzakhani Scholars, and how to become a scholar as you explore this site.\nContact the Presidential Scholars Program\nDr. Mia Reisweber\nAssociate Dean of Students\nmreisweber@sfsu.edu\nHome Office:\nDean of Students Office\ndos@sfsu.edu\n| dos.sfsu.edu | (415) 338-2032\nLearn More\nSFSU's Presidential Scholars Program\nMeet Our Scholars\nGet to know this year's San Francisco State University Presidential Scholars.\nThe Presidential Scholars Program\nLearn about the Presidential Scholars Program (PSP).\nBecome a Scholar\nThinking about becoming a scholar? We can help you plan for that!\nSenior Scholars\nMeet our Senior Gator Scholars!\nSite Under Construction\nScholar Showcase\nCheck out presentations created by the scholars on academic programs, study abroad and more!\nSite Under Construction\nScholar Projects\nExplore community service projects designed and organized by the scholars.\nSite Under Construction",
    "url": "https://dos.sfsu.edu/presidential-scholars",
    "domain": "dos.sfsu.edu"
  },
  {
    "source": "https://dos.sfsu.edu/safeplace",
    "category": "general",
    "title": "The SAFE Place | Dean of Students (DOS)",
    "content": "The SAFE Place\nThe SAFE Place is a survivor-focused, trauma-informed program that provides\nFREE\nand\nCONFIDENTIAL\nsupport services to survivors of sexual assault, intimate partner violence, stalking, and sexual harassment (sexual violence) while working with campus partners to end sexual violence. We serve all members of the SFSU community including students, staff, and faculty. The SAFE Place recognizes that sexual violence impacts all people, regardless of race, ethnicity, age, gender, or sexual orientation and strives to foster a safe and welcoming environment. We are committed to addressing sexual violence within a social justice, anti-oppression framework. The SAFE Place helps survivors determine their own healing path by reviewing options for reporting, medical care, mental health care, alternative healing interventions, and empowering survivors to choose the path that feels right for them.\nMission Statement:\nEmpowering and supporting survivors through advocacy to end sexual violence.\nHow to make An Appointment:\nThe SAFE Place advocate is available Monday through Friday from 8 a.m. - 4:45 p.m. The SAFE Place is located in the Student Services Building Suite 403. You can contact the advocate by emailing\nsafeplace@sfsu.edu\nor calling (415) 694-3825 to schedule an appointment or to meet if immediate services are needed.\nFor advocacy services when The SAFE Place is closed, reach out to our community partner,\nSFWAR\n(available 24/7 at (415) 647- RAPE).\nStudents can also reach out to SF State University Police for emergency situations (415) 338-2222 and/or the Title IX Office/Equity Programs & Compliance to submit a report.\nTitle IX/Equity Programs & Compliance\nhttps://titleix.sfsu.edu/about",
    "url": "https://dos.sfsu.edu/safeplace",
    "domain": "dos.sfsu.edu"
  }
]