[
  {
    "source": "http://news.sfsu.edu/exhibits",
    "category": "general",
    "title": "Exhibits | SF State News",
    "content": "Exhibits\nWaters Run Deep\nFine Arts Gallery, Fine Arts Building Room 2398, San Francisco State University\nAug. 10 through Sept. 7, 2024\nThe Fine Arts Gallery at SF State will present the exhibition Waters Run Deep from Aug. 10 through Sept. 7, 2024. Waters Run Deep explores the mythical and mystical properties of water. Guest curated by Rogelio Cruz (B.A., 2024), the exhibition features Maëlis Bekkouche, Alexis C. Garcia, Lindsay Gauthier with Fog Beast, Tiare Ribeaux, Ana Paula Teixeira and Jessica Tully.\n60% of the human body is made up of water, and 71% of the Earth’s surface is covered in water. Water, in every shape and form, is a building block for life on Earth, and its importance has been recognized by many, both in the physical by sustaining life, but also in the spiritual. Water is critical in many religious and ritual practices around the world. This manifests as deities dedicated to bodies of water and rain, cleansing rituals and the recognition of the integral connection of water and life.\nThe artists included in Waters Run Deep explore their own personal, cultural and metaphysical connections to water. Maëlis Bekkouche's \"Fish Woman\" is a video performance describing her connection to the ocean, as she covers her body in fish skins and transforms into who she calls \"fish woman.\" This connection is further exemplified by her sculptural work recycling fish and animal bones. Alexis C. Garcia's short film \"Daughter of the Sea\" follows the story of grief and healing through reconnecting to Yemaya, the Orisha who controls the oceans in Yoruba spirituality. Lindsay Gauthier with Fog Beast's \"These Lines Are Living\" is a film based on a series of performances commissioned by Headlands Center for the Arts. \"These Lines Are Living\" is the inaugural presentation by Fog Beast (Melecio Estrella and Andrew Ward) of a series of outdoor, site-specific performances that began at shorelines across the Bay Area in 2020. Multi-generational and participatory, \"These Lines Are Living\" brings attention to how our bodies, communities and governing institutions interact with and conceptualize shorelines in a time of accelerating climatic and social change. The film of the performance that we will be screening was created by Lindsay Gauthier. Tiare Ribeaux's \"Pō'ele Wai (As The Water Darkens)\" is a short film about a weaver who experiences a transformation when they find their drinking water has been poisoned by fuel leaking into O‘ahu’s watersheds. In \"Ulu Kupu,\" Ribeaux emphasizes the sacredness of wai (water), and the rainforests that hold our watersheds. Depicted through video, photography, sculpture, botanical art, paintings, and kapa, our interconnectedness and responsibility to the elements that sustain us is offered as a remembrance to the viewer, along with a respect for the land we inhabit and are stewards of. Ana Paula Teixeira, Puerto Rican photographer Ana Paula Teixeira, centers her photography around women of color, frequently photographing them in different bodies of water and using imagery that is undeniably inspired by the afro-indigenous cultures of the Caribbean. Jessica Tully's \"Submersion: The Secret Language of Water\" documents a site-specific performance ritual and video installation reconnecting Jewish women's 4,000-year-old purity rites with the contemporary water practices of the artist and her secular grandmother during the late 1970s.\n\"Waters Run Deep\" showcases the work of emerging curator Rogelio Cruz. Rogelio was born and raised in Sonoma County. From an early age discovered his love for the visual arts and dance, and he recently graduated from San Francisco State University majoring in Fine Art and minoring in Dance. He views his personal art practice as a ritual, one that allows him to connect to the earth, himself and his ancestral ties. His vision is that this collection of work captures the importance of prioritizing and celebrating our personal connections to the element of water. Life began in the ancient oceans, and it is in the waters that we can reflect on the sacredness of our own existence.\nThe exhibition program at SFSU Fine Arts Gallery positions emerging and mid-career artists from the Bay Area in conversation with national and international artists to consider global issues. Ever seeking to broaden the canon of contemporary art and future art histories, the SFSU Fine Arts Gallery centers on the presentation of artists of diverse backgrounds and lived experiences",
    "url": "http://news.sfsu.edu/exhibits",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu/news/sfsu-alumna-wins-creative-arts-emmy-award-hit-documentary",
    "category": "general",
    "title": "SFSU alumna wins Creative Arts Emmy Award for hit documentary | SF State News",
    "content": "SFSU alumna wins Creative Arts Emmy Award for hit documentary\nAuthor:\nMatt Itelson\nSeptember 24, 2025\nPhoto Credit:\nCourtesy of Poh Si Teng\nPoh Si Teng honored as executive producer of ‘Patrice: The Movie’\nSan Francisco State University couldn’t be a better place to learn about global culture, diversity and politics. For alumna Poh Si Teng, this campus fostered her journalistic pursuits from the classroom to Malcolm X Plaza, where you can see SFSU’s social justice ethos come to life. Teng (B.A., ’07) won her first Emmy Award earlier this month, as an executive producer of “Patrice: The Movie,” honored for Exceptional Merit in Documentary Filmmaking at the Creative Arts ceremony.\n“Truly, I couldn’t have chosen a better university and home,” Teng said. “I think back on all the classes and all the professors and all the protests and movements that I was part of, and I’m so proud and glad that I went to SF State.”\nTeng entered SFSU as an international student from Malaysia. She wrote for the\nGolden Gate Xpress\n, the University’s student-run newspaper, and she appreciates the diverse, supportive faculty members in the Department of Journalism, including Cristina Azocar, Erna Smith and Venise Wagner. Teng also credits SFSU with helping her land numerous internships that propelled her career.\n“I think about my time at SF State a lot,” she says. “It is foundational to who I am today. I’m so glad that was the first place I landed in the United States, which led me to the path of being a journalist, and then documentary filmmaker.”\nTeng would become a reporter for The New York Times, where she garnered her first Emmy nomination, and later, a documentary commissioner for Al Jazeera English, where she was nominated for an Academy Award for the documentary short “St. Louis Superman.” After a decade in journalism, she left the newsroom and became a grants director for the International Documentary Association. At IDA she created a grant for filmmakers with disabilities, with the support of the Ford Foundation. It was her time working with the disability film community that led her to championing “\nPatrice: The Movie\n” at ABC News/Disney. The documentary follows a disabled couple who risk losing their benefits if they get engaged or married. Teng was the lead creative executive at ABC News/Disney who brought the film to Hulu.\nLast year, Teng left her position at Disney/ABC to start her own production company. She is producing a three-part docuseries that she developed, and she is directing a political and medical verité film that is set in the U.S. and Gaza.\n“SFSU gave me the real-life experience of being close to the issues that mattered,” she said, “because the students were living them, whether it was the struggle to pay rent, the fight for disability rights or the weight of America’s foreign wars. I learned not just what to care about, but how to fight. That education continues to guide my work today.”\nLearn more about the SFSU Department of Journalism\n.\nTags\nCollege of Liberal & Creative Arts\nJournalism\nalumni\nAlumni News\nRelated News\nDiscover 2025: See what makes life brighter at SFSU on Oct. 18\nSeptember 25, 2025\nSFSU offers full scholarships for first-of-its-kind PK-12 certificate in climate justice education\nSeptember 25, 2025\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nSFSU alumna wins Creative Arts Emmy Award for hit documentary\nSeptember 24, 2025",
    "url": "https://news.sfsu.edu/news/sfsu-alumna-wins-creative-arts-emmy-award-hit-documentary",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu/news/discover-2025-see-what-makes-life-brighter-sfsu-oct-18",
    "category": "general",
    "title": "Discover 2025: See what makes life brighter at SFSU on Oct. 18 | SF State News",
    "content": "Discover 2025: See what makes life brighter at SFSU on Oct. 18\nAuthor:\nStrategic Marketing and Communications\nSeptember 25, 2025\nProspective students and families can explore campus, meet faculty and students, and learn how SFSU prepares graduates for success\nThinking about your next step after high school or community college? Discover SFSU is your chance to picture yourself as a Gator. San Francisco State University’s annual fall open house takes place Saturday, Oct. 18, from 9 a.m. to 1:30 p.m. on the main campus.\nThis isn’t a one-size-fits-all event. Discover SFSU is designed as a guided experience tailored to where you are in the admissions journey. You’ll be placed on a track and led by a student tour guide who can answer questions and share what life at SFSU is really like. Along the way, you’ll tour campus and housing, check out an academic and resource showcase, attend an admissions presentation and enjoy lunch in the dining center.\nYou’ll also meet faculty and current students, explore opportunities like hands-on research, internships and career services and learn about financial aid and scholarships that make SFSU one of the most affordable options in California.\n“Choosing a college is a big decision, and we want students to feel both excited and confident about the possibilities ahead,” said Camille Rieck-Armstrong, director of Undergraduate Admissions and Recruitment. “Discover SFSU gives them the chance to imagine themselves here — not only in the classroom, but also as part of a community that values their individuality, supports their goals and celebrates their success.”\nAnd because San Francisco is part of the SFSU experience, you’ll get a feel for studying in one of the world’s most dynamic and thriving cities — a place where education and opportunity extend far beyond the classroom. At SFSU, your future really is brighter here.\nFor more details and to register,\nvisit the Discover SFSU event page\n.\nRelated News\nDiscover 2025: See what makes life brighter at SFSU on Oct. 18\nSeptember 25, 2025\nSFSU offers full scholarships for first-of-its-kind PK-12 certificate in climate justice education\nSeptember 25, 2025\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nSFSU alumna wins Creative Arts Emmy Award for hit documentary\nSeptember 24, 2025",
    "url": "https://news.sfsu.edu/news/discover-2025-see-what-makes-life-brighter-sfsu-oct-18",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu/news-story/new-data-science-certificate-aims-open-doors-biotech-jobs",
    "category": "general",
    "title": "New data science certificate aims to open doors to biotech jobs",
    "content": "New data science certificate aims to open doors to biotech jobs\nBy\nKanaga Rajan\nWednesday, October 6, 2021\nLaunched this fall, the Data Science and Machine Learning for Biotechnology certificate was developed in collaboration with Genentech\nA new certificate program developed in collaboration with one of Silicon Valley’s biggest biotech companies will do more than teach San Francisco State University undergraduates about the interdisciplinary field known as data science. It’ll help them develop the skills they need to land jobs as data scientists.\nLaunched this fall, the\nData Science and Machine Learning for Biotechnology (gSTAR) certificate program\ngrew out of\nan already flourishing collaboration between San Francisco State and Genentech\n. Any SF State undergraduate student, regardless of major, is eligible for the certificate as long as they meet the program’s minimal prerequisites and complete six designated courses. The classes ground students in data science — an interdisciplinary field that gleans actionable insight from large volumes of data — while emphasizing professional development through rigorous mock interviews, elevator pitches and more. SF State biology and computer science faculty worked directly with Genentech scientists to develop the curriculum.\n“We used our internal computational experts who also hire computational talent to help us build this curriculum,” said Joy Branford, R&D people and culture strategic HR leader at Genentech.\nThat kind of practical, real-world input makes the program unique — and uniquely helpful — for undergraduate students hoping to jump-start biotech careers, says SF State Associate Professor\nAnagha Kulkarni\n, who is spearheading the program. Since the undergraduate population is large and diverse, Kulkarni hopes that hiring from this pool may help more women and people of color enter the biotech workforce. The problem is that biotech rarely recruits undergraduates directly after college and, prior to gSTAR, data science and professional development opportunities for undergraduates have been limited.\n“I’m hoping that this certificate opens doors and opens eyes as well on the industry side to the potential of undergraduates in the workforce,” she said.\nThe new certificate falls under the College of Science & Engineering’s larger\nPromoting Inclusivity in Computing (PINC) program\n, a computer science program tailored for biology and chemistry students like Elizabeth Mathiasen. A fourth-year physiology major, Mathiasen describes herself as a nontraditional student because she is over the age of 40 and has teenage kids.\n“Basically, it’s all geared towards preparing you for the things that we don’t usually get a lot of guidance on, and it really makes the process of planning your future a lot less daunting and a lot kinder, I think,” Mathiasen said about her current gSTAR course. After just a month of classes, Mathiasen says she’s already boosted her professional internet presence, learned how to improve her resume and gained insight into life at a biotech startup.\n“It’s been really exceptionally useful,” she said, “and it also just helps so much with the imposter syndrome.”\nThe gSTAR certificate is just one notch in SF State’s and Genentech’s goals to promote inclusivity in biotech. Kulkarni has aspirations to develop more industry partnerships to continue growing PINC and the certificate program. Long term, there are also plans to possibly open the certificate to individuals outside of SF State and establish similar programs at other educational institutions. In the meantime, Branford says the collaboration already represents a win for the entire industry.\n“I really see this as a way to pipeline that next generation of scientists,” she said.\nLearn more about the Data Science and Machine Learning for Biotechnology (gSTAR) certificate program\n.\nShare this story\nContact\nUniversity Communications\nEmail:\npubcom@sfsu.edu\nPhone:\n(415) 338-1665\nQuick Links\nNews Releases\nAnnouncements\nFaculty Experts\nCampusMemo\nSF State in the News\nSF State Facts\nCampus Directory\nUniversity Calendar\nColleges and Departments\nAthletics\nContact\nSearch",
    "url": "https://news.sfsu.edu/news-story/new-data-science-certificate-aims-open-doors-biotech-jobs",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu/news/sf-state-graduate-founded-americas-longest-running-juneteenth-celebration",
    "category": "general",
    "title": "SF State graduate founded America’s longest-running Juneteenth celebration | SF State News",
    "content": "SF State graduate founded America’s longest-running Juneteenth celebration\nAuthor:\nMatt Itelson\nJune 12, 2024\nPhoto Credit:\nFrom left: Wesley Johnson, an unidentified woman and blues musician T-Bone Walker in the Texas Playhouse nightclub. Courtesy of the Wesley Johnson Jr. Collection.\nWesley Johnson was a 1930s student activist before becoming a seminal entrepreneur in San Francisco’s Fillmore District\nFor the second time ever, the San Francisco State University campus will close on June 19 for Juneteenth. The festivities in San Francisco for the new federal holiday — which commemorates the emancipation of African American enslaved persons — have been rededicated to their founder, a San Francisco State alumnus named Wesley Johnson.\nIn 1945, Johnson created what would become the longest continuously running Juneteenth celebration in America. The native Texan announced it in grandiose fashion, riding a white stallion in the street and inviting passersby to celebrate at his Fillmore District nightclub. Nineteen years later, he established the Juneteenth parade in San Francisco, leading the way again on a white horse in his signature 10-gallon white Stetson cowboy hat to set off a three-day festival. This year the parade took place on June 8, alongside a month filled with festivals in several neighborhoods.\nSF State alumna Melina Jones, who has served on the committee for the Juneteenth parade and festival, learned about Johnson when researching the history of the holiday for her annual “BlaCOEUR” Juneteenth event.\n“I just got so excited about him and his legacy in the Fillmore during the Harlem of the West era of the ’40s and ’50s,” said Jones, a designer and rap artist born and raised in San Francisco. “I was incredibly proud just to be from here and to know that I get to be from a region where there are all of these innovators who are just brilliant cultural engineers.”\nWesley Johnson was born in 1908 in Galveston, Texas — the same city where Juneteenth celebrations began on June 19, 1866, one year after a Union Army general issued an order informing Texans that enslaved persons were now free. Although President Abraham Lincoln signed the Emancipation Proclamation on Jan. 1, 1863, it took two and a half years for the news to spread and for abolition to be enforced.\nAfter World War I, when Johnson was still a teenager, he and his family moved to San Francisco. Due to racist housing covenants and redlining, African Americans were welcome to live in only three of the city’s neighborhoods; the Johnson family settled in the Fillmore District. He entered San Francisco State College when the campus was located on Haight Street with about 1,100 students, very few of them Black.\nSeveral archival news clippings from the Golden Gater student newspaper, available in the University Archives in the J. Paul Leonard Library, highlight Johnson’s engagement in student life. In fall 1931, pledges from the Delta Sigma Theta sorority threw him a party to celebrate the birth of his second son. “Oh yes, all I need now is three more and I will have a basketball team!” Johnson quipped.\nAs president of the International Relations Club, Johnson directed “The Big Broadcast,” a live variety show on campus in the 1930s. Tickets were 20 cents each. “Do you want to witness the greatest show ever given at State?” Johnson said in the Golden Gater to promote the show.\nSF State Associate Librarian Meredith Eliassen, the University’s archivist, notes that Johnson launched one of the first student organizations for African Americans. In 1935 he created the Utopian Club for African Americans to discuss social issues. The following year it became the Negro Students Club, which would eventually be replaced by the first-ever\nBlack Student Union\n.\nEliassen says Johnson paved the way for students who decades later organized efforts to effect change, particularly the strike of 1968 – 1969 that resulted in the nation’s first\nCollege of Ethnic Studies\n.\n“The issues for Black students in the ’30s were the same as the ’60s: They were paying a fee, but not getting an equal education,” Eliassen said, noting students were unhappy about exclusionary admissions policies and curricula that omitted persons of color.\nAfter graduating from SF State, Johnson became one of the seminal entrepreneurs in the Fillmore District, as detailed in a\nWestern Historical Quarterly\narticle by Emily Blanck from 2019. The commercial corridor of Fillmore Street was thriving with African American-owned businesses, giving the area its status as the “Harlem of the West.” Among the area’s 20 nightclubs were Johnson’s Texas Playhouse (also known as Club Flamingo, with 15 hotel rooms above the ground floor) and the Congo. On any given night Johnson would be spinning jazz music and dancing “up and down the bar,” waitress Dorothy Alley said in the 2006 book “Harlem of the West: The San Francisco Fillmore Jazz Era” by Elizabeth Pepin (B.A., ’94) and Lewis Watts. Famous musicians like Billie Holliday and Louis Armstrong would visit and spend time with Johnson.\nJohnson retired as grand marshal of the Juneteenth parade in the late 1980s. His legacy continues to grow, as people like Jones seek to share his story and his values with younger generations, with the aim to inspire as many as possible. She designed a new website and logo for Juneteenth in San Francisco. Unveiled just last month, the logo depicts a silhouette of Johnson on a white horse. Jones also wrote\nan article about Johnson for the Juneteenth San Francisco website\n.\n“When he had these businesses, he looked incredibly impeccable. Everybody came with this allure and this air of excellence and pride — and he would not have it any other way,” Jones said. “You could see that he had this very unwavering desire to be excellent, and you could see it in all the pictures. I think he was extremely strategic and just very proud.”\nVisit the University Archives in the J. Paul Leonard Library\n.\nAn archival news clipping from the Golden Gater, as seen on display in the J. Paul Leonard Library\nTags\nAlumni News\n#SFSU125\nJ. Paul Leonard Library\nRelated News\nDiscover 2025: See what makes life brighter at SFSU on Oct. 18\nSeptember 25, 2025\nSFSU offers full scholarships for first-of-its-kind PK-12 certificate in climate justice education\nSeptember 25, 2025\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nSFSU alumna wins Creative Arts Emmy Award for hit documentary\nSeptember 24, 2025",
    "url": "https://news.sfsu.edu/news/sf-state-graduate-founded-americas-longest-running-juneteenth-celebration",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu",
    "category": "general",
    "title": "SF State News | San Francisco State University",
    "content": "Latest Stories\nDiscover 2025: See what makes life brighter at SFSU on Oct. 18\nSFSU offers full scholarships for first-of-its-kind PK-12 certificate in climate justice education\nSFSU is first CSU campus to join IBM Quantum Network\nSee all News\nFeatured\nScience\nSFSU researchers’ unique 3D maps might help solve the mysteries of octopus arms\nAlumni\nABC news anchor and alumnus Whit Johnson returns to SFSU to inspire students\nCampus Community\nCampus food resources help students thrive",
    "url": "https://news.sfsu.edu",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu/faculty-experts",
    "category": "general",
    "title": "Faculty Experts | SF State News | San Francisco State University",
    "content": "Faculty Experts\nFrom the discovery of new planets to the work of noted criminologists, SF State offers a wide variety of scholars who are the most distinguished in their fields. This directory identifies academics who possess insight and knowledge of diverse subjects and who are willing to work with journalists whenever possible. The faculty experts directory is compiled by the Office of Strategic Marketing and Communications.\nIf you need immediate assistance finding an expert, please call (415) 338-1665 or email\npubcom@sfsu.edu\n.\nKeyword Search\nFaculty Expertise\n- Any -\nArts and Humanities\nAstronomy, Chemistry and Physics\nBusiness and Economics\nDesign\nEducation\nGeography and Environment\nHealth and Nutrition\nIdentity Studies\nLeisure and Recreation\nMathematics\nMedia\nPolitics and Public Policy\nPsychology and Behavior\nTechnology and Engineering\nTransportation and Urban Planning\nYouth and Adolescence\nApply\nTony Sparks\nAssociate Professor of Public Affairs and Civic Engagement\nOffice Phone:\nEmail:\ntsparks@sfsu.edu\nTony's research and teaching interests fall at the intersection of poverty, law, and social policy with a particular emphasis on homelessness and housing informality. He has published several articles on the implications and complications of life in a homeless encampment in Seattle. His current research focuses on the everyday legal regulation of the bodies, spaces and habitations of the informally housed in San Francisco.\nAreas of Expertise:\nSan Francisco and national homelessness\nHomelessness policies\nHighest Degree:\nPh.D, Urban Geography, University of Washington\nJason T. Cantley\nAssistant Professor of Biology\nOffice Phone:\nEmail:\ncantley@sfsu.edu\nJason considers himself a botanist, evolutionary scientist, island biogeographer and biodiversity scientist. He is interested in the evolution of adaptive radiations and what generates novel biodiversity. His research is geographically focused on many plant lineages from the Hawaiian Islands, Australia and the California Floristic Province.\n​\nAreas of Expertise:\nBotany\nEvolution\nBiogeography\nHighest Degree:\nPh.D., Botany & Plant Biology, University of Hawaii at Manoa\nRabab Ibrahim Abdulhadi\nAssociate Professor of Ethnic Studies/Race and Resistance Studies, and Senior Scholar in the Arab and Muslim Ethnicities and Diasporas Studies\nOffice Phone:\n(415) 405-2668\nEmail:\nria55@sfsu.edu\nRabab Ibrahim Abdulhadi is an expert on the Middle East. She is also very involved in the new Arab and Muslim Ethnicities and Diasporas Initiative (AMED) minor program. Abdulhadi is originally from Nablus, Palestine.\nAreas of Expertise:\nPalestine\nIsrael and the Middle East\nArab and Muslim communities transnationally\nHighest Degree:\nPh.D., Sociology, Yale University\nMitra Ara\nProfessor of Persian & Iranian Studies\nOffice Phone:\n4153383121\nEmail:\nmitraara@sfsu.edu\nDr. Mitra Ara is a Persian and Iranian Studies Professor and Founding Director of the Persian Studies Program in the College of Liberal & Creative Arts at San Francisco State University. As a cultural historian, she lectures in the Department of Modern Languages and Literatures, and Middle East Studies program. She teaches cultures of the Persianate Societies, both ancient and modern, in addition to the Asian and ancient Iranian religions, including the minorities’ traditions.\nAreas of Expertise:\nIndo-Iranian & the Greater Iranian Studies\nReligion & Cultures in Central and West Asia\nReligious Traditions in Iran (from ancient to present)\nHighest Degree:\nPh.D., Asian Studies, University of California, Berkeley\nFred Astren\nProfessor of Jewish Studies\nOffice Phone:\n(415) 338-3152\nEmail:\nfastren@sfsu.edu\nFred Astren is an expert on Judaism, Jewish history and Israel-Palestine issues.\nAreas of Expertise:\nIsrael-Palestine issues\nIslam and Islamic history\nJewish history\nHighest Degree:\nPh.D., Near Eastern Studies, University of California, Berkeley\nNathan Avani\nProfessor Emeritus of Secondary Education\nOffice Phone:\n(415) 338-6442\nEmail:\nnatalio@sfsu.edu\nNathan Avani is an expert on mentoring middle and high-school age youth and adults, and on the benefits of intentionally small schools for improved student learning.\nAreas of Expertise:\nMentoring for youth and adults\nPublic school reform\nTeacher preparation for secondary education\nHighest Degree:\nPh.D., Educational Psychology and Instructional Systems Development, Michigan State University\nBruce Avery\nProfessor of Theatre and Dance\nOffice Phone:\n(415) 338-3100\nEmail:\nbravery@sfsu.edu\nBruce Avery's expertise is in Shakespeare's life and work and teaching Shakespeare.\nAreas of Expertise:\nEast Indian writers\nShakespeare\nTeaching Shakespeare\nHighest Degree:\nPh.D., English Literature, University of California, Santa Cruz\nJoAnn Aviel\nProfessor Emerita of International Relations\nOffice Phone:\n(415) 338-1448\nEmail:\njaviel@sfsu.edu\nJoAnn Aviel is an expert on foreign policy analysis and Latin American foreign relations.\nAreas of Expertise:\nU.S. foreign policy\nLatin American foreign policy\nInternational organizations including the United Nations\nHighest Degree:\nPh.D., Fletcher School of Law and Diplomacy of Tufts University",
    "url": "https://news.sfsu.edu/faculty-experts",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "http://news.sfsu.edu/faculty-experts",
    "category": "general",
    "title": "Faculty Experts | SF State News | San Francisco State University",
    "content": "Faculty Experts\nFrom the discovery of new planets to the work of noted criminologists, SF State offers a wide variety of scholars who are the most distinguished in their fields. This directory identifies academics who possess insight and knowledge of diverse subjects and who are willing to work with journalists whenever possible. The faculty experts directory is compiled by the Office of Strategic Marketing and Communications.\nIf you need immediate assistance finding an expert, please call (415) 338-1665 or email\npubcom@sfsu.edu\n.\nKeyword Search\nFaculty Expertise\n- Any -\nArts and Humanities\nAstronomy, Chemistry and Physics\nBusiness and Economics\nDesign\nEducation\nGeography and Environment\nHealth and Nutrition\nIdentity Studies\nLeisure and Recreation\nMathematics\nMedia\nPolitics and Public Policy\nPsychology and Behavior\nTechnology and Engineering\nTransportation and Urban Planning\nYouth and Adolescence\nApply\nTony Sparks\nAssociate Professor of Public Affairs and Civic Engagement\nOffice Phone:\nEmail:\ntsparks@sfsu.edu\nTony's research and teaching interests fall at the intersection of poverty, law, and social policy with a particular emphasis on homelessness and housing informality. He has published several articles on the implications and complications of life in a homeless encampment in Seattle. His current research focuses on the everyday legal regulation of the bodies, spaces and habitations of the informally housed in San Francisco.\nAreas of Expertise:\nSan Francisco and national homelessness\nHomelessness policies\nHighest Degree:\nPh.D, Urban Geography, University of Washington\nJason T. Cantley\nAssistant Professor of Biology\nOffice Phone:\nEmail:\ncantley@sfsu.edu\nJason considers himself a botanist, evolutionary scientist, island biogeographer and biodiversity scientist. He is interested in the evolution of adaptive radiations and what generates novel biodiversity. His research is geographically focused on many plant lineages from the Hawaiian Islands, Australia and the California Floristic Province.\n​\nAreas of Expertise:\nBotany\nEvolution\nBiogeography\nHighest Degree:\nPh.D., Botany & Plant Biology, University of Hawaii at Manoa\nRabab Ibrahim Abdulhadi\nAssociate Professor of Ethnic Studies/Race and Resistance Studies, and Senior Scholar in the Arab and Muslim Ethnicities and Diasporas Studies\nOffice Phone:\n(415) 405-2668\nEmail:\nria55@sfsu.edu\nRabab Ibrahim Abdulhadi is an expert on the Middle East. She is also very involved in the new Arab and Muslim Ethnicities and Diasporas Initiative (AMED) minor program. Abdulhadi is originally from Nablus, Palestine.\nAreas of Expertise:\nPalestine\nIsrael and the Middle East\nArab and Muslim communities transnationally\nHighest Degree:\nPh.D., Sociology, Yale University\nMitra Ara\nProfessor of Persian & Iranian Studies\nOffice Phone:\n4153383121\nEmail:\nmitraara@sfsu.edu\nDr. Mitra Ara is a Persian and Iranian Studies Professor and Founding Director of the Persian Studies Program in the College of Liberal & Creative Arts at San Francisco State University. As a cultural historian, she lectures in the Department of Modern Languages and Literatures, and Middle East Studies program. She teaches cultures of the Persianate Societies, both ancient and modern, in addition to the Asian and ancient Iranian religions, including the minorities’ traditions.\nAreas of Expertise:\nIndo-Iranian & the Greater Iranian Studies\nReligion & Cultures in Central and West Asia\nReligious Traditions in Iran (from ancient to present)\nHighest Degree:\nPh.D., Asian Studies, University of California, Berkeley\nFred Astren\nProfessor of Jewish Studies\nOffice Phone:\n(415) 338-3152\nEmail:\nfastren@sfsu.edu\nFred Astren is an expert on Judaism, Jewish history and Israel-Palestine issues.\nAreas of Expertise:\nIsrael-Palestine issues\nIslam and Islamic history\nJewish history\nHighest Degree:\nPh.D., Near Eastern Studies, University of California, Berkeley\nNathan Avani\nProfessor Emeritus of Secondary Education\nOffice Phone:\n(415) 338-6442\nEmail:\nnatalio@sfsu.edu\nNathan Avani is an expert on mentoring middle and high-school age youth and adults, and on the benefits of intentionally small schools for improved student learning.\nAreas of Expertise:\nMentoring for youth and adults\nPublic school reform\nTeacher preparation for secondary education\nHighest Degree:\nPh.D., Educational Psychology and Instructional Systems Development, Michigan State University\nBruce Avery\nProfessor of Theatre and Dance\nOffice Phone:\n(415) 338-3100\nEmail:\nbravery@sfsu.edu\nBruce Avery's expertise is in Shakespeare's life and work and teaching Shakespeare.\nAreas of Expertise:\nEast Indian writers\nShakespeare\nTeaching Shakespeare\nHighest Degree:\nPh.D., English Literature, University of California, Santa Cruz\nJoAnn Aviel\nProfessor Emerita of International Relations\nOffice Phone:\n(415) 338-1448\nEmail:\njaviel@sfsu.edu\nJoAnn Aviel is an expert on foreign policy analysis and Latin American foreign relations.\nAreas of Expertise:\nU.S. foreign policy\nLatin American foreign policy\nInternational organizations including the United Nations\nHighest Degree:\nPh.D., Fletcher School of Law and Diplomacy of Tufts University",
    "url": "http://news.sfsu.edu/faculty-experts",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu/news/social-work-student-earns-top-csu-award-says-education-radically-transformed-his-life",
    "category": "general",
    "title": "Social work student earns top CSU award, says ‘education radically transformed’ his life | SF State News",
    "content": "Social work student earns top CSU award, says ‘education radically transformed’ his life\nAuthor:\nKent Bravo\nSeptember 23, 2024\nJuan Carlos Arredondo (B.A.. ’24) returns to SFSU, pursues graduate degree to advance career in supporting migrant communities\nJuan Carlos Arredondo faced challenges that profoundly disrupted his life. His father passed away when Arredondo was young, he had to navigate the United States education system as a child with very little guidance and he dropped in and out of college while pursuing an associate’s degree.\nDespite these challenges, Arredondo persevered and turned his life around. Last spring he earned a bachelor’s degree in Social Work from San Francisco State University, graduating with a 4.0 grade-point average. He returned to San Francisco State this fall to pursue a master’s degree in Social Work. On top of that, he recently earned one of the most prestigious student accolades.\nThe California State University (CSU) has awarded Arredondo the\nTrustees’ Award for Outstanding Achievement\n, the highest recognition of student achievement granted by the CSU. Each award provides a donor-funded scholarship to students who demonstrate superior academic performance, personal accomplishments, community service and inspirational goals for the future. The awardees have demonstrated a deep commitment to making a positive impact on their generation, as well as those who come after them.\n“Mr. Arredondo is an extraordinary person as well as a promising future professional who deserves the support provided by this award,” SF State President Lynn Mahoney said. “He possesses qualities of character, determination and personal excellence that’ll help him reach his goals and better our communities.\"\nArredondo was born in the U.S., relocated to Mexico due to his father’s death and eventually moved back to the U.S. When he returned, he spent all of his time outside of school helping with food preparation for his mother’s food truck that catered to agricultural workers. While this experience shaped his strong worth ethic, it also took away his focus on school at times and prevented him from joining extracurricular activities.\nAfter a decade of financially insecure and high-pressure work, Arredondo committed to pursuing an undergraduate degree. At that time, he had learned about an agency at the U.S./Mexico border that provides counseling to migrants who are incarcerated and separated from their families. That’s when his dream of becoming a social worker came into focus. “I want to be a role model and catalyst for change and embody the representation and services that were not available during my youth,” he said.\nWhile at SFSU, Arredondo worked hard toward his dream. He led a qualitative study that highlighted the voices of the unhoused population in San Francisco’s Tenderloin District and presented the findings at the 2024 Social Work Social Development Joint World Conference.\nArredondo also won the highly competitive\nWillie L. Brown , Jr. Fellowship\n, which landed him an internship with San Francisco’s Human Services Agency. There he helped connect emancipated foster youth to a guaranteed-income pilot program, shadowed social workers in the family maintenance and family reunification department and assisted with biopsychosocial assessments.\n“Education radically transformed my life,” Arredondo said. “It has not only given me meaning and hope for the future, but it is also healing old wounds. It has made me aware that I have always been capable.”\nArredondo is also involved in helping the communities he deeply cares for. For example, he interns at Manzanita SEED Elementary School, where he provides bilingual behavioral therapy in Spanish and English.\n“It is with tremendous joy and great pride that I celebrate the outstanding achievements and extraordinary perseverance of this year’s Trustees’ Scholars,” said CSU Chancellor Mildred García. “Through the visionary generosity of our donors, the CSU is able to uplift and support these diverse students and truly outstanding scholars who have overcome educational and personal hardships in pursuit of a college degree that will not only transform their lives, but will also elevate their families and strengthen their communities.”\nAre you passionate about social work and supporting marginalized communities?\nLearn more about how SF State’s School of Social Work can help you make a difference\n.\nTags\nCalifornia State University\nAwards and Achievements\nCollege of Health & Social Sciences\nSocial Work\nRelated News\nDiscover 2025: See what makes life brighter at SFSU on Oct. 18\nSeptember 25, 2025\nSFSU offers full scholarships for first-of-its-kind PK-12 certificate in climate justice education\nSeptember 25, 2025\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nSFSU alumna wins Creative Arts Emmy Award for hit documentary\nSeptember 24, 2025",
    "url": "https://news.sfsu.edu/news/social-work-student-earns-top-csu-award-says-education-radically-transformed-his-life",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu/faculty-experts?page=5",
    "category": "general",
    "title": "Faculty Experts | SF State News | San Francisco State University",
    "content": "Faculty Experts\nFrom the discovery of new planets to the work of noted criminologists, SF State offers a wide variety of scholars who are the most distinguished in their fields. This directory identifies academics who possess insight and knowledge of diverse subjects and who are willing to work with journalists whenever possible. The faculty experts directory is compiled by the Office of Strategic Marketing and Communications.\nIf you need immediate assistance finding an expert, please call (415) 338-1665 or email\npubcom@sfsu.edu\n.\nKeyword Search\nFaculty Expertise\n- Any -\nArts and Humanities\nAstronomy, Chemistry and Physics\nBusiness and Economics\nDesign\nEducation\nGeography and Environment\nHealth and Nutrition\nIdentity Studies\nLeisure and Recreation\nMathematics\nMedia\nPolitics and Public Policy\nPsychology and Behavior\nTechnology and Engineering\nTransportation and Urban Planning\nYouth and Adolescence\nApply\nRoy Conboy\nProfessor of Theatre Arts\nOffice Phone:\n(415) 338-1614\nEmail:\nrconboy@sfsu.edu\nRoy Conboy is a Chicano playwright, director, and teacher, and is the head of the Playwrighting Program at SF State, teaching in both Theatre Arts and Creative Writing. His plays and those of his former students have been produced on stages across California and the United States.\nAreas of Expertise:\nPlaywriting and contemporary theatre\nModern Chicano theatre\nBusiness and production of playwriting\nHighest Degree:\nM.F.A., Acting and Directing, University of California, Irvine\nJamal Cooks\nProfessor of Secondary Education\nOffice Phone:\n(415) 338-2065\nEmail:\njcooks@sfsu.edu\nJamal Cooks is an expert on the connections among education, popular culture and hip hop, particularly the use of hip hop to teach literacy in schools.\nAreas of Expertise:\nUsing music and sports as a teaching tool in the classroom\nUsing hip hop in schools to teach expository writing skills\nHighest Degree:\nUsing hip hop in schools to teach expository writing skills\nJeff Cookston\nProfessor of Psychology\nOffice Phone:\n(415) 405-2133\nEmail:\ncookston@sfsu.edu\nJeff Cookston is an expert on father-child relationships, particularly during adolescence, and how families and children adjust during and after divorce.\nAreas of Expertise:\nHow children adjust to divorce\nSocial constructions of fatherhood and parenting\nMarital conflict\nHighest Degree:\nPh.D., Educational Psychology - Human Development and Education, University of Texas, Austin\nAdrienne Cool\nProfessor of Physics and Astronomy\nOffice Phone:\n(415) 338-6450\nEmail:\ncool@sfsu.edu\nAdrienne Cool is an expert on globular clusters (dense aggregates of stars) and the exotic types of star found within them, including binary stars (pairs of stars that orbit each other), blue stragglers and white dwarf stars.\nAreas of Expertise:\nGlobular star clusters\nWhite dwarf stars\nBlue stragglers\nHighest Degree:\nPh.D., Astronomy, Harvard University\nCarlos B. Cordova\nProfessor of Latina/Latino Studies\nOffice Phone:\n(415) 405-2419\nEmail:\ncordova@sfsu.edu\nCarlos Cordova is an expert on South American countries and populations including settlement patterns, demographics and Latino emigrants from these countries in the U.S.\nAreas of Expertise:\nCentral American politics\nCentral American culture and society\nCentral American migration\nHighest Degree:\nEd.D., Multicultural Education, University of San Francisco\nSarah Curtis\nProfessor of History\nOffice Phone:\n(415) 338-2250\nEmail:\nscurtis@sfsu.edu\nSarah Curtis is an historian who studies the role of women and religion in 19th century France. She can also comment on contemporary issues of religious freedom in France, such as government efforts to ban Islamic religious dress in schools.\nAreas of Expertise:\n19th century France\nReligion and the state\nFrench education system\nHighest Degree:\nPh.D., History, Indiana University\nAnthony D'Agostino\nProfessor of History\nOffice Phone:\n(415) 338-7535\nEmail:\ndagostin@sfsu.edu\nRobert D'Agostino is an expert on the history of Russia, including the Russian revolution and the Cold War and the history of Europe during the World Wars.\nAreas of Expertise:\nHistory of Russia\nHistory of Europe: 1900 - 1949\nDiplomatic history of the 20th century\nHighest Degree:\nPh.D., University of California, Los Angeles\nRene Dahl\nProfessor of Child and Adolescent Development\nOffice Phone:\n(415) 338-2056\nEmail:\nrdahl@sfsu.edu\nRene Dahl is an expert in the field of school age child development.\nAreas of Expertise:\nElementary school age development\nAfter school development programs\nHighest Degree:\nPh.D., Sociology of Education, Stanford University",
    "url": "https://news.sfsu.edu/faculty-experts?page=5",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu/faculty-experts?page=2",
    "category": "general",
    "title": "Faculty Experts | SF State News | San Francisco State University",
    "content": "Faculty Experts\nFrom the discovery of new planets to the work of noted criminologists, SF State offers a wide variety of scholars who are the most distinguished in their fields. This directory identifies academics who possess insight and knowledge of diverse subjects and who are willing to work with journalists whenever possible. The faculty experts directory is compiled by the Office of Strategic Marketing and Communications.\nIf you need immediate assistance finding an expert, please call (415) 338-1665 or email\npubcom@sfsu.edu\n.\nKeyword Search\nFaculty Expertise\n- Any -\nArts and Humanities\nAstronomy, Chemistry and Physics\nBusiness and Economics\nDesign\nEducation\nGeography and Environment\nHealth and Nutrition\nIdentity Studies\nLeisure and Recreation\nMathematics\nMedia\nPolitics and Public Policy\nPsychology and Behavior\nTechnology and Engineering\nTransportation and Urban Planning\nYouth and Adolescence\nApply\nPaul Beckman\nProfessor of Information Systems\nOffice Phone:\n(415) 338-6240\nEmail:\npbeckman@sfsu.edu\nPaul Beckman is an expert in human performance, wireless networks and issues of social connectedness on task performance. In addition to his research, Beckman has worked as a systems analyst at Hewlett-Packard.\nAreas of Expertise:\nDatabases\nWireless networking\nHuman interface\nHighest Degree:\nPh.D., Management (MIS), Purdue University\nMaziar Behrooz\nAssociate Professor of History\nOffice Phone:\n(415) 338-1776\nEmail:\nmroozbeh@sfsu.edu\nMaziar Behrooz is an expert on the modern history of the Middle East, particularly the social, political and intellectual history of Iran, including the present day.\nAreas of Expertise:\nIran and Afghanistan: 19th\n20th\n21st centuries\nHighest Degree:\nPh.D., History, University of California, Los Angeles\nEmily Smith Beitiks\nAssociate Director, Paul K. Longmore Institute on Disability\nOffice Phone:\n(415) 405-3528\nEmail:\nbeitiks@sfsu.edu\nEmily Beitiks, PhD, is an expert in promoting access in museums, art, and film in her roles as the Interim Director of the Longmore Institute on Disability at San Francisco State University and Co-Director of Superfest Disability Film Festival.\nAreas of Expertise:\nDisability justice\nDisability and popular culture\nReproductive justice issues for people with disabilities\nHighest Degree:\nPh.D., American studies with disability studies emphasis, University of Minnesota\nPeggy Benton\nProfessor Emerita of Instructional Technologies\nOffice Phone:\n(415) 338-2508\nEmail:\npeggyb@sfsu.edu\nPeggy Benton is an expert on the integration of computers, video and multimedia in classroom teaching and teachers' professional development, particularly how computer graphics and virtual reality can improve learning.\nAreas of Expertise:\nUse of computers and technology in teaching\nUse of technology in teacher professional development\nDigital video education\nHighest Degree:\nPh.D., Instructional Systems Technology, Indiana University\nDaniel Bernardi\nProfessor of Cinema\nOffice Phone:\n(415) 338-6267\nEmail:\nbernardi@sfsu.edu\nDaniel Bernardi is a noted media and cultural studies scholar with a focus on critical race theory, early cinema and the role of whiteness in film and television. His publications include \"Narritive IEDS: Rumors, Islamic Extremism and the Struggle for Strategic Influence,\" \"Filming Difference: Actors, Directors and Writers on Gender, Race and Sexuality,\" and \"Star Trek and History: Race-ing Toward a White Future.\" He is currently studying the impact of rumor on counterinsurgency operations.\nAreas of Expertise:\nRace\nGender and sexuality in the media\nPopular culture\nHighest Degree:\nPh.D., Film and Television, University of California, Los Angeles\nSubodh Bhat\nProfessor of Marketing\nOffice Phone:\n(415) 817-4399\nEmail:\nsbhat@sfsu.edu\nSubodh Bhat is an expert in brands and brand management. He has commented widely in national media about corporate branding marketing choices and branding disasters.\nAreas of Expertise:\nBranding and brand management\nBrand disasters\nIndian entrepreneurs' success in Silicon Valley\nHighest Degree:\nPh.D., Marketing, University of Georgia\nRoger Bland\nProfessor Emeritus of Physics & Astronomy\nOffice Phone:\n(415) 338-2433\nEmail:\nbland@stars.sfsu.edu\nRoger Bland is an expert on underwater acoustics who analyzes the songs and calling patterns made by blue whales and toadfish (plainfin midshipman).\nAreas of Expertise:\nUnderwater acoustics\nBlue Whale songs\nMating call of the toadfish (plainfin midshipman)\nHighest Degree:\nPh.D., Elementary Particle Physics, University of California, Berkeley\nAli Borjian\nProfessor of Secondary Education\nOffice Phone:\n(415) 338-1838\nEmail:\nborjian@sfsu.edu\nAli Borjian is expert on effective teaching for children who are English language learners.\nAreas of Expertise:\nTeacher education\nSchool reform\nSecond-language acquisition\nHighest Degree:\nPh.D., Education, Stanford University",
    "url": "https://news.sfsu.edu/faculty-experts?page=2",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu/news/new-book-sfsu-professor-revisits-african-american-comedy-1980s-and-1990s",
    "category": "general",
    "title": "In new book, SFSU professor revisits African American comedy of the 1980s and 1990s | SF State News",
    "content": "In new book, SFSU professor revisits African American comedy of the 1980s and 1990s\nAuthor:\nMatt Itelson\nJuly 7, 2025\nPhoto Credit:\nCourtesy of Artel Great\n‘The Black Pack,’ by Artel Great of the School of Cinema, explores legacy of five influential comedians\nThe most popular African American-helmed comedies of the 1980s and 1990s made millions of people laugh, but San Francisco State University Associate Professor Artel Great has discovered a greater purpose in them. His new book, “The Black Pack: Comedy, Race and Resistance,” offers groundbreaking scholarly analysis on five influential artists of the era: Eddie Murphy, Keenen Ivory Wayans, Arsenio Hall, Robert Townsend and Paul Mooney.\nThese five men joined forces as a comedic collective known as “The Black Pack” and became household names as actors, writers, producers, directors and collaborators. In\n“The Black Pack” (Rutgers University Press)\n, Great cites 24 productions between 1987 and 1994 that defined a generation, both splitting sides and testing boundaries. In a review of “The Black Pack,” the Library Journal praises the book as “an entertaining and essential read.”\n“I call it ‘laugh-tivism.’ The book is a tribute to generations of Black American comedians and how they used their voices to challenge corrupt authority, to confront the racial condition in America and to say very serious things,” Great said. “The book speaks to this notion of revolutionary laughter, but it also speaks to the need for a creative space for laughter as catharsis and the need to create space for Black joy — and to do so through brotherhood and solidarity.”\nGreat\nis a scholar, filmmaker, actor and former standup comedian who holds SFSU’s George and Judy Marcus Endowed Chair in African American Cinema Studies. He appeared in films such as “Light It Up” and “Save the Last Dance” and landed an Independent Spirit Award nomination for “Dahmer” before earning his doctorate at New York University and later directing two feature films.\nFrom age 9, Great spent countless nights at his grandmother’s house in Chicago watching classics like Hall’s talk show, Townsend’s “Hollywood Shuffle” and Wayans’ “In Living Color.” It wasn’t until years later that he noticed how the rebellious, pro-Black themes spoke to sociopolitical issues that persist between generations.\nGreat traces the lineage of Black American comedy from slavery and vaudeville. In the late 19th century, a biracial man named Charley Case established the contemporary style of standup comedy. He would take command at center stage and speak directly to the audience, sometimes with minstrelsy makeup on his face, Great writes in “The Black Pack.”\nGreat plans to use “The Black Pack” in his SFSU School of Cinema courses, accompanied by viewings. He’s excited to observe how students react. Eddie Murphy films like “Boomerang” and “Coming to America” still make him laugh and give him feelings of nostalgia but may be new to them. More importantly, Great hopes students will be inspired to bring brightness to the world, with humor or without: “My ultimate goal is to always make our students more active and practical citizens.”\nLearn more about the SFSU School of Cinema\n.\nCourtesy of Rutgers University Press\nTags\nCollege of Liberal & Creative Arts\nCinema\nFaculty\nResearch\nRelated News\nDiscover 2025: See what makes life brighter at SFSU on Oct. 18\nSeptember 25, 2025\nSFSU offers full scholarships for first-of-its-kind PK-12 certificate in climate justice education\nSeptember 25, 2025\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nSFSU alumna wins Creative Arts Emmy Award for hit documentary\nSeptember 24, 2025",
    "url": "https://news.sfsu.edu/news/new-book-sfsu-professor-revisits-african-american-comedy-1980s-and-1990s",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu/news/speaker-emerita-pelosi-addresses-sf-state-community-annual-opening-convocation",
    "category": "general",
    "title": "Speaker Emerita Pelosi addresses SF State community at annual Opening Convocation | SF State News",
    "content": "Speaker Emerita Pelosi addresses SF State community at annual Opening Convocation\nAuthor:\nMatt Itelson\nAugust 21, 2023\nPhoto Credit:\nJuan Montes\nWelcome event also features remarks by SF supervisors, President Mahoney, other University leaders\nSpeaker Emerita Nancy Pelosi was a surprise guest at San Francisco State University’s Opening Convocation on Aug. 17, taking part in the ceremonial tradition welcoming faculty and staff to a new year on campus.\nPelosi began her speech in McKenna Theatre by acknowledging the vital roles of University employees.\n“We have to make sure we are paying our workers well as we sing our praises,” Pelosi said in front of an audience of hundreds. “We want to make sure we respect them.”\nShe also praised San Francisco State for its dedication to social justice and democracy.\n“Right now, we have to make sure with all of the challenges that are out there to our democracy and democracy worldwide, that we make decisions that our flag is still there, with liberty and justice for all. San Francisco State is about all of that,” Pelosi said. “So I’m proud to bring you greetings from the Congress with respect for you, for the students, for the families, with gratitude to all of you. And just one last thing: Go Gators!”\nPelosi was not the only elected official in attendance. Two members of the San Francisco Board of Supervisors, Rafael Mandelman and Shamann Walton (MPA, ’10), were also on hand.\nMandelman said he is optimistic that today’s college students will graduate prepared to face the myriad challenges in society.\n“I, and the city and county of San Francisco, are grateful that you all have chosen to prepare to lead the students here into that non-dystopian future that we all hope remains achievable,” Mandelman said.\nWalton said he is proud to not only have graduated from SF State himself, but also to be the parent of two Gator alumni. He discussed the value of education as “the No. 1 thing that can never be taken away from us.”\n“As Malcolm X said, ‘Education is the passport to the future, for tomorrow belongs to those who prepare for it today,’” Walton said. “Your work this year and continuing, of course, is preparing the brightest minds for success ... and [to] change the world.”\nIn her remarks, SF State President Lynn Mahoney highlighted SF State’s dedication to focusing on students.\n“I am deeply proud of the ways in which San Francisco State serves as a model of excellence in innovation in teaching, academic innovation and research,” Mahoney said. “Strengthening student learning is a priority for all here.”\nMahoney also noted the University remains committed to eliminating equity and opportunity gaps among underrepresented populations.\n“The greatest demonstration of our commitment to social justice starts here,” she said. “It starts at home by increasing the success of our students, especially our Black, Latinx, low-income and first-generation students.”\nOther speakers included: Provost and Vice President of Academic Affairs Amy Sueyoshi, Professor of Biology and Academic Senate Chair Michael A. Goldman, Associated Students President Ersa Rao, California Faculty Association SF State Chapter President Brad Erickson, Staff Council Chair Dylan Mooney and CSU Employees Union SF State Chapter President Sandee Noda. The deans of SF State’s academic colleges and the University librarian introduced 34 new tenure-track faculty members.\nConvocation also featured an awards ceremony honoring distinguished faculty and staff, presented by Neda Nobari (B.S., ’84), board chair of the SF State Foundation. This year’s winners:\nExcellence in Teaching (Tenured): Paul Beckman, Information Systems\nExcellence in Teaching (Lecturer): Mohammad HajiAboli, Engineering\nExcellence in Professional Achievement (Tenured): Dianthe “Dee” Spencer, Theatre and Dance\nExcellence in Service (Tenured): Nancy Gerber, Chemistry and Biochemistry\nExcellence in Service (Staff): Phonita Yuen, Metro College Success Program\nLearn more about the Opening Convocation on the Academic Senate website.\nTags\nFaculty\nalumni\nRelated News\nDiscover 2025: See what makes life brighter at SFSU on Oct. 18\nSeptember 25, 2025\nSFSU offers full scholarships for first-of-its-kind PK-12 certificate in climate justice education\nSeptember 25, 2025\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nSFSU alumna wins Creative Arts Emmy Award for hit documentary\nSeptember 24, 2025",
    "url": "https://news.sfsu.edu/news/speaker-emerita-pelosi-addresses-sf-state-community-annual-opening-convocation",
    "domain": "news.sfsu.edu"
  },
  {
    "source": "https://news.sfsu.edu/news/sfsu-earns-prestigious-seal-excelencia-its-commitment-latinx-students",
    "category": "general",
    "title": "SFSU earns prestigious Seal of Excelencia for its commitment to Latinx students | SF State News",
    "content": "SFSU earns prestigious Seal of Excelencia for its commitment to Latinx students\nAuthor:\nStrategic Marketing and Communications\nOctober 1, 2024\nThe seal recognizes SFSU for its leadership in meeting needs of Latinx students, advancing their talents\nSAN FRANCISCO (October 1, 2024) –\nSan Francisco State University\nhas earned the prestigious Seal of Excelencia granted by\nExcelencia in Education\n, the nation’s premier authority on efforts to accelerate Latinx student success in higher education. The Seal is a national certification for institutions that strive to more intentionally serve Latinx students.\nSan Francisco State is one of 17 colleges and universities to earn the Seal in 2024. In 2018, Excelencia introduced the Seal to certify trendsetting colleges and universities for their efforts to become learning environments where Latinx, and all, students thrive. This year marks the organization’s 20th year of service to accelerate Latinx student success in higher education.\nThe Seal of Excelencia framework\nrepresents a rigorous assessment of certified institutions’ intentionality and impact. It assesses the institutions’ outcomes in retention, financial support and degree completion for Latinx students through the alignment of data, practice and leadership. Seal certification remains valid for three years, after which institutions can recertify progress.\n“We are deeply honored to receive the Seal of Excelencia for our steadfast commitment to advancing the talents of Latinx students,” SFSU President Lynn Mahoney said. “Here at SF State, we understand the importance of providing an environment where students’ identities are celebrated and represented in their education. Earning the Seal reflects that.”\nThis year’s cohort of newly certified and recertified institutions belongs to a collective of 46 colleges and universities that have earned the Seal. Together, they represent less than 1% of all institutions but enroll 17% and graduate 19% of all Latinx students nationwide.\nSpecifically at SFSU, Latinx student enrollment doubled between 2010 and 2022. More than 39% of students identify as Latinx, making them the largest ethnic group among the University’s undergraduates.\n“The colleges and universities that earn the Seal of Excelencia lead the charge in meeting our nation’s degree attainment goals,” said Deborah Santiago, co-founder and CEO of Excelencia\nof Education. “They demonstrate commitment to Latino student success through impact and ongoing self-assessment.”\nHigher education, business, philanthropy and government leaders in Excelencia’s community convened in Washington, D.C., to recognize SFSU as one of eight institutions that earned the Seal of Excelencia for the first time, as well as nine other institutions that earned recertification. The announcement was part of the organization’s National Policy Forum, focused on innovating policies to accelerate Latinx degree attainment and strengthen our country’s civic leadership and workforce. The 17 Seal-certified institutions exemplify the kinds of programs and practices that inform good policy.\nBefore SFSU earned the Seal of Excelencia, President Mahoney joined Excelencia’s national network of\nPresidents for Latino Student Success (P4LSS)\n. The network comprises over 200 higher education leaders committed to making their institutions learning environments where Latinx, and all, students thrive. Institutions in the P4LSS network are eligible to apply for the Seal. To earn the Seal of Excelencia, they must demonstrate:\nAn intentional, institutional focus on advancing Latinx student success by aligning data and practice\nDeliberate and ongoing assessment to identify and implement strategies that improve Latinx student achievement\nLeadership commitment to continue transforming into an environment where Latinx students thrive\nA long-term and unwavering commitment to intentionally serve Latinx, and all, students.\nFor example, SFSU is conducting targeted outreach efforts aimed at bolstering retention and degree completion rates among Latinx students. Much of this work is part of the California State University’s Equity Priority directives, which aim to eliminate equity gaps. Re-enrollment and re-engagement campaigns are also a priority with cross-campus units working to help our Latinx students who have dropped out return.\n“Students and families as well as leaders in philanthropy, business and government look to colleges and universities that earned the Seal of Excelencia when making their institutional choices,” said Sarita Brown, co-founder and president of Excelencia in Education. “Excelencia is proud to partner with institutions ensuring America’s bright future by advancing the talents of the Latino community.”\nInterested in becoming a San Francisco State University student? Apply now!\n###\nAbout San Francisco State University\nSan Francisco State University is a public university serving students from the San Francisco Bay Area, across California and around the world, with nationally acclaimed programs that span a broad range of disciplines. More than 22,000 students enroll at the University each year, and its approximately 294,000 graduates have contributed to the economic, cultural and civic fabric of San Francisco and beyond. Through them — and more than 1,800 world-class faculty members — SF State proudly embraces its legacy of academic excellence, community engagement and commitment to social justice. For more information, visit\nsfsu.edu\n.\nAbout Excelencia in Education\nLaunched in 2004 in the nation’s capital,\nExcelencia\nin Education leads a national network of results-oriented educators and policymakers to tap the talents of the Latino community and address the U.S. economy’s needs for a highly educated workforce and engaged civic leaders. With this network,\nExcelencia\naccelerates Latino student success in higher education by promoting Latino student achievement, informing educational policies with a Latino lens and advancing evidence-based practices. In 2024,\nExcelencia\nmarks 20 years of commitment to Latino student success. For more information, visit\nEdExcelencia.org\n.\nTags\nAwards and Achievements\nStudent Life\nLatinx\nRelated News\nDiscover 2025: See what makes life brighter at SFSU on Oct. 18\nSeptember 25, 2025\nSFSU offers full scholarships for first-of-its-kind PK-12 certificate in climate justice education\nSeptember 25, 2025\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nSFSU alumna wins Creative Arts Emmy Award for hit documentary\nSeptember 24, 2025",
    "url": "https://news.sfsu.edu/news/sfsu-earns-prestigious-seal-excelencia-its-commitment-latinx-students",
    "domain": "news.sfsu.edu"
  }
]