[
  {
    "source": "https://cs.sfsu.edu/",
    "category": "cs_general",
    "title": "Welcome | Department of Computer Science",
    "content": "Welcome\nResearch\nOur faculty and students are engaged in projects and research in many areas of Computer Science. Major areas of focus include Computing for Life Sciences, Soft Computing and Decision Support Systems, Software Engineering and Systems, Human Computer Interaction and more.\nExplore CS Research\nGraduate Program\nCS Department offers a Master of Science (MS) degree. Faculty and students are engaged in innovative research projects, many funded by grants from government or industry such as NSF and NIH, IBM Research, Microsoft, Amazon Web Services, Emulex, Claritics.\nExplore CS Graduate Programs\nUndergraduate Program\nWe are committed to providing the opportunity to master the Computer Science discipline to students from all backgrounds. Our program combines strong fundamentals, project- and team- oriented activities, and soft skills, leading to a well-rounded professional education.\nExplore CS Undergraduate Programs\nCS @ SF State Highlights\nWe Are Hiring!\nSan Francisco State University's Computer Science Department in the College of Science and Engineering offers an exciting opportunity for a tenure-track Assistant Professor position beginning August 2026. We seek a colleague whose teaching and research interests include Cybersecurity, Machine Learning/Generative AI, and/or Quantum Computing although candidates with research interests in other areas are also welcome to apply. We are especially interested in qualified candidates with a demonstrated commitment -- through their research, teaching, and service -- to the excellence of our academic program and community.\nFor best consideration, please apply by 1/31/2026.\nApply Here.\nStudent Spotlight - Diversity and Equity\nSF State Science Coding Programs Boost Biotech Diversity\nGrants impact SF State’s computer science diversity efforts with new certification programs and scholarships. The importance of diversity and equity in computer science is important to the CS Department and faculty members' efforts have recently received recognition from both academia and the biotech industry.\nReview Diversity Grant Efforts\nStudent Spotlight - Graduate Certificates Options\nEthical Artificial Intelligence & Software Engineering\nCS Department announces two new Graduate Certificates in Ethical Artificial Intelligence and Software Engineering. Learn about the certificates, the eligibility processing and how to apply.\nView Grad Certificates Options\nNews\nSFSU is first CSU campus to join IBM Quantum Network\nIBM quantum resources open doors for hands-on learning and workforce readiness\nSan Francisco State University is the first C…\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nOn August 20, 2025, the Kumo AI Hackathon took place in San Francisco. The CIDER Lab students Binrong Zhu, Guiran Liu, and Y…\nAnnouncement of Two New Grants Awarded From NSF\nGrant 1\nCollaborative Research: CISE Core Small: NeTS: Intelligent Reflecting Surface Assisted Physical Layer Security Enhan…\nMore News\nMore events coming soon!\nMore Upcoming Events",
    "url": "https://cs.sfsu.edu/",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/justice-equity-diversity-and-inclusion-jedi",
    "category": "cs_general",
    "title": "Justice, Equity, Diversity and Inclusion (JEDI) | Department of Computer Science",
    "content": "Justice, Equity, Diversity and Inclusion (JEDI)\nThe department is committed to making the computer science field more diverse and to provide an inclusive environment for people of all backgrounds. We celebrate and value justice, equity, diversity and inclusion as fundamental to our mission.\nFaculty Making a Difference\nSF State Science Coding Programs Boost Biotech Diversity\nDespite the San Francisco Bay Area being one of the most diverse regions in the country, the technology industries that call it home still lack diversity. Faculty members in the\nPromoting Inclusivity and Computing (PINC)\nprogram at San Francisco State University aim to change this. Their efforts have recently received recognition from both academia and the biotech industry, including two recent grants from the Genentech Foundation and Genentech, Inc. totaling over $1.2 million.\n“It’s very male driven — gender diversity is very low, and ethnic and racial diversity are also very low.”\nAssociate Professor of Computer Science\nAnagha Kulkarni\nRead Full Article\nDiversity, Equity & Outreach Committee\nPurpose\nEstablish ties with off-campus professionals, companies, foundations, and other educational institutions.\nSolicit feedback for curricula updates from off-campus entities.\nRepresent the Department at outreach events.\nMaintain and engage alumni of the Department.\nFunctions\nAlumni management:\nCreate and maintain a list of alumni.\nSend occasional updates to alumni.\nOrganize the Department's annual Alumni Mixer event.\nIndustry Advisory Board (IAB):\nDefine statues of the Department's IAB.\nSolicit and recruit members for the IAB.\nOrganize regular meetings with the member of the IAB.\nRelay feedback from the IAB to the Department Affairs Committee.\nOffer at least five presentations for the Department's Computer Science Seminar Series.\nGeneral outreach (e.g., K12)\nUpdate the Department's web presence and social networks.\nOrganize the Department's Graduation Celebration.\nSeek unrestricted funding opportunities and donations for the benefit of the Department in collaboration with the college's development office.",
    "url": "https://cs.sfsu.edu/justice-equity-diversity-and-inclusion-jedi",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/employment",
    "category": "cs_general",
    "title": "Employment | Department of Computer Science",
    "content": "Employment\nFaculty Hiring\nHiring Assistant Professor, Computer Science\nJob no:\n551685\nWork type:\nInstructional Faculty – Tenured/Tenure-Track\nLocation:\nSan Francisco\nCategories:\nUnit 3 - CFA - California Faculty Association, Tenured/Tenure-Track, Full Time, Faculty - Computer Science, On-site (work in-person at business location)\nApplications close:\nOpen Until Filled\nView Job Opportunity",
    "url": "https://cs.sfsu.edu/employment",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/news/cider-lab-wins-first-prize-kumo-ai-hackathon",
    "category": "cs_general",
    "title": "CIDER Lab Wins First Prize at Kumo AI Hackathon | Department of Computer Science",
    "content": "CIDER Lab Wins First Prize at Kumo AI Hackathon\nAuthor:\nQun Wang\nSeptember 11, 2025\nOn August 20, 2025, the Kumo AI Hackathon took place in San Francisco. The CIDER Lab students Binrong Zhu, Guiran Liu, and Yang Liu participated. Competing among many strong teams, the project WildfireRFM – Wildfire Risk Alarm System with KumoRFM won First Prize. Part of this work is also supported by Gilead Innovation Initiative 2025 Summer Research Award and with Professor Zhuwei Qin, an Assistant Professor of Computer Engineering.\nWildfireRFM leverages KumoRFM to combine California-wide forest datasets and historical wildfire records in order to predict the regions at highest risk of wildfire in the coming month. The system also integrates real-time camera detection and edge LLM analysis of weather and environmental signals, enabling timely early-warning reports for fire stations in high-risk zones. This recognition highlights both our students’ dedication — after a summer of intensive research on AI and wireless networks — and the potential for foundation models to tackle urgent real-world challenges such as wildfire prevention.\nRead more about this event here.\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/cider-lab-wins-first-prize-kumo-ai-hackathon",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/career-development-internships-jobs-and-resources",
    "category": "cs_general",
    "title": "Career Development: Internships, Jobs and Resources | Department of Computer Science",
    "content": "Career Development: Internships, Jobs and Resources\nThe Computer Science Department at SFSU is committed to supporting students in their professional development. This page provides a comprehensive list of internship and job opportunities, career preparation resources, and hands-on training programs to help students gain industry experience and build their careers. Explore the resources below to find opportunities that align with your career goals.\nNot sure where to start? The Career Services & Professional Development Center (CSPD) supports students in navigating their career paths through advising.\nCareer Advising Services\nHandshake\nConnect with employers looking for SFSU students and access exclusive on-campus and off-campus job listings.\nHandshake\nLinkedIn\nLearn how to build your professional network, showcase your skills, and find job and internship opportunities in tech.\nLearn how to optimize your LinkedIn\nCS Job Boards\nExplore job boards tailored for computer science roles, from software engineering to AI and cybersecurity.\nSee Job Boards\nPrepare for Your Interview\nOn top of preparing for behavioral interviews, technical interviews are a key part of landing a job in computer science, often requiring candidates to solve coding problems in real time. To prepare, you can practice coding challenges on platforms like\nLeetCode\n,\nHackerRank\n, and\nCodeSignal\n, which offer problems similar to those asked by major tech companies. Explore how to ace your interview below, and get practice with coding challenges.\nBig Interview\nUse Big Interview to learn and practice your interview skills, whether you’re interviewing for a job or graduate school. When preparing for a job interview, it's not enough to only read advice — you need to put that advice into practice! That's why Big Interview isn't just a training course. You'll also get hands-on practice with mock interviews tailored to your specific industry, job and experience level.\nPractice with Big Interview\nLeetCode\nHackerRank\nCodeSignal\nCodeWars\nBuild Your Experience\nThere are many valuable ways to gain experience outside of traditional roles. Explore opportunities like\nworkshops\n,\nindustry sponsored programs\n, and\npersonal projects\nthat showcase your abilities. These experiences can help you develop key skills, grow your network, and stand out in your career journey.\nGoogle Summer of Code\nGoogle Summer of Code is a global, online program focused on bringing new contributors into open source software development. GSoC Contributors work with an open source organization on a 12+ week programming project under the guidance of mentors.\nLearn More\nCTI Accelerate\nHosted by CSU Monterey, students can enhance their portfolios by contributing to open-source projects, working in teams under industry mentor guidance to develop professional-quality solutions.\nLearn More\nNSF I-Corps Training\nThe Bay Area I-Corps Program helps students and researchers turn innovative ideas into marketable products through entrepreneurship training and mentorship.\nLearn More\nHackathons\nHackathons are a fun and exciting way to\nlearn new skills\n,\nmeet peers\n, and\nboost your portfolio\n. You'll get to work with other students, tackle real-world challenges, and build creative solutions — all in a fast-paced, hands-on environment. Plus, many hackathons offer\nprizes\n,\nmentorship\n, and great networking opportunities, making them a great way to gain experience and stand out to future employers.\n2025 Hackathons:\nTreeHacks\n: Stanford University's premier hackathon, TreeHacks 2025, is scheduled for February 14-16, 2025, offering participants 36 hours to develop solutions to global challenges across various sectors.\nHackHayward\n: Hosted at California State University, East Bay, on March 1-2, 2025, HackHayward is the first collegiate hackathon in the Hayward area, expecting over 250 participants to tackle real-world challenges.\nSF Hacks\n: Scheduled for April 4-6, 2025, at San Francisco State University's Annex 1, SF Hacks 2025 promises to be bigger and better, offering participants opportunities to collaborate and innovate.\nUC Berkeley AI Hackathon\n: Taking place on June 21-22, 2025, this event invites participants to engage in AI-focused projects, with mentorship and judging opportunities available.\nCalHacks 11.0\n: Co-hosted by Google and Fetch.ai, CalHacks 11.0 is set for October 3-5, 2025, in San Francisco, bringing together student hackers for a weekend of innovation and collaboration.\nFellowships & Research Programs\nGeneral Computer Science Fellowships\nGoogle STEP (Student Training in Engineering Program)\n-  A 12-week summer internship program for first and second-year undergraduate students with a passion for computer science, focusing on providing exposure to software engineering and professional development.\nMicrosoft Explore\n- A 12-week summer internship program specifically designed for first and second-year college students, offering a rotational experience to gain exposure to different software engineering roles, including Software Development Engineer (SDE) and Program Manager (PM).\nKleiner Perkins\n- Connects students with opportunities to work with innovative companies, offering deep technical skill development and mentorship from executives through internships at portfolio companies.\nFormation Fellowship\n- Offers personalized mentorship and training to help aspiring software engineers from diverse backgrounds bridge the gap between education and a successful tech career.\nDiversity-Focused Fellowships\nGoogle Tech Exchange\n- This program provides students from Historically Black Colleges and Universities (HBCUs) and Hispanic-Serving Institutions (HSIs) with the opportunity to spend a semester at Google's campus, engaging in computer science coursework and professional development.\nMLT Career Prep\n- Management Leadership for Tomorrow's Career Prep program equips Black, Latinx, and Native American college students with the skills, coaching, and connections necessary for career success in various industries, including tech.\nRewriting the Code (RTC)\n- A nonprofit organization that empowers women in tech globally by providing support, mentorship, and education to help pave the way for sustainable careers, professional advancement, and equal opportunities.\nColorStack\n- A nonprofit organization dedicated to supporting minority students in computer science through mentorship, academic advising, and career development opportunities, aiming to improve diversity in computing.\nUber Career Prep\n- A seven-month fellowship program emphasizing technical growth, mentorship, and professional development, designed to prepare students from underrepresented backgrounds for careers in software engineering.\nAI/ML & Research Programs\nNSF Research Experiences for Undergraduates (REU)\n- Supports active research participation by undergraduate students in any area of research funded by the National Science Foundation, involving students in meaningful ways in ongoing research programs or in projects specifically designed for the REU program.\nF-1 Students Opportunities\nOIP Information for International Students\nCurricular Practical Training (CPT)\nPurpose, Length and Eligibility\nPurpose:\nCPT is a program that allows temporary employment authorization for International students in F-1 Student visa status. CPT is an alternate work/study, internship, cooperative education or other type of required practicum that a sponsoring employer offers through cooperative agreements with your college or university. CPT is only available for F-1 students when it is part of an established curriculum within a school. CPT must be integral to your program of study.\nLength:\nCPT is semester based. CPT will begin no earlier than the first day of instruction and must end no later than the last day of final exams for the semester.\nPlease note the process on average can take up to 10 working days.\nEligibility:\nGPA >= 2.0 for undergraduate students; GPA >= 3.0 for Graduate Students\nGood academic standing, student must not be in probation at the time CPT is required\nValid F-1 status\nEnrolled full-time.\nMinimum 12 units for undergraduate students or 8 units for graduate students.\nWaitlisted classes will not be counted towards full time requirement.\nFulfilled one year full-time requirement. You must have been enrolled full-time for at least one full academic year prior to submitting a CPT application. One year full-time enrollment may be fulfilled at SF State, a previous university, or between multiple universities\nInternship offer letter from employer\nEnrollment in CSC 694 (for undergrads, Cooperative Education) or CSC 893 (for graduate students, Supervised Industrial Research) in the same semester in which you are employed\nPlease note: Graduate students enrolled in Culminating Experience courses must have their committee chair send an email to\nProfessor Shah Rukh Humayoun\napproving the request for CSC 893 enrollment.\nCSC 694 and CSC 893 can be taken for 1 unit, up to three times total, and cannot be used as an elective or to fulfill minimum course load requirements. CS Department requirements are in addition to any requirements dictated OIP\nThe Department does not support students to take a full-time internship during the academic semester.\nSummer CPT\nStudents who qualify for CPT are eligible to work full time in the Summer semester.\nSummer CPT applicants will follow the same steps as required for Fall/Spring CPT.\nOPT/CPT - for International Students Only\nOptional Practical Training (OPT)\nPractical Training\nPractical training is very valuable for all students’ educational experience. International students need to get proper permits to get external jobs. This program (OPT and CPT) allows them to work during their time as a full-time student (working part-time in Fall/Spring and full-time in the Summer) in what is called the Curricular Practical Training (CPT). For details on how to obtain the CPT permit, visit:\nMasters Culminating Experience\n. After graduating with a B.S. or M.S. degree, students can work under the Optional Practical Training (OPT) Program\nIn both cases, students must work with the\nSF State Office of International Program (OIP)\nand with the CS faculty. It is the responsibility of the student to look for and secure jobs as well as following these rules - failure to follow rules for CPT/OPT may result in\nloss of student visa privileges\n.\nOPT\nUndergraduate Students\nStudent must be very close to graduation, please speak with\nProfessor Shah Rukh Humayoun\n.\nGraduate Students\nOPT is applied when student is about 95% finished with his/her culminating experience work or later. To participate in OPT the student\nmust\nfollow the following steps once he/she obtains the job offer:\nStudent’s mentor and CS Chair determines if 95% or more of culminating experience work has been completed and has signed the necessary OIP forms.\nStudent visits the\nSF State Office of International Program (OIP)\nto get necessary permissions.",
    "url": "https://cs.sfsu.edu/career-development-internships-jobs-and-resources",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/data-perceptualization-and-user-experience",
    "category": "cs_general",
    "title": "Data Perceptualization and User Experience | Department of Computer Science",
    "content": "Data Perceptualization and User Experience\nA cutting-edge computer science research program in data perceptualization, visual analytics, human interface, and computer graphics focuses on advancing the equitable and accessible representations of and interaction with large and complex data sets. The program explores innovative techniques for rendering and visually representing data in intuitive and aesthetically pleasing ways, enables users to interactively explore and analyze data through use of visual representations to gain insight, identify patterns and make data-driven decisions, and enhances user experiences through interactive interfaces. By leveraging state-of-the-art computational technologies, this program aims to bridge the gap between data analytics and human cognition, enabling more effective data-driven decision-making and communication.\nAcademics and Coursework\nIn addition to broader requirements for a CS undergraduate or graduate degree, students may specialize their education around Data Perceptualization and User Experience topics via these undergraduate and graduate level courses:\nUndergraduate Courses\nCSC 630\nComputer Graphics Systems Design\nCSC 642\nHuman-Computer Interaction\nCSC 698\nTopics in Computing - Information Visualization\nCSC 699\nIndependent Study\nGraduate Courses\nCSC 805\nData Visualization: Concepts, Tools, Techniques, and Paradigms\nCSC 842\nHuman-Computer Interaction\nCSC 895\nApplied Research Project\nCSC 897\nResearch\nCSC 898\nMaster's Thesis\nCSC 899\nIndependent Study\nFaculty and Focus Areas\nWes Bethel\nHigh performance computing, scientific visualization, computer graphics\newbethel@sfsu.edu\nShah Rukh Humayoun\nInformation visualization, visual analytics, human-computer interaction, virtual reality, software engineering\nhumayoun@sfsu.edu\nIlmi Yoon\nComputer graphics, virtual reality, augmented reality, gamification\nilmi@sfsu.edu\nZainab Agha\nHuman-computer interaction, online safety, privacy, social computing\nzainabagha@sfsu.edu\nSanika Doolani\nHuman Computer Interaction, User Experience, XR/VR/AR, Immersive Media\nsanikadoolani@sfsu.edu\nPublications and Reports\nZainab Agha, Naima Ali Samreen, Jinkyung Park, Pamela Wisniewski. A systematic review on design-based nudges for adolescent online safety. International Journal of Child-Computer Interaction (2025).\nJanghee, Cho, Inhwa Song, Zainab Agha, Bengisu Cagiltay, Veena Calambur, Minjin MJ Rheu, and Jina Huh-Yoo. Mobile Technology and Teens: Understanding the Changing Needs of Sociocultural and Technical Landscape. Workshop at the Conference on Human Factors in Computing Systems (2025), Yokohama, Japan.\nJenna Wong, Shah Rukh Humayoun, M. Seto, Khanh Nguyen and S. Win. Interactive Rapid Earthquake Evaluation Training for Structural Engineering. In proceedings of the 18th World Conference on Earthquake Engineering (WCEE 2024), Milan, Italy, June 30 to July 05, 2024.\nIlya Nemtsov, MST Jasmine Jahan, Chuting Yan, and Shah Rukh Humayoun: Visual Exploration of Emotion Feelings Comparison in Tweet Data. In Proceedings of Eurographics Conference on Visualization (EuroVis 2024 – Posters), The Eurographics Association, May 27 – 31, 2024, Odense, Denmark\nShah Rukh Humayoun, Jenna Wong, Khanh Nguyen, Purva Zinjarde, and Prathiba Ramesh: VR-Engine: Training Post-Earthquake Damages in Building Structure. 2024 IEEE Conference on Virtual Reality and 3D User Interfaces, Abstracts and Workshops (VRW) proceedings, Orlando, FL, USA, 2024, pp. 931-932, doi: 10.1109/VRW62533.2024.00262.\nSyed Ahsan Ali Dilawer and Shah Rukh Humayoun: A Visual Analytics Tool to Explore Multi-Classification Model with High Number of Classes The 16th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS Companion '24), June 24–28, 2024, Cagliari, Italy,\nhttps://doi.org/10.1145/3660515.3662835\nJarrett Zapata, Syed Farhan Haider, Ragaad AlTarawneh, and Shah Rukh Humayoun: GraDVis: A Visualization Tool for a Visual Data Management System. The 16th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS Companion '24), June 24–28, 2024, Cagliari, Italy,\nhttps://doi.org/10.1145/3660515.3662833\nNina Mir, Ragaad AlTarawneh, and Shah Rukh Humayoun: “Circles: Inter-Model Comparison of Multi-Classification Problems with High Number of Classes”. IEEE VIS 2023: Visualization and Visual Analytics. Melbourne, Australia, 22-27 October, 2023.\nhttps://arxiv.org/abs/2309.05672\nSyed Ahsan Ali Dilawer and Shah Rukh Humayoun: “MultiCaM-Vis: Visual Exploration of Multi-Classification Model with High Number of Classes”. IEEE VIS 2023: Visualization and Visual Analytics. Melbourne, Australia, 22-27 October, 2023.\nhttps://arxiv.org/abs/2309.05676\nIlya Nemtsov, MST Jasmine Jahan, Chuting Yan, and Shah Rukh Humayoun: “TECVis: A Visual Analytics Tool to Compare People's Emotion Feelings”. IEEE VIS 2023: Visualization and Visual Analytics. Melbourne, Australia, 22-27 October, 2023.\nhttps://arxiv.org/abs/2309.04722\nSnehal Patil and Shah Rukh Humayoun: “A Visual Analytic Environment to Co-locate Peoples' Tweets with City Factual Data”. IEEE VIS 2023: Visualization and Visual Analytics. Melbourne, Australia, 22-27 October, 2023.\nhttps://arxiv.org/abs/2309.04724\nShimizu M.* and Kulkarni A. (2023) Quantitative Measures of Online Health Information (QMOHI): Broadening the impact through improved usability, applicability, and effectiveness. Appears in\n2023 IEEE 11th International Conference on Healthcare Informatics (ICHI)\n. IEEE\nShah Rukh Humayoun, Salman Zaidi, and Ragaad AlTarawneh: “SamS-Vis: A Tool to Visualize Summary View Using Sampled Data”. 19th IFIP TC13 International Conference on Human-Computer Interaction (INTERACT 2023), York, UK, August 28 – September 1, 2023, Lecture Notes in Computer Science book series (LNCS, volume 14145), Springer, 557-562\nShah Rukh Humayoun, Yael Dubinsky, Kerri Kariti, Moshe Kariti: “Where Do All Stakeholders Find the Software Product Blueprint?” 19th IFIP TC13 International Conference on Human-Computer Interaction (INTERACT 2023), York, UK, August 28 – September 1, 2023, Lecture Notes in Computer Science book series (LNCS, volume 14145), Springer, 590-594\nJenna Wong, Shah Rukh Humayoun, Khanh Nguyen, and Yongjian Pan: “Reinforcing Human-Technology Interaction Theory through a Virtual Reality Engineering Training Application”. In the American Society for Engineering Education Annual Conference (ASEE 2023), Balyimore Convention Center, MD, USA, June 25-28, 2023.\nZihao Wang and Shah Rukh Humayoun: “Vertex2Image: Construct Human Figure Based On A Monocular Video”. In Companion Proceedings of the 28th International Conference on Intelligent User Interfaces (IUI '23 Companion). Association for Computing Machinery, New York, NY, USA, 108–111.\nRené Reinhard, Erinchan Telatar, and Shah Rukh Humayoun: “Comparison of Object Detection in Head-Mounted and Desktop Displays for Congruent and Incongruent Environments”. Big Data and Cognitive Computing Journal, 6(1): 28 (2022).\nJenna Wong and Shah Rukh Humayoun. “Expanding Structural Engineering Education through Virtual Reality”. In American Society for Engineering Education Annual Conference (ASEE 2022), Minneapolis, Minnesota, USA, June 26-29, 2022.\nShah Rukh Humayoun and Likhitha Brahmadevara: “Chord2DS: An Extension to Chord Diagram to Show Data Elements from Two Heterogeneous Data Sources”. In 24th EG/VGTC Conference on Visualization (EuroVis 2022), Rome, June 13-17, 2022.\nKulkarni A, Wong M, Belsare T*, Shah R*, Yu Yu D**, Coskun B**, Holschuh C, Kakar V, Modrek S, Smirnova A. (2022) Quantifying the Quality of Web-Based Health Information on Student Health Center Websites Using a Software Tool: Design and Development Study.\nJMIR Form Res 2022;6(2):e32360.\nhttps://doi.org/10.2196/32360\nShah Rukh Humayoun and Siddhita Chimote: “An Interactive Visualization Tool to Explore People's Tweets towards COVID-19”. In International Conference on Advanced Visual Interfaces (AVI 2022), Rome, June 06-10, 2022.\nShah Rukh Humayoun, Ghazanfar Abbas, and Ragaad AlTarawneh: “Touch-behavioral Authentication on Smartphones using Machine Learning”. In ACM 27th International Conference on Intelligent User Interfaces (IUI ’22 Companion), March 22–25, 2022, Helsinki, Finland. ACM, New York, NY, USA, 6 pages.\nhttps://doi.org/10.1145/3490100.3516456\nKakar V, Kulkarni A, Holschuh C, Smirnova A, Modrek S. (2022) Contraception information on the websites of student health centers in the United States.\nContraception. 2022 Jan 25:S0010-7824(22)00011-7\n.\nhttps://doi.org/10.1016/j.contraception.2022.01.007\n.\nModrek, S., Wong, M., Kulkarni, A., Holschuh, C., & Kakar, V. (2022). Medication abortion: State of information on Student Health Center websites.\nJournal of American College Health\n, 1-5.\nhttps://doi.org/10.1080/07448481.2022.2155472\nPeer-Timo Bremer, Georgia Tourassi, Wes Bethel, Kelly Gaither, Valerio Pascucci, and Wei Xu. Visualization for Scientific Discovery, Decision-Making, and Communication. Summary Report from the ASCR Workshop on Visualization for Scientific Discovery, Decision-Making, and Communication, United States, January 2022.\nhttps://www.osti.gov/biblio/1845708\nDoolani, Sanika. VISTAS: Vocational Immersive Storytelling Training and Support Framework for Augmenting Work Performance. The University of Texas at Arlington, 2021.\nDoolani, Sanika, Callen Wessels, and Fillia Makedon. \"vIIIS: A Vocational Intelligent Interactive Immersive Storytelling Framework to Support Task Performance.\" In The 14th PErvasive Technologies Related to Assistive Environments Conference, pp. 527-533. 2021.\nDoolani, Sanika, Callen Wessels, and Fillia Makedon. \"Designing a Vocational Immersive Storytelling Training and Support System to Evaluate Impact on Working and Episodic Memory.\" In The 14th PErvasive Technologies Related to Assistive Environments Conference, pp. 268-269. 2021.\nShah Rukh Humayoun, Ibrahim Mansour, Ragaad AlTarawneh: “TEVisE: An Interactive Visual Analytics Tool to Explore Evolution of Keywords' Relations in Tweet Data”. The IFIP Technical Committee 13 18th International Conference on Human–Computer Interaction (INTERACT ’21), 579-599, August 30 – September 03, 2021.\nDylan Cashman, Shenyu Xu, Subhajit Das, Florian Heimerl, Cong Liu, Shah Rukh Humayoun, Michael Gleicher, Alex Endert, and Remco Chang: “CAVA: A Visual Analytics System for Exploratory Columnar Data Augmentation Using Knowledge Graphs”. IEEE Transactions on Visualization & Computer Graphics (TVCG), 27(2): 1731-1741, Feb. 2021.\nDoolani, Sanika, Callen Wessels, Varun Kanal, Christos Sevastopoulos, Ashish Jaiswal, Harish Nambiappan, and Fillia Makedon. \"A review of extended reality (xr) technologies for manufacturing training.\" Technologies 8, no. 4 (2020): 77.\nDoolani, Sanika, Luke Owens, Callen Wessels, and Fillia Makedon. \"vIS: An immersive virtual storytelling system for vocational training.\" Applied sciences 10, no. 22 (2020): 8143.\nShah Rukh Humayoun, Muhammad Faizan, Zuhair Zafar and Karsten Berns: “Space-free Gesture Interaction with Humanoid Robot”. International Conference on Advanced Visual Interfaces (AVI 2020), Island of Ischia, Italy September 28 - October 2, 2020.\nGupta, Sanika, Luke Owens, Konstantinos Tsiakas, and Fillia Makedon. \"vIIS: a vocational interactive immersive storytelling framework for skill training and performance assessment.\" In Proceedings of the 12th ACM International Conference on PErvasive Technologies Related to Assistive Environments, pp. 411-415. 2019.\nGrants and Awards\nNational Science Foundation (NSF). Equipment: VRMaS: VR Maker Space. PI: Shahrukh Humayoun (Department of Computer Science), Co-PI: Jenna Wong (School of Engineering), December 01, 2024 – November 30, 2026, Award: $200K.\nFoundation for California Community Colleges: California Education Learning Lab. E-GAISE: Ethical Generative AI in Undergraduate Computer Science Education. PI: Shahrukh Humayoun, Co-PIs: Hui Yang, Isabel Hyo Jung Song, and Akila de Silva. January 2025 – June 2026, Award: $150K\nStructural Engineers Association of Northern California (SEAONC). SAP Evaluator Training/SEAONC.). PI: Jenna Wong (School of Engineering), Co-PI: Shahrukh Humayoun (Department of Computer Science), $10,000,  Feb. – June 2022.",
    "url": "https://cs.sfsu.edu/data-perceptualization-and-user-experience",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/news",
    "category": "cs_general",
    "title": "News Listing | Department of Computer Science",
    "content": "News Listing\nSeptember 25, 2025\nSFSU is first CSU campus to join IBM Quantum Network\nIBM quantum resources open doors for hands-on learning and workforce readiness\nSan Francisco State University is the first C…\nSeptember 11, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nOn August 20, 2025, the Kumo AI Hackathon took place in San Francisco. The CIDER Lab students Binrong Zhu, Guiran Liu, and Y…\nAugust 28, 2025\nAnnouncement of Two New Grants Awarded From NSF\nGrant 1\nCollaborative Research: CISE Core Small: NeTS: Intelligent Reflecting Surface Assisted Physical Layer Security Enhan…\nAugust 26, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nWe are pleased to announce that CS Professor Jozo Dujmovic’s new AI book -- Graded Logic: Modeling Human Commonsense Reasoni…\nAugust 01, 2025\nNew Undergraduate Certificate in Generative Artificial Intelligence: Technology, Applications, and Ethics\nThe Department of Computer Science is proud to announce the launch of a new Undergraduate Certificate in Generative Artifici…\nFebruary 17, 2025\nProfessor Dragutin Petkovic presented a keynote speech at IEEE CCWC Conference in Las Vegas January 8, 2025 on \"GenAI and Education\"\nProfessor Dragutin Petkovic delivered a keynote speech on January 8, 2025, at the IEEE Computing and Communication Workshop…\nDecember 02, 2024\nNew Department of Defense, Energy grants prepare SFSU students for industry jobs\nThe grants expand research opportunities in engineering, robotics and quantum computing\nTechnology is constantly evolving, w…\nOctober 07, 2024\nInstructor Joseph Hui Featured on CBS News for Commitment to Helping Youth\nJoseph Hui, an instructor here at SFSU has been featured on CBS News for turning his passion for bikes into a mission to sup…\nSeptember 25, 2024\nBethel, Huang Awarded U.S. Department of Energy Research Grant in Quantum Computing\nThe U.S. Department of Energy (DOE) Office of Advanced Scientific Computing Research recently awarded a $250,000, five-year…\nJuly 09, 2024\nSan Francisco State University Lecturer Duc Ta Earns Prestigious Teaching Award\nSFSU Recognizes Excellence in Teaching with Award to CS Lecturer\nSan Francisco State University's Computer Science Departmen…\nJuly 09, 2024\nSan Francisco State Honors Computer Science Graduates at 2024 Ceremony\nSFSU Celebrates its Newest Class of Graduates\nSan Francisco State University's Computer Science Department hosted a Gradua…\nApril 15, 2024\nIn-person hackathon makes triumphant return to campus\nSF Hacks was a nonstop weekend filled with ‘hacking,’ friendly competition, networking, karaoke and Bob Ross\nWhat is a hacka…\nMarch 04, 2024\nKulkarni Lab Receives Grant from Smith-Kettlewell Eye Research Institute\nFebruary 27, 2024\nAI-STAARS Program Awards Scholarships to 20 Computer Science Freshman\nAI-STAARS stands for Artificial Intelligence Scholarships that Improve Academic Achievement, Retention, and Career Success.…\nFebruary 27, 2024\nComputer Science, Biology, and Psychology Faculty Receive a Renewal Award from Genentech Inc.\nAnagha Kulkarni (CS), Ilmi Yoon (CS), Pleuni Pennings (Biology), and Shasta Ihorn (Psychology) have received a renewal award…\nFebruary 19, 2024\nComputer Science Researchers Receive U.S. Department of Energy Grant\nDecember 04, 2023\nSF State program prepares participants to view AI through an ethical lens\nThe Ethical AI certificate provides a foundation in the computer science, philosophy and business of ethical AI\nU.S. Preside…\nNovember 15, 2023\nCISCO @ SFSU\nOver 100 SFSU Computer Science students indicated interest in attending a professional development workshop hosted by CISCO…\nNovember 03, 2023\nCISCO Meraki Campus Visit\n40 SFSU Computer Science students had the opportunity to visit the CISCO Merkai Campus in downtown San Francisco. In collabo…\nSeptember 29, 2023\nFall 2023 Engineering and Computer Science Career Fair\nThis year’s Engineering and Computer Science Career Fair took place on September 29, 2023, in the Annex. This event was host…\nSeptember 26, 2023\nOpen Faculty Position in CS Department\nSan Francisco State University, Department of Computer Science offers an exciting opportunity for two tenure-track Assistant…\nSeptember 22, 2023\nCS Department College Tour\nThe Computer Science Academy at Oakland Technical High School coordinated a campus visit with several of our majors to learn…\nAugust 31, 2023\nInaugural Meeting of SFSU’s ACM CS Research Special Interest Group\nIn conjunction with the CS ACM student chapter and its Treasurer and former president, Mark Kim, Professors Daniel Huang and…\nMay 28, 2023\nCS Department Graduation Celebration 2023\nTo celebrate the achievements of our Computer Science students, the department held a Graduation Celebration for all CS unde…\nMay 28, 2023\nProf. Daniel Huang Recipient 2023 Petkovic Family Teaching Excellence Award\nProf. Daniel Huang of the SFSU Computer Science Department is the recipient of the 2023 Petkovic Family Teaching Excellence…\nMay 15, 2023\nEthical AI Certificate Presentation Awarded at the AAAI Symposium (2023)\nComputer science professor Dragutin Petkovic, alongside philosophy professor Carlos Montemayor and business management profe…\nMay 08, 2023\nLeaping Into the World of Computer Science with the help of Google’s CSRMP\nThe CS Department would like to congratulate SFSUs own Purva Zinjarde, on their acceptance into the Google CS Research Mento…\nJune 01, 2022\nBiotech Certificate Students get Insider Peek into Industry Jobs\nThe gSTAR program is only one year old, but the SF State-Genentech collab is already impacting students, faculty and industr…\nDecember 16, 2020\nSF State Science Coding Programs Boost Biotech Diversity\nGrants impact SF State’s computer science diversity efforts with new certification programs and scholarships\nDespite the San…\nAugust 28, 2018\nBuild the Diverse, Multidisciplinary Computer Science Workforce of the Future\nDeveloping a Computing Application Minor and an Inclusive Learning Environment to Build the Diverse, Multidisciplinary Compu…",
    "url": "https://cs.sfsu.edu/news",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/masters-culminating-experience",
    "category": "cs_general",
    "title": "Master's Theses and Projects | Department of Computer Science",
    "content": "Master's Theses and Projects\nThe objective of the mandatory Master's Thesis or Project requirement is to provide a culminating educational experience, where the student, under the supervision of a faculty member, conducts an individual study employing concepts and methods learned in the program to solve a problem of significant importance from a practical or theoretical standpoint.\nThe Following Policies Apply\nStudy Involves Overview\nThe study should involve a synthesis of concepts and methods learned in more than one course, and exhibit awareness of previous work in the area of study. This requirement also aims to provide an opportunity to the student to learn and practice the means of written and oral communication. The project or thesis provides an extremely important component to the students' portfolio applied towards a future undertaking whether it be for admission to a Ph.D. program or for a leadership position in the computing industry.\nTwo Equivalent Possibilities\nThere are two equivalent possibilities for the culminating experience in the MS program in Computer Science:\nMS project (CSC 895)\n, and\nMS thesis (CSC 898)\n. The MS thesis and the MS project have the same level of difficulty, need the same time for completion, and yield the same kind of MS degree. The decision whether a work is a thesis or a project must be made at the time of registration for CSC 895/898 in consultation with the faculty advisor.\n1. Credits and Courses to Take\nThe complete work on MS thesis/project has a limit of 9 credits. Typically, students working on a thesis will register for 3 credits of CSC 897 (Research) followed by 3 credits of CSC 898, but they can take an additional 3 units of CSC 897 upon advisement. Students working on a project will usually enroll in 3 credits of CSC 899 followed by 3 credits of CSC 895,but they can take additional 3 units of CSC 899 upon advisement. CSC 895 and 898 are graded as CR/NC.\n2. Advisor and Committee Selection\nBefore registering for the MS thesis/project the student must select an advisor, and other members of the thesis/project committee and file the GAP and Culminating Experience Form with the Graduate Division. The thesis committee must have at least 3 members, and the project committee must have at least 2 members. At least two members must be tenured or tenure-track SFSU/CS faculty for either type of committee. In addition to the 2 members of the CS Department, the committee may include faculty or members outside of the CS Department, upon approval of the CS Chair.\n3. Defense\nBoth MS thesis and MS project have a public oral defense. Usually the student presentation is about 30 min. with Q&A following. Defense committee then asks all to leave the room for a short period of time to discuss the work and the grading. The defense must be advertised to the local community. This is a great opportunity to bring family and friends. Students are advised to carefully rehearse and check the presentation for content, duration and to make sure all the SW and demos work.\n4. MS Thesis Format\nThe format of the MS thesis document is strictly defined and controlled by the SF State Graduate Division (\nUniversity Thesis Composition Guidelines\n). The original copy of the thesis, including committee signatures, is submitted to the Graduate Division for approval. After approval by the Graduate Division the original version is bound according to the SFSU standard and available in the SFSU library. One bound copy of the thesis must also be given to the CS Department office. Thesis copies are submitted to the committee members in a form approved by the members.\n5. MS Project Format\nThe format of the MS project document is strictly defined and controlled by the Department of Computer Science, and has the form of the CS Technical Report. The final version of the MS project is submitted to the CS Department and stored in the CS Department office. Project document copies are submitted to the committee members in a form approved by the members. Please work with your advisor for more details.\n6. Deadlines, Forms & Paperwork\nStudents are encouraged to consult with prospective thesis/project advisors and CS office for more detailed information on the expected schedules for completion of their culminating experience work.\nNote: CSC 895 enrollment (permit number) is strictly controlled by CS Office and not your mentor. This is due to the need to make a complete check on whether you fulfilled all the requirements for graduation.\nThe deadline for filing all forms for your CSC 895/898 is the semester preceding your planned CSC 895/898 enrollment (November for Spring and April for Fall). See your grad advisor and CS office for details, and check the above link.\n7. Culminating Experience Project Proposal\nThis is submitted the term prior to enrollment in 895 or 898. The CER is a vehicle to communicate and agree upon expectations for the work for culminating experience between the student and the advisor. Typical sections of this proposal should include motivation, problem description, method of solving the problem, relevant work of others, as well as milestones, deliverables and approximate timetable (for more details talk with the thesis/project advisor). This project proposal should be done carefully and will serve as a \"contract\" between the advisor and the student. The size of this report is in general about 2-4 pages. Students are encouraged to work with their thesis/project advisor on specific details.\nIt is required that this proposal be developed as a deliverable with the 899 or 897 course preceding 895 or 898 courses.\n8. Student Responsibility\nIt is\ncritical\nto plan to take graduate level electives with possible culminating experience supervisors during your first year of study. Think of topic(s) for your culminating experience, do a research on it, check what CS faculty does for research, and feel free to meet CS Chair or other faculty for advice.\nMust\nattend the first graduate seminar (graduate program overview) in your first semester of study\nMust\nenroll in courses taught by prospective thesis/project supervisors in your second semester of study. Consult your favorite professors for guidance in project selection.\nMust\nattend mandatory advising group meeting with CS Chair to be organized within the first 4 weeks of second semester.\nMust\nselect your culminating experience supervisor by the end of second semester and obtain your supervisor's permission to work under his/her supervision.\nThe culminating project and thesis require serious commitment and focus of the student. Serve the purpose to show that the student is capable of delivering individual work as well as being independent, able to deliver a project etc.\nIt is the responsibility of the student to follow up the agreed upon milestones and commitments made to the advisors (typically via approved project proposal). This is especially critical for projects where the work involves external funding and commitments including developing publications that require student's contributions.\nStudents are strongly encouraged to help faculty develop research publications (e.g. doing the necessary work such as SW development, experiments) and to participate in writing research papers, especially those aspiring toward Ph. D. studies.\nWhile students own the copyright to the code they develop at SF State, the source code, and all the data and procedures used for the research and experiments, must be made publicly available for faculty and others for the purpose of grading and evaluation.\nChanges in project plans, topics, title or committee members (but not the main advisor) must be made in writing in accordance with Department procedures. Change of advisor requires repeating the whole culminating project or thesis course sequence (including 899 or 897) and adherence to Department polices.\nStudents must follow all CS Department and general rules about plagiarism. Details are available at\nDepartment Cheating and Plagiarism Policy Web Page\nOther Options to Finish Culminating Experience\nIf you do not finish your culminating experience within two semester, you must enroll in culminating experience through CEL. More about enrolling through CEL.\nCS Department Information\nInformation and Deadlines\nAdvancement to Candidacy (ATC)\nUniversity Graduate Student Deadlines\nUniversity ATC Information\nProposal for Culminating Experience Form (CEF)\nUniversity Graduate Student Deadlines\nUniversity Culminating Experience Procedures\nHuman Subjects Protocol (HSP)\nUniversity Submitting a Protocol Information\nDepartment Human Subjects Protocol Information\nGraduate Seminars (PERNET)\nComplete the semester PRIOR to 895/898 enrollment\nDepartment Graduate Seminar Series\n895/898 Enrollment\nNeed ALL of the above submitted/completed the semester PRIOR to enrollment in 895/898\nDepartment Checklist for Enrolling in 895/898 PDF\nThesis Defense (Complete Culminating Experience)\nUniversity Graduate Students Deadlines\nDepartment Oral and Written Defense\nOral and Written Defense\nIf you are a Graduate Student, in your last semester and planning to graduate, you need to write up your project report or thesis, and prepare for your Oral Defense. Please follow the steps and timeline below for writing up your project report/thesis and oral defense. We urge you to work closely with your project/thesis advisor, to clarify expectations, confirm deadlines, and coordinate other committee members.\nSteps for Completing Your Culminating Experience Project/Master's Thesis\nThe last day to submit your \"Report of Completion\" is the last day of instruction (not the last day of final exams). Your committee members need ample time to read and review your written report. Plan accordingly. All programming should be done, most experiments completed and you should have a solid first draft report written by the second week of the semester. Submit the masters project/thesis write up to your project/thesis advisor for content approval no later than the 6th week of the semester. This allows you time to correct for proper grammar as well as make any other edits based on your advisor's feedback. Students completing the thesis option are referred to the\nUniversity Gradute Studies website\nfor guidelines on formatting the thesis report, as well as instructions on submitting final copies.\nOnce the project/thesis advisor approves the report/thesis, the student submits copies to all committee members for their approval of the CONTENT.\nOnce the committee approves the write-up the oral defense is scheduled. The CS office prepares your cover sheet and two signature pages for the CER report, the Report of Completion, grade change form (if needed), as well as the announcement flyer advertising your defense. These forms will be available for your committee members to sign the day of your oral defense. We recommend that your file your GRADUATION APPLICATION once your report/thesis has been approved by your project/thesis advisor.\nStudent confers with faculty to determine the date and time all committee members are available for the Oral Defense\nStudent submits abstract and keywords to project/thesis advisor for approval\nOnce the student has successfully completed the oral defense requirement the final version of the written report/thesis is submitted\nThe student works with the committee to resolve any issues with the report submitted in Steps 1. and 2. above. After all issues with the written report are resolved, the student is given the (official) signed signature sheets and cover sheet to include with the written report\nThe student makes copies of the write-up:\nStudents submitting a thesis write-up are referred to the\nGraduate Division website\nfor instruction on submitting final copies.\nStudents submitting a project write-up should use the plastic (white) binding combs, thick black plastic sheet on the back and thick clear plastic sheet on the front. The number of copies depends upon the committee - minimal of 2 copies. The original version is provided to the office.\nIn preparing for oral presentation, students must review instructions and guidelines for\nDepartment Preparing Oral Presentation web page\nand confirm this to their advisor.\nDepartment Writing Culminating Experience Reports (CER) Web Page\nWriting a Culminating Experience Report (CER)\nIn this section we will outline what constitutes an outstanding culminating experience report (CER) whether it is Thesis or a Project; what constitutes unacceptable one; and also outline our general recommendations for the CER outline and content of each chapter.\nThe focus here is on the write-up part of the CER, namely how to communicate it in the written form (i.e. CER), and not on the culminating experience project itself. Please note that the final decision and guidance on this comes from your Culminating Experience Committee Chair and committee members, but we believe that the material in this section is general enough to set you on the right path. Finally, we will reiterate some recommendations on your oral presentation of CER.\nMore details on what kinds of CER exist (Thesis or Project) are located at:\nDepartment M.S. Culminating Experience Requirments\n.\nSteps in completing the Culminating Experience are located at:\nDepartment Writen and Oral Defense Information\n.\nTo help you improve your writing skills, all of our students are encouraged to take an online writing course such as the one offered through courses at Stanford University, titled \"Writing in the Sciences\" offered during the Fall semester. For more information:\nStanford Writing in the Sciences Course Information\n.\nVery good resources on how to write technical reports are here:\nColubia Web Page: Writing Technical Articles\n.\nColumbia Web Page: Common Bugs in Writing\n.\nBefore we start, let us reiterate that completing culminating experience (both the project and the report) is primarily the responsibility of the student and hence the student has to drive it. It is not expected from the faculty to fully participate in writing the CER or in very extensive editing except to give necessary feedback and comments. We strongly recommend that high level CER outline be agreed between student and faculty before the writing commences.\nLet us first see what constitutes an outstanding CER and what constitutes an unacceptable CER. While the definitions below touch upon the project work itself, please focus for now on the suggestions that refer to the ways on how to write about it.\nPreparing Oral Presentations\nBeing able to present your work is critically important for your future career as well as for the oral defense of your culminating project or thesis. Please consult the following resources in preparing for your oral defense. Be sure to test your presentation on the exact same computer and projector which you will use during your presentation.\nPerformance Juxtaposition Web Page: Presentations\nStudent Theses and Projects\n2023\nCE/MT Number\nOral Defense Date\nAuthors\nTitle\nCE-23.13\n05/29/2023\nKhushboo Himanshu Gandhi\nA Case Study of Co-Designing a Resyme Builder With Returning Community Members\nCE-23.12\n05/27/2023\nYubo (Caelen) Wang\nFine-tuning Large Pre-trained Vision-Language Models for Video Description Generation\nCE-23.11\n05/26/2023\nAshwini Gururaj Managuli\nEnhancing User's Sense of Presence in VR\nCE-23.10\n05/25/2023\nAkshay Mhatre\nAutograder IntelliJ Plugin\nCE-23.09\n05/25/2023\nChristopher Patrick Humphrey\nFederated Learning and Differentially Private Stochastic Gradient Descent\nCE-23.08\n05/23/2023\nSanket Sanjay Naik\nYouDescribe and YouDescribeX: Improvements to Audio Clip Playback and Migration to YouDescribeX\nCE-23.07\n05/19/2023\nBenjamin Patrick Kao\nChallenges of Productionizing an Audio Description Pipeline for Blind and Visually Impaired Users\nCE-23.06\n05/18/2023\nJasmine Jahan\nVisual Analytic Support for Exploring People's Emotions Towards Events using Tweet Data\nCE-23.05\n05/18/2023\nMujtabauddin Furqan Mohammed\nA Visual Analytics Environment to Analyze and Explore Software Microservices Architecture and Workflow\nCE-23.04\n05/18/2023\nIlya Nemtsov\nVisual Analytics Tool to Compare Peoples' Reaction Towards an Event Based on Location\nCE-23.03\n05/18/2023\nEric John Chen\nInterface and Algorithms for Solving Puzzles\nCE-23.02\n05/16/2023\nHirva Maneshkumar Patel\nSystem Development and User Study of YouDescribeX HR-Narration Bot Interface\nCE-23.01\n05/16/2023\nSnehal Shrinivas Patil\nA visual Analytic Environment to Co-locate People's Tweets with City Factual Data\n2022\nCE/MT Number\nOral Defense Date\nAuthors\nTitle\nCE-22.09\n09/21/2022\nBhavani Goruganthu\nIntuitive Web Application Design and Development for YouDescribeX\nCE-22.08\n08/11/2022\nNodirjon Turdiev\nLinux Security for Internet of Things\nCE-22.07\n08/03/2022\nWiam Boumaazi\nParallelizing VOCA to reduce the latency\nCE-22.06\n08/03/2022\nAshwini Uthirakumar\nPointGoal Navigation in Photorealistic Environments\nCE-22.05\n05/12/2022\nTsun Ming Lee\nTechniques for Children to Learn Alphabets\nCE-22.04\n05/10/2022\nJiawei Xu\nDeveloping an IoT Management System\nCE-22.03\n05/10/2022\nIzaac Garcilazo\nVisual Analytics Support for the Analysis of Relationship between Crimes and Demographics\nCE-22.02\n05/09/2022\nXinwei Fan\nAn Advanced Trafﬁc Line Detector Based on Machine Learning Algorithm\nCE-22.01\n05/09/2022\nZhuozhuo Liu\nCsanim: a Python Library of Creating Videos on Visualizing Algorithms and Data Structure for Computer Science Educators\n2021\nCE/MT Number\nOral Defense Date\nAuthors\nTitle\nCE-21.28\n12/17/2021\nSwetha Govindu\nKoob AI-Powered ePUB Reader\nCE-21.27\n12/17/2021\nRaviteja Guttula\nKoob - eBook Reader Enhanced with NLP\nCE-21.26\n12/14/2021\nXinze Zhang\nDesign and Release the Machine Learning Model with Differential Privacy\nMT-21.05\n12/13/2021\nInez Wibowo\nImproving Communication and Sense of Belonging in Remote Teaching\nCE-21.25\n12/10/2021\nAllen Sun\nA Machine Learning Based Web Application for Hybrid Apps Security Analysis\nMT-21.04\n12/10/2021\nMegha Babariya\nUnderstanding Airline Travel Demand Trends During Covid-19\nCE-21.24\n12/10/2021\nLikhitha Brahmadevara\nExploratory Visualization of Movies and their Tweet Sentiment\nCE-21.23\n12/09/2021\nCherise Lau\nUser-Centered Design to Improve the Meeting Experience\nCE-21.22\n12/09/2021\nSrinithi Ramachandran\nTOOLSHARE Web Application\nCE-21.21\n12/08/2021\nSiddhita Chimote\nCOVID-19 and Twitter Data Visual Analysis\nCE-21.20\n12/07/2021\nRachit Joshi\nAn Interactive Visualization for Comparing Embedding Spaces\nCE-21.19\n12/07/2021\nVaisakh Kusabhadran\nLocal Differential Privacy in Machine Learning\nCE-21.18\n12/01/2021\nZhifan Cai\nAutomate the AutoML: Machine Learning as a Service Web Application for data analysis\nCE-21.17\n11/29/2021\nSanchit Joshi\nVisualization for mHealth Applications\nCE-21.16\n11/12/2021\nJeff Cheng\nJavaScript Tutor: An Educational Tool\nCE-21.15\n10/28/2021\nChaitali Kalra\nTOS x86 Emulator\nCE-21.14\n10/19/2021\nJohn Gann\nCreating a Universal Scene Description Hydra Render Delegate for the Luxcore Renderer\nCE-21.13\n09/08/2021\nVarun Yogesh Sura\nYouDescribeX iOS App\nCE-21.12\n08/09/2021\nManish Patil\nEnhanced YouDescribe Web Interface Design and Development\nCE-21.11\n08/06/2021\nJugal Nikul Bhatt\nVisual Analytics Support for Automated Discovery of Machine Learning Problem Specifications\nCE-21.10\n08/04/2021\nQihong Kuang\nPrediction of Fire Incidents in San Francisco\nCE-21.09\n05/20/2021\nKriti Upadhyaya\nAnalyze the Factors that Make Students Succeed in “Programming Methodology” Course\nCE-21.08\n05/12/2021\nSrushti Manishbhai Buddhadev\nAssociation of Sleep Patterns with Lifestyle Habits and Other Factors Using Machine Learning and NHANES Data\nCE-21.07\n05/12/2021\nBeibei Jiang\nOnline Learning Algorithmic Model of TweetSafe\nCE-21.06\n05/10/2021\nKunal Rajeshbhai Shah\nCloud Based Pipeline for mHealth Data\nCE-21.05\n05/10/2021\nJinghan Cao\nTWEETSAFE: A Web-­Based App for Detecting Spam Tweets\nCE-21.04\n05/10/2021\nAkhil Gandu\nExploratory Visualization of COVID-19 Cases and Tweet Sentiment\nCE-21.03\n05/07/2021\nSally Mostafa\nA Framework fo",
    "url": "https://cs.sfsu.edu/masters-culminating-experience",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/cs-graduate-seminars",
    "category": "cs_general",
    "title": "CS Graduate Seminars | Department of Computer Science",
    "content": "CS Graduate Seminars\nSpring 2025 Schedule\nDate\nTopic\nPresenter\n5/7/2025\nRevealing Hidden Stories: Co-Designing the Thámien Ohlone Augmented Reality Tour\nKai Lukoff\n4/9/2025\nStanford Cybersecurity: CERT, Clinics, and Competitions\nAlex Keller\n4/1/2025\nThe Elusive Quest for AGI: Science or Speculation?\nKerrie Holley\n3/11/2025\nClimate Change: From Hot Air to Environmental Justice\nMichael Wehner\n3/7/2025\nAI Entrepreneurship\nJiajun (Feynman) Xu\n3/3/2025\nDeploy AI at the Edge to Bridge the Information Gap: Efficiency and Security\nQun Wang\n02/26/2025\nGamification and Playful Design: Exploring the Design Space for Business, Teaching, and Sports\nOliver Korn\n02/19/2025\nAn Intelligent Vocational Storytelling Virtual Reality System for Augmenting Work Performance\nSanika Doolani\n02/12/2025\nHow can we Decarbonize the Power Grid and meet AI’s Exploding Power Demands?\nAndrew A. Chien\n02/05/2025\nAn Introduction to Programming Quantum Computers\nWes Bethel\nFall 2024 Schedule\nDate\nTopic\nPresenter\n12/04/2024\nByzantine-Resilient Reinforcement Learning for Multi-UAV Systems\nTracy Chen\n11/21/2024\nBeyond the Lens: Detecting Bias through Eye-Tracking Measurements and Computer Vision Techniques\nNada Attar\n11/19/2024\nMachine Learning and Artificial Intelligence in Healthcare: Infectious Diseases Case Study and Broader Implications\nLjubomir Buturovic\n11/18/2024\nHuman-Centered Assistive Robots: From Understanding Commands to Detecting Cognitive Fatigue\nMaria Kyrarini\n11/13/2024\nProfessional Decision Support Systems Based on Graded Logic\nJozo Dujmovic\n10/29/2024\nGenomics and Deep-Sea Microbiology: Computational Innovations in Biological Research\nSean Jungbluth\n10/15/2024\nFrom Compression to Transformation: Efficient Deep Learning on Mobile Devices and LLMs in Education\nZhuwei Qin\n10/10/2024\nSan Francisco State University Graduate Certificate in Ethical AI – Overview and Early Experiences\nDragutin Petkovic\n09/19/2024\nQuantum Computing: What is it, exactly?\nE. Wes Bethel\n09/11/2024\nOverview of the Computer Science Graduate Program\nArno Puder, Timothy Sun, Qun Wang\nSpring 2024 Schedule\nDate\nTopic\nPresenter\n02/22/2024\nSecure Distributed Machine Learning with Multi Aggregators in Edge Computing\nXiao Li\n02/21/2024\nSafe and Reliable AI\nXuhui Chen\n02/20/2024\nDeveloping Robots for Dynamic, Safety-Critical Environments\nSachiko Matsumoto\n02/15/2024\nTowards Analyzing Online Communities of Problematic Information: A Computational Approach\nShruti Phadke\n02/14/2024\nGlobal Investigation of Network Connection Tampering\nRam Sundara Raman\n02/12/2024\nIterative Join-Graph Propagation\nRobert Mateescu\n02/08/2024\nBeyond Reality: Crafting the Future of Workforce Training with AI-Driven Immersive Storytelling\nSanika Doolani\nFall 2023 Schedule\nDate\nTopic\nPresenter\n11/29/2023\nSWIG: Modern Applications\nAaron Cruz\n11/15/2023\nComputational Approaches to Understanding Perception and the Brain\nSantani Teng\n11/8/2023\nGraded Logic for AI Applicatons\nJozo Dujmovic\n11/2/2023\nAI-Driven Advancements in Battery Materials and Alzheimer's Biomarker Detection\nDani Ushizima\n11/1/2023\nMaking Physical Models of Maps on Surfaces\nTimothy Sun\n10/31/2023\nApplication of Mathematical Modeling and Machine Learning for Optimizing Network Design and Operation\nSara El Alaoui\n10/25/2023\nLearning After Graduation\nRobert Mateescu\n10/19/2020\nCoders Wanted: Computational Opportunities in the Aquatic and Biological Sciences\nSean Jungbluth\n10/11/2023\nTowards On-Device Intelligence Through Deep Learning Compression\nZhuwei Qin\n09/14/2023\nWhat is Quantum Computing and Why Would you care?\nWes Bethel\nSpring 2023 Schedule\nDate\nTopic\nPresenter\n05/22/2023\nMachine Learning for Flow Visualization\nAkila de Silva\n02/27/2023\nGeometric algorithms for robot motion planning and biomedical imaging applications\nKa Yaw Teo\n02/24/2023\nRobot Behavior Adaptation for Personalized Longitudinal Interaction\nAlyssa Kubota\n02/23/2023\nTowards Understanding and Defending Against Algorithmically Curated Misinformation\nPrerna Juneja\n02/21/2023\nIntelligent Assistive Technologies for People with Visual Impairments\nHae-Na Lee\n02/20/2023\nEnabling Urban Intelligence by Harnessing Human-Generated Spatial-Temporal Data\nXin Zhang\n02/14/2023\nAccelerating the Discovery of Advanced Materials Using Data-driven AI Techniques\nYuqi Song\n02/13/2023\nRobust and Interpretable Graph Models\nBo Hui\n02/10/2023\nDesigning AI-Based Applications to Benefit Deaf and Hard-of-Hearing Individuals and Sign-Language Users\nSaad Hassan\n02/09/2023\nDemystifying Deep Network Architectures: from Theory to Applications\nWuyang Chen\nFall 2022 Schedule\nDate\nTopic\nPresenter\n11/30/2022\nUser-centric Visual Analytics towards Data Exploration and Analysis\nShah Rukh Humayoun\n11/16/2022\nGood Drawings of Graphs in Surfaces\nTimothy Sun\n11/10/2022\nBig Data Differential Privacy Preservation\nJingyi Wang\n09/28/2022\nCommunity-Engaged Technology for Social Good\nAakash Gautam",
    "url": "https://cs.sfsu.edu/cs-graduate-seminars",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/news/new-department-defense-energy-grants-prepare-sfsu-students-industry-jobs",
    "category": "cs_general",
    "title": "New Department of Defense, Energy grants prepare SFSU students for industry jobs | Department of Computer Science",
    "content": "New Department of Defense, Energy grants prepare SFSU students for industry jobs\nAuthor:\nKanaga Rajan\nDecember 2, 2024\nPhoto Credit:\nPaul Asper\nThe grants expand research opportunities in engineering, robotics and quantum computing\nTechnology is constantly evolving, which means industries — and the people who work for them — must change to keep up. San Francisco State University faculty want to make sure their students have the skills and flexibility they need to compete in these growing, ever-shifting fields such as civil, mechanical and computer engineering and quantum computing.\nThree new grants — two from the Department of Defense (DOD) and one from the Department of Energy (DOE) — will expand the research capabilities of San Francisco State students and better prepare them to achieve their academic and career goals. The faculty leading these projects are in SF State’s School of Engineering (SOE) and Department of Computer Science.\nStructural hazard mitigation research\nA $541,541 DOD grant was awarded to SOE Professor Zhaoshuo Jiang, who leads the Intelligent Structural Hazard Mitigation lab. The funds support purchasing two state-of-the-art shake tables (Quanser Corporation’s six-degrees of freedom hexapod motion platforms) and a high-throughput data acquisition system (DAQ). This new equipment will significantly advance the capacity of performing experimental testing with accurate sensing and control, thereby enhancing the institution’s ability to support diverse research areas that are of interest to DOD.\nHuman-machine performance lab\nDOD awarded another $409,433 grant to School of Engineering Associate Professor David Quintero to acquire state-of-the-art instrumentation for a human-machine performance lab. The new equipment will include a treadmill, markerless motion capture and human-machine interaction equipment like a robotic leg, hip exoskeleton and rehabilitation robot. Combining these instruments will help establish a research system that integrates humans and machines to enhance human physical and cognitive performance.\nQuantum computing comes to SFSU\nSF State, along with Lawerence Berkeley Laboratory and Argonne National Laboratory, is part of new multi-institutional\nproject funded by the DOE\n. Associate Professor of Computer Science Wes Bethel and Assistant Professor Daniel Huang were awarded $250,000 as part of the larger five-year grant aiming to bridge the gap between theoretical quantum advantages and practical scientific applications.\nRead the full article at SF State News.\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/new-department-defense-energy-grants-prepare-sfsu-students-industry-jobs",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/events",
    "category": "cs_general",
    "title": "Events | Department of Computer Science",
    "content": "Events\nFilter by Year\n2025\n2024\n2023\n2025\nMay\n07\nRevealing Hidden Stories: Co-Designing the Thámien Ohlone Augmented Reality Tour\nWed, May 07, 02:00 pm\nSEC 210\nApr\n09\nStanford Cybersecurity: CERT, Clinics, and Competitions\nWed, April 09, 02:00 pm\nSEC 210\nApr\n01\nThe Elusive Quest for AGI: Science or Speculation?\nTue, April 01, 05:00 pm\nSEC 210\nMar\n11\nClimate Change: From Hot Air to Environmental Justice\nTue, March 11, 06:00 pm\nLIB 121\nMar\n07\nAI Entrepreneurship\nFri, March 07, 02:00 pm\nSEC 210\nMar\n03\nDeploy AI at the Edge to Bridge the Information Gap: Efficiency and Security\nMon, March 03, 02:00 pm\nSEC 210\nFeb\n26\nGamification and Playful Design: Exploring the Design Space for Business, Teaching, and Sports\nWed, February 26, 03:00 pm\nSEC 210\nFeb\n19\nAn Intelligent Vocational Storytelling Virtual Reality System for Augmenting Work Performance\nWed, February 19, 02:00 pm\nSEC 210\nFeb\n12\nHow can we Decarbonize the Power Grid and meet AI’s Exploding Power Demands?\nWed, February 12, 02:00 pm\nSEC 210\nFeb\n05\nAn Introduction to Programming Quantum Computers\nWed, February 05, 05:00 pm\nSEC 210\n2024\nDec\n04\nByzantine-Resilient Reinforcement Learning for Multi-UAV Systems\nWed, December 04, 05:00 pm\nSEC 210\nNov\n21\nBeyond the Lens: Detecting Bias through Eye-Tracking Measurements and Computer Vision Techniques\nThu, November 21, 11:00 am\nLIB 286\nNov\n19\nMachine Learning and Artificial Intelligence in Healthcare: Infectious Diseases Case Study and Broader Implications\nTue, November 19, 05:30 pm\nLIB 286\nNov\n18\nHuman-Centered Assistive Robots: From Understanding Commands to Detecting Cognitive Fatigue\nMon, November 18, 04:00 pm\nLIB 286\nNov\n13\nProfessional Decision Support Systems Based on Graded Logic\nWed, November 13, 04:00 pm\nSEC 210\nOct\n29\nGenomics and Deep-Sea Microbiology: Computational Innovations in Biological Research\nTue, October 29, 06:00 pm\nSEC 210\nOct\n15\nFrom Compression to Transformation: Efficient Deep Learning on Mobile Devices and LLMs in Education\nTue, October 15, 04:00 pm\nSEC 210\nOct\n10\nSan Francisco State University Graduate Certificate in Ethical AI – Overview and Early Experiences\nThu, October 10, 05:01 pm\nSEC 210\nSep\n19\nQuantum Computing: What is it, exactly?\nThu, September 19, 06:00 pm\nSEC 210\nSep\n11\nOverview of the Computer Science Graduate Program\nWed, September 11, 06:00 pm\nSEC 210\nFeb\n22\nGraduate Seminar: Secure Distributed Machine Learning with Multi Aggregators in Edge Computing\nThu, February 22, 01:00 pm\nZOOM\nFeb\n21\nGraduate Seminar: Safe and Reliable AI\nWed, February 21, 01:00 pm\nZOOM\nFeb\n20\nGraduate Seminar: Developing Robots for Dynamic, Safety-Critical Environments\nTue, February 20, 01:00 pm\nZOOM\nFeb\n15\nGraduate Seminar: Towards Analyzing Online Communities of Problematic Information:  A Computational Approach\nThu, February 15, 01:00 pm\nZOOM\nFeb\n14\nGraduate Seminar: Global Investigation of Network Connection Tampering\nWed, February 14, 12:30 pm\nZOOM\nFeb\n12\nGraduate Seminar: Iterative Join-Graph Propagation\nMon, February 12, 01:00 pm\nZOOM\nFeb\n08\nGraduate Seminar: Beyond Reality: Crafting the Future of Workforce Training with AI-Driven Immersive Storytelling\nThu, February 08, 01:00 pm\nZOOM\n2023\nNov\n29\nGraduate Seminar: SWIG: Modern Applications\nWed, November 29, 06:00 pm\nThornton Hall 326\nNov\n15\nGraduate Seminar: Computational Approaches to Understanding Perception and the Brain\nWed, November 15, 05:00 pm\nHensill Hall 439\nNov\n08\nGraduate Seminar: Graded Logic for AI Applications\nWed, November 08, 11:00 am\nThornton Hall 331\nNov\n02\nGraduate Seminar: AI-Driven Advancements in Battery Materials and Alzheimer's Biomarker Detection\nThu, November 02, 04:00 pm\nThornton Hall Blakeslee Room\nNov\n01\nGraduate Seminar: Making Physical Models of Maps on Surfaces\nWed, November 01, 06:30 pm\nThornton Hall 331\nOct\n31\nGraduate Seminar: Application of Mathematical Modeling and Machine Learning for Optimizing Network Design and Operation\nTue, October 31, 01:00 pm\nZoom\nOct\n25\nGraduate Seminar: Learning After Graduation\nWed, October 25, 05:00 pm\nHensil Hall 439\nOct\n19\nGraduate Seminar: Coders Wanted: Computational Opportunities in the Aquatic and Biological Sciences\nThu, October 19, 03:45 pm\nThornton Hall 331\nOct\n11\nGraduate Seminar: Towards On-Device Intelligence Through Deep Learning Compression\nWed, October 11, 03:30 pm\nThornton Hall 428\nSep\n14\nGraduate Seminar: What is Quantum Computing and Why Would You Care?\nThu, September 14, 05:15 pm\nThornton Hall 331\nSep\n14\nCS Research Special Interest Group\nThu, September 14, 02:30 pm\nHensil Hall 803\nSep\n13\nUnlock Your Future: Join Our Seminar on Landing Your First Software Engineer Job\nWed, September 13, 11:00 am\nLIB 121\nJan\n03\nPacific Symposium on Biocomputing (PSB) 2023\nTue, January 03, 09:00 am\nFairmont Orchid: The Big Island of Hawaii",
    "url": "https://cs.sfsu.edu/events",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/biotech-certificate-students-get-insider-peek-industry-jobs",
    "category": "cs_general",
    "title": "Biotech Certificate Students get Insider Peek into Industry Jobs | Department of Computer Science",
    "content": "Biotech Certificate Students get Insider Peek into Industry Jobs\nAuthor:\nKanaga Rajan\nJune 1, 2022\nThe gSTAR program is only one year old, but the SF State-Genentech collab is already impacting students, faculty and industry\nWant a job in biotech? The first step is to get into college and study science. But what’s the second step? Moving directly from the classroom to the workplace isn’t always easy, especially in a competitive field like biotech.\ngSTAR student Phuong Phan\nEnter San Francisco State University’s Data Science and Machine Learning for Biotechnology Certificate (gSTAR) program. Designed by San Francisco State faculty and Genentech scientists, the program is tailored specifically to University undergraduates interested in industry. It\nlaunched in the fall of 2021\n, and the first students are already reaping the benefits, with several earning Genentech internships.\n“I think this internship is going to be a pretty wonderful opportunity for me to see if I fit into [scientific research] and to see if I can imagine myself doing it long term,” said fourth-year Cell and Molecular Biology student Phuong Phan.\nShe’s one of three gSTAR students who accepted an internship with Genentech’s research and development clinical imaging group, a position specifically tailored for gSTAR students. Not only will this be Phan’s first foray into biotech, it will be her first research opportunity ever.\nWhen academia meets industry\nThe gSTAR program is part of a\ngrowing collaboration\nbetween SF State and Genentech to expand coding programs, particularly for students from historically marginalized groups. The yearlong program helps beginners learn data science and machine learning skills in the context of research and industry and provides in-depth interview preparation.\n“My hope is that we can reach a lot of students, demystify machine learning and the biotech industry, and help students learn skills that open doors for them,” said Associate Professor of Biology Pleuni Pennings. She is one of the core SF State faculty behind gSTAR, along with Associate Professor Anagha Kulkarni and Professor Ilmi Yoon from Computer Science. The team — which developed SF State’s\nPromoting Inclusivity and Computing (PINC) program\n— worked with Genentech scientists to develop the new curriculum.\n“There seemed to be an unending pool of [Genentech] people who were interested to help out,” said Pennings, who was sometimes surprised to find herself in Zoom meetings with a dozen eager Genentech collaborators. Industry scientists provided real-world datasets and papers, recommended industry-relevant software and even helped Pennings with nitty-gritty details. Once the course started, they presented in classes, provided students with advice, participated in mock interviews and more.\n“I love my job but [gSTAR] is one of the best parts of my week,” said Spencer James, a principal data scientist at Genentech who, among other things, helped organize and run mock interviews in Kulkarni’s gSTAR class this semester. He admits that he himself did not gain a lot of this interview experience until his fellowship after undergrad.\n“Maybe I can do this, too”\nThe first cohort to finish the yearlong gSTAR program consisted of 14 students; 11 are also graduating from SF State. Of the nine females in the course, eight are people of color. Five students have accepted Genentech internships: three in the clinical imaging group and two in other groups.\ngSTAR student Fayeeza Shaikh sharing her gSTAR/PINC project\n“As a person who did not know what biotech was, to get interview prep and then finally get an internship, [gSTAR] was really eye opening for me …,” said sophomore Biology student Fayeeza Shaikh, who has lined up an internship with Genentech’s product quality and occupational toxicology group. “I’ve started building on my career because of this program.”\nShaikh and Phan, who both started out in the PINC program, had never interacted with industry scientists. But in gSTAR, scientists came directly to their class (via Zoom), giving students a chance to network and learn how these scientists navigated their own careers, with some even admitting their own bouts of imposter syndrome.\n“When we hear that, it kind of reassures us that maybe I can do this, too,” said Phan. She originally started her degree in 2011 but left to serve in the Navy for eight years. She returned to SF State in 2019 because she was still interested in going to school for science.\nWe can change biotech\nWorking with University students like Shaikh and Phan has left James excited for the future of Genentech and the whole biotech industry. Though he doesn’t recruit for Genentech, he’s also now reflecting on his responsibilities as an interviewer.\n“Going through this course helped me really think a lot about how to effectively conduct an interview … how to take students who have majored in different things, have different interests, different experiences and hopefully work with each candidate in a way that you really get at their passions and capabilities …,” he said.\nPennings is also excited by all they’ve accomplished but is aware that there’s more to do.\n“If we can make these skills attainable for a large number of people, I think we can change [students’] lives,” she said. “If we can show other people how it’s done, we can change the world of biology and biotech.”\nLearn more about\ngSTAR\nand the other\nPINC\nprograms.\nTags\nCertificate\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/biotech-certificate-students-get-insider-peek-industry-jobs",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/anagha-kulkarni",
    "category": "cs_general",
    "title": "Anagha Kulkarni | Department of Computer Science",
    "content": "Anagha Kulkarni\nProfessor\nAssociate Chair\nPhone:\n(415) 338-2539\nEmail:\nak@sfsu.edu\nLocation:\nThornton Hall 970\nOffice Hours:\nBy appointment only\nAnagha Kulkarni Website\nBiography\nAreas of Expertise\nInformation Retrieval\nNatural Language Processing\nMachine Learning",
    "url": "https://cs.sfsu.edu/anagha-kulkarni",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/event/san-francisco-state-university-graduate-certificate-ethical-ai-overview-and-early-experiences",
    "category": "cs_general",
    "title": "San Francisco State University Graduate Certificate in Ethical AI – Overview and Early Experiences | Department of Computer Science",
    "content": "San Francisco State University Graduate Certificate in Ethical AI – Overview and Early Experiences\nThursday, October 10, 2024\nEvent Time\n05:01 p.m.   -  06:00 p.m.\nPT\nCost\nLocation\nSEC 210\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nThis talk first overviews San Francisco State University’s (SFSU) Graduate Certificate in Ethical Artificial Intelligence launched in Fall 2019 by combined efforts of the Computer Science department, department of Philosophy, and the College of Business. It is designed to offer both professionals and graduate students (matriculated or non-matriculated, AI experts or not) the opportunity to acquire a deeper grasp of the ethical, legal, policy, and technical issues of AI, thus enabling them to effectively participate in the development or auditing of ethical and trustworthy AI systems and applications across a spectrum of employment sectors. The talk then gives a bit more details on CSC 859 AI Explainability and Ethics class created and taught by Prof. Petkovic which is also a core class in the certificate. More on SFSU Graduate Certificate in Ethical AI can be found here\nhttps://bulletin.sfsu.edu/colleges/science-engineering/computer-science/certificate-ethical-artificial-intelligence/\nSpeaker Biography\nDragutin Petkovic (IEEE Life Fellow since 2018, IEEE Fellow since 1998) received Ph.D. degree in electrical engineering from UC Irvine in 1983 in the area of biomedical image analysis, and B.S. and M.S. degrees in electrical engineering and multidisciplinary studies respectively from University of Belgrade, Serbia with emphasis on image and signal analysis. He is currently a professor of computer science at San Francisco State University (SFSU) since 2003 where he was computer science department chair from 2003 to 2015. In 2019, he founded and co-leads the multidisciplinary SFSU Graduate Certificate in Ethical Artificial Intelligence together with SFSU Department of Philosophy and School of Business. He was a founder and Director of SFSU Center for Computing for Life Sciences from 2005 till 2018 and collaborated on multiple NIH grants with Stamford University in the areas of Artificial Intelligence (AI) for bioinformatics. He held positions at VMware as a Senior Director, Applications, and as senior manager and researcher at IBM Almaden Research center, San Jose (1983-2000). His research focus included content based retrieval (he was founder of trend-setting IBM Query by Image Content QBIC project). For last 10 years his work combines AI and ease of use and has a goal to bring technology closer to people and users. Due to his concerns about the state of the ethics and trustworthiness of AI systems and their possibly negative implications to society, his recent focus is on explainable and trustworthy AI to which he contributes by papers, books, workshops, talks and importantly by education of broader community via SFSU Certificate of Ethical AI.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/san-francisco-state-university-graduate-certificate-ethical-ai-overview-and-early-experiences",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/computer-science-education-research",
    "category": "cs_general",
    "title": "Computer Science Education Research | Department of Computer Science",
    "content": "Computer Science Education Research\nOur computer science education program prioritizes inclusivity and diversity aiming to provide equitable access to computer science learning for students from various backgrounds. It offers a comprehensive curriculum, teacher training, and resources that cater to diverse populations, emphasizing the importance of digital literacy and computational thinking. The program encourages underrepresented groups to engage in coding, problem-solving, and technology exploration, fostering a more inclusive and empowered generation of young learners in the field of computer science.\nAcademics and Coursework\nOur Computer Science education research program has developed exceptional certificate programs and continuing education programs aimed at enhancing CS skills and literacy, preparing a diverse workforce for the evolving field of computing. In addition to broader requirements for a CS undergraduate or graduate degree, students may specialize their education around Computer Science Education research topics via these undergraduate and graduate level courses, minors, and certificate programs:\nUndergraduate Courses\nCSC 699\nLearning by Teaching\nK-12 CS Teacher Supplementary Authorization Program\nCSC 699\nComputational Thinking\nCSC 309\nComputer Programming\nCSC 645\nComputer Networks\nCSC 305\nImpacts of Computing\nCSC 698\nSoftware Development and Pedagogy\nComputing Application Minor\nCSC 209\nIntroduction to Programming using Python\nCSC 306\nAn Interdisciplinary Approach to Computer Programming\nCSC 219\nData Structure for Data Science Application Development\nCSC 308\nIntroduction to Machine Learning for Data Scientists\nCSC 508\nMachine Learning and Data Science for Personalized Medicine\nCSC 509\nData Science and Machine Learning for Medical Image Analysis\nData Science and Machine Learning for Biotechnology Certificate\nCSC 308\nIntroduction to Machine Learning for Data Scientists\nCSC 508\nMachine Learning and Data Science for Personalized Medicine\nCSC 509\nData Science and Machine Learning for Medical Image Analysis\nCSC 601\nData Science and Machine Learning for Biotechnology Seminar Series\nCSC 602\nInterview Preparation for Data Science and Machine Learning for Biotechnology\nFaculty and Focus Areas\nHao Yue\nK-12 CS education, inclusive pedagogy, broaden participation in K-16 CS education\nhaoyue@sfsu.edu\nAnagha Kulkarni\nPI of the Data Science and Machine Learning for Biotechnology Certificate Program (gSTAR Certificate) and the Artificial Intelligence Scholarships that Improve Academic Achievement, Retention, and Career Success (AI-STAARS)  Program\ndanehuang@sfsu.edu\nIlmi Yoon\nInclusive computing (Promoting Inclusivity in Computing, PINC), Computing Application Minor, data science and machine learning for biotechnology, socially responsible computing\nilmi@sfsu.edu\nPublications and Reports\nTransfer Pathways grant from Center for Inclusive Computing (partnered with CCSF) - AY 2024-2025 - $162,265 ($104,305 for SFSU) - (PI: Sun)\nIhorn, S., Kulkarni, A., & Yoon, I. (2023). Sustaining and expanding student training and support efforts beyond the NSF support period. In ASEE: American Society for Engineering Education, July 25-28, 2023, Baltimore, MD.\nGautam, A., Ihorn, S., Yoon, I., & Kulkarni, A. Foundational strategies to support students with diverse backgrounds and interests in early programming. In ASEE: American Society for Engineering Education, July 25-28, 2023, Baltimore, MD.\nIhorn, S., Kulkarni, A., & Yoon, I. (2023). Sustaining and expanding student training and support efforts beyond the NSF support period. In ASEE: American Society for Engineering Education, July 25-28, 2023, Baltimore, MD.\nGautam, A., Kim, M.,  Ihorn, S., Yoon, I., & Kulkarni, A. (2023) Foundational strategies to support students with diverse backgrounds and interests in early programming. In ASEE: American Society for Engineering Education, July 25-28, 2023, Baltimore, MD.\nZimmerman, T., Esquerra, R., Chan, Y.H.M., Kulkarni, A., Adelstein, N., Albright, A., Luo, J., Dean, Z., Ahmed, S., Phillips, M. and Bianco, S., (2023). Teaching Image Processing and Optical Engineering to University Biology Students. The Biophysicist, 4(1), pp.38-57.\nhttps://doi.org/10.35459/tbp.2022.000240\nReyes, R.J., Hosmane, N., Ihorn, S., Johnson, M., Kulkarni, A., Nelson, J., Savvides, M., Ta, D., Yoon, I. and Pennings, P.S., (2022). Ten simple rules for designing and running a computing minor for bio/chem students. PLOS Computational Biology, 18(7), p.e1010202.\nhttps://doi.org/10.1371/journal.pcbi.1010202\nKulkarni, A., Ihorn, S., Tate, C., Nelson, J., Hosmane, N., Adelstein, N., Pennings, P., Jacques, T. and Yoon, I., (2021). January. Peer Mentoring in an Interdisciplinary Computer Science Training Program: Mentor & Student Perspectives and Lessons Learned. In Zone 1 Conference of the American Society for Engineering Education.\nIhorn, S., Yoon, I. and Kulkarni, A., 2020, February. Student psychological factors and diversity in computer science education. In Proceedings of the 51st ACM Technical Symposium on Computer Science Education (pp. 1380-1380).\nGrants and Awards\nNational Science Foundation. CS4NorthCal: Scaling an Evidence-based Model for Teacher Preparation and Support to Provide Equitable and Inclusive CS Education in California High Schools. 10/01/2022-09/31/2026. (PI: Yue)\nNational Science Foundation. BPC-A: Socially Responsible Computing: Promoting Latinx student retention via community engagement in early CS courses. 10/1/2022-9/30/2025. (PI: Yoon)\nNational Science Foundation. HSI Implementation and Evaluation Project: Self-sustaining Peer Mentor Support System for Computer Science Students. 08/01/2022-07/31/2025. (PI: Wang)\nCenter of Inclusive Computing, Northeastern (\nhttps://cic.northeastern.edu/\n). Redesign Introductory CS Courses. 6/1/2022-5/31/2024. (PI: Yoon)\nCalifornia State University Chancellor’s Office. Math and Science Teacher Initiative (MSTI) Supplement Grant. 09/01/2020-08/31/2023. (PI: Yue)\nGenentech Inc. Data Science, Artificial Intelligence and Biotechnology Certificate program. 8/1/2020-7/31/2023. (PI: Kulkarni)\nGenentech Foundation. Gene-PINC Scholarship. 8/1/2020-7/31/2023. (PI: Kulkarni)\nNational Science Foundation. Collaborative Research: CS4SF: A Scalable Model for Preparing High School Teachers to Provide Rigorous, Inclusive Computer Science Instruction. 10/01/2018-09/31/2021. (PI: Yue)\nNational Science Foundation. Building the Diverse, Multidisciplinary Computer Science Workforce of the Future with Promoting Inclusivity in Computing (PINC) 2.0. 10/2018-9/2023 (PI: Yoon).\nNational Science Foundation. Scholarships To Improve Undergraduate Students' Academic Achievement, Retention, and Career Success in Computer Science and Artificial Intelligence. 8/7/2020-2/28/2025. (PI: Kulkarni)",
    "url": "https://cs.sfsu.edu/computer-science-education-research",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/news/professor-dragutin-petkovic-presented-keynote-speech-ieee-ccwc-conference-las-vegas-january-8",
    "category": "cs_general",
    "title": "Professor Dragutin Petkovic presented a keynote speech at IEEE CCWC Conference in Las Vegas January 8, 2025 on \"GenAI and Education\" | Department of Computer Science",
    "content": "Professor Dragutin Petkovic presented a keynote speech at IEEE CCWC Conference in Las Vegas January 8, 2025 on \"GenAI and Education\"\nAuthor:\nKasey Chen\nFebruary 17, 2025\nProfessor Dragutin Petkovic delivered a keynote speech on January 8, 2025, at the IEEE Computing and Communication Workshop and Conference (CCWC) in Las Vegas. His talk focused on the challenges and opportunities of integrating Generative AI (GenAI) into education, addressing both its potential benefits and ethical concerns. During his presentation, Prof. Petkovic outlined key issues surrounding GenAI, including the risks of misinformation, ethical considerations, and the importance of fostering critical thinking skills among students. He also shared insights on how AI can be effectively incorporated into educational settings to enhance learning while maintaining academic integrity.\nHis keynote sparked discussions among researchers and educators about the evolving role of AI in academia. The IEEE CCWC 2025 conference provided a valuable platform for exchanging ideas on responsible AI adoption, highlighting the need for thoughtful strategies to ensure AI supports, rather than hinders, the educational experience.\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/professor-dragutin-petkovic-presented-keynote-speech-ieee-ccwc-conference-las-vegas-january-8",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/undergrads/student-policies",
    "category": "cs_undergraduate",
    "title": "Student Policies | Department of Computer Science",
    "content": "Student Policies\nThe university is committed to maintaining a safe and healthy living and learning environment for students, faculty, and staff. Each campus community member should choose behaviors that contribute toward this end. Therefore, students are expected to be good citizens and to engage in responsible behaviors that reflect well upon their university, be civil to one another and others in the campus community, and contribute positively to student and university life.\nPrerequisite Policy\nCS Department strictly enforces prerequisites for all courses.\nPrerequisites are checked by CS faculty at the beginning of each course.\nA grade of\nC or better is required\nto be accepted as a prerequisite.\nThe final decision about whether a student is ready to take a course is made by the instructor who teaches the course.\nCheating and Plagiarism Policy\nBy academic cheating and plagiarism we mean presenting, as your own work, material produced by or in collaboration with others, or permitting or assisting others to present your work as their own without proper acknowledgment.\nThe policies of San Francisco State University, with respect to cheating and plagiarism, are stated in SF State's Bulletin. Courses involving computer programming require special consideration because use of the computer permits easy copying and trivial modification of programs. In addition, our polices also address availability of content and services on the Internet which can be used for plagiarism and cheating. The following guidelines are provided to help in determining if an incident of cheating or plagiarism has occurred.\nThe instructor may suspect a student of program plagiarism if the student submits a program that is so similar to the program submitted by a present or past student in the course that the solutions may be converted to one another by a simple mechanical transformation.\nThe instructor may suspect a student of cheating, whether on a program or an examination, if the student cannot explain both the intricacies of his or her solution and the techniques and principles used to generate that solution.\nIt should be clear that there is latitude for difference among individual instructors, particularly on the matter of when working with other students or adapting material from a textbook is permissible. The following general policy on cooperation on homework assignments holds:\nIn all circumstances it is acceptable to discuss the meaning of assignments and general approaches and strategies for handling those assignments with other members of the Academic Community. Any cooperation beyond that point, including shared pseudocode or flowcharts, shared code, or shared documentation, is only acceptable if specifically so permitted by the class instructor in written guidelines distributed to the entire class.\nThe Penalty\nIn cases of academic cheating or plagiarism, no credit will be given for the assignment in question and a record will be kept in the Computer Science department office. If a second or further incident is reported for an individual, or if the circumstances of a first incident so warrant, a letter describing the incident(s) will be forwarded to the Student Discipline Officer for possible disciplinary action, which may include expulsion, suspension, or probation; as well as lesser sanctions. Please refer to the Supplemental Regulations and Procedures section of SF State's Bulletin for details.\nAny student using Rentacoder or similar WWW service in any relation to schoolwork will be dealt with most seriously, including possible expulsion from the university.\nExamples\nWhen a student turns in the work of another student and represents it as his or her own work.\nWhen a student knowingly permits another to turn in his or her work.\nWhen a student copies code from the work of another student.\nWhen a student deliberately transforms borrowed sections of code in order to disguise their origin.\nWhen several students collaborate on a project and fail to inform the instructor of this.\nWhen a student steals or obtains examinations, answer keys, or program samples from the instructors files or computer directories.\nWhen a student modifies or deletes another student's or an instructor's computer files.\nWhen a student uses content from other sources like Internet and includes it in his/her work or projects without proper attribution.\nWhen a student uses Internet or other services to post assignments and seek solutions.\nWhen Internet resources are used verbatim and/or \"cut and pasted\" into students work regardless whether they are acknowledged or not.\nWhen Does It Not Occur?\nWhen students have permission to collaborate on a project, and list all collaborators.\nWhen students receive advice from instructors, teaching assistants, or staff members involved in the course.\nWhen students share knowledge about syntax errors, coding tricks, or other language-specific information that makes programming easier.\nWhen students engage in a general discussion of the nature of an assignment, the requirements for an assignment, or general implementation strategies.\nWhen students compare independent solutions to an assignment in order to better understand the nature of the assignment.\nWhen students engage in discussion of course concepts or programming strategies in preparation for an assignment or examination.\nWhen students copy code and cite its source on assignments for which the instructor allows inclusion of code other than the student's own.\nHow to Check for Plagiarism\nPlease consult with your course instructor if you have any questions regarding whether or not your work with other students and/or materials prepared for submission are appropriate. The following examples illustrate situations when Academic Cheating and/or Plagiarism has and has not occurred. Please note these lists are not comprehensive!\nSee also the reference materials posted by SF State's Center for Teaching and Faculty Development on Academic Integrity & Plagiarism:\n(SF State's Plagirarism Policy Page)\nDistribution of this Policy\nCopies of this policy will be available in the department office and posted on bulletin boards within the department. The policy will also be attached to, or included, in the undergraduate and graduate information bulletins.\nAn announcement of the existence of the policy will be made by the instructor at the first meeting each semester of every Computer Science class, at which time any course specific guidelines on cooperation and use of published programs can also be stated. For lower division courses, reference to this policy and statement of any course specific guidelines will be included in the course syllabus distributed to all students.\nPolicy on Observance of Religious Holidays\nThe San Francisco State University faculty shall make reasonable accommodations for students to observe religious holidays when such observances require students to be absent from class activities.\nIt is the responsibility of the student to inform the instructor, in writing, about such holidays during the first two weeks of the class each semester. If such holidays occur during the first two weeks of the semester, the student must notify the instructor, in writing, at least three days before the date that they will be absent.\nIt is the instructor's responsibility to make every reasonable effort to honor the student's request without penalty and for the student to make up the work missed.\nStudent Disclosures on Sexual Violence\nSF State fosters a campus free of sexual violence including sexual harassment, domestic violence, dating violence, stalking, and/or any form of sex or gender discrimination.\nIf you disclose a personal experience as an SF State student, the course instructor is required to notify the Dean of Students.\nTo disclose any such violence confidentially, please contact:\nThe SAFE Place:\n(415) 338-2208\nhttp://www.sfsu.edu/~safe_plc/\nCounseling and Psychological Services Center:\n(415) 338-2208\nhttp://psyservs.sfsu.edu/\nFor more information on your rights and available resources:\nhttp://titleix.sfsu.edu\nDisability Access\nStudents with disabilities who need reasonable accommodations are encouraged to contact the instructor.\nThe Disability Programs and Resource Center (DPRC) is available to facilitate the reasonable accommodations process. The DPRC is located in the Student Services Building and can be reached by telephone (voice/TTY 415-338-2472) or by email\ndprc@sfsu.edu\n.\nFor more information, please visit their homepage:\nhttp://www.sfsu.edu/~dprc",
    "url": "https://cs.sfsu.edu/undergrads/student-policies",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/news/computer-science-biology-and-psychology-faculty-receive-renewal-award-genentech-inc",
    "category": "cs_general",
    "title": "Computer Science, Biology, and Psychology Faculty Receive a Renewal Award from Genentech Inc. | Department of Computer Science",
    "content": "Computer Science, Biology, and Psychology Faculty Receive a Renewal Award from Genentech Inc.\nAuthor:\nDr. Anagha Kulkarni\nFebruary 27, 2024\nAnagha Kulkarni (CS), Ilmi Yoon (CS), Pleuni Pennings (Biology), and Shasta Ihorn (Psychology) have received a renewal award of $661,250 from Genentech Inc. to establish and expand a professional certificate program in Data Science and Machine Learning for Biotechnology Professionals. This project aims to provide biotechnology professionals from any backgrounds with the knowledge, skills, and practical experience necessary to excel in the rapidly evolving field of data science and machine learning. The program is designed to align with the technical needs of the biotechnology field and is adapted for professionals in various work-life situations.\nThe first cohort of 24 Genentech employees is on path to earning this certificate in May 2024.\nAdditional information:\nhttps://cpage.sfsu.edu/datascience\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/computer-science-biology-and-psychology-faculty-receive-renewal-award-genentech-inc",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/event/elusive-quest-agi-science-or-speculation",
    "category": "cs_general",
    "title": "The Elusive Quest for AGI: Science or Speculation? | Department of Computer Science",
    "content": "The Elusive Quest for AGI: Science or Speculation?\nTuesday, April 01, 2025\nEvent Time\n05:00 p.m.   -  06:00 p.m.\nPT\nCost\nLocation\nSEC 210\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nArtificial General Intelligence (AGI) has become ubiquitous in technological discourse, fueling excitement and apprehension. However, a critical examination reveals that AGI remains a nebulous concept, lacking a precise definition and failing to meet the rigorous standards of a scientific hypothesis. This presentation delves into AGI's core challenges, addressing the fundamental question: Is it a genuine scientific pursuit, marketing, or a collection of unsubstantiated claims?\nWe will explore tech leaders' diverse and often conflicting perspectives, highlighting the absence of consensus on AGI's nature and feasibility. Furthermore, we will consider the possibility that human intelligence transcends computational processes, raising questions about the limitations of current AI paradigms. The nature of consciousness, often relegated to philosophical and neuroscientific inquiry, will be brought into the discussion, suggesting its potential relevance to the AGI debate.\nThe presentation will also address the problematic tendency to anthropomorphize AI and use hyperbolic pronouncements about its capabilities. In conclusion, we will argue that a more nuanced and critical approach is necessary to navigate the complexities of AGI, moving beyond the hype and fostering a more grounded understanding of artificial intelligence's potential and limitations.\nSpeaker Biography\nKerrie Holley's pioneering journey spans from punch cards to today's AI revolution, leading breakthrough innovations across every significant computing paradigm. Named IBM's first Black Distinguished Engineer and later IBM Fellow, he shattered barriers while architecting and engineering transformative solutions in the mainframe, client-server, Internet, mobile, cloud, and AI era. His exceptional contributions and innovations earned him induction into the National Academy of Engineering (2023) and the National Inventors Hall of Fame (2025).\nAs a tech executive at Google and VP/CTO at Cisco, Kerrie drove enterprise-scale innovation. In healthcare, he built and led a groundbreaking team of engineers, scientists, and AI specialists who revolutionized healthcare delivery through cutting-edge technology. His deep expertise in healthcare transformation is captured in his latest books, \"LLM and Generative AI in Healthcare” (2024) and “AI First Healthcare” (2021), part of his extensive portfolio of published works on technology innovation.\nToday, he shapes the future of technology through board leadership, speaking engagements, strategic consultation, and continued thought leadership in emerging technologies.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/elusive-quest-agi-science-or-speculation",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/undergrads/prerequisite-chart",
    "category": "cs_undergraduate",
    "title": "Prerequisite Chart | Department of Computer Science",
    "content": "Prerequisite Chart\nEnforcement\nCS Department\nstrictly\nenforces prerequisites for all courses. Prerequisites are checked by CS faculty at the beginning of each course. The final decision about whether a student is ready to take a course is made by the instructor who teaches the course.\nBulletin Rights\nStudents who start the study of CS under a program that is published in the Bulletin have the right to graduate with the same program in a specific time interval. However, this right\ndoes not\nhold for course prerequisites. The CS Department regularly improves its curriculum and as a result the prerequisites may change. Because the Bulletin is printed early (before the start of the academic year), it may not completely reflect the most recent changes to prerequisites.",
    "url": "https://cs.sfsu.edu/undergrads/prerequisite-chart",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/event/graduate-seminar-swig-modern-applications",
    "category": "cs_graduate",
    "title": "Graduate Seminar: SWIG: Modern Applications | Department of Computer Science",
    "content": "Graduate Seminar: SWIG: Modern Applications\nWednesday, November 29, 2023\nEvent Time\n06:00 p.m.   -  07:00 p.m.\nPT\nCost\nLocation\nThornton Hall 326\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nSWIG is widely used in the embedded world because of the conveniences, tool support and debug capabilities that can be leveraged by having a Python interface for C/C++ library. We’ll talk about some of the applications along with a brief overview of how SWIG works.\nSpeaker Biography\nAaron Cruz is a Senior Software Engineer at Cisco Systems who focuses on embedded software development with 8 years of industry experience. Cruz has focused his career on physical middleware software for communication devices like Software Defined Radios and Networking Routers.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/graduate-seminar-swig-modern-applications",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/grads/student-policies",
    "category": "cs_graduate",
    "title": "Student Policies | Department of Computer Science",
    "content": "Student Policies\nThe university is committed to maintaining a safe and healthy living and learning environment for students, faculty, and staff. Each campus community member should choose behaviors that contribute toward this end. Therefore, students are expected to be good citizens and to engage in responsible behaviors that reflect well upon their university, be civil to one another and others in the campus community, and contribute positively to student and university life.\nPrerequisite Policy\nCS Department strictly enforces prerequisites for all courses.\nPrerequisites are checked by CS faculty at the beginning of each course.\nA grade of\nC or better is required\nto be accepted as a prerequisite.\nThe final decision about whether a student is ready to take a course is made by the instructor who teaches the course.\nCheating and Plagiarism Policy\nBy academic cheating and plagiarism we mean presenting, as your own work, material produced by or in collaboration with others, or permitting or assisting others to present your work as their own without proper acknowledgment.\nThe policies of San Francisco State University, with respect to cheating and plagiarism, are stated in SF State's Bulletin. Courses involving computer programming require special consideration because use of the computer permits easy copying and trivial modification of programs. In addition, our polices also address availability of content and services on the Internet which can be used for plagiarism and cheating. The following guidelines are provided to help in determining if an incident of cheating or plagiarism has occurred.\nThe instructor may suspect a student of program plagiarism if the student submits a program that is so similar to the program submitted by a present or past student in the course that the solutions may be converted to one another by a simple mechanical transformation.\nThe instructor may suspect a student of cheating, whether on a program or an examination, if the student cannot explain both the intricacies of his or her solution and the techniques and principles used to generate that solution.\nIt should be clear that there is latitude for difference among individual instructors, particularly on the matter of when working with other students or adapting material from a textbook is permissible. The following general policy on cooperation on homework assignments holds:\nIn all circumstances it is acceptable to discuss the meaning of assignments and general approaches and strategies for handling those assignments with other members of the Academic Community. Any cooperation beyond that point, including shared pseudocode or flowcharts, shared code, or shared documentation, is only acceptable if specifically so permitted by the class instructor in written guidelines distributed to the entire class.\nThe Penalty\nIn cases of academic cheating or plagiarism, no credit will be given for the assignment in question and a record will be kept in the Computer Science department office. If a second or further incident is reported for an individual, or if the circumstances of a first incident so warrant, a letter describing the incident(s) will be forwarded to the Student Discipline Officer for possible disciplinary action, which may include expulsion, suspension, or probation; as well as lesser sanctions. Please refer to the Supplemental Regulations and Procedures section of SF State's Bulletin for details.\nAny student using Rentacoder or similar WWW service in any relation to schoolwork will be dealt with most seriously, including possible expulsion from the university.\nExamples\nWhen a student turns in the work of another student and represents it as his or her own work.\nWhen a student knowingly permits another to turn in his or her work.\nWhen a student copies code from the work of another student.\nWhen a student deliberately transforms borrowed sections of code in order to disguise their origin.\nWhen several students collaborate on a project and fail to inform the instructor of this.\nWhen a student steals or obtains examinations, answer keys, or program samples from the instructors files or computer directories.\nWhen a student modifies or deletes another student's or an instructor's computer files.\nWhen a student uses content from other sources like Internet and includes it in his/her work or projects without proper attribution.\nWhen a student uses Internet or other services to post assignments and seek solutions.\nWhen Internet resources are used verbatim and/or \"cut and pasted\" into students work regardless whether they are acknowledged or not.\nWhen Does It Not Occur?\nWhen students have permission to collaborate on a project, and list all collaborators.\nWhen students receive advice from instructors, teaching assistants, or staff members involved in the course.\nWhen students share knowledge about syntax errors, coding tricks, or other language-specific information that makes programming easier.\nWhen students engage in a general discussion of the nature of an assignment, the requirements for an assignment, or general implementation strategies.\nWhen students compare independent solutions to an assignment in order to better understand the nature of the assignment.\nWhen students engage in discussion of course concepts or programming strategies in preparation for an assignment or examination.\nWhen students copy code and cite its source on assignments for which the instructor allows inclusion of code other than the student's own.\nHow to Check for Plagiarism\nPlease consult with your course instructor if you have any questions regarding whether or not your work with other students and/or materials prepared for submission are appropriate. The following examples illustrate situations when Academic Cheating and/or Plagiarism has and has not occurred. Please note these lists are not comprehensive!\nSee also the reference materials posted by SF State's Center for Teaching and Faculty Development on Academic Integrity & Plagiarism:\n(SF State's Plagirarism Policy Page)\nDistribution of this Policy\nCopies of this policy will be available in the department office and posted on bulletin boards within the department. The policy will also be attached to, or included, in the undergraduate and graduate information bulletins.\nAn announcement of the existence of the policy will be made by the instructor at the first meeting each semester of every Computer Science class, at which time any course specific guidelines on cooperation and use of published programs can also be stated. For lower division courses, reference to this policy and statement of any course specific guidelines will be included in the course syllabus distributed to all students.\nPolicy on Observance of Religious Holidays\nThe San Francisco State University faculty shall make reasonable accommodations for students to observe religious holidays when such observances require students to be absent from class activities.\nIt is the responsibility of the student to inform the instructor, in writing, about such holidays during the first two weeks of the class each semester. If such holidays occur during the first two weeks of the semester, the student must notify the instructor, in writing, at least three days before the date that they will be absent.\nIt is the instructor's responsibility to make every reasonable effort to honor the student's request without penalty and for the student to make up the work missed.\nStudent Disclosures on Sexual Violence\nSF State fosters a campus free of sexual violence including sexual harassment, domestic violence, dating violence, stalking, and/or any form of sex or gender discrimination.\nIf you disclose a personal experience as an SF State student, the course instructor is required to notify the Dean of Students.\nTo disclose any such violence confidentially, please contact:\nThe SAFE Place:\n(415) 338-2208\nhttp://www.sfsu.edu/~safe_plc/\nCounseling and Psychological Services Center:\n(415) 338-2208\nhttp://psyservs.sfsu.edu/\nFor more information on your rights and available resources:\nhttp://titleix.sfsu.edu\nDisability Access\nStudents with disabilities who need reasonable accommodations are encouraged to contact the instructor.\nThe Disability Programs and Resource Center (DPRC) is available to facilitate the reasonable accommodations process. The DPRC is located in the Student Services Building and can be reached by telephone (voice/TTY 415-338-2472) or by email\ndprc@sfsu.edu\n.\nFor more information, please visit their homepage:\nhttp://www.sfsu.edu/~dprc",
    "url": "https://cs.sfsu.edu/grads/student-policies",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/sf-state-science-coding-programs-boost-biotech-diversity",
    "category": "cs_general",
    "title": "SF State Science Coding Programs Boost Biotech Diversity | Department of Computer Science",
    "content": "SF State Science Coding Programs Boost Biotech Diversity\nAuthor:\nKate High\nDecember 16, 2020\nPhoto Credit:\nSF State News (Strategic Marketing and Communications)\nGrants impact SF State’s computer science diversity efforts with new certification programs and scholarships\nDespite the San Francisco Bay Area being one of the most diverse regions in the country, the technology industries that call it home still lack diversity. Faculty members in the\nPromoting Inclusivity and Computing (PINC)\nprogram at San Francisco State University aim to change this. Their efforts have recently received recognition from both academia and the biotech industry, including two recent grants from the Genentech Foundation and Genentech, Inc. totaling over $1.2 million.\nAssociate Professor of Computer Science Anagha Kulkarni, one of the leaders of PINC, says faculty members and their collaborators at Genentech share a motivation to make tech more diverse. “It’s really highly skewed right now,” she explained. “It’s very male driven — gender diversity is very low, and ethnic and racial diversity are also very low.”\nPINC provides opportunities for non-Computer Science majors to learn coding skills in a supportive environment. In the program’s three years of existence, more than three-quarters of the program’s graduates have been women, and more than half of the students have come from underrepresented minority groups.\nOne of the two grants, for $621,000 provided by Genentech, Inc., will support the development of a new Data Science and Artificial Intelligence certificate program for undergraduates. Researchers at Genentech are also developing curricula alongside San Francisco State faculty members to ensure that students are prepared for success in the biotech industry.\n“As we met over the course of a semester, we all agreed that we need to create a curriculum that is not just designed by us academics but also informed by what practitioners want in the industry,” Kulkarni said. SF State faculty will bring their own expertise in training students, providing undergraduates with graduate-level skillsets, professional development and mentorship.\nThe second grant, $580,750 provided by The Genentech Foundation, will fund scholarships for 10 undergraduates in the PINC minor program each year. One barrier many students face is the need to financially support themselves throughout their undergraduate career, which makes it difficult to take advantage of research opportunities. The funding will allow students in the minor, who are learning a new and complex skillset in order to enter a highly competitive field, the opportunity to focus on their coursework and research without having to take on other jobs. At the same time, they’ll gain access to a network of researchers and mentors from other universities and companies around the Bay Area.\nTech diversity efforts at SF State haven’t just caught the notice of local industry — they’ve turned heads in academia, too. A team of faculty members recently\npublished an article in the journal PLOS Computational Biology\ndescribing an innovative summer program that teaches students to apply coding to their science disciplines.\n“It’s unique in the sense that students are given an opportunity not only to learn coding skills but also in the context of their discipline with a real research project,” said Assistant Professor of Chemistry and Biochemistry Nicole Adelstein, a faculty organizer and advisor for the PINC summer program. Students in this nine-week program learn coding skills while applying them towards topics of their interest and supporting one another in cohorts throughout the summer.\nAnd at the helm of that program are faculty members who are committed to making the computer science and biotech fields more diverse — and whose backgrounds are similar to the students they teach. “Many of the SF State faculty involved in organizing the program, I think, are mostly self-taught programmers,” Adelstein explained. “We’re very motivated to give these students opportunities to explore coding within their own field, in part because we all wish we had started earlier.”\nTags\nGrant\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/sf-state-science-coding-programs-boost-biotech-diversity",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/event/byzantine-resilient-reinforcement-learning-multi-uav-systems",
    "category": "cs_general",
    "title": "Byzantine-Resilient Reinforcement Learning for Multi-UAV Systems | Department of Computer Science",
    "content": "Byzantine-Resilient Reinforcement Learning for Multi-UAV Systems\nWednesday, December 04, 2024\nEvent Time\n05:00 p.m.   -  06:00 p.m.\nPT\nCost\nLocation\nSEC 210\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nMulti-Unmanned Aerial Vehicle (multi-UAV) systems have become crucial in applications such as aerial surveillance and search and rescue missions. State-of-the-art multi-agent reinforcement learning (MARL) algorithms offer promising methods to train multi-UAV systems in both collaborative and competitive scenarios. However, the inherent vulnerabilities in multi-agent systems present substantial privacy and security challenges, particularly when deploying conventional MARL algorithms. The introduction of even a single Byzantine adversary within the system can drastically compromise the learning performance of UAV agents. In this talk, Dr. Chen will introduce a Byzantine-resilient MARL algorithm designed to mitigate, and potentially eliminate, the impact of Byzantine attacks, enhancing the reliability and robustness of multi-UAV deployments. Finally, Dr. Chen will introduce some of her ongoing research projects focused on safe and reliable AI, as well as the application of generative AI in education.\nSpeaker Biography\nDr. Xuhui (Tracy) Chen is an Assistant Professor in the Department of Computer Science at San Francisco State University. She earned her Ph.D. in Computer Engineering from Case Western Reserve University in 2019, her M.S. in Electrical and Computer Engineering from Mississippi State University in 2015, and her B.E. in Information Engineering from Xidian University, Xi'an, China, in 2012. Dr. Chen’s research interests focus on Artificial Intelligence and cybersecurity, particularly addressing security and privacy challenges in distributed machine learning, with applications in bioinformatics and cyber-physical systems, including UAVs, IoT, and power systems. She is also engaged in education research, exploring the use of generative AI to facilitate communication in interdisciplinary teams. Dr. Chen has authored over 25 peer-reviewed articles in leading journals and conferences, with her research supported by federal programs, industry, and university funding.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/byzantine-resilient-reinforcement-learning-multi-uav-systems",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/people",
    "category": "cs_faculty",
    "title": "People | Department of Computer Science",
    "content": "People\nLeadership & Staff\nAnagha Kulkarni\nProfessor\nAssociate Chair\nak@sfsu.edu\n(415) 338-2539\nArno Puder\nProfessor\nDepartment Chair, Undergraduate Advisor\narno@sfsu.edu\nYuki Huynh\nOffice Manager\nyukihuynh@sfsu.edu\nBriana Miranda\nAdministrative Support Coordinator\nbrianamiranda@sfsu.edu\nFaculty\nAkila de Silva\nAssistant Professor\ndesilva@sfsu.edu\nHui Yang\nProfessor\nhuiyang@sfsu.edu\n(415) 338-2221\nJingyi Wang\nAssociate Professor\nTransfer Advisor\njingyiwang@sfsu.edu\n(415) 405-2636\nJozo Dujmovic\nProfessor\njozo@sfsu.edu\n(415) 338-2207\nKaz Okada\nProfessor\nkazokada@sfsu.edu\n(415) 338-7687\nQun Wang\nAssistant Professor\nGraduate Advisor\nqunwang@sfsu.edu\nSanika Doolani\nAssistant Professor\nsanikadoolani@sfsu.edu\nSara El  Alaoui\nAssistant Professor\nselalaoui@sfsu.edu\nShah Rukh Humayoun\nAssociate Professor\nUndergraduate Advisor\nhumayoun@sfsu.edu\n(415) 338-2858\nTimothy Sun\nAssistant Professor\nGraduate Coordinator, Graduate Advisor\ntimothysun@sfsu.edu\nTracy Xuhui Chen\nAssistant Professor\ntracychen@sfsu.edu\nWes Bethel\nProfessor\newbethel@sfsu.edu\nZainab Agha\nAssistant Professor\nzainabagha@sfsu.edu\nAdjunct Faculty\nJulia Cluceru\nAdjunct Faculty\nRobert Mateescu\nAdjunct Faculty\nmateescu@sfsu.edu\nLecturers\nAbdur Sikder\nLecturer\nabdur@sfsu.edu\nAndrew Scott\nLecturer\nats@sfsu.edu\nAnthony Souza\nLecturer\najsouza@sfsu.edu\nBrian Parra\nLecturer\nbrianparra@sfsu.edu\nDaniel Tomasevich\nLecturer\ndtomas@sfsu.edu\n(415) 338-2168\nDuc Ta\nLecturer\ndta@sfsu.edu\nHenry Villar\nLecturer\njvillar@mail.sfsu.edu\nHugh Hui\nLecturer\nhhui@sfsu.edu\nIvan Corneillet\nLecturer\nivan@sfsu.edu\nJennifer Nelson\nLecturer\nkerekesj@sfsu.edu\nJohn Roberts\nLecturer\njrob@sfsu.edu\nJose Ortiz-Costa\nLecturer\njortizco@sfsu.edu\nJoseph Hui\nLecturer\njhui@sfsu.edu\nKimbrough Moore\nLecturer\namoore8@sfsu.edu\nMark Davis\nLecturer\nmarkkdavis@sfsu.edu\nMatt Pico\nLecturer\nmpico@sfsu.edu\nNina Mir\nLecturer\nnina@sfsu.edu\nRobert Bierman\nLecturer\nbierman@sfsu.edu\nFaculty On Leave\nIsabel Hyo Jung Song\nAssociate Professor\nUndergraduate Advisor\nhjsong@sfsu.edu\n(415) 338-7688\nEmeritus Faculty\nBarry Levine\nProfessor\nlevine@sfsu.edu\n(415) 338-1661\nDragutin Petkovic\nProfessor\nCoordinator for Graduate Certificates in AI Ethics & SW Engineering\npetkovic@sfsu.edu\n(415) 338-2261\nIlmi Yoon\nProfessor\nilmi@sfsu.edu\nJames Wong\nProfessor\njwong@sfsu.edu\nLawrence Kroll\nProfessor\nkroll@sfsu.edu\nRobert Douglas\nProfessor\nrdouglas@sfsu.edu\nWilliam Hsu\nProfessor\nwhsu@sfsu.edu\nGraduate Teaching Assistants\nJonathan  Jacobson\nGraduate Teaching Assistant\njacobsonj@sfsu.edu\nFall 2025 Instructional Student Assistants (ISAs)\nAbdillahi\nAbdoulfatah\nBavisetti\nSai\nBavisetty\nHemasri\nBaxter\nTyler\nBohlander\nTy\nDaghbashyan\nArman\nGade\nJaideep\nHalvadiya\nNaisarg\nKatturu\nSneha\nKidwai\nAlex\nLiu\nGuiran\nLiu\nYang\nMagar\nAishwarya\nFazl\nMohammad\nMoore\nConnor\nNarayan\nShivangi\nNhan\nElton\nPatel\nShail\nPatel\nMeet\nPisati\nAbhinaya\nPowell\nKayla\nSakanovic\nDenis\nShorb\nBenjamin\nShrivastava\nAtharva\nSuratia\nNishi\nTaneja\nNipun\nThompson\nMichael\nVats\nAnshaj\nWalawalkar\nAtharva\nYoung\nDeven\nZhu\nBinrong\nNote: ISAs do not have an office location or office hours.",
    "url": "https://cs.sfsu.edu/people",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/people/akila-de-silva",
    "category": "cs_faculty",
    "title": "Akila de Silva | Department of Computer Science",
    "content": "Akila de Silva\nAssistant Professor\nEmail:\ndesilva@sfsu.edu\nLocation:\nThornton Hall 968\nOffice Hours:\nMon:\n2:00 p.m. - 3:00 p.m.\nJoin Zoom Meeting:\nhttp://zoom.us/j/4728433340pwd=SmZPK3dzZW5uWTNrdnc4TjBMV0dNUT09\nWebsite\nBiography\nAreas of Expertise\nArtificial Intelligence, Machine Learning, Deep Learning, Computer vision, Visualization, Applied AI\nPublications\nKhan, F. H., Lovell, E.,de Silva, A. Dusek, G., Davis, J., Pang, A. \"WIP: Citizen Science Tools with Machine Learning as a Pathway to Engage High School Students in Research\". Accepted at Frontiers in Education.\nDusek, D.,Hernandez, D., Long, J., Porter, D., Pang, A., Cothran, J.,Schandera, L., Showalter, L., Rhoades, J, Sager, C., Palmsten, M, de Silva, A., Khan, F. and Jass, T., “Expanding partnerships, products and use-cases for an operational coastal web camera observation network” In: Ocean Sciences Meeting 2024. AGU.\nde Silva, A., Zhao, M.◦, Stewart D.◦, Khan, F. H., Dusek, G., Davis, J., Pang, A. “RipViz: Finding Rip Currents by Learning Pathline Behavior.” In: IEEE Transactions on Visualization and Computer Graphics (TVCG) 2023.\nhttps://doi.org/10.1109/TVCG.2023.3243834\nLuo, J., Khan, F. H.,Mori, I., de Silva, A., Ruezga, E. S., Pang, A., Davis, J. “How Much Does Input Data Type Impact Final FaceModel Accuracy?.” In: IEEE Computer Vision and Pattern Recognition (CVPR) 2022.\nhttps://doi.org/10.1109/CVPR52688.2022.01841\nMori, I., de Silva, A., Dusek, G., Davis, J., Pang, A. “Flow-based Rip Current Detection and Visualization.” In: IEEE Access 2022.\nhttps://doi.org/10.1109/ACCESS.2022.3140340\nKhan, F. H., de Silva, A., Dusek, G., Davis, J., Pang, A. “A Citizen Science Platform for Creating ML-poweredMobile Apps to Collect Visual Data.” In: Conference on Computer Supported CooperativeWork and Social Computing (CSCW) 2021.\nhttps://doi.org/10.1145/3462204.3481743\nDe Silva, A.,Mori, I., Dusek, G., Davis, J., Pang, A. “Automated rip current detection with region based convolutional neural networks.” In: Coastal Engineering.\nhttps://doi.org/10.1016/j.coastaleng.2021.103859\nLuo, J., Khan, F. H.,Mori, I., de Silva, A., Ruezga, E.S., Davis, J. “FaceModels: How Good DoesMy Data Need To Be?.” In: IEEE ICIP 2021.\nhttps://doi.org/10.1109/ICIP42928.2021.9506668\nKhan, F. H.∗, de Silva, A.∗, Yetukuri, J.∗, Norouzi, N.∗ “Sequential Image Synthesis for Human Activity Video Generation.” In: International Conference on Image Analysis and Recognition (pp. 129-133). ∗ equal contribution.\nhttps://doi.org/10.1007/978−3−030−27272−2_11\nDusek, G., Churma, M., Im, J. S., Pang, A., de Silva, A.,Mori, I. “From Lifeguards to AI:Advancing Rip Current Forecasting Through New DetectionMethods.” In: Ocean Sciences Meeting 2020. AGU.\nde Silva, A., Tee, N. Ganekar, O., Khan, F. H., Dusek, G., Davis, J., Pang, A.  VortexViz: Finding Vortices by Learning from particle trajectories.\nhttps://doi.org/10.48550/arXiv.2404.01352\nAwards and Grants\nMichael Richman Award,\nwith Professor Leigh Jin and Professor Weimin Zhang, for 2024-25.",
    "url": "https://cs.sfsu.edu/people/akila-de-silva",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/event/graduate-seminar-making-physical-models-maps-surfaces",
    "category": "cs_graduate",
    "title": "Graduate Seminar: Making Physical Models of Maps on Surfaces | Department of Computer Science",
    "content": "Graduate Seminar: Making Physical Models of Maps on Surfaces\nWednesday, November 01, 2023\nEvent Time\n06:30 p.m.   -  07:30 p.m.\nPT\nCost\nLocation\nThornton Hall 331\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nGiven a map of countries, cartographers color the map so that bordering countries are colored differently. A classic problem in graph theory asks for the minimum number of colors needed for any map. For maps drawn on the plane or the sphere, this is the well-known Four Color Theorem, but there is also a generalization to arbitrary closed surfaces, like the torus or the Klein bottle. Recently, mathematical artists have been interested in making physical models of those maps that need the most number of colors. In this talk, I will discuss the various approaches people have taken for making these models. In particular, I will cover my own attempts using a 3D printer, and the challenges and workarounds I found while making my \"Neighborly Nine\" sculpture.\nBiography of Speaker\nTimothy Sun is an Assistant Professor in the Computer Science department at SFSU. His research is primarily in topological graph theory, but he sometimes dabbles in computer science education and recreational mathematics.\"\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/graduate-seminar-making-physical-models-maps-surfaces",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/event/cs-research-special-interest-group",
    "category": "cs_general",
    "title": "CS Research Special Interest Group | Department of Computer Science",
    "content": "CS Research Special Interest Group\nThursday, September 14, 2023\nEvent Time\n02:30 p.m.   -  03:30 p.m.\nPT\nCost\nLocation\nHensil Hall 803\nContact Email\nmkim22@mail.sfsu.edu\nOverview\nIn the ever-evolving world of technology, the past, present, and future of computer science hold the keys to unlocking endless possibilities. Our CS Research Roundtable brings together curious minds, from seasoned researchers to budding enthusiasts, for a dynamic dialogue that explores both the contemporary breakthroughs and the treasures of the past. We invite you to join us as our own Prof. Wes Bethel leads our examination of past Turing Award winners!\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/cs-research-special-interest-group",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/people/james-wong",
    "category": "cs_faculty",
    "title": "James Wong | Department of Computer Science",
    "content": "James Wong\nProfessor\nEmail:\njwong@sfsu.edu\nJames Wong Website\nBiography\nAreas of Expertise\nAnalysis of Algorithms\nInternet Applications\nSystem Testing Strategies\nScheduling Algorithms\nPublications\nDynamic path planning for mobile beacons in wireless sensor network localization\" (with Wen Ouyang, Hao-Chun Hsieh), The 8th International Workshop on Performance Evaluation of Wireless Networks (PEWiN-2016)\n“Heuristics for Reconfigurable Three Dimensional Free Space,” (with J, Kosumo, D. Luong and G. Young), The 19th International Conference on Parallel and Distributed Processing Techniques and Applications, pp 423-429, Las Vegas, Nevada, July 2013.\n“A Formal Methodology to Determine Functional Stress Testing Criteria,” (with H. Luo), 1/2013.",
    "url": "https://cs.sfsu.edu/people/james-wong",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/undergrads/advising",
    "category": "cs_undergraduate",
    "title": "Undergraduate Advising | Department of Computer Science",
    "content": "Undergraduate Advising\nProper and timely advising has been shown to significantly improve students' success and graduation rate. We summarize here our advising process and mandatory advising checkpoints. Please refer to the advising process described under these undergraduate, graduate and transfer advising section.\nAdvising\nStudent Advising Guidance\nComputer science students are strongly encouraged to adhere to the following student responsibilities:\nFollowing the appropriate advising process to their standing, as described under these Undergraduate and Graduate sections.\nReading\nall emails\nsent from the computer science office and faculty.\nSeeking advising for any mandatory advising checkpoints.\nSeeking advising whenever a need arises, in a timely manner with respect to any deadlines.\nUndergraduate Advising\nIt is important and beneficial to take the opportunity to schedule timely advising for assistance and achieving success. Students should plan their program of study in the major with the help of a departmental advisor as soon as possible in order that the correct sequence of courses is taken and a proper set of electives is chosen. Students are advised that CR/NC grades are\nnot\nacceptable in courses to be counted for the Computer Science major or minor programs. It is also suggested that students consult with an advisor before selecting courses to meet the General Education requirements.\nUse Navigator to Schedule your appointment.\nWilliam Hsu can be reached via email only until 10/5/2025 for advising needs:\nwhsu@sfsu.edu\n.\nSee Navigator Appointment Guide for Computer Science on how to schedule your appointment.\nPlease email\ncs-dept@sfsu.edu\nif you are unable to access Navigator.\nTransfer Advising\nAdvising Tips\nFor your appointment with your advisor, please bring the following documents (if available, online documents are ok):\nTranscripts\nList of all major related courses with course title, semester taken, college taken at, and grades obtained.\nIf possible, please bring course descriptions, syllabus, text book title, and any other related course materials.\nUse Navigator to Schedule your appointment.\nWilliam Hsu can be reached via email only until 10/5/2025 for advising needs:\nwhsu@sfsu.edu\n.\nSee Navigator Appointment Scheduler Quick Reference Guide on how to schedule your appointment.\nPlease email\ncs-dept@sfsu.edu\nif you are unable to access Navigator.\nGraduation Advising\nGraduation\nSee the\nRegistrar's Office's web page\nfor details on the graduation process. If your DPR shows something missing, please schedule an appointment with an Advisor. Make sure to complete your Senior Electives.\nSenior Electives\nAll CSC majors must complete five 3-unit senior electives. Students may choose 15 units from among the following courses:\nCSC 520: Theory of Computing\nCSC 600: Programming Paradigms and Languages\nCSC 615: UNIX Programming\nCSC 620: Natural Language Technologies\nCSC 621: Biomedical Imaging and Analysis\nCSC 630: Computer Graphics Systems Design\nCSC 631: Multiplayer Game Development\nCSC 641: Computer Performance Evaluation\nCSC 642: Human-Computer Interaction\nCSC 645: Computer Networks\nCSC 647: Introduction to Quantum Computing and Quantum Information Science\nCSC 649: Search Engines\nCSC 651: System Administration\nCSC 652: Introduction to Security and Data Privacy\nCSC 656: Computer Organization\nCSC 657: Bioinformatics Computing\nCSC 658: Programming Cafe\nCSC 664: Multimedia Systems\nCSC 665: Artificial Intelligence\nCSC 667: Internet Application Design and Development\nCSC 668: Advanced Object Oriented Software Design and Development\nCSC 671: Deep Learning\nCSC 675: Introduction to Database Systems\nCSC 676: Soft Computing and Decision Support Systems\nCSC 680: Application Development for Mobile Devices\nCSC 690: Interactive Multimedia Application Development\nCSC 698: Topics in Computing\nCSC 699: Independent Study\nMATH 400: Numerical Analysis\nMATH 425: Applied and Computational Linear Algebra\nMATH 448: Introduction to Statistical Learning and Data Mining\n*Most graduate CSC courses may also be used as senior electives.\n**You may only choose one of the listed MATH courses as a senior elective.\nStudents are advised to check their university and college regulations regarding academic standing requirements. It is occasionally possible to use a course taken in a different department or at another university to satisfy elective requirements. Any course substitutions must be approved in advance by a Senior Advisor.\nOutside of SF State Transfer Students\nOur program has been recently revised to streamline the course articulation for transfer, allowing more courses taken at community colleges or other schools to count towards your Computer Science Degree at SF State.\nTransferable Courses\nAll lower division courses (course numbers below 300) included among the degree requirements are available at many community colleges in California. Students intending to enter the program upon transferring to San Francisco State University from a community college should take as many of those courses there as possible.\nThe equivalents for the following Computer Science courses may be taken from approved universities and applied to your SF State CS Degree:\nCSC 101: Introduction to Computing\nCSC 215: Intermediate Computer Programming\nCSC 220: Data Structures\nCSC 230: Discrete Mathematics\nCSC 256: Machine Structures\nAdditionally, the following non-CS courses, required for completion of the program, may also be transferred from other institutions depending on their respective department's policies:\nMATH 226: Calculus I\nMATH 227: Calculus II\nPHYS 220/222: Physics I\nPHYS 230/232: Physics II\nBIOL 100: Introduction to Biology\nTo verify course equivalencies, please consult\nassist.org\n.\nQuickly look up articulation agreements for CS courses\nusing this tool\n.\nIf all lower-division major and GE requirements are satisfied, check out the\nSF State Bulletin's Roadmap for Transfer Students\n.\nExpected Programming Knowledge\nStudents who transfer to our program should have adequate Java experience. Students can attain adequate Java background by taking a course which should include topics as specified in the resources below:\nThe main Java tutorials website:\nOracle Java Tutorial Documentation web page.\nTopics Include:\nOracle Java Tutorial Documentation: Getting Started\n(Study All Topics)\nOracle Java Tutorial Documentation: Learning the Java Language\n(Study All Topics)\nOracle Java Tutorial Documentation: Essential Java Classes\n(Study Exceptions and Basic I/O)\nOracle Java Tutorial Documentation: Collections\n(Study Introduction and Interfaces)\nForms\nUndergraduate Forms\nIf you are submitting a\nWaiver of College Regulations Petition form\n, please follow the instructions below:\nSTEP 1: Student fills out the petition form electronically:\nhttps://registrar.sfsu.edu/sites/default/files/documents/collegewaiver_1.pdf\nMake sure Course information is correct\n.\n(ex. Term/Year: Fall 2023, Prefix: CSC, Number: 510, Section: 02, Class No. 3216, Units: 3). Check Class No. on\nhttps://webapps.sfsu.edu/public/classservices/classsearch\nCheck only 1 box. If you need to submit multiple petitions, use different forms.\nSend form from your SFSU email to Instructor’s SFSU email for approval\nNote: you DO NOT have to sign the form if it is being sent from your official SFSU email account.\nPLEASE USE THIS PATTERN AS THE SUBJECT LINE FOR YOUR EMAIL:\nNAME – SFSU ID#\n(ex. John Doe - 912345678)\nSTEP 2: Instructor receives form and forwards approval to the CS Office\nForward approval with an “I approve” from the instructor’s official SFSU email to\ncs-dept@sfsu.edu\nNote: instructors DO NOT need to sign the form if it is being sent from their official SFSU email account.\nSTEP 3: Office checks if all the above is correct and then forwards to Department Chair\nPut * after ID# in email title for everything except “Repeat a course after maximum attempts or in excess of unit repeat limits”\nForward to Dept. Chair and cc student\nSTEP 4: Department Chair will forward approval to Registrar’s to process\nIf you do not complete all instructions in Step 1 correctly, the CS Office will reroute your petition form back to your email for you to correct.\nHas my petition been approved/processed?\nIf you have been cc'd in the email with approval from the Dept. Chair to the Registrar's, your form has been sent to the Registrar's to process your petition. If you have not, the office is most likely waiting on the Instructor to send their approval. The Registrars Office will provide updates to your petition to your SFSU email.\nWaiver of College Regulations Petition.pdf\n532.62 KB\nComputer Science Department Transfer Equivalency Evaluation.pdf\n429.15 KB\nAcademic Bulletin Quick Links\nPrerequisite Courses\nRoadmap\nTransfer",
    "url": "https://cs.sfsu.edu/undergrads/advising",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/event/graduate-seminar-secure-distributed-machine-learning-multi-aggregators-edge-computing",
    "category": "cs_graduate",
    "title": "Graduate Seminar: Secure Distributed Machine Learning with Multi Aggregators in Edge Computing | Department of Computer Science",
    "content": "Graduate Seminar: Secure Distributed Machine Learning with Multi Aggregators in Edge Computing\nThursday, February 22, 2024\nEvent Time\n01:00 p.m.   -  02:00 p.m.\nPT\nCost\nLocation\nZOOM\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nFederated learning (FL) is a sought-after distributed machine learning architecture and has been seamlessly integrated into edge computing. However, the limited resources on edge devices introduce security vulnerabilities to FL. While blockchain technology promises to bolster security, edge devices cannot afford the cost of off-the-shelf blockchain systems. Moreover, the Blockchain-FL with multiple aggregators is still under-explored. In this talk, I introduce a novel Blockchain-empowered Heterogeneous Multi-Aggregator Federated Learning Architecture (BMA-FL). We design a performance-based Byzantine consensus mechanism to enable secure and fast model aggregation. I will also discuss the model damaging problem in BMA-FL due to the heterogeneity of aggregators. We propose a multi-agent deep reinforcement learning algorithm to help aggregators decide the best training strategies to mitigate the damage. The experiments on real-word datasets demonstrate the efficiency of BMA-FL to achieve better model performance faster than baselines.\nSpeaker Biography\nXiao Li is a Ph.D. Candidate in Computer Science at The University of Texas at Dallas advised by Prof. Weili Wu. His research focuses on blockchain technology and its applications in distributed systems. He is also interested in applied data science for problem solving with application of machine learning, deep learning and reinforcement Learning. Xiao has published 10 papers in related fields at refereed conferences and journals such as IEEE ICDCS, IEEE TCSS, Theoretical Computer Science, and Journal of Combinatorial Optimization. Xiao was awarded the prestigious Jan Van der Ziel Fellowship at UT Dallas in 2023. Xiao is also a member of IEEE, ACM and AAAI. Xiao has served as peer reviewers in various reputable conferences and journals including KDD, ICDCS, IJCAI and Information Sciences.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/graduate-seminar-secure-distributed-machine-learning-multi-aggregators-edge-computing",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/tags/tags/certificate",
    "category": "cs_general",
    "title": "Certificate | Department of Computer Science",
    "content": "Certificate\nBiotech Certificate Students get Insider Peek into Industry Jobs\nRead more\nabout Biotech Certificate Students get Insider Peek into Industry Jobs\nThe gSTAR program is only one year old, but the SF State-Genentech collab is already impacting students, faculty and industry\nWant a job in biotech? The first step is to get into college and study science. But what’s the second step? Moving directly from the classroom to the workplace isn’t always easy, especially in a competitive field like biotech.\ngSTAR student Phuong Phan\nEnter San Francisco State University’s Data Science and Machine Learning for Biotechnology Certificate (gSTAR) program. Designed by San Francisco State faculty and Genentech scientists, the program is tailored specifically to University undergraduates interested in industry. It\nlaunched in the fall of 2021\n, and the first students are already reaping the benefits, with several earning Genentech internships.\n“I think this internship is going to be a pretty wonderful opportunity for me to see if I fit into [scientific research] and to see if I can imagine myself doing it long term,” said fourth-year Cell and Molecular Biology student Phuong Phan.\nShe’s one of three gSTAR students who accepted an internship with Genentech’s research and development clinical imaging group, a position specifically tailored for gSTAR students. Not only will this be Phan’s first foray into biotech, it will be her first research opportunity ever.\nWhen academia meets industry\nThe gSTAR program is part of a\ngrowing collaboration\nbetween SF State and Genentech to expand coding programs, particularly for students from historically marginalized groups. The yearlong program helps beginners learn data science and machine learning skills in the context of research and industry and provides in-depth interview preparation.\n“My hope is that we can reach a lot of students, demystify machine learning and the biotech industry, and help students learn skills that open doors for them,” said Associate Professor of Biology Pleuni Pennings. She is one of the core SF State faculty behind gSTAR, along with Associate Professor Anagha Kulkarni and Professor Ilmi Yoon from Computer Science. The team — which developed SF State’s\nPromoting Inclusivity and Computing (PINC) program\n— worked with Genentech scientists to develop the new curriculum.\n“There seemed to be an unending pool of [Genentech] people who were interested to help out,” said Pennings, who was sometimes surprised to find herself in Zoom meetings with a dozen eager Genentech collaborators. Industry scientists provided real-world datasets and papers, recommended industry-relevant software and even helped Pennings with nitty-gritty details. Once the course started, they presented in classes, provided students with advice, participated in mock interviews and more.\n“I love my job but [gSTAR] is one of the best parts of my week,” said Spencer James, a principal data scientist at Genentech who, among other things, helped organize and run mock interviews in Kulkarni’s gSTAR class this semester. He admits that he himself did not gain a lot of this interview experience until his fellowship after undergrad.\n“Maybe I can do this, too”\nThe first cohort to finish the yearlong gSTAR program consisted of 14 students; 11 are also graduating from SF State. Of the nine females in the course, eight are people of color. Five students have accepted Genentech internships: three in the clinical imaging group and two in other groups.\ngSTAR student Fayeeza Shaikh sharing her gSTAR/PINC project\n“As a person who did not know what biotech was, to get interview prep and then finally get an internship, [gSTAR] was really eye opening for me …,” said sophomore Biology student Fayeeza Shaikh, who has lined up an internship with Genentech’s product quality and occupational toxicology group. “I’ve started building on my career because of this program.”\nShaikh and Phan, who both started out in the PINC program, had never interacted with industry scientists. But in gSTAR, scientists came directly to their class (via Zoom), giving students a chance to network and learn how these scientists navigated their own careers, with some even admitting their own bouts of imposter syndrome.\n“When we hear that, it kind of reassures us that maybe I can do this, too,” said Phan. She originally started her degree in 2011 but left to serve in the Navy for eight years. She returned to SF State in 2019 because she was still interested in going to school for science.\nWe can change biotech\nWorking with University students like Shaikh and Phan has left James excited for the future of Genentech and the whole biotech industry. Though he doesn’t recruit for Genentech, he’s also now reflecting on his responsibilities as an interviewer.\n“Going through this course helped me really think a lot about how to effectively conduct an interview … how to take students who have majored in different things, have different interests, different experiences and hopefully work with each candidate in a way that you really get at their passions and capabilities …,” he said.\nPennings is also excited by all they’ve accomplished but is aware that there’s more to do.\n“If we can make these skills attainable for a large number of people, I think we can change [students’] lives,” she said. “If we can show other people how it’s done, we can change the world of biology and biotech.”\nLearn more about\ngSTAR\nand the other\nPINC\nprograms.\nSubscribe to Certificate",
    "url": "https://cs.sfsu.edu/tags/tags/certificate",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/ai-staars-program",
    "category": "cs_general",
    "title": "AI-STAARS Program | Department of Computer Science",
    "content": "AI-STAARS Program\nArtificial Intelligence Scholarships\nFrom self-driving cars to smart speakers, AI is changing the way we work, learn, and communicate, and its role in our society is becoming increasingly critical.\nAI-STAARS Program\nArtificial Intelligence Scholarships that Improve Academic Achievement, Retention, and Career Success (AI-STAARS) is a program whose goal is to provide early AI exposure to computer science bachelors students.  AI-STAARS program also provides academic support and career coaching that the students need to graduate with a CS degree and ultimately take their place in this fast-growing field. No prior computer science or AI background is needed to participate in the program.\nThere are three key components are designed to facilitate students’ academic progress and to guide them with their future careers in Computer Science and Artificial Intelligence.\nAcademic and Career Advising\nA TGIF (Thank God Its Friday) series\nWinter and Summer break activities.\nNo Experience in CS or AI Necessary →\nAcademic Support & Mentorships →\nFun Hands-on AI Workshops →\nProfessional Development & Internships\nAI STAARS Program Objectives\nThe objectives of the AI-STAARS program are:\nTo improve information equity through intensive and tailored academic and professional advising\nTo increase the academic and professional self-efficacy through co-curricular activities that provide early AI exposure, career coaching, and research and industry experiences in AI\nTo develop students’ sense of belonging and identity as computer scientists by helping them become part of the CS community and by humanizing CS and AI via showcasing role models and social good projects.\nAI-STAARS is a year-long program that also offers scholarships based on financial need. Students will join during the Fall and continue until the Summer. Students in this program will engage in three key components:\nIntensive advising\nA TGIF (Thank God Its Friday) series\nWinter and Summer break activities.\nWhat will Advising involve?\nAcademic advising\n-\nLike many science and engineering bachelor's programs, SFSU’s CS major has a high unit load, and many required courses have two or more prerequisite courses. For such programs, it is imperative that students make steady progress through major courses to graduate on time, taking the right courses in the right order. Academic advising will keep students on track to graduate on time.\nCareer advising\n-  The advising component of AI-STAARS is designed to address the next career step. Students may be unaware of all the internship, job opportunities, or professional development events happening on campus because their busy lives (part-time/full-time jobs, commuter student status) prevent them from being aware. Career advisors will bridge the gap and address these problems by improving information equality for the scholars.\nCareer planning resources for students\n:\nJob Search Preparation\nSocial Media Guidance\nJob Search and Interview Prep\nWhat is the TGIF Series?\nTGIF series consists of 2-hour sessions on Friday afternoons during academic semesters (currently held virtually).\nMost sessions will consist of an AI-focused talk and a fun hands-on workshop.\nSome of the sessions will be dedicated to professional development activities (resume and professional profile building workshop, career panels, interview preparation workshops)\nWhat are the Winter and Summer activities for?\nOur\n1-week winter boot camp\nand\n10-week summer paths program\nwill provide AI-STAARS scholars with the combination of structure and flexibility they need to do well in their CS courses and get started on the path of AI careers\nWinter\n- In the Winter, AI-STAARS student will participate in a\n1-week boot camp\nto help students consolidate the concepts and skills they learned previously in the fall. This will help prepare and build the skills further so students can get ready for the spring semester. Students will work in groups with a mentor to work on topics they may have struggled with.\nSummer\n- In the Summer, after their first year of SF State coursework, the summer paths program will engage AI-STAARS scholars in external internships and REUs, or in opportunities to develop their CS/AI skills through research in different labs\nApplication\nApplications for the AI-STAARS Program has closed for the 2021-2022 academic year.  Please check back soon for the next application period.\nFaculty Team\nAI-STARRS Faculty Team Members\nName\nPosition\nContact Information\nAnagha Kulkarni\nProfessor\nak@sfsu.edu\nSanika Doolani\nAssistant Professor\nsanikadoolani@sfsu.edu\nXuhui Chen\nAssistant Professor\ntracychen@sfsu.edu\nShasta Ihorn\nAssistant Professor\nsihorn@sfsu.edu\nMichael Savvides\nProgram Manager\nmsavvides@sfsu.edu",
    "url": "https://cs.sfsu.edu/ai-staars-program",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/event/quantum-computing-what-it-exactly",
    "category": "cs_general",
    "title": "Quantum Computing: What is it, exactly? | Department of Computer Science",
    "content": "Quantum Computing: What is it, exactly?\nThursday, September 19, 2024\nEvent Time\n06:00 p.m.   -  07:00 p.m.\nPT\nCost\nLocation\nSEC 210\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nQuantum computing is a type of computation that uses the principles of quantum mechanics to process information. Unlike classical computers, which use bits (0 or 1), quantum computers use\nqubits\n, which can exist in superpositions of 0 and 1 simultaneously. This enables quantum computers to solve certain problems more efficiently. The introduction to quantum computing will introduce concepts like quantum state of qubits, programmatic manipulation of quantum state to perform computations, and an overview of the state of the field of quantum computing.\nSpeaker Biography\nE. Wes Bethel is an Associate Professor in the\nComputer Science Department at San Francisco State University\n, a Research Affiliate at\nLawrence Berkeley National Laboratory\n, and an\nACM Distinguished Member\n. His research interests include high performance computing, advanced computational architectures and technologies, quantum computing, data science, machine learning and its applications, scientific visualization, and computer graphics.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/quantum-computing-what-it-exactly",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/advanced-computational-technology-research",
    "category": "cs_general",
    "title": "Advanced Computational Technology Research | Department of Computer Science",
    "content": "Advanced Computational Technology Research\nIn advanced computational technology research our program explores High-Performance Computing (HPC) and Quantum Computing. In HPC, it optimizes algorithms and architectures to enable complex simulations and scientific breakthroughs. Simultaneously, in quantum computing, it investigates quantum algorithms, programming languages, and system performance to push the boundaries of computation for cryptography, optimization, and the sciences. This dual-focused program aims to harness both classical HPC and emerging quantum capabilities, accelerating scientific progress and solving computationally intensive problems at unprecedented speeds.\nAcademics and Coursework\nIn addition to broader requirements for a CS undergraduate or graduate degree, students may specialize their education around Advanced Computational Technology research topics via these undergraduate and graduate level courses:\nUndergraduate Courses\nCSC 630\nComputer Graphics Systems Design\nCSC 641\nComputer Performance Evaluation\nCSC 647\nIntroduction to Quantum Computing and Quantum Information Science\nCSC 656\nComputer Organization\nGraduate Courses\nCSC 746\nHigh Performance Computing\nCSC 747\nIntroduction to Quantum Computing and Quantum Information Science\nCSC 841\nComputer Performance Evaluation\nCSC 847\nCloud and Distributed Computing: Concepts and Applications\nCSC 878\nBig Data Platforms and Systems\nCSC 890\nGraduate Seminar – Quantum Computing\nCSC 895\nApplied Research Project\nCSC 897\nResearch\nCSC 898\nMaster's Thesis\nFaculty and Focus Areas\nWes Bethel\nHigh performance computing, quantum computing, scientific computing, computer graphics, scientific visualization, artificial intelligence/machine learning, computer vision/image analysis, computer organization and architecture\newbethel@sfsu.edu\nDaniel Huang\nProgramming languages, quantum computing, artificial intelligence/machine learning, computational chemistry\ndanehuang@sfsu.edu\nPublications and Reports\nSudhanshu Kulkarni and E. Wes Bethel. From Bits to Qubits: Challenges in Classical-Quantum Integration. 2024 IEEE 31th International Conference on High Performance Computing, Data, and Analytics (HiPC), Bangalore India, Dec. 2024.\nBalewski, J., Amankwah, MG, Beeumen, RV, Bethel, EW, Perciano, T., and Camps, D. (2024). Quantum-parallel vectorized data encodings and computations on trapped-ions and transmons QPUs. Nature Scientific Reports, 14(1).\nhttps://doi.org/10.1038/s41598-024-53720-x\nBurlen Loring, E. Wes Bethel, and Gunther Weber. Extensions to the SENSEI In situ Framework for Heterogeneous Architectures. In ISAV 2023: In Situ Infrastructures for Enabling Extreme-scale Analysis and Visualization, Denver, CO, USA, November 2023.\nDaniel Huang, E. Wes Bethel, Talita Perciano, Roel van Beeumen, and Daan Camps. Towards High- Level Quantum Programming Languages. In ASCR Basic Research Needs in Quantum Computing and Networking, 2023.\nTalita Perciano, Jan Balewski, Roel van Beeumen, E. Wes Bethel, Daan Camps, and Daniel Huang. A Quantum Approach for Efficient Biomedical Data Analysis. In ASCR Basic Research Needs in Quantum Computing and Networking, 2023.\nMercy Amankwah, Daan Camps, E. Wes Bethel, Roel Van Beeumen, and Talita Perciano. Quantum pixel representations and compression for N -dimensional images. Nature Scientific Reports, May 2022.\nE. Wes Bethel, Burlen Loring, Utkarsh Ayatchit, David Camp, Earl P. N. Duque, Nicola Ferrier, Joseph Insley, Junmin Gu, James Kress, Patrick O’Leary, David Pugmire, Silvio Rizzi, David Thompson, Gunther H. Weber, Brad Whitlock, Matthew Wolf, and Kesheng Wu. The SENSEI Generic In Situ Interface: Tool and Processing Portability at Scale. In Hank Childs, Janine Bennett, and Christoph Garth, editors, In Situ Visualization for Computational Science. Springer, 2022.\nE. Wes Bethel, Burlen Loring, Utkarsh Ayatchit, David Camp, Earl P. N. Duque, Nicola Ferrier, Joseph Insley, Junmin Gu, James Kress, Patrick O’Leary, David Pugmire, Silvio Rizzi, David Thompson, Gunther Weber, Brad Whitlock, Matthew Wolf, and Kesheng Wu. Proximity Portability and In Transit, M-to-N Data Partitioning and Movement in SENSEI. In Hank Childs, Janine Bennett, and Christoph Garth, editors, In Situ Visualization for Computational Science. Springer, 2022.\nPeer-Temo Bremer, Georgia Tourassi, E. Wes Bethel, Kelly Gaither, Valerio Pascucci, and Wei Xu.Visualization for Scientific Discovery, Decision-Making, and Communication. In Summary Report from the ASCR Workshop on Visualization for Scientific Discovery, Decision-Making, and Communication, United States, January 2022.\nB. Loring, E.W. Bethel, and K.J. Wu. Interfaces Supporting Data Management in Complex In transit Processing Workflows on Heterogeneous Systems with Deep Memory Hierarchies. In ASCR Workshop on the Management and Storage of Scientific Data, January 2022.\nE. W. Bethel, B. Loring, O. Rübel, G. Weber, N. Ferrier, J. Insley, V. Mateevitsi, S. Rizzi, P. O’Leary, U. Ayachit, C. Wetterer-Nelson, E. Duque, and B. Whitlock. A Well-Designed Interface is a Trojan Horse for New Capabilities in Data Management and Data-intensive Processing. In ASCR Workshop on the Management and Storage of Scientific Data, January 2022.\nG. H. Weber, E. W. Bethel, A. Butko, and John Shalf. Data Analysis on Heterogeneous Architectures at the “Edge” and Beyond. In ASCR Workshop on Visualization for Science, January 2022.\nE. Wes Bethel, Colleen Heinemann, and Talita Perciano. Performance Tradeoffs in Shared-memory Platform Portable Implementations of a Stencil Kernel. In Matthew Larsen and Filip Sadlo, editors, Eurographics Symposium on Parallel Graphics and Visualization, Zürich, Switzerland, June 2021.\nE. W. Bethel, B. Loring, O. Rübel, G. Weber, N. Ferrier, J. Insley, V. Mateevitsi, S. Rizzi, P. O’Leary, U. Ayachit, C. Wetterer-Nelson, E. Duque, and B. Whitlock. Fostering Interoperability and Increasing Scientific Productivity in Environments of Heterogeneous Software and Computational Platforms. In ASCR Workshop on the Science of Scientific-Software Development and Use, October 2021.\nH. Childs, S. Ahern, J. Ahrens, A. C. Bauer, J. Bennett, E. W. Bethel, et al.. A Terminology for In Situ Visualization and Analysis Systems. International Journal of High Performance Computing Applications,  August 2020.\nT. Perciano, C. Heinemann, D. Camp, B. Lessley, and E. W. Bethel. Shared-memory Parallel Probabilistic Graphical Modeling Optimization: Comparison of Threads, OpenMP, and Data-Parallel Primitives. In Proceedings of ISC High Performance 2020, Frankfurt, Germany, June 2020.\nBurlen Loring, Mathew Wolf, James Kress, Sergei Shudler, Junmin Gu, Silvio Rizzi, Jeremy Logan, Nicola Ferrier, and E. Wes Bethel. Improving Performance of M-to-N Processing and Data Redistribution in In Transit Analysis and Visualization. In Steffen Frey, Jian Huang, and Filip Sadlo, editors, Eurographics Symposium on Parallel Graphics and Visualization (EGPGV), Norrköping, Sweden, May 2020.\nGrants and Awards\nFrom Bits to Qubits: Challenges in Classical-Quantum Integration. 2024 IEEE 31th International Conference on High Performance Computing, Data, and Analytics (HiPC), Bangalore India, Dec. 2024.\nUS Department of Energy, Office of Advanced Scientific Computing Research. AQuA-DATA: Advanced Quantum Algorithms for Diverse Applications and Theoretical Advancements in Science. Oct 2024 -- Sep 2029. (SFSU PI: Bethel, SFSU Co-PI: Huang)\nU. S. Department of Energy, Office of Advanced Scientific Computing Research. Scalable Analysis Methods and In Situ Infrastructure for Extreme Scale Knowledge Discovery (SENSEI). Subaward from Lawrence Berkeley National Laboratory. Oct. 2022 – Sep. 2024. (PI: Bethel)",
    "url": "https://cs.sfsu.edu/advanced-computational-technology-research",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/cybersecurity-research",
    "category": "cs_general",
    "title": "Cybersecurity Research | Department of Computer Science",
    "content": "Cybersecurity Research\nOur cybersecurity research program is dedicated to advancing techniques, algorithms, and knowledge essential for protecting systems and data against threats. It delves into emerging threats such as data/model poisoning, eavesdropping, and privacy leakage while also bolstering intrusion detection systems. Through collaborative efforts, our researchers strive to develop robust cybersecurity solutions that protect privacy and ensure the integrity of digital assets.  This program aims to strengthen cyber defenses in an ever-evolving technological landscape.\nAcademics and Coursework\nIn addition to broader requirements for a CS undergraduate or graduate degree, students may specialize their education around Cybersecurity research topics via these undergraduate and graduate level courses:\nUndergraduate Courses\nCSC 415\nOperating System Principles\nCSC 645\nComputer Networks\nCSC 652\nIntroduction to Security and Data Privacy\nCSC 653\nNetwork Security\nCSC 675\nIntroduction to Database Systems\nGraduate Courses\nCSC 845\nAdvanced Computer Networks\nCSC 852\nIntroduction to Security and Data Privacy\nCSC 853\nNetwork Security\nCSC 890\nGraduate Seminar - Machine Learning for Cybersecurity\nCSC 895\nApplied Research Project\nCSC 897\nResearch\nCSC 898\nMaster's Thesis\nFaculty and Focus Areas\nHao Yue\nComputer network and system security\nhaoyue@sfsu.edu\nJingyi Wang\nCybersecurity and big data privacy\njingyiwang@sfsu.edu\nQun Wang\nCybersecurity, security for machine learning, wireless security\nqunwang@sfsu.edu\nPublications and Reports\nS. Jiang, J. Li, X. Zhang, H. Yue, H. Wu and Y. Zhou, \"Secure and Privacy-Preserving Energy Trading with Demand Response Assistance Based on Blockchain,\" in IEEE Transactions on Network Science and Engineering, doi: 10.1109/TNSE.2023.3321754. (2023)\nX. Zhang, J. Wang, H. Zhang, L. Li, M. Pan and Z. Han, \"Data-Driven Transportation Network Company Vehicle Scheduling With Users’ Location Differential Privacy Preservation,\" in IEEE Transactions on Mobile Computing, vol. 22, no. 2, pp. 813-823, 1 Feb. 2023, doi: 10.1109/TMC.2021.3091148.\nL. Li et al., \"Privacy Preserving Participant Recruitment for Coverage Maximization in Location Aware Mobile Crowdsensing,\" in IEEE Transactions on Mobile Computing, vol. 21, no. 9, pp. 3250-3262, 1 Sept. 2022, doi: 10.1109/TMC.2021.3050147.\nQ. Wang, H. Sun, R. Q. Hu and A. Bhuyan, \"When Machine Learning Meets Spectrum Sharing Security: Methodologies and Challenges,\" in IEEE Open Journal of the Communications Society, vol. 3, pp. 176-208, 2022, doi: 10.1109/OJCOMS.2022.3146364.\nX. Zhang et al., \"Data-Driven Caching With Users’ Content Preference Privacy in Information-Centric Networks,\" in IEEE Transactions on Wireless Communications, vol. 20, no. 9, pp. 5744-5753, Sept. 2021, doi: 10.1109/TWC.2021.3069763.\nQ. Wang, F. Zhou, R. Q. Hu and Y. Qian, \"Energy Efficient Robust Beamforming and Cooperative Jamming Design for IRS-Assisted MISO Networks,\" in IEEE Transactions on Wireless Communications, vol. 20, no. 4, pp. 2592-2607, April 2021, doi: 10.1109/TWC.2020.3043325.\nS. Jiang, X. Zhang, J. Li, H. Yue and Y. Zhou, \"Secure and Privacy-preserving Energy Trading Scheme based on Blockchain,\" GLOBECOM 2020 - 2020 IEEE Global Communications Conference, Taipei, Taiwan, 2020, pp. 1-6, doi: 10.1109/GLOBECOM42002.2020.9348246.\nDing, Jiahao, et al. \"Towards plausible differentially private ADMM based distributed machine learning.\"\nProceedings of the 29th ACM International Conference on Information & Knowledge Management\n. 2020.\nR. Chen, X. Zhang, J. Wang, Q. Cui, W. Xu and M. Pan, \"Data-Driven Small Cell Planning for Traffic Offloading with Users’ Differential Privacy,\" ICC 2020 - 2020 IEEE International Conference on Communications (ICC), Dublin, Ireland, 2020, pp. 1-6, doi: 10.1109/ICC40277.2020.9149254.\nQ. Wang, H. Hu, H. sun and R. Q. Hu, \"Secure and Energy-Efficient Offloading and Resource Allocation in a NOMA-Based MEC Network,\" 2020 IEEE/ACM Symposium on Edge Computing (SEC), San Jose, CA, USA, 2020, pp. 420-424, doi: 10.1109/SEC50012.2020.00063.\nGrants and Awards\nUncover the Ghost: Deep Learning based Spammer Detection on Twitter, Principal Investigator (Hao Yue), $10,000, SFSU ORSP Small Grant, 08/16/2018-08/15/2019.\nPrivacy-Preserving Medical Data Access in Future eHealth Systems, Principal Investigator (Hao Yue), $5,000, SFSU Center for Computing in Life Sciences (CCLS), 02/01/2016-01/31/2017.",
    "url": "https://cs.sfsu.edu/cybersecurity-research",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/event/gamification-and-playful-design-exploring-design-space-business-teaching-and-sports",
    "category": "cs_general",
    "title": "Gamification and Playful Design: Exploring the Design Space for Business, Teaching, and Sports | Department of Computer Science",
    "content": "Gamification and Playful Design: Exploring the Design Space for Business, Teaching, and Sports\nWednesday, February 26, 2025\nEvent Time\n03:00 p.m.   -  04:00 p.m.\nPT\nCost\nLocation\nSEC 210\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nPlayful design and gamification are methods that incorporate elements from video games (such as levels, achievements, or avatars) to enhance the appeal of real-world applications. By leveraging such features, playful design and gamification can drive participation, improve user experiences, and create lasting behavioral changes. These methods have potential applications in several fields, including business, education, and even in physical training and rehabilitation. Despite long-standing successful examples, such as bonus programs or step counters in smartwatches, their full potential remains underutilized.\nIn this seminar, we will explore several best practices from both design courses and real-world applications. Additionally, we will examine the foundational models of current solutions and delve into the psychological and cognitive aspects of gamification and playful design, such as motivation, engagement, and task load.\nSpeaker Biography\nOliver Korn is a professor of Human Computer Interaction (HCI) at Offenburg University, Germany, and founder of the Affective & Cognitive Institute (ACI). He is also dean for research and directs the OGFLab startup center. A certified project manager and Senior Member of ACM, his research includes Context-aware Systems, Assistive Technologies, Affective Computing, Virtual Worlds, and Gamification.\nAt ACI, he leads an interdisciplinary team to create intuitive systems that adapt to users’ contexts and emotional states, focusing on engagement and enjoyment. A special focus lies on vulnerable groups. He established the bachelor’s program “Virtual Worlds & Game Technologies” in 2023 to align with this vision.\nHis research has been featured in ACM CHI, ASSETS, and many more. He has edited two Springer books, produced a science comic, and chaired ACM PETRA (2018–2021).  Currently, he is a visiting professor at the School of Information at UC Berkeley.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/gamification-and-playful-design-exploring-design-space-business-teaching-and-sports",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/event/graduate-seminar-application-mathematical-modeling-and-machine-learning-optimizing-network",
    "category": "cs_graduate",
    "title": "Graduate Seminar: Application of Mathematical Modeling and Machine Learning for Optimizing Network Design and Operation | Department of Computer Science",
    "content": "Graduate Seminar: Application of Mathematical Modeling and Machine Learning for Optimizing Network Design and Operation\nTuesday, October 31, 2023\nEvent Time\n01:00 p.m.   -  02:00 p.m.\nPT\nCost\nLocation\nZoom\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nNetwork architectures can be found in many structures ranging from natural phenomena to computer systems. My research centers on the study and design of algorithms for the simulation and optimization of network structures using various methods including mathematical modeling, graph theory and machine learning. In this talk, I present selected findings from our research on routing optimization in heterogeneous wireless communication networks deployed in challenged environment, such as the deep space. I also present the ongoing work on the simulation of metabolic networks to build a deep mechanistic understanding of the interplay between key environmental growth conditions and the ability of plants’ metabolism to manage the flow of energy, carbon, and nitrogen.\nBiography of Speaker\nSara El Alaoui is a postdoctoral researcher at Argonne National Lab conducting research in the field of computational biology. She received her Ph. D. in Computer Engineering and her Master’s in Computer Science from the University of Nebraska-Lincoln (UNL). Her current research focuses on building a deep mechanistic understanding of plants’ metabolism ability to manage the flow of energy, carbon, and nitrogen through simulation. She has designed and built analytical processes and simulators for metabolic networks using state of the art tools. Her work has been presented and published in multiple flagship conferences and peer-reviewed journals. In recognition of her research contributions, she has received multiple awards, including UNL's Othmer Fellowship for exceptional scholars seeking a terminal degree, the Dean's Fellowship, and CSE Outstanding Master’s Thesis Award. Along with her research, Sara has served as a Teaching Assistant and lab instructor in a number of Computer Science courses. She has also received the Center for the Integration of Research, Teaching and Learning (CIRTL) Certificate from UNL.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/graduate-seminar-application-mathematical-modeling-and-machine-learning-optimizing-network",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/people/isabel-hyo-jung-song",
    "category": "cs_faculty",
    "title": "Isabel Hyo Jung Song | Department of Computer Science",
    "content": "Isabel Hyo Jung Song\nAssociate Professor\nUndergraduate Advisor\nPhone:\n(415) 338-7688\nEmail:\nhjsong@sfsu.edu\nLocation:\nThornton Hall 909\nIsabel Hyo Jung Song LinkedIn\nBiography\nAreas of Expertise\nMobile Computing\nSoftware Engineering\nEntrepreneurship\nOn-device AI\nMachine Learning\nPublications\nS. Mostafa*, Isabel HJ Song, N. Strauli**, N. Sewde**, M. Friesenhahn**, M. Usdin**, X. Jia**, “A framework for predicting progression in primary progressive multiple sclerosis using machine learning and statistical methods”, IEEE Bioinformatics and Biomedicine(BIBM), Dec. 2021. (* denotes a student that I mentored from SFSU and ** denotes staff at Genentech I collaborated with.)\nT. Touati*, K. Okada**, Isabel HJ Song, “What makes a person obese? :An individual-level analysis of obesity”, IEEE Biomedical and Health Informatics (BHI), Jul. 2021. (* denotes a student that I mentored from SFSU, and ** denotes a SFSU faculty I collaborated with.)\nJa-Hee Kim**, Chanhyuk Park, Isabel HJ Song, “An Empirical Analysis of the Benefits of Agile Process”, Journal of Information Technology Services, Mar. 2021 (** denotes a visiting scholar at SFSU I collaborated with.)\nU Khyoi Nu*, Tahar Touati*, Srushti Buddhadev*, Ruopen Sun, Matthew Smuck, and Isabel HJ Song, “Who is physically active? : Classification and analysis of Physical activity using NHANES data”, IEEE Symposium Series on Computational Intelligence, Dec 2020. (* denotes students that I mentored from SFSU.)\nIsabel HJ Song, W. Yazar, A.Tsang*, The self-upgrading mobile application for the automatic malaria detection, 10th Annual Computing and Communication Workshop and Conference, 2020. (* denotes students that I mentored from SFSU)",
    "url": "https://cs.sfsu.edu/people/isabel-hyo-jung-song",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/people/hui-yang",
    "category": "cs_faculty",
    "title": "Hui Yang | Department of Computer Science",
    "content": "Hui Yang\nProfessor\nPhone:\n(415) 338-2221\nEmail:\nhuiyang@sfsu.edu\nLocation:\nThornton Hall 966\nHui Yang Website\nBiography\nAreas of Expertise\nData Mining\nText Mining and Information Extraction with a Current Focus in Biomedical Application\nProtein Structure Analysis\nAwards\nGE Predix Challenge Grant, $10,000, 2017\nCollaborative research project with IBM Almaden on annotating and extracting entities and relationships in biomedical articles. January 2013-February 2014. Budget: $20,000.\nCollaborative research project with Genentech on curating bio-entities and software testing and quality assessment. October 2011—June 2012. Budget: $10,000.\nPublications\nA Systematic study of eleven feature selection algorithms and their impact on the text classification task, Suchi Vora** and Hui Yang. IEEE Computing Conference 2017, July 18-20, 2017, London.\nTwo Simple and Effective Ensemble Classifiers for Twitter Sentiment Analysis. Yeqing Yan**, Hui Yang, and Hui-ming Wang. IEEE Computing Conference 2017, July 18-20, 2017, London.\nA Multifaceted Data Mining Approach to Understanding What Factors Lead College Students to Persist and Graduate, Aparna Gopalakrishnan**, Hui Yang, Celia Graterol, Rama Kassed, Mary Beth Love, and Alycia Shada. IEEE Computing Conference 2017, July 18-20, 2017, London.\n\"Structuring unstructured clinical narratives in OpenMRS with medical concept extraction,\" Ryan M. Eshleman*, Hui Yang and Barry Levine. In the proceedings of the IEEE International Conference on Bioinformatics and Biomedicine (BIBM2015) (industrial track). November 2015, Washington DC.",
    "url": "https://cs.sfsu.edu/people/hui-yang",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/news-list",
    "category": "cs_general",
    "title": "News Listing | Department of Computer Science",
    "content": "News Listing\nSeptember 25, 2025\nSFSU is first CSU campus to join IBM Quantum Network\nIBM quantum resources open doors for hands-on learning and workforce readiness\nSan Francisco State University is the first C…\nSeptember 11, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nOn August 20, 2025, the Kumo AI Hackathon took place in San Francisco. The CIDER Lab students Binrong Zhu, Guiran Liu, and Y…\nAugust 28, 2025\nAnnouncement of Two New Grants Awarded From NSF\nGrant 1\nCollaborative Research: CISE Core Small: NeTS: Intelligent Reflecting Surface Assisted Physical Layer Security Enhan…\nAugust 26, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nWe are pleased to announce that CS Professor Jozo Dujmovic’s new AI book -- Graded Logic: Modeling Human Commonsense Reasoni…\nAugust 01, 2025\nNew Undergraduate Certificate in Generative Artificial Intelligence: Technology, Applications, and Ethics\nThe Department of Computer Science is proud to announce the launch of a new Undergraduate Certificate in Generative Artifici…\nFebruary 17, 2025\nProfessor Dragutin Petkovic presented a keynote speech at IEEE CCWC Conference in Las Vegas January 8, 2025 on \"GenAI and Education\"\nProfessor Dragutin Petkovic delivered a keynote speech on January 8, 2025, at the IEEE Computing and Communication Workshop…\nDecember 02, 2024\nNew Department of Defense, Energy grants prepare SFSU students for industry jobs\nThe grants expand research opportunities in engineering, robotics and quantum computing\nTechnology is constantly evolving, w…\nOctober 07, 2024\nInstructor Joseph Hui Featured on CBS News for Commitment to Helping Youth\nJoseph Hui, an instructor here at SFSU has been featured on CBS News for turning his passion for bikes into a mission to sup…\nSeptember 25, 2024\nBethel, Huang Awarded U.S. Department of Energy Research Grant in Quantum Computing\nThe U.S. Department of Energy (DOE) Office of Advanced Scientific Computing Research recently awarded a $250,000, five-year…\nJuly 09, 2024\nSan Francisco State University Lecturer Duc Ta Earns Prestigious Teaching Award\nSFSU Recognizes Excellence in Teaching with Award to CS Lecturer\nSan Francisco State University's Computer Science Departmen…\nJuly 09, 2024\nSan Francisco State Honors Computer Science Graduates at 2024 Ceremony\nSFSU Celebrates its Newest Class of Graduates\nSan Francisco State University's Computer Science Department hosted a Gradua…\nApril 15, 2024\nIn-person hackathon makes triumphant return to campus\nSF Hacks was a nonstop weekend filled with ‘hacking,’ friendly competition, networking, karaoke and Bob Ross\nWhat is a hacka…\nMarch 04, 2024\nKulkarni Lab Receives Grant from Smith-Kettlewell Eye Research Institute\nFebruary 27, 2024\nAI-STAARS Program Awards Scholarships to 20 Computer Science Freshman\nAI-STAARS stands for Artificial Intelligence Scholarships that Improve Academic Achievement, Retention, and Career Success.…\nFebruary 27, 2024\nComputer Science, Biology, and Psychology Faculty Receive a Renewal Award from Genentech Inc.\nAnagha Kulkarni (CS), Ilmi Yoon (CS), Pleuni Pennings (Biology), and Shasta Ihorn (Psychology) have received a renewal award…\nFebruary 19, 2024\nComputer Science Researchers Receive U.S. Department of Energy Grant\nDecember 04, 2023\nSF State program prepares participants to view AI through an ethical lens\nThe Ethical AI certificate provides a foundation in the computer science, philosophy and business of ethical AI\nU.S. Preside…\nNovember 15, 2023\nCISCO @ SFSU\nOver 100 SFSU Computer Science students indicated interest in attending a professional development workshop hosted by CISCO…\nNovember 03, 2023\nCISCO Meraki Campus Visit\n40 SFSU Computer Science students had the opportunity to visit the CISCO Merkai Campus in downtown San Francisco. In collabo…\nSeptember 29, 2023\nFall 2023 Engineering and Computer Science Career Fair\nThis year’s Engineering and Computer Science Career Fair took place on September 29, 2023, in the Annex. This event was host…\nSeptember 26, 2023\nOpen Faculty Position in CS Department\nSan Francisco State University, Department of Computer Science offers an exciting opportunity for two tenure-track Assistant…\nSeptember 22, 2023\nCS Department College Tour\nThe Computer Science Academy at Oakland Technical High School coordinated a campus visit with several of our majors to learn…\nAugust 31, 2023\nInaugural Meeting of SFSU’s ACM CS Research Special Interest Group\nIn conjunction with the CS ACM student chapter and its Treasurer and former president, Mark Kim, Professors Daniel Huang and…\nMay 28, 2023\nCS Department Graduation Celebration 2023\nTo celebrate the achievements of our Computer Science students, the department held a Graduation Celebration for all CS unde…\nMay 28, 2023\nProf. Daniel Huang Recipient 2023 Petkovic Family Teaching Excellence Award\nProf. Daniel Huang of the SFSU Computer Science Department is the recipient of the 2023 Petkovic Family Teaching Excellence…\nMay 15, 2023\nEthical AI Certificate Presentation Awarded at the AAAI Symposium (2023)\nComputer science professor Dragutin Petkovic, alongside philosophy professor Carlos Montemayor and business management profe…\nMay 08, 2023\nLeaping Into the World of Computer Science with the help of Google’s CSRMP\nThe CS Department would like to congratulate SFSUs own Purva Zinjarde, on their acceptance into the Google CS Research Mento…\nJune 01, 2022\nBiotech Certificate Students get Insider Peek into Industry Jobs\nThe gSTAR program is only one year old, but the SF State-Genentech collab is already impacting students, faculty and industr…\nDecember 16, 2020\nSF State Science Coding Programs Boost Biotech Diversity\nGrants impact SF State’s computer science diversity efforts with new certification programs and scholarships\nDespite the San…\nAugust 28, 2018\nBuild the Diverse, Multidisciplinary Computer Science Workforce of the Future\nDeveloping a Computing Application Minor and an Inclusive Learning Environment to Build the Diverse, Multidisciplinary Compu…",
    "url": "https://cs.sfsu.edu/news-list",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/news/professor-jozo-dujmovic-authors-new-ai-book-springer-nature",
    "category": "cs_general",
    "title": "Professor Jozo Dujmovic authors new AI book from Springer Nature | Department of Computer Science",
    "content": "Professor Jozo Dujmovic authors new AI book from Springer Nature\nAuthor:\nE. Wes Bethel\nAugust 26, 2025\nWe are pleased to announce that CS Professor Jozo Dujmovic’s new AI book -- Graded Logic: Modeling Human Commonsense Reasoning in Decision-Making and AI – was just released by Springer as part of the Intelligent Systems Reference Library.\nRead more about this book here\n.\nContact: Prof Jozo Dujmovic,\njozo@sfsu.edu\nRelated News\nSFSU is first CSU campus to join IBM Quantum Network\nSeptember 25, 2025\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nSeptember 11, 2025\nAnnouncement of Two New Grants Awarded From NSF\nAugust 28, 2025\nProfessor Jozo Dujmovic authors new AI book from Springer Nature\nAugust 26, 2025",
    "url": "https://cs.sfsu.edu/news/professor-jozo-dujmovic-authors-new-ai-book-springer-nature",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "https://cs.sfsu.edu/event/beyond-lens-detecting-bias-through-eye-tracking-measurements-and-computer-vision-techniques",
    "category": "cs_general",
    "title": "Beyond the Lens: Detecting Bias through Eye-Tracking Measurements and Computer Vision Techniques | Department of Computer Science",
    "content": "Beyond the Lens: Detecting Bias through Eye-Tracking Measurements and Computer Vision Techniques\nThursday, November 21, 2024\nEvent Time\n11:00 a.m.   -  12:00 p.m.\nPT\nCost\nLocation\nLIB 286\nContact Email\ncs-dept@sfsu.edu\nOverview\nAbstract\nThis presentation investigates ethnocentric biases faced by refugee populations through empirical human-computer interaction (HCI) research. Using eye-tracking techniques, we analyzed participant responses to various images, revealing nuanced biases: participants favored certain refugees in complete images but shifted preferences based on text labels. This highlights how context influences perceptions of refugee identity.\nAdditionally, we explore the connection between authentic representations and increased support, demonstrating the potential of computer vision for social good. The study also employs art as a stimulus to untrain gender biases, emphasizing the importance of thoughtful representation in fostering inclusivity in discussions about marginalized communities.\nSpeaker Biography\nDr. Nada Attar earned her Ph.D. in Computer Science from the University of Massachusetts. She also holds an M.S. in Computer Science from Tufts University and a BSc. in Computer Science from King Abdulaziz University. Following her doctoral studies, she served as a Postdoctoral Research Fellow at Harvard University, specifically at the Mass. Eye & Ear Institute and the Schepens Eye Research Institute, Bowers Lab, in Boston, MA.\nDr. Attar’s research focuses on Computer Vision, Ethics in AI, and Human-Computer Interaction (HCI). She has contributed to various projects, including eye-tracking for automated vehicles, HCI for cognitive state measurement, and addressing gender and ethnic bias for social good. Her work also explores computer vision applications in climate change and coastal resilience, as well as ethical AI models that investigate biases in datasets, algorithms, and user behavior.\nShe is a recipient of the Mozilla Responsible Computing Challenge Award for her team’s work on CIRCLE: Cross-Campus Interdisciplinary Responsible Computing Learning Experiences.\nUpcoming Events\nMore events coming soon!",
    "url": "https://cs.sfsu.edu/event/beyond-lens-detecting-bias-through-eye-tracking-measurements-and-computer-vision-techniques",
    "domain": "cs.sfsu.edu"
  },
  {
    "source": "http://cs.sfsu.edu",
    "category": "cs_general",
    "title": "Welcome | Department of Computer Science",
    "content": "Welcome\nResearch\nOur faculty and students are engaged in projects and research in many areas of Computer Science. Major areas of focus include Computing for Life Sciences, Soft Computing and Decision Support Systems, Software Engineering and Systems, Human Computer Interaction and more.\nExplore CS Research\nGraduate Program\nCS Department offers a Master of Science (MS) degree. Faculty and students are engaged in innovative research projects, many funded by grants from government or industry such as NSF and NIH, IBM Research, Microsoft, Amazon Web Services, Emulex, Claritics.\nExplore CS Graduate Programs\nUndergraduate Program\nWe are committed to providing the opportunity to master the Computer Science discipline to students from all backgrounds. Our program combines strong fundamentals, project- and team- oriented activities, and soft skills, leading to a well-rounded professional education.\nExplore CS Undergraduate Programs\nCS @ SF State Highlights\nWe Are Hiring!\nSan Francisco State University's Computer Science Department in the College of Science and Engineering offers an exciting opportunity for a tenure-track Assistant Professor position beginning August 2026. We seek a colleague whose teaching and research interests include Cybersecurity, Machine Learning/Generative AI, and/or Quantum Computing although candidates with research interests in other areas are also welcome to apply. We are especially interested in qualified candidates with a demonstrated commitment -- through their research, teaching, and service -- to the excellence of our academic program and community.\nFor best consideration, please apply by 1/31/2026.\nApply Here.\nStudent Spotlight - Diversity and Equity\nSF State Science Coding Programs Boost Biotech Diversity\nGrants impact SF State’s computer science diversity efforts with new certification programs and scholarships. The importance of diversity and equity in computer science is important to the CS Department and faculty members' efforts have recently received recognition from both academia and the biotech industry.\nReview Diversity Grant Efforts\nStudent Spotlight - Graduate Certificates Options\nEthical Artificial Intelligence & Software Engineering\nCS Department announces two new Graduate Certificates in Ethical Artificial Intelligence and Software Engineering. Learn about the certificates, the eligibility processing and how to apply.\nView Grad Certificates Options\nNews\nSFSU is first CSU campus to join IBM Quantum Network\nIBM quantum resources open doors for hands-on learning and workforce readiness\nSan Francisco State University is the first C…\nCIDER Lab Wins First Prize at Kumo AI Hackathon\nOn August 20, 2025, the Kumo AI Hackathon took place in San Francisco. The CIDER Lab students Binrong Zhu, Guiran Liu, and Y…\nAnnouncement of Two New Grants Awarded From NSF\nGrant 1\nCollaborative Research: CISE Core Small: NeTS: Intelligent Reflecting Surface Assisted Physical Layer Security Enhan…\nMore News\nMore events coming soon!\nMore Upcoming Events",
    "url": "http://cs.sfsu.edu",
    "domain": "cs.sfsu.edu"
  }
]