[
  {
    "source": "https://gallery.sfsu.edu/",
    "category": "general",
    "title": "Fine Arts Gallery | College of Liberal & Creative Arts",
    "content": "Welcome to the Fine Arts Gallery\nThe Fine Arts Gallery presents both professional and student-oriented exhibitions every semester. Professional exhibitions are organized to spotlight the range and diversity of both contemporary and historical art. Open Tuesday through Friday, noon to 4 p.m., during exhibitions.\nAnnouncements and Exhibitions\nNews\nMay 27, 2025\nBeads & Belonging Exhibition open through September 4, 2025\nGuest curated by SFSU alum Kristina Singleton (MA Museum Studies 2025), Beads & Belonging explores explores the ways bea…\nApril 10, 2025\nMFA Thesis Exhibition Open Saturday, May 10, 12noon to 4pm\nJoin us on Saturday, May 10 for weekend viewing of Autonomous Zones, SFSU School of Art's 2025 MFA Thesis Exhibition. You ca…\nApril 10, 2025\nMFA Thesis Exhibition Opens Friday, April 25, 5 to 8pm\nJoin us for the opening reception for Autonomous Zones, SFSU School of Art's 2025 MFA Thesis Exhibition.\nArtists: Lucia Gonz…\nMore News\nEvents\nSep\n27\nIN PROGRESS: Proxies, Prototypes and Maquettes\nSat, September 27, 12:00 pm\nFine Arts Gallery, FA238\nDec\n02\n38th Annual Stillwell Student Exhibition\nTue, December 02, 04:00 pm\nFine Arts Gallery, FA238\nMore Upcoming Events\nLearn About the Gallery\nAbout the Gallery\nMartin Wong Gallery\nExhibitions\nThe vision of the Fine Arts Gallery is to serve a broad and varied audience that includes students, faculty and staff of the University, along with the local arts community and the greater population of the region, while carrying out a program that reflects the range of disciplines taught by San Francisco State University's School of Art.\nThe mission of the Martin Wong Gallery is to provide San Francisco State University's student artists the opportunity to exhibit works and organize and present exhibitions. This program is made possible through the generous support of the Martin Wong Foundation and SF State’s Instructionally Related Student Activities Fund.\nThe Fine Arts Gallery program typically features group exhibitions conceived by School of Art faculty that explore different dimensions of California contemporary art, annual student exhibitions and a faculty exhibition once every four years.",
    "url": "https://gallery.sfsu.edu/",
    "domain": "gallery.sfsu.edu"
  },
  {
    "source": "https://gallery.sfsu.edu/event/progress-proxies-prototypes-and-maquettes",
    "category": "general",
    "title": "IN PROGRESS: Proxies, Prototypes and Maquettes | Fine Arts Gallery",
    "content": "IN PROGRESS: Proxies, Prototypes and Maquettes\nSaturday, September 27, 2025\nEvent Time\n12:00 p.m.   -  04:00 p.m.\nPT\nCost\nFree\nLocation\nFine Arts Gallery, FA238\nContact Email\nfineartsgallery@sfsu.edu\nOverview\nOpening Reception: Saturday, September 27,  1 to 3 p.m.\nExhibition dates: September 27 – October 23, 2025\nRegular gallery hours: Tuesday – Friday, noon – 4 p.m.\nFREE\nModels and maquettes are essential in artistic production, often serving as small-scale versions of larger projects for practical reasons. Bypassing real-world constraints like size, cost, and safety, these prototypes and mock-ups enable vivid experimentation and exploration of ideas. This group exhibition forefronts the creativity and beauty of these objects, celebrating the hidden processes of artistic practice.\nCurated by Kevin B. Chen and featuring: Michael Arcega; Mark Baugh-Sasaki; Chris Dorosz; Linda Fleming; Elina Frumerman; Dana King; Phoebe Leung; Adrien Segal; Banker White & Anna Fitch & Simon Cheffins; Selections from SFMOMA's model room.\nUpcoming Events\nIN PROGRESS: Proxies, Prototypes and Maquettes\nSaturday, September 27, 2025\n38th Annual Stillwell Student Exhibition\nTuesday, December 02, 2025",
    "url": "https://gallery.sfsu.edu/event/progress-proxies-prototypes-and-maquettes",
    "domain": "gallery.sfsu.edu"
  }
]