[
  {
    "source": "https://catalyze.sfsu.edu/catalyze",
    "category": "general",
    "title": "Catalyzing Our Students' Futures | Catalyze the Future",
    "content": "BE A CATALYST!\nThe new Science & Engineering Innovation Center will transform STEM education\nGive to the Catalyze the Future campaign\nCatalyzing Our Students' Futures\nSan Francisco State University's future\nScience & Engineering Innovation Center\nwill enable cutting-edge, high-level exploration of the physical world and nurture expertise and equity in the STEM fields. Home to the School of Engineering and Department of Chemistry & Biochemistry, the Innovation Center replaces an outdated science building that was built in the 1950s and will feature state-of-the-art research and educational labs, studio-style learning, and workforce-relevant technology. The Innovation Center is due to be completed in 2024 and is a core component of the University’s strategy to reinvigorate and update its science and engineering programs to meet the workforce needs of the Bay Area and California STEM industries.\nThe Science & Engineering Innovation Center is designed to achieve Leadership in Energy and Environmental Design (LEED) Gold certification. Sustainable characteristics include:\n100% all-electric building with an active mechanical heat recovery system\n25% reduction of storm water runoff from the existing site\nHigh-reflectivity cool roof\nHigh-performance glazing\nLow-flow plumbing fixtures\nAdvanced lighting controls\nCalifornia State University has dedicated $150 million to the construction of SF State’s new Innovation Center. The University's\nCatalyze the Future\ncampaign will build on this funding, raising $25 million from private sources to provide leading-edge research equipment and technology in the Innovation Center. Campaign funds will also support student success initiatives and programming in the new facility.\nThe Science & Engineering Innovation Center: Educating the Workforce of Tomorrow\nInnovative Design Promoting Curiosity and Facilitating Collaboration\nLeading-Edge Science & Engineering Labs and Classrooms\nScience on Display: Flexible and Inclusive Classrooms and Research Labs\nMore about the Center\nSee What's Inside the Center\nCollege of Science & Engineering (CoSE)\nCoSE serves a student population that reflects the diversity of the region and includes many international students. The College offers more than\n7,300 students\nan academic experience of \"thinking, learning and doing\" each year in programs that are designed to encourage and support all students in pursuing careers in science and engineering.\nThe College of Science & Engineering had a 40% rise in student enrollment between 2011 and 2021. In 2011, the college served 5,298 students, 35% were Asian American & Pacific Islander, 26% were White, 21% were Latina/o/x, 13% were defined as \"other\" and 5% were African American. In 2021, the college had 7,437 students, with 37% being Latina/o/x, 34% American & Pacific Islander, 15% White, 9% other, and 5% African American. 48% of students in Fall 2021 were women, and 38% of CoSE students in Fall 2021 were Pell Grant eligible.\nLEARN MORE ABOUT THE COLLEGE OF SCIENCE & ENGINEERING\nContact Associate Vice President of University Development Anjali Billa to learn about naming opportunities and to become a donor to the Science & Engineering Innovation Center:\nanjalibilla@sfsu.edu\nor (415) 405-3625.",
    "url": "https://catalyze.sfsu.edu/catalyze",
    "domain": "catalyze.sfsu.edu"
  }
]