[
  {
    "source": "https://at.sfsu.edu/?utm_source=mass_mailer&utm_medium=email&utm_content=1260581&utm_campaign=uni_targeted_emails",
    "category": "general",
    "title": "Academic Technology is Here to Help | Academic Technology",
    "content": "Academic Technology is Here to Help\nWhat's New in AT\nOctober 06, 2025\nDigital Media Studio & MakerSpace: October events\nThe Digital Media Studio & MakerSpace hosts events and workshops, and is also available for drop-in exporation.\nJoin us…\nSeptember 22, 2025\nCSU AI Survey for Students, Faculty and Staff\nStarting Monday, September 22, through Monday, October 6, 2025, SFSU students, faculty and staff are invited to provide thei…\nSeptember 19, 2025\nSFSU now an Adobe Creative Campus, expanding access for Students and Employees\nThe California State University (CSU) system has officially launched a groundbreaking systemwide initiative that significant…\nSeptember 08, 2025\nDigital Media Studio & MakerSpace: September events\nThe Digital Media Studio & MakerSpace hosts events and workshops, and is also available for drop-in exporation (hours ar…\nAugust 25, 2025\nAcademic Technology Updates: Fall 2025\nAcademic Technology (AT) welcomes you to Fall 2025! As you prepare to start a new semester, please note the following announ…\nAugust 18, 2025\nAI Literacy Education Program: Fall 2025 courses now available\nThe AI Literacy Education Program equips the SFSU community with essential knowledge and…\nRead all news and announcements from AT\nSupport\nQuick Links\nMore from AT\nContact Academic Technology\nPhone\n: (415) 405-5555\nEmail\n:\nat@sfsu.edu\nOffice\n: LIB 80 | Appointments\navailable via Outlook\nFall & Spring Hours\n8:00 a.m. - 8:00 p.m.\nWinter & Summer Hours\n8:00 a.m. - 5:00 p.m.\nLog in to Canvas\nClassrooms Database\nGuides via ATHelp\nService Status page\nDigital Media Studio & MakerSpace\nAT on YouTube\nView recorded webinars, how-to videos, and much more on AT's Youtube channel.\nOne Little Thing\nFrom enhancing course engagement to streamlining grading tasks and harnessing the power of in-classroom technology, these bite-sized tutorials promise to revolutionize your approach to education,\none little thing\nat a time.\nFogCam!\nTune in to the world's longest running webcam, maintained by Academic Technology.\nEvents\nOct\n03\nCSU x Adobe Apprenticeship Information Session: Jump Start Your Career!\nFri, October 03, 12:00 pm\nZoom, streaming in LIB 260\nOct\n07\nDigital Media Studio & MakerSpace Open House\nTue, October 07, 02:00 pm\nLIB 260\nOct\n08\nImage Creation with Generative AI\nWed, October 08, 02:00 pm\nZoom\nOct\n09\nVR & Retro Game Day\nThu, October 09, 03:00 pm\nLIB 260\nOct\n13\n360 Video Workshop\nMon, October 13, 04:30 pm\nLIB 260\nMore Upcoming Events\nView all AT Events\nAT Services\nClassroom Technology\nAT supports the design, installation and support of all classroom technology, campus wide. That includes projectors, speakers, cable connections, document cameras and more.\nView classroom technology services\nIT & Desktop Support\nAT provides anytime, anywhere access to research and teaching software; check out laptops and peripherals to faculty and staff; desktop computer and website support for participating units within Academic Affairs.\nView IT & desktop support services\nLearning Technologies\nAT develops, optimizes and supports a variety of technologies used for teaching and learning, including the Canvas learning management system, Zoom web conferencing, Syllabus management tool, and more.\nView learning technology services\nTeaching & Learning with Technology\nAT provides support for the equitable use of technology for teaching and learning, including access to the latest and most effective resources from the CSU.\nView instructional design services\nStudent Resources\n- Technology\nCanvas Support\nContact Academic Technology Services for Canvas, or other teaching and learning with technology questions.\nVisit Canvas Support\nGenerative AI @ SFSU\nGenAI website (ai.sfsu.edu)\nAI Tools (ai.sfsu.edu/tools)\nAfter an extensive review of the TAR process, BuyIT aims to help streamline tasks for both reviewers and members of the campus community who need to get approval for technology purchases.\nLearn more about BuyIT\n.\nGet the latest from AT\nATCentral - Subscribe Now!\nInstructional Continuity\nAT Events Listserv\nGet the latest from Academic Technology, delivered straight to your inbox!\nFor more on service availability and maintenance windows, updates to service hours, the latest on Canvas, and so much more,\nsubscribe today\n!\nThe campus has launched an Instructional Continuity website for instructors and students to learn about teaching and learning using remote modalities.\nVisit the\nInstructional Continuity site\nto find out more.\nSubscribe to the AT events mailing list to be notified of upcoming workshops, trainings, and other opportunities hosted by Academic Technology.\nJoin the AT Events mailing list",
    "url": "https://at.sfsu.edu/?utm_source=mass_mailer&utm_medium=email&utm_content=1260581&utm_campaign=uni_targeted_emails",
    "domain": "at.sfsu.edu"
  }
]