[
  {
    "source": "http://lca.sfsu.edu/scholarships",
    "category": "financial_aid",
    "title": "Scholarships | College of Liberal & Creative Arts",
    "content": "Scholarships\nThrough generous donor support, the College of Liberal & Creative Arts offers students a broad range of scholarships. Scholarships are available from the College, schools and departments. Please search our listing below to find a scholarship that is right for you. All scholarships link to detailed information and the option to apply at the\nSF State AcademicWorks\nportal.\nAll College\nSpecific scholarship requirements for each award are listed on\nsfsu.academicworks.com\n.\nThe Carol Channing Creative Arts Scholarship\nEncourages academic excellence for all students in any of the Creative Arts majors by defraying educational expenses.\nLearn more about the Carol Channing Creative Arts Scholarship →\nCarolyn Irene Howard Memorial Scholarship\nThe Carolyn Irene Howard Memorial Scholarship is meant to ease the financial burden for College of Liberal & Creative Arts undergraduates and graduates who are making career changes to become teachers and entering the fields of language, literature, and the humanities.\nCollege of Liberal & Creative Arts Departmental Award\nRecognizes student achievement in particular areas of study, including research and community projects. Open to all majors within the College of Liberal & Creative Arts.\nEdward B. Kaufmann College of Liberal & Creative Arts Scholarship\nSupports classified graduate and undergraduate students pursuing a degree within the College of Liberal & Creative Arts other than the Department of Humanities.\nEdward M. Nagel Endowed Scholarship\nThe Edward M. Nagel Endowed Scholarship offers an opportunity for students to learn the foundation of business while applying their craft to the arts. This award is an opportunity for students pursuing professional careers in the arts, the entertainment industry, and non-profit organizations. The Edward M. Nagel Foundation strives to provide gifts and grants to economically disadvantaged young people pursuing entrepreneurial goals in education. Further information about philanthropist, business man, art collector, and community advocate Edward M. Nagel can be found at the\nEdward Nagel Foundation Facebook page\n.\nLearn more about the Edward M. Nagel Endowed Scholarship →\nEvans, Hsu, Kauffman Scholarship\nProvides a scholarship award for a SF State undergraduate pursuing a degree in the College of Humanities.\nJohn Bauer Scholarship\nProvides financial support for outstanding graduate or undergraduate students in the College of Liberal and Creative Arts who are majoring in a field related to Arts Administration.\nJudith Anne Ott Scholarship\nThe purpose of the scholarship is to provide a classified graduate students an award from programs from the former College of Humanities. The scholarship should be awarded each fall and spring semester contingent upon availability of funds.\nKyriakos Karababas Memorial Scholarship\nAssists promising students whose major area of study would be in Creative Arts.\nLearn more about the Kyriakos Karababas Memorial Scholarship →\nLCA Study Abroad Scholarship\nAssists students with expenses related to studying abroad. Proof of enrollment in a Study Abroad program is required to be eligible for this award.\nMarshall J. Miller Scholarship Fund\nProvides an annual scholarship award to one or more full time students with financial need whose major is in the general field of literary arts.\nJerold Rosenberg Family Scholarship\nProvide financial assistance, with the possibility of an extension for up to 3 years, to full-time undergraduate students in the College of Liberal & Creative Arts. To assist students with a cumulative GPA between 2.5 and 3.33 who are enrolled as majors or minors in all departments and programs in the College of Liberal and Creative Arts. Graduate applicants must have previously been a recipient of the Jerold Rosenberg Family Scholarship.\nLearn more about the Jerold Rosenberg Family Scholarship →\nShirley Barnett Memorial Scholarship\nProvides financial support to students enrolled in degree programs within the College of Liberal & Creative Arts who are over the age of 40. History majors will receive preference for at least one award, if multiple awards are given. Awards will be given initially for a single semester, but they may be renewed as long as the student remains in an LCA program and in good standing for up to the maximum amount allowed (see criteria for specifics), and as long as funds for the scholarship remain. Students who receive the award are required to provide their major program thirty hours of service each semester in which they receive scholarship funds.\nAward\n: Graduate award of $1,500 per semester for up to five semesters. Undergraduate award of $1,500 per semester for up to six semesters. History students receive preference for at least one award.\nWalter P. Riley Radical Change Scholarship\nTo provide scholarships to undergraduate students in any major in the College of Liberal & Creative Arts who are committed to pursuing radical social change through community activism.\nLearn more about the Walter P. Riley Radical Change Scholarship →\nWilbur Eugene Smith Endowed Scholarship Fund\nTo provide one-time financial assistance for an incoming or current student enrolled in the College of Liberal and Creative Arts in one of the Creative Arts majors at SF State.\nLearn more about the Wilbur Eugene Smith Endowed Scholarship Fund →\nView current College-wide scholarships on AcademicWorks\nSchools\nArt\nArnesen Travel Scholarship\nScholarship is to support participation in professional meetings, workshops, or courses sponsored by museums or museum professional associations, or similar professional development opportunities.\nAward: $200\nChristine Tamblyn Memorial Scholarship\nTo provide financial support for outstanding graduate level students in the College of Liberal & Creative Arts who are emphasizing interdisciplinary arts studies.\nAward: $1,000\nJohn Ihle Scholarship in Printmaking, The\nAward for undergraduate/graduate student work in printmaking.\nAward: $100\nJules H. Strauss Memorial Scholarship in Photography\nSupports photographic achievement for senior students in memory of Jules H. Strauss.\nAward: $2,000\nLeo D. Stillwell Jr.Scholarship\nFunds scholarships for the benefit of students seeking graduate degrees in the School of Art.\nAward: Varies\nSF State - KALA Art Institute Graduate Student Fellowship\nKala Art Institute provides exceptional facilities to professional artists working in all forms of printmaking, digital media, photography, and book arts. The SF State - Kala Art Institute Graduate Student Fellowship is given annually to an SF State M.F.A. graduate student in Art whose work demonstrates a focus on printmaking processes and concepts and would benefit from Kala's specialized equipment. The award includes a three-month full time residency from June 1 - August 30, fee remission for one Kala class while in residence, portfolio review opportunity with local curators, inclusion in the Kala Artists' Annual Exhibition, and a mentorship opportunity with a Kala artist-in-residence or staff person.\nAward: Varies\nSher-Right Scholarship in Art\nTo provide financial assistance to students majoring in Art at SF State University.\nAward: $2,500\nSteve Wilson Award\nTo support the work of students of excellence (undergraduate and/or graduate students) in Digital Media Arts & Emerging Technologies (Conceptual Information Arts) in the School of Art who are working in art and new technologies, demonstrate an interdisciplinary practice that can include, but not be limited to, cultural concerns, science and emerging technologies.\nAward: $1,000\nSylvia and Jim Walters Award in Printmaking\nAnnual award for meritorious undergraduate student work in printmaking related to the annual Stillwell student exhibition.\nAward: $100\nView current Art and Museum Studies scholarships on AcademicWorks\nCinema\nCinema Department Scholarship\nTo award funds for the production of films and videos to undergraduate and graduate film majors in the Cinema Department at SF State.\nAward: Varies\nGordon Thomas Scholarship\nScholarship for a Junior or Senior or a graduate student in animation/cinema.\nAward: Up to $1000\nJim Goldner Scholarship\nTo provide financial assistance to undergraduate students pursuing careers as filmmakers.\nAward: Up to $1,000\nMarcus Graduate Student Fellowship in Cinema Studies\nThis scholarship is granted to students entering the M.A. program in Cinema Studies at the School of Cinema who show high merit. Grantees are identified by the graduate admissions committee.\nAward: up to $2500\nRobin Eickman Cinema Student Scholarship\nTo encourage outstanding cinema students to pursue careers as professionals in the film industry and to provide support to individuals who may be underrepresented in the film industry.\nAward: Varies\nView current Cinema scholarships on AcademicWorks\nDesign\nDr. Wan-Lee Cheng Design Innovation Honors & Merit Award\nAwarded to outstanding School of Design, DES students in the areas of honors convocation, design research, social impact and technology innovation.\nAward: Varies\nHearth Homes Inclusive Design Scholarship\nThe purpose of the Hearth Homes Inclusive Design Scholarship is to assist, encourage and attract promising SF State students to the field of inclusive (universal) design.\nAward: Varies\nMartin Linder Scholarship\nTo support underrepresented and deserving students in pursuing studies in the School of Design at San Francisco State University.\nAward: Varies\nView current Design scholarships on AcademicWorks\nLiberal Studies\nLiberal Studies Alumni Scholarship\nProvide assistance to a junior or senior Liberal Studies major who shows financial need. It is also meant to honor the program and education received and allow alumni a form to give back to the university.\nAward: $500\nView current Liberal Studies scholarships on AcademicWorks\nMusic\nAlexander String Quartet\nTo support a resident Graduate String Quartet that will be coached, guided and mentored by SF State’s professional Quartet in Residence, the Alexander String Quartet.\nAward: Varies\nAnthony I. Balestrieri Endowment Fund, The\nTo assist students majoring in music by defraying educational expenses.\nAward: Varies\nBalestrieri Forgivable Loan/Scholarship, The\nTo assist students majoring in music with an emphasis on string instrument performance by defraying educational expenses.\nAward: Varies\nCarla Carol Ferrando Memorial Endowed Scholarship for Piano Students\nThe fund provides funding for promising piano students pursuing their education at San Francisco State University.\nAward: Varies\nDonna S. Kline Endowment in Creative Arts in Memory of Joanne Rae Kline\nThe scholarship was established to help strengthen and permanently support the School of Music at SF State. It is Mrs. Donna Kline’s intent this scholarship will provide financial assistance to a junior, senior, or graduate student enrolled in music classes as a major or a minor at SF State, and give a motivated and focused music student these same opportunities.\nAward: Up to $1000\nView current Music scholarships on AcademicWorks\nTheatre & Dance\nClarence Miller Musical Theatre Scholarship\nProvides merit scholarships for Theatre Arts students of promise in Musical Theatre.\nAward: $500.00\nDance Scholarship Fund - Susan Whipp Legacy Scholarship\nAwarded to promising dance students at SF State to assist with educational costs.\nAward: Varies\nHarry Donovan Memorial Scholarship, The\nRecognize and support students with outstanding achievement in a technical theatre area of the Brown Bag Theatre Project through a merit scholarship in memory of Harry Donovan.\nAward: $500\nJ. Fenton McKenna Memorial Fund\nTo honor and reward Theatre Arts students for their excellence.\nAward: $400\nJim Ponder Scholarship\nTargeted to a promising undergraduate/graduate designer/technician in a theatrical design area.\nAward: $700.00\nJules Irving Scholarship\nProvides financial assistance to Theatre Arts students who desire to enter upon a dramatic career in legitimate theatre.\nAward: $1,000\nScreen Actors Guild Award\nTo provide financial assistance for Theatre Arts students who demonstrate considerable merit/excellence in their courses and production work.\nAward: $500\nTeresina Drama Scholarship\nProvides financial assistance to Theatre Arts students who desire to enter upon a dramatic career in legitimate theatre.\nAward: $500.00\nTheater Arts Scholarship\nProvide financial assistant for students within the Theatre Arts program, particularly those who have demonstrated merit.\nAward: $500.00\nView current Theatre & Dance scholarships on AcademicWorks\nDepartments\nAnthropology\nJay P. Young Department Excellence Award\nThe Jay Young Department Excellence Award is an annual award available to the Department of Anthropology to support deserving faculty and student projects and activities, thanks to a generous gift by Jay P. Young of San Francisco, who graduated with a BA in Anthropology in 1981.\nAward: Varies\nKiana Dressendorfer Scholarship in Archaeology\nTo allow SF State undergraduate and graduate students to further their interests and educations in the archaeology of any region of the world.\nAward: Varies\nView current Anthropology scholarships on AcademicWorks\nBroadcast and Electronic Communication Arts\nAnthony F. Torrano Memorial Scholarship, The\nThe Anthony F. Torrano Memorial Scholarship is given to honor the life of KRON Video Journalist Tony Torrano. The scholarship provides financial support to benefit a Broadcast & Electronic Communication Arts major who intends to pursue a career in Video J\nAward: $1000\nBAARC Scholarship for Excellence in Bay Area Radio & Audio Media\nThe Bay Area Advertising Relief Committee (BAARC) is establishing this scholarship at the request of the Northern California Broadcasting Association (NCBA). BAARC's goals are to provide mentoring, career, and life assistance for individuals involved in the media industry universe. The intent of this scholarship is to support a Broadcast and Electronic Communication Arts student with their education. The goal is to provide resources to support that student as they begin their career trajectory.\nAward: Varies\nBECA Department Scholarship\nProvides a number of scholarships and prizes to students studying electronic media at SF State.\nAward: Varies\nBeverly Johnson Memorial Scholarship\nTo assist a motivated, career-minded student with their career and educational goals in broadcasting. The award is in memory of Beverly Johnson who was a respected news host, weather reporter and accomplished actress. Through her career and community engagement she also served as a pioneer and role model for women and students of color striving to build a career in broadcast journalism.\nAward: Varies\nDave McElhatton Memorial Scholarship\nTo defray educational expenses and support educational goals of students majoring in Broadcasting and Electronic Communication Arts (BECA) who hope to pursue a career in broadcast journalism.\nAward: Varies\nDr. Herbert Zettl Endowment Scholarship\nThe purpose of this award is to recognize the long-term contribution of Dr. Herbert Zettl to the Broadcast & Electronic Communication Arts (BECA) Department by providing financial assistance to two students who are majoring in BECA and have reached the senior year of their baccalaureate degree program. Award intends to honor the student recipients for the high quality of their academic achievement in the BECA department and provide the opportunity for them to devote full time creative energy to the study and advancement of the art of broadcast and electronic communication in the senior year.\nAward: $2,000\nKTSF Broadcast and Electronic Com. Arts Scholarship\nTo assist students majoring in Broadcast and Electronic Communication Arts by defraying educational expenses.\nAward: $2500\nRonondo A. Johnson Memorial Scholarship\nTo assist a promising student with financial need in the BECA program who is studying audio production, music recording and music.\nAward: $1500\nView current BECA scholarships on AcademicWorks\nClassics\nEkaterini Vitale Scholarship Fund in Modern Greek Studies\nScholarship for undergraduate students in Modern Greek Studies and graduate students doing related academic studies on Modern Greek and/or Greek American Studies at San Francisco State University. It will cover such things as tuition, books and travel to Greece for academic purposes.\nAward: Up to $1000\nJohn Ungaretti Translation Prize\nTo provide awards for the best written translations of a selection or selections from an ancient Greek or Latin author.\nAward: $350, 1st; $150, 2nd\nRaoul Bertrand Scholarship in Classics\nTo support entering and continuing M.A. students in Classics.\nAward: Varies\nRichard Trapp Scholarship in Classical Studies\nTo recognize the achievements of students in Classical Studies and to provide some modest financial support as part of that recognition of excellence.\nAward: Varies\nSociety for Classical and Comparative Studies Travel Scholarship\nTo support travel for participation in an archaeological field project; for formal study at a foreign university where courses are taught in the native language; for formal language study of a language other than English.\nAward: $750\nView current Classics scholarships on AcademicWorks\nCommunication Studies\nCommunication Studies Emeriti Scholarship\nTo provide a scholarship award for an SF State student pursuing a degree in Speech & Communication Studies.\nAward: Varies\nEva Lokey Scholarship\nTo assist one promising student annually who is pursuing a Masters degree in Communication Studies. Successful candidates will be chosen by a vote of full-time faculty in the Dept. of Communication Studies.\nAward: Varies\nView current Communication Studies scholarships on AcademicWorks\nCreative Writing\nBernice Ruben Arnold Scholarship Fund\nThe purpose of the Bernice Ruben Arnold Scholarship is to assist the Creative Writing Department in its desire to diversify its graduate student body through its promotion and recruitment of people from under-served communities.\nAward: $5000\nMarcus Recruitment Award\nA recruitment scholarship for two M.A./M.F.A. applicants to support their first year of study in our program. All applicants accepted into our M.A. or M.F.A. program will be eligible. Recipients for the award will be selected in Spring by TT faculty application readers, based on the promise of the applicant’s writing sample submitted as part of their application. The writing sample will show the applicant’s willingness to explore with the craft of their genre complex human experience. Writing sample may also show writers willingness to take risks and innovate within their genre.\nAward: Varies\nMarcus Second Year Graduate Student Scholarship\nFor graduate students in any of the genres who have shown their commitment to rich and ambitious writing and translation. Students submit a work-in-progress that demonstrates attention to craft, cultural/social awareness, and the complexity of human experience. The recipient would also be a student for whom this award would make a significant difference in their ability to focus on their studies and their writing.\nAward: $2,500\nView current Creative Writing scholarships on AcademicWorks\nEnglish Language and Literature\nASW Scholarship Fund\nTo provide a scholarship award for an SF State undergraduate pursuing a degree as a declared major in English Literature.\nAward: Varies\nDebra Plousha Moore Scholarship\nThe recipient must demonstrate service and commitment to the African American community, and an interest in women's issues, African American literature, or African American women.\nAward: Varies\nEllanore and Maurice Bassan English Dept. Scholarship\nTo provide financial support for graduate students pursuing M.A. Literature who have demonstrated excellence in literary study.\nAward: Varies\nEnglish Department Scholarship\nThis scholarship is established to give a stipend annually to three undergraduate honorees from the three separate undergrad branches of the English Department: Lit",
    "url": "http://lca.sfsu.edu/scholarships",
    "domain": "lca.sfsu.edu"
  },
  {
    "source": "http://slhs.sfsu.edu/scholarships",
    "category": "financial_aid",
    "title": "Grant, Scholarship, and Fellowship Opportunities | Department of Speech, Language and Hearing Sciences",
    "content": "Grant, Scholarship, and Fellowship Opportunities\nTraining Grants\nFederally funded training grants are available for graduate students in the SF State CD Program to receive stipend support while obtaining a specialization in\nAugmentative and Alternative Communication (AAC)\nand\nAutism and Neurodiversity.\nCollege of Education Scholarships\nThe Graduate College of Education offers a number of\nscholarships\n.\nASHA Foundation Scholarships\nThe American Speech-Language-Hearing Association (ASHA) Foundation offers many\nscholarships\nfor students and scholars.\nCampus Scholarship Listing\nA listing of\nscholarships\noffered across colleges at SF State is available for review.\nChicana/Latina Foundation Scholarship Program\nEach year the Chicana Latina Foundation awards merit-based\nscholarships\nto Latina college students, valued at $1,500 dollars each. All of the scholarship awardees attend a leadership institute retreat each semester where they are immersed in topics such as public policy, community advocacy, financial literacy and leadership skill development. There is also a strong focus on cultural connection as well as personal care and growth.\nGeneral Scholarship Listing\nA listing of scholarships offered across the country that may be applicable to students at SF State is available at\nFinancial Aid\n.\nAcademic Honors and Fellowships Office\nAn Academic Honors and Fellowships Advisor is available to assist undergraduates and recent alumni in applying for nationally competitive\nscholarships and fellowships\n, as well as system-wide scholarships and fellowships offered by CSU. The opportunities provided by these fellowships include generous funding for graduate studies, as well as research experience and prestigious internships in the U.S. and abroad.\nCalifornia Pre-Doctoral Program\nThe\nCalifornia Pre-Doctoral Program\nis designed to diversify the pool of university faculty by supporting the doctoral aspirations of students who are upper division undergraduates or graduate students on a California State University campus, economically or educationally disadvantaged, with focused research interests, and an interest in a university faculty career. Students who are chosen for this prestigious award are designated Sally Casanova Pre-Doctoral Scholars as a tribute to Dr. Sally Casanova, for whom the scholarship is named.",
    "url": "http://slhs.sfsu.edu/scholarships",
    "domain": "slhs.sfsu.edu"
  },
  {
    "source": "http://wgsdept.sfsu.edu/news/marjorie-h-stern-scholarship",
    "category": "financial_aid",
    "title": "Marjorie H. Stern Scholarship | Department of Women and Gender Studies",
    "content": "Marjorie H. Stern Scholarship\nAuthor:\nThe Marjorie H. Stern Scholarship supports women's rights and social justice by helping Women and Gender Studies (WGS) students in immediate financial need to remain in school.  Two scholarships will be awarded each year to students who demonstrate a commitment to social justice and articulate how the scholarship would help them to continue their education.\nApplicants must be Women and Gender Studies majors or minors of junior or senior status, or MA students.\nApply\nhere\n!\nRelated News\nTime Bomb\nJune 11, 2025\nCSU WGS Programs Call for Reinstatement of SSU WGS. Our department in support and solidarity of Sonoma State University WGS\nFebruary 14, 2025\nWill Clark Teaching WGS 712 - Queer Theories this Spring\nJanuary 27, 2025\nFifty Shades of Brown\nJune 5, 2024",
    "url": "http://wgsdept.sfsu.edu/news/marjorie-h-stern-scholarship",
    "domain": "wgsdept.sfsu.edu"
  }
]