[
  {
    "source": "https://oip.sfsu.edu/employment",
    "category": "international_employment",
    "title": "U.S. Employment Authorization | Division of International Education",
    "content": "U.S. Employment Authorization\nF-1 and J-1 students are eligible to seek employment under limited circumstances. Students may not begin any employment prior to receiving work authorization. This section covers the various types of employment eligibility students may seek in J-1 or F-1 status. It is students’ responsibility to understand their on- and off-campus work eligibility.\nAll Students\nOn-Campus Employment\nWith authorization, eligible F-1 and J-1 students may work on campus as student assistants, tutors, teaching assistants, etc.\nSF State student employees may work up to 20 hours per week (part-time) during the Spring and Fall semesters and up to 40 hours per week (full-time) during Summer sessions and semester breaks.\nSee\nOn-Campus Employment\n>>\nVolunteering and Unpaid Internships\nRules governing volunteering and unpaid internships are complex, as this is an area where immigration regulations and labor laws intersect.\nStudents must understand relevant regulations so that they do not violate any laws by participating in unauthorized employment.\nSee\nVolunteering and Unpaid Internships\n>>\nSocial Security Number (SSN)\nA Social Security Number (SSN) is not a U.S. work authorization.\nEven if an international or exchange student already has an SSN, it does not imply that the student has U.S. work authorization. In essence, an SSN does not verify the eligibility of international or exchange students to work in the U.S.\nSSN  is primarily intended to identify participants in the U.S. federal government's Social Security Program. SSNs are generally assigned to people who are authorized to work in the U.S. and are used to report their wages to the government.\nSee\nSocial Security Number (SSN)\n>>\nCareer and Leadership Development\nCareer & Leadership Development (CLD) equips SF State's diverse student and alumni population with modern resources that assist, guide, and foster their leadership, professional, and career advancement.\nSee\nCareer and Leadership Development\n>>\nJ-1 Exchange Students Only\nAcademic Training\nAcademic Training allows eligible J-1 exchange students to gain work experience in their field of study (as it appears on the student’s DS-2019) by participating in off-campus internships and employment opportunities.\nSee\nAcademic Training for J-1 Students\n>>\nEconomic Hardship\nJ-1 exchange students may request off-campus work authorization in the event of lost exchange program funding. Loss of funding must result from unforeseen circumstances outside the student's control. Off-campus work authorization will only be considered if on-campus employment opportunities are not available or are otherwise insufficient.\nJ-1 exchange students who believe they qualify for Economic Hardship should contact\nexchange@sfsu.edu\n.\nF-1 International Students Only\nCurricular Practical Training (CPT)\nCurricular Practical Training (CPT) is a temporary employment authorization available for eligible F-1 international students. With an approved CPT, an F-1 student is allowed to work off-campus for a specific time frame in a specific role that is an integral part of their major.\nSee\nCurricular Practical Training (CPT)\n>>\nOptional Practical Training (OPT)\nOptional Practical Training (OPT) is a temporary employment authorization available for eligible F-1 international students. With approved OPT, an F-1 student is allowed to work off-campus for a specific time frame in roles that are integral to their major.\nF-1 students are eligible for Pre-Completion OPT during their programs and for Post-Completion OPT after they complete their programs at SF State.\nSee\nOptional Practical Training (OPT)\n>>\nSTEM OPT Extension\nSTEM OPT extension is a temporary employment authorization available for specific eligible F-1 international students currently on Post-Completion OPT. With an approved STEM OPT extension, an F-1 student is allowed to work off-campus for a specific time frame in roles that are an integral part of their major.\nSee\nSTEM OPT Extension\n>>\nEconomic Hardship\nF-1 students may request off-campus work authorization based on unforeseen and severe economic hardship caused by unforeseen circumstances beyond the student's control if other employment opportunities are not available or are otherwise insufficient.  This work authorization is issued by United States Citizenship and Immigration Services (USCIS).\nSee\nEconomic Hardship\n>>\nSpecial Student Relief\nU.S. Regulations allow the Department of Homeland Security (DHS) to suspend or alter rules regarding duration of status, full course of study, and employment eligibility, for specific groups of F-1 students from parts of the world that are experiencing emergent circumstances. This collection of benefits is known as \"Special Student Relief\" (SSR).\nSee\nSpecial Student Relief\n>>\nH-1B Cap Gap Extension\nF-1 students who have been granted H-1B status receive automatically an extension of F-1 status and post-completion OPT until September 30.\nSee\nH-1B Status and the Cap Gap Extension | Study in the States (dhs.gov)\n>>\nStudents who are eligible for Cap Gap extension may request an updated I-20 with extension remark.  Submit request at\nUpdated I-20 Request (qualtrics.com)\n.\nQuick Links\nCurrent Students\nVisa and Immigration\nMaintaining Status\nU.S. Employment Authorization\nTravel\nNew Students\nImportant Dates\nPre-Arrival Checklist\nOrientation\nOther Resources\nHealth Insurance Requirement and U.S. Health Care\nLife in San Francisco\nWellness & Academic Success\nContact an Advisor\nLast updated:\nApril 2024\nFor PDF files, Adobe Acrobat 5.0 or above is required to view it. Adobe Acrobat Reader it's available\nfree from Adobe\n(link is external).\nThe information contained in this website is provided as a service to the international students, faculty, staff, employees, and administrators of San Francisco State University, and does not constitute legal advice on any immigration, tax or other matter. We try to provide useful information, but we make no claims, promises or guarantees about the accuracy, completeness or adequacy of the information contained in or linked to this web site or any associated site. As legal advice must be tailored to the specific circumstances of each case, and laws are constantly changing, nothing provided herein should be used as a substitute for the advice of competent counsel. Neither San Francisco State University nor the Division of International Education is responsible for any errors or omissions contained in this website, or for the results obtained from the use of this information.",
    "url": "https://oip.sfsu.edu/employment",
    "domain": "oip.sfsu.edu"
  }
]