[
  {
    "source": "https://registrar.sfsu.edu/howtoenroll",
    "category": "registrar_general",
    "title": "How to Enroll: Registration Guide | Registrar's Office",
    "content": "How to Enroll: Registration Guide\nRegistration is an exciting time! By planning ahead and using our helpful planning resources, you can create a class schedule that is intellectually engaging and helps you progress towards earning your degree.\nSF State's 5-Step strategy can help you create a comprehensive enrollment and graduation plan so you can spend more time studying and enjoying your time at SF State.\nSTEP 1 | CHECK TO SEE IF YOU HAVE ANY HOLDS\nA hold may be placed on your account for academic, financial, health and safety, or administrative activity and progress reasons.\nSome of these holds can prevent enrollment in classes if they are not cleared or addressed before your enrollment appointment. To identify these holds and understand how they affect you, follow the steps below.\nOpen your\nStudent Center\nLocate the message box titled\nHolds & Alerts\nIf “\nNo Holds”\nis listed, you have no holds or system messages\nIf items are listed, click the\nDetails\nlink.\nPlease Note:\nnot all holds prevent registration\n. Holds that do prevent registration indicate this in the\nDetails\nsection.\nClick through the hold listing to see more information on the hold's purpose and how to clear it.\nSTEP 2 | FIND YOUR ENROLLMENT APPOINTMENT\nYour enrollment appointment is the\nDate and Time\nin which you will be able to enroll in classes for a future term. To identify your Enrollment Appointment, follow the steps below.\nOpen your\nStudent Center\nLocate the message box titled\nEnrollment Dates\nIdentify the correct Term appointment for the semester you intend to register for, as multiple appointment times may be present.\nPlease Note:\nnewly admitted students will get an initial registration appointment by\nsigning up for orientation\nor during SF State's\nOpen Registration period\nfor the semester they enter SF State.\nSTEP 3 | PLAN YOUR SCHEDULE & SEARCH FOR CLASSES\nAs you plan your courses for next semester, please keep in mind that taking 30 units a year can speed up your path towards earning a degree, saving you time and money. While many students choose to take 15 units each semester, we recognize this does not work for all students. We encourage you to\nThink 30\nand consider\nenrolling in winter or summer courses to get ahead in your degree!\nSF State has developed enrollment tools designed to help you locate classes needed for degree completion and generate schedules that work around your needs.\nPlan for Timely Degree Completion\nYou can plan your entire academic path to graduation using\nDegree Planner\n.  Each time you enter the Degree Planner, the system determines which degree requirements you have met and which are still remaining, and then provides a recommended plan promoting timely graduation.  You can make adjustments to your plan 24/7, including moving classes between terms and selecting your preferred unit load each semester.\nOpen your\nStudent Center\nUnder the\nAcademics\nheader, click the\nDegree Planner\nlink\nFor more information on how to use Degree Planner, visit our\nDegree Planner guide\n.\nOnce you're satisfied with your plan click the Gator Scheduler button to import your classes!\nPlan classes that meet your schedule and learning needs\nCreate a class schedule based on your specific class requirements, academic and personal needs, and availability. Access\nGator Scheduler\nto see what classes are offered and create or save multiple schedule options. You can even start by loading the plan you created for your Degree Planner!\nOpen your\nStudent Center\nUnder the\nAcademics\nheader, click the\nGator Scheduler\nlink\nFor more information on how to use Gator Scheduler, visit our\nGator Scheduler guide\n.\nAnd be aware that you can easily select classes from your Degree Planner Plan, see\ninstructions here\n!\nReview our video guide to learn how to identify instructional modes and review class notes for important attendance details.\nSTEP 4 | USE GATOR SCHEDULER WITH THE SHOPPING CART\nUsing\nGator\nScheduler\nto create a schedule allows you to import a class schedule into your shopping cart, select preferred courses, create breaks, and generate a schedules accordingly. This system highlights any potential problems with your selections, such as time conflicts. Using Gator Scheduler also allows you to make adjustments to your course selections\nbefore\nmeeting with an advisor, allowing you to spend that appointment focused on degree planning and other questions you may have.\nUse the Gator Scheduler to Import courses to your Shopping Cart\nOnce a schedule is generated transfer it to your\nShopping Cart\nClick the\nView\noption for the desired schedule\nA pop-up window will display the schedule\nClick the\nSend\nSchedule to\nShopping Cart\nbutton (top of page)\nOn the pop-up confirmation screen, click\nOK\nNote\n: Continuing to your enrollment shopping cart will close the\nGator Scheduler\nClick the\nClose\nbutton, in the window that pops up, after you have sent your schedule to your shopping cart\nGo back to the\nGator Scheduler Launch\nwindow (the window started on)\nClick the green button labeled\nCOURSE ENROLLMENT\nInside the yellow rectangular box, click\nImport Cart\nClick the green button labeled\nNEXT\nClick the green button labeled\nPROCEED TO STEP 2 OF 3\nFor more information on how to navigate the Student Center, visit our\nStudent Center User guide\nUse the Shopping Cart Before Your Priority Enrollment Appointment\nUsing the Shopping Cart can make it easier to register right when your Priority Enrollment Appointment opens.  You can store classes you wish to take in your Shopping Cart until it is time for your enrollment appointment. Access your Shopping Cart from your Enrollment Dashboard.  You can also create a schedule using\nGator\nScheduler\n(see above), and then import your schedule from Gator Scheduler directly into your Shopping Cart.\nOpen your\nStudent Center\nUnder the\nAcademics\nheader, click the\nEnroll\nlink\nThen select the\nEnroll\ntab\nClick the\nAdd\noption to access the\nShopping Cart\nFor more information on how to navigate the\nStudent Center\n, visit our\nStudent Center User guide\n.\nMax Units during Priority Enrollment (Grad and Undergrad):\nMax Fall and Spring units: 16 Enrolled | including 12 Waitlisted\nMax Summer Units: 14 Enrolled | including 5 Waitlisted\nPLEASE NOTE: Storing classes in the Shopping Cart does NOT enroll or save a spot for you in these classes. You must still complete the enrollment process (step 5) during your priority enrollment appointment.\nSTEP 5 | ENROLL\nPriority Enrollment Appointment\nOnce you have courses in your shopping cart, or have imported your\nGator Scheduler\nschedule into your shopping cart, you will be prepared to enroll once your priority enrollment appointment opens.  (Step 2, above, shows you how to find your priority enrollment appointment date in your Student Center).\nDuring your Enrollment Appointment, open the\nStudent Center\nUnder the\nAcademics\nheader, click the\nEnroll\nlink\nYou can either enter the class number of the course you want to enroll or use the Class Search\nLook over your Shopping Cart selection, then click the\nProceed to Step 2 of 3\nbutton\nFor more information on how to navigate the Enrollment Dashboard, visit our\nStudent Center guide\n.\nMake sure to complete your request by clicking\nFinish Enrolling\nAdding classes during your Priority Enrollment Appointment\nEnrolling earlier in the registration period increases your chances of finding open spots in the classes you need or prefer.\nEnrolling before the first day of instruction gives you more time to evaluate the class and to decide whether it is a good fit for you.  Most classes do not require permission numbers until the third week of classes.\nAll add/drop decisions must be made by the established add/drop deadline for each term.\nFor more information on how to Add, Drop, Swap classes, update grading options, or other items, visit our\nStudent Center User guides\nand our\nGator Scheduler User Guides\n.\nADDITIONAL REGISTRATION & ENROLLMENT INFORMATION\nFor more information about the below registration subjects, please visit our additional registration & enrollment site.\nDropping and withdrawing\nCan’t register due to unmet prerequisites\nDropped for unmet prerequisites\nFull-time vs. part-time enrollment status\nAdding with permission numbers\nUsing permission numbers after the first day of instruction\nWaitlist\nSpecial programs (registration at other campuses)\nGrading options\nTime conflicts\nAdditional Registration Information\nWHERE CAN I FIND OUT HOW A CLASS WILL MEET?\nThe\nclass schedule\nincludes a learning mode column that specifies how the class will meet. The modalities include:\nModality Breakdown\nModality\nDescription\nOnline Asynchronous\nClass meets entirely online with no set day/time.\nOnline Synchronous\nClass meets entirely online at scheduled days/times.\nHybrid (online asynchronous with occasional in-person)\nClass meets mostly online with no set day/time and has occasional in-person meetings. See class note for the in-person meeting days/times.\nOnline Bichronous (mostly online asynchronous with occasional online synchronous)\nClass meets mostly online with no set day/time and has occasional online meetings at scheduled days/times.  See class note for meeting days/times.\nHybrid (Online synchronous with occasional in-person)\nClass meets mostly online at scheduled days/times and has occasional in-person meetings. See class note for the in-person meeting days/times.\nHybrid (Combination of in-person and online asynchronous)\nClass meets regularly in-person at scheduled days/times and online with no set day/time.\nHybrid (Combination of in-person and online synchronous)\nClass meets regularly in-person and online with scheduled days/times.\nIn-Person\nClass meets in-person at scheduled days/times.\nOnline Bichronous (Combination of online synchronous and online asynchronous)\nClass meets entirely online with some scheduled meeting days/times and some with no set day/time.\nOnline Bichronous with Occasional In-Person (Combination of online synchronous, online asynchronous, and occasional in-person)\nClass meets online with some scheduled meeting days/times and some with no set day/time. The class also has occasional in-person meetings.  See class note for the in-person meeting days/times.\nADDING WITH PERMISSION NUMBERS\nIf you are adding during a registration period in which permission is required, please get in touch with the course instructor or department to request a permission number (conditions to receive a permission number vary for each course, department, and college). Once obtained, permission numbers can be entered through the\nStudent Center\nwhen adding classes to the shopping cart.\nFor questions related to getting a permission number, please contact the course\ninstructor\nor\ndepartment\n. For instructions about using a permission number, view our\nUser Guide\n.\nFor questions related to getting a permission number, please contact the course\ninstructor\nor\ndepartment\n. For instructions about using a permission number, view our\nUser Guide\n.\nUSING PERMISSION NUMBERS AFTER THE FIRST DAY OF INSTRUCTION\nMost courses do not require a permission number for enrollment during the\nfirst two weeks of a Fall or Spring semester (For Summer, it's the first three days)\nDates & Deadlines | Enrollment Lookup\nIf seats are available and permission is not specified, you\ncan enroll in the course\nnormally until the start of the third week of the semester.\nWAITLIST\nA limited number of waitlist spots are available for the majority of undergraduate courses and select graduate courses. The waitlist option is available for you to select when enrolling in a course. When seats become available in a closed course, a process will automatically enroll the first student on the waitlist as long as all prerequisites for the course are met. If you do not meet the course prerequisites, the process will select the next student on the waitlist who satisfies all course prerequisites. You may be waitlisted for up to 12 units at a time. You cannot be waitlisted and enrolled in the same class.\nWaitlist scenarios\nI want to be on the waitlist for a course that conflicts with another open course in which I want to enroll. If I get into the waitlisted course, I will want to drop the course that presents a time conflict.\nEnroll in the open course using the \"add a class\" instructions as usual. Next, select the \"swap\" option and swap the currently enrolled class with the waitlisted course to successfully swap the courses, should seats become available in the waitlisted course.\nI am currently waitlisted for 11 units but want to change the courses I am waiting for because I cannot be waitlisted for more than 12 units\n. Drop any or all of the courses for which you are waitlisted using the \"drop\" function. Select the appropriate course to drop, and proceed with the drop process. Once a waitlisted course is dropped, your position number on the waitlist is forfeited. You can now add your desired waitlist course as long as it will not exceed the maximum waitlist units of 12.\nIf you have a Registration Hold, the process will select the next student on the waitlist who satisfies all course prerequisites. You may be waitlisted for up to 12 units at a time.\nHELPFUL CAMPUS RESOURCES\nMany offices across campus are here to help you with questions.  Don’t hesitate to reach out to any of these areas if you need support.\nFinancial Aid\nFor financial aid information, scholarships, loans, deadlines, and disbursement dates, visit the\nFinancial Aid Homepage\n.\nFinancial Aid Office\nTuition and Refunds\nFor information on tuition fees, payment deadlines, and refund schedules, visit the\nBursar's Office website\n.\nBursar's Office\nAcademic Advising\nIf you need any guidance to help you plan your classes, one of our\nacademic advisors\ncan assist.\nAcademic Advising HUB\nRegistrar’s Office\nAnd of course, the\nRegistrar’s Office\nis always a resource for registration-related questions you may have!\nSF State Gateway\nReturn to Registrar Guides",
    "url": "https://registrar.sfsu.edu/howtoenroll",
    "domain": "registrar.sfsu.edu"
  },
  {
    "source": "https://registrar.sfsu.edu/privacy",
    "category": "registrar_general",
    "title": "Privacy Rights | Registrar's Office",
    "content": "Privacy Rights\nStudent Privacy Rights\nSF State Policy - Student Privacy Rights Policy and Procedure\nSTUDENT PRIVACY RIGHTS POLICY AND PROCEDURE\nRecords Release (Parent or Guardian)\nStudent Authorization to Release Educational Records Form\nRelease of Student Information (Restrict Record)\nRequest to Withhold Directory Information\nLetter of Recommendation Release Form\nOnline Privacy Notice\nVisit SF State Policy Site\n34 CFR PART 99—Family Educational Rights and Privacy\nVisit the US Department of Education Policy Site\nSF State Employee Responsibilities\nBest Practices for Information Security PowerPoint\nBest Practices_2007.pdf\n165.1 KB\nConfidential Data (Includes Level 1/Level 2 Data Information)\nVisit SF State's Data Practices Page\nFERPA & Protecting Education Training\nVisit CSU's Training Site\nProtecting Students' Academic Privacy in the Classroom\nProtecting Students Academic Privacy in the Classroom.pdf\n157.72 KB\nArchived Information\nSF State Identification Number Policy\nSFSU SSN Conversion_2009.pdf\n73.01 KB\nSF State  Social Security Conversion Project\nSSN Conversion 10 Things to Know.pdf\n22.25 KB\nPreferred/Chosen Name\nSF State Student Right to Know",
    "url": "https://registrar.sfsu.edu/privacy",
    "domain": "registrar.sfsu.edu"
  },
  {
    "source": "https://registrar.sfsu.edu/",
    "category": "registrar_general",
    "title": "Welcome to the Registrar's Office | Registrar's Office",
    "content": "Welcome to the Registrar's Office\nOrdering Transcripts\nTranscripts are available online through SF State Gateway or Parchment's ordering portal. If you are unable to complete a request, please review our ordering guide for assistance.\nTranscript Ordering Guide\nParchment Ordering Portal\nSubmitting Transcripts, GE, or ADT Certification to the Admissions Office\nPart of the admission process is to submit your official transcripts from all institutions you have attended to the\nOffice of Undergraduate Admissions & Recruitment\n. In addition, if applicable, submit your AP, IB, and CLEP test scores.\nPlease click the button below to view the\nUndergraduate Admissions\nprocess for accepting and reviewing transcripts.\nUndergraduate Admissions Transcript Information\nSubmitting Petitions to Other Departments or On-Campus Offices\nSubmission Option(s)\nForm(s)\nSteps\nWaiver of College Regulations\nChange or Addition of a Major/Minor\nIndependent Study Requests\nLeave of Absence\nSpecial Program Enrollments\nSend completed form as attachment from your SFSU email directly to your advisor or department office.\nA physical signature is not needed only if submitting forms via SFSU email.\nAdvisor or department offices will review and forward through any required approval workflow.\nOnce complete, the final approver should send directly to the Registrar’s records email,\nrecords@sfsu.edu\n.\nSubmitting Petitions Directly to the Registrar’s Office\nSubmission Option(s)\nForm(s)\nSteps\nAll\nSend completed form as attachment from your SFSU email directly to your advisor or department office.\nA physical signature is not needed only if submitting forms via SFSU email.\nThe Registrar’s Office will review and process.\nDates & Deadlines\nFor more dates visit our dates & deadlines, and visit the Bursar's Student Information site to review payment deadline information.\nDates & Deadlines Detail\nBursar's Student Information\nFall 2025\nSpring 2026\nSemester events, dates, times, and deadlines can change without prior notice. Please check back regularly for the latest updates, and if you have any questions please email\nrecords@sfsu.edu\n.\nFirst Day of Instruction\nMonday\n, August 25\nLast day to Drop/Withdraw classes without a W grade\nMonday\n, September 15\nWithdrawal from Classes or University for serious and compelling reason\nTuesday\n, September 16 -\nMonday\n, November 17\nGrading Option Deadline\n(This includes Cr/No CR or Letter Grade)\nFriday\n, December 5\nWithdrawal from Classes or University by exception for documented serious and compelling reasons\nTuesday\n, November 18 -\nFriday\n, December 12\nLast Day of Instruction\nFriday\n, December 12\nSemester events, dates, times, and deadlines are subject to change without prior notice. Please check back regularly for the latest updates. If you have any questions, please email\nrecords@sfsu.edu\n.\nFirst Day of Instruction\nMonday\n, January 26\nLast day to Drop/Withdraw classes without a W grade\nMonday\n, February 16\nWithdrawal from Classes or University for serious and compelling reasons\nTuesday\n, February 17 -\nMonday\n, April 20\nGrading Option Deadline\n(This includes Cr/No CR or Letter Grade)\nFriday\n, May 8\nWithdrawal from Classes or University by exception for documented serious and compelling reasons\nTuesday\n, April 21 -\nFriday\n, May 15\nLast Day of Instruction\nFriday\n, May 15\nLast Updated: 07/02/2025",
    "url": "https://registrar.sfsu.edu/",
    "domain": "registrar.sfsu.edu"
  },
  {
    "source": "https://registrar.sfsu.edu/deadlines",
    "category": "registrar_general",
    "title": "Dates & Deadlines | Registrar's Office",
    "content": "Dates & Deadlines\nCalendar Update Warning\nSemester events, dates, times, and deadlines can change without prior notice. Please check back regularly for the latest updates, and if you have any questions please email us.\nrecords@sfsu.edu\nRegistrar-specific dates and deadlines are the only ones listed on this page. For an all-campus calendar, visit the University Calendar. For College or Department-specific calendars, visit\nSF State's directory\n.\nUniversity Calendar\nArchived Dates\nRegistration Breakdown\nFALL\nWINTER\nSPRING\nSUMMER\nFall 2025\nDates are Tentative\nEvents\nDates\nFall Priority Graduation Application Period Opens\nReview your\nDPR\nand visit our\nGraduation site\nto see if you meet eligibility.\nSaturday\n, March 1, 2025\nFall Priority Graduation Application Period Closes\nReview your\nDPR\nand visit our\nGraduation site\nto see if you meet eligibility.\nFriday\n, April 4\nClass Schedule on the Web\nMonday, April 14\nBursar Begins Accepting Payments\nMonday\n, April 28\nPRIORITY Registration Begins for Continuing Students\nPermission numbers will override closed classes starting the\nthird week\nof the term.\nExceed Maximum Unit Petitions\ncan be processed as soon as registration opens.\nOnly the first two weeks of this period have appointments.\nUnit limits:\nUndergraduate\n: 19 unit limit includes combined enrolled and waitlisted units with up to 12 waitlisted units allowed\nPost-Baccalaureate\n: 16 unit limit includes combined enrolled and waitlisted units with up to 12 waitlisted units allowed\nBeginning\nMonday\n, April 28\nCoursematch\nSee\ncsufullyonline.com\nfor more details\nTuesday\n, July 1 -\nSunday\n, September 7\nRegistration: New Graduate Students (Includes International Students)\nPermission numbers will override closed classes starting the\nthird week\nof the term\nPost-Baccalaureate\n: 16 unit limit includes combined enrolled and waitlisted units with up to 12 waitlisted units allowed\nMonday\n, June 9 -\nThursday\n, July 24\nORIENTATION: Freshman, Transfers, & International students\nSF State does not host Orientation sessions on Saturdays or Sundays.\nIf you have questions about the specific dates listed, please visit the\nNSP site\nor contact\nnsp@sfsu.edu\nThursday\n, June 12\n- Tuesday\n, July 22\nOPEN Registration: All Students\nExceed Maximum Unit Petitions\ncan be processed as soon as registration opens.\nUndergraduate\n: 19 unit limit includes combined enrolled and waitlisted units with up to 12 waitlisted units allowed\nPost-Baccalaureate\n: 16 unit limit includes combined enrolled and waitlisted units with up to 12 waitlisted units allowed\nFriday\n, July 25 -\nSunday\n, August 24\nPayment DUE\nFor fee payment information visit the Bursar’s\nTuition/Fee schedule\n.\nIn-person:\n4 PM\nOnline:\n11:59 PM\nMonday\n, September 22\nCSU Fully Online (AB386) Continued Registration\nSee\ncsufullyonline.com\nfor more details\nMonday\n, August 4 -\nSunday\n, September 7\nPayment Due for NEW International & Graduate Students\nFor fee payment information visit the Bursar’s\nTuition/Fee schedule\n.\nMonday\n, August 25\nFirst Day of Instruction\nWaitlists will continue to be available until the second Sunday.\nMonday, August 25\nAdd Period\n|\nPermission numbers\nARE NOT\nrequired to add most classes\nMonday\n, August 25 -\nSunday\n, September 7\nLate Add by Exception with Permission Number\n|\nPermission numbers\nARE\nrequired\nMonday\n, September 8 -\nMonday\n, September 15\nLabor Day\nNo Classes | Campus Closed\nMonday\n, September 1\nInstructor Drop DEADLINE\nLast day for faculty to drop students from their course(s).\nWednesday\n, September 10\nAudit Grading Option\nDEADLINE\nMonday\n, September 15\nStudent Drop DEADLINE\nLast day for students to drop/withdraw from their course(s) without a “W” grade.\nLast day to swap a course.\nFor refund or financial impact questions, review the Bursar's\nRefund Guidelines page\n.\nMonday\n, September 15\nCENSUS\nMonday, September 22\nVeterans Day\nNo Classes | Campus Closed\nTuesday\n, November 11\nWithdrawal from Classes or University\nFor serious and compelling\nreasons\nTuesday\n, September 16 -\nMonday\n, November 17\nFall Recess\nNo Classes | Campus Open\nSunday\n, November 23 -\nWednesday\n, November 26\nFall Recess: Thanksgiving\nNo Classes | Campus Closed\nThursday\n, November 27 -\nFriday\n, November 28\nFall Recess\nNo Classes | Campus Closed\nSaturday\n, November 29\nGrading Option DEADLINE\nThis includes Credit and No Credit, Audit, and Letter Grades\nFriday\n, December 5\nGrade Rosters Available\nSaturday\n, December 6\nWithdrawal from Classes or University\nBy exception, for\nDOCUMENTED\nserious and compelling\nreasons\nTuesday\n, November 18 -\nFriday\n, December 12\nLast Day of Instruction\nFriday, December 12\nFinal Exams\nSaturday\n, December 13 -\nFriday\n, December 19\nWinter Recess\nNo Classes | Campus Closed\nThursday\n, December 25, 2025 -\nThursday\n, January 1, 2026\nGrades Due by Faculty\nFriday, December 26\nGrades Available on SF State Gateway\nThis date is tentative.\nGrades are posted to Gateway when submitted to a grade roster, not Canvas.\nFriday\n, January 2, 2026\nGrades Available on Official Transcripts\nThis date is tentative.\nGraduation applications are processed when a term's end-of-term processes are completed.\nMonday\n, January 19\nLast Updated: 4/17/2025\nWhat is Winter Session?\nTake advantage of Winter Session to make progress toward your degree — or take a class that sparks your interests:\nEarn up to four units during winter break.\nApply credit toward your degree.\nWinter Session is Open to Everyone\nWinter Session enrollment is open to everyone — matriculated SFSU students, prospective students, visitors and the Bay Area community. Winter Session classes offer an excellent opportunity to meet the faculty, get to know the campus, and get acquainted with other students. The credit you earn may count toward your degree.\nWinter Session Information\nSpring 2026\nDates are Tentative\nEvents\nDates\nSpring Priority Graduation Application Period Opens\nMonday, September 1, 2025\nSpring Priority Graduation Application Period Closes\nFriday, October 17, 2025\nClass Schedule on the Web\nMonday, October 27, 2025\nBursar Begins Accepting Payments\nMonday, November 10, 2025\nPriority Registration Begins for Continuing Students\nMonday, November 10, 2025 - Friday, November 21, 2025\nCoursematch\nTBD\nRegistration: New Graduate Students (Includes International Students)\nMonday, November 24th, 2025 - TBD\nOrientation: Freshman, Transfers, & International Students\nTBD\nPayment Due\nTBD\nCSU Fully Online Continued Registration\nTBD\nMartin Luther King Jr. Day\nMonday, January 19, 2026\nOpen Registration: All Students\nTBD\nPayment Due for New International & Graduate Students\nTBD\nFirst Day of Instruction\nMonday, January 26, 2026\nAdd Period - Permission Numbers Are Not required to add most classes\nMonday, January 26, 2026 - Sunday, February 8, 2026\nInstructor Drop Deadline\nWednesday, February 11, 2026\nLate Add by Exception with Permission Number - Permission Numbers Are required\nMonday, February 9, 2026 - Monday, February 16, 2026\nAudit Grading Option Deadline\nMonday, February 16, 2026\nStudent Drop Deadline\nMonday, February 16, 2026\nWithdrawal from Classes or University for serious and compelling reasons\nTuesday, February 17, 2026 - Monday, April 20, 2026\nCensus\nFriday, February 20, 2026\nSpring Recess\nMonday, March 23, 2026 - Saturday, March 28, 2026\nCesar Chavez Day\nTuesday, March 31, 2026\nCommencement Booklet Entry Deadline\nWednesday, April 1, 2026\nWithdrawal from Classes or University by exception, for Documented serious and compelling reasons\nTuesday, April 21, 2026 - Friday, May 15, 2026\nGrading Option Deadline\nFriday, May 8, 2026\nGrade Rosters Available\nSaturday, May 9, 2026\nLast Day of Instruction\nFriday, May 15, 2026\nFinal Exams\nSaturday, May 16, 2026 - Friday, May 22, 2026\nCommencement\nMemorial Day\nMonday, May 25, 2026\nGrades Due by Faculty\nFriday, May 29, 2026\nGrades Available on SF State Gateway\nFriday, June 6, 2026\nGrades Available on Official Transcripts\nFriday, June 12, 2026\nLast Updated: 5/17/2025\nSummer 2026 Coming Soon",
    "url": "https://registrar.sfsu.edu/deadlines",
    "domain": "registrar.sfsu.edu"
  },
  {
    "source": "https://registrar.sfsu.edu/degreeplanner",
    "category": "registrar_general",
    "title": "Degree Planner | Registrar's Office",
    "content": "Degree Planner\nGraduating in a timely manner is a top priority at SF State. Degree Planner, a new online tool allowing undergraduate students to map their academic path to graduation, is now live in many undergraduate majors.\nWhat is Degree Planner?\nDegree Planner is a planning tool to assist students and advisors in mapping courses towards degree completion and to provide students with the best-recommended sequence of courses for success.\nWhat are the key features of Degree Planner?\nThe Plan is based on your current progress and updates in real-time based on registration, course completions, transfer credit, and substitutions.\nYou and your advisor can customize your Plan, including the number of units planned each semester.\nThe Planner has shopping–style course selection and drag-and-drop functionality so you can re-arrange courses to meet your needs.\nThe Plan is integrated with your Degree Progress Report (DPR, your degree audit), Gator Scheduler, and registration to make it easier to use.\nYou can use what-if capability to explore the impact of changing your major or adding a major or minor so you can understand the impact of a change before you decide!\nQuick Reference Guide\nSTEP 1 | Determine whether you are eligible to use the Degree Planner.\nStudents who are eligible to use the Degree Planner:\nMust be an undergraduate student\nMust be following the Fall 2014 or later GE pattern\nMust be following a major bulletin year of Fall 2018 or later\nNot eligible to use Degree Planner?\nYou can use your DPR to identify classes that will meet your remaining graduation requirements.\nVisit the Degree Progress Report (DPR) page\nfor guides and information.\nSTEP 2 | Access the Degree Planner within your Student Center.\nIf Degree Planner is available for your major and bulletin year, you can access Degree Planner from within your\nStudent Center\nunder Academics.  If “Degree Planner” shows in your Student Center, you are eligible – just click it and get started!\nSTEP 3 | Plan for Timely Degree Completion – Plan your entire academic path to graduation utilizing Degree Planner.\nYou can customize the Degree Planner in many ways to meet your needs:\nYou can set the terms and unit load that you plan to take, and the Planner will automatically provide updated recommendations.\nBy checking the “Lock” box, you can ensure the specified course will remain in that term.\nYou can review messages from your advisor in the “Advisor Message” section.\nYou’ll also want to select preferred classes for areas where you can select from a list of options, including General Education areas and Major electives.\nReview our\nQuick Reference Guide\nfor more tips on how to get started!\nDegree Planner Quick Reference Guide\n262.82 KB\nSTEP 4 | Plan your Class Schedule each semester.\nStart by reviewing and updating your Degree Planner.\nOnce the Registrar’s Office has notified you that it is time to plan for registration for the next semester, you should start by reviewing and updating your Degree Planner.  You can continue to refine your plan, selecting from available course lists and adjusting your planned unit totals.  Check the Class Schedule to make sure you’ve met any prerequisites for the classes you intend to take.\nThen, click on Gator Scheduler.\nOnce you are satisfied with your plan for the upcoming semester, simply click on\nGator Scheduler\nat the top of the page to proceed with making a schedule.\nLoad the courses from your plan into Gator Scheduler.\nGator Scheduler\nwill then prompt you with one click to load the courses from your plan.  Add any personal scheduling commitments or breaks you are trying to work around, and search for all the possible combinations to meet your plan!\nFinally, load your preferred schedule into your shopping cart.\nOnce you have a preferred course plan for that term, be sure to load it to your shopping cart.  It will save, so your class schedule will be ready for you when your priority registration appointment begins.\nSTEP 5 | Register for courses during your priority registration appointment.\nDuring your priority registration appointment you can double check your shopping cart to make sure classes are still open, make any changes necessary, and then register for your classes.  Be sure you go back to your Degree Planner if you need to adjust your schedule.  For more information about registering please visit:\nregistrar.sfsu.edu/cms/registering-classes\nSTEP 6 | Review and update your planner regularly as you proceed through your academic program.\nYou can access the Degree Planner once grades are available at the end of the term, to see if you need to make any changes to your next semester’s class schedule.\nAnd then, as registration approaches for the following term, access the Degree Planner again to prepare for your registration appointment. Once you have a preferred course plan for that term, be sure to load it to your shopping cart and check the Class Schedule to make sure you’ve met any prerequisites for the class.\nFAQ’s\nQ: Can I change my major through the Degree Planner tool?\nA:\nNo, you cannot change your \"official\" university record through Degree Planner.  You can however see a hypothetical plan through the\n\"What if?\n\" function.  This allows for you to see a complete degree plan if you were to add a new major or a minor.  If you decide to change or add a program of study, you can use our online\nChange of Major and Minor system.\nQ: Does Degree Planner plan for multiple majors and/or minors?\nA:\nYes, if the majors or minors in question are live in the Degree Planner. See Step 1 above for a list of which majors/minors are live in the Degree Planner.\nQ: Are course substitutions integrated into Degree Planner?\nA:\nYes, course substitutions are included in the Degree Planner, and are removed from the planned courses in the roadmap.\nTip: If you know a substitution has been submitted, but has not been processed, you may use the ‘Remove’ feature to move the requirement to the ‘Manually Removed Courses’ section at the bottom of the plan. Once the substitution is processed, the requirement will be satisfied and no longer appear in the \"Manually Removed Courses\" section of the Degree Planner.  Note that removing a requirement or course does not remove it from your degree requirements. If the substitution cannot be processed, you will still need to meet the requirement in another way.\nQ: What if I need assistance with my degree plan?\nCheck out the\nDegree Planner Quick Reference Guide\nfor a summary of the key features. Be sure to make an appointment with your advisor if you need assistance with degree planning.  Refer to the\nAcademic Advising Directory\non the Advising Hub website to find advising resources.\nQ: What is the difference between the Degree Planner, the Degree Progress Report (DPR), and the Degree Progress Report with planned courses?\nA:\nThe Degree Planner is a planning tool\n, which can be invaluable in helping you to plan and finish graduation requirements from your first semester on campus, as well as to understand how quickly these requirements can be completed.\nThe DPR is a degree audit tool\nthat can help you understand what requirements remain in your academic program.  It will show you overall which requirements have been met, which are in progress, and which have not been met.\nThe DPR w/ planned courses is also a degree audit tool that incorporates the courses that are currently planned in the Degree Planner\n. It will show you all elements in the DPR, but additionally shows which courses you have planned in your Planner.\nQ: How do I know if my plan meets all of the requirements for graduation?\nOnce you have made all your course selections, you can select DPR w/Planned Courses from the top of the Degree Planner page to review your Degree Progress Report including all the planned courses.  Blue stars will indicate requirements being satisfied by your planned courses.  Look out for the red boxes as those requirements still need attention.  Check to see that you have made all the course selections in your plan!\nQ: What is the difference between “Refresh Defaults” under Edit Preferences: “Refresh Suggestions” on the main screen and “Reset” on Arrange My Plan?\nA:\nRefresh Defaults\n– restores the term and unit preferences back to the default for that specific plan.\nRefresh Suggestions\n– sets the recommended order of courses back to default for the major, with the exception of courses that have been locked into a term.\nReset\n– allows you to undo drag and drop changes made during the current session.\nQ: How are changes saved in Degree Planner?\nA:\nDegree Planner saves automatically every time you make a change within the tool.\nSF State Gateway\nReturn to Registrar Guides",
    "url": "https://registrar.sfsu.edu/degreeplanner",
    "domain": "registrar.sfsu.edu"
  },
  {
    "source": "https://registrar.sfsu.edu/transcripts",
    "category": "registrar_general",
    "title": "Transcripts | Registrar's Office",
    "content": "Transcripts\nNeed Transcripts?\nOrder an eTranscript to send and receive orders immediately, or choose paper transcripts to send and receive orders using\nFedEx\nor\nStandard USPS\nshipping.\nSF State Gateway Login\nParchment Account Login or Creation\nIMPORTANT: Not all CEL programs create an SF State academic record. Please consult with your program department for more information on how to get proof of work completed or certificates earned.\nCurrent Students\nCurrently enrolled students or students who attended an SF State class in the last six months can use the below instructions to access SF State Gateway, order official transcripts, or download unofficial transcripts.\nOrdering Online | Step 1\nOpen\nSF State Gateway\nNavigate to the\nLaunchPad\nmenu\nClick the\nSee all apps\nbutton\nScroll down to the\nTools\nsection\nClick the\nOfficial Transcript\ntile\nSF State web services require\nTwo-Factor Authentication\n; if you do not already have this setup, please review\nNSP's how-to Guide\nor\nITS's FAQ\n.\nOrdering Online | Step 2\nYou will be redirected to\nParchment's Login\nportal\nNew users select\nNew Learner Account\nNote: In this instance, \"New Users\" include students who have never ordered from Parchment, as well as those who have only ordered before 08/31/2021.\nReturning users select\nExisting User Account\nFor transcript help about:\nAn electronic or paper order not received\nAn issue entering recipient information\nAn issue entering payment\nAny payment questions\neTranscript problems (wrong recipient, password reset, the order can't be accessed)\nParchment login issues\nPlease visit Parchment's\nSupport Center Dashboard\n.\nFor questions about transcript content, SF State Gateway, or holds, please email us at records@sfsu.edu, or call us at (415) 338-2350.\nOrdering Online | Transcript Costs\nCost Breakdown\nShipping Speed\nAmount\nParchment Orders\n---\neTranscripts\n$8.00\nDomestic, Regular Shipping (USPS)\n$10.50\nDomestic, Express Shipping (FEDEX)\n$40.00\nInternational, Regular Shipping (USPS)\n$13.40\nInternational, Express Shipping (FEDEX)\n$66.00\nIn Person Orders\nFor orders made\nonly on\ncampus.\nPlease call or email before coming in to ensure there are no holds on your record.\n$8.00\nBeginning January 6, 2025, sales tax will apply to certain document requests (including transcripts) in accordance with federal, state, and local tax regulations. For more information, please click the link below.\nSales Tax Update on Credential Requests\nOrdering by Mail or In-Person\nThe transcript request form can only request hard copy transcripts; if an electronic copy is needed, please order online through\nParchment\n.\nOfficial transcripts are not available for first-time students until after completion of their first semester.\nTranscript Request Form\nSend Options\nModality\nRequired Items\nBy Mail\nA photocopy of a valid government-issued photo ID\nA check or money order made out to\nSan Francisco State University.\nIn-Person\nA valid photo ID (either valid government ID or an SFSU Student ID)\nA check, money order, or cash\n.\nSF State's Bursar's Office\ncannot accept credit or debit cards.\nOrders made in person can\nonly receive two printed transcripts;\nif more are needed, they will be mailed.\nThrough a 3\nrd\nParty\nA written, signed, and dated authorization release from the requesting student\nA photocopy of a valid government-issued photo ID from\nBOTH\nthe third party and requesting student\nCheck made out to\nSan Francisco State University.\nAccessing Unofficial Transcripts\nAs a current student, unofficial transcripts are housed in your Student Center.\nDisable your browser's pop-up blocker or exempt SF State sites from being blocked\n. To learn how to disable your browser's pop-up security, visit the\nWikihow\nreference link\nbelow.\nIf you are a current student and a portion of your record is from before Spring 1985, we may need additional time to prepare your transcript using historical records.\nIf you cannot access the Student Center via Gateway, please use the\nAlternative Student Center Access\nlink.\nWikihow.com - Disable Pop-Up Blocker Guide\nAlternative Student Center Access\nLog in to\nGateway\nAs of 2021, SF State web services require Two-Factor Authentication; if you do not already have this setup, please review\nNSP's how-to Guide\nor\nITS's FAQ\n.\nNavigate to your\nLaunchpad\nClick the\nStudent Center\ntile\nOpen the\nother academic...\ndrop-down menu\nSelect\nTranscript: View Unofficial,\nclick the double arrow button\nIn\nReport Type\n, select\nSF State Unofficial Transcript,\nclick\nView Report\nRemember: Disable pop-up blockers or exempt SF State sites.\nFormer Students\nStudents who have not attended SF State recently (a gap of a year or more) no longer have access to their Student Center or unofficial transcripts, and must order official transcripts through Parchment\nOrdering Online\n1. Go to\nSF State's Parchment Login\n2. New users select\nNew Learner Account\nNote: In this instance, \"New Users\" include students who have never ordered from Parchment, as well as those who have only ordered before 08/31/2021.\n3. Returning users select\nExisting User Account\nFor transcript help about:\nAn electronic or paper order not received\nAn issue entering recipient information\nAn issue entering payment\nAny payment questions\neTranscript problems (wrong recipient, password reset, the order can't be accessed)\nParchment login issues\nPlease visit Parchment's\nSupport Center Dashboard\n.\nFor questions about transcript content, SF State Gateway, or holds, please email us at records@sfsu.edu, or call us at (415) 338-2350.\nOrdering by Mail or In-Person\nThe Transcript Request Form can only request hard copy transcripts; if an electronic copy is needed, please order online through\nParchment\n.\nRecords from before Spring 1985 require more processing time and same-day pick-up is usually unavailable.\nPlease review our Records Before 1985 Tab for additional details.\nTranscript Request Form\nSend Options\nModality\nRequired Items\nBy Mail\nA photocopy of a valid government-issued photo ID\nA check or money order made out to\nSan Francisco State University\nIn-Person\nA valid government-issued photo ID\nA check, money order, or cash\n.\nSF State's Bursar's Office\ncannot accept credit or debit cards\nOrders made in person can\nonly receive two printed transcripts\n; if more are needed, they will be mailed.\nThrough a 3\nrd\nParty\nA written and signed authorization from the requesting student\nA photocopy of a valid government-issued photo ID from\nBOTH\nthe third party and requesting student\nCheck made out to\nSan Francisco State University\nUnofficial Transcripts Not Available\nTo ensure system security and the safeguarding of your data and the data of everyone else whose data is in our systems, the CSU has mandated the de-provisioning of accounts for students who have not been enrolled for at least one year.\nThis means that students who have one or more years of non-attendance (either due to graduating or other reasons) will not be able to access the following account information:\nSFSU Email\nStudent Center\nUnofficial Transcripts\nStudents in this situation (no account access due to being gone 1+ years) who wish to access transcripts will have to order an official transcript. SF State ITS will not be able to password reset any student who has one or more years of non-attendance, as the account itself has been de-provisioned.\nOrdering Records From Before Spring 1985\nIf you attended Spring 1985 or earlier, you must use our\nTranscript Request Form\n.\nIf exact dates of attendance are not known, then use best estimate. Also, use\nSF State's ID Lookup\nto verify if an online record is available.\nTranscript Request Form\nSF State ID Lookup\nSend Options\nModality\nRequired Items\nBy Mail\nA photocopy of a valid government-issued photo ID\nA check or money order made out to\nSan Francisco State University\nIn-Person\nA valid government-issued photo ID\nA check, money order, or cash.\nSF State's Bursar's Office\ncannot accept credit or debit cards\nOrders made in person can only receive two printed transcripts; if more are needed, they will be mailed.\nThrough a 3rd Party\nA written and signed authorization from the requesting student\nA valid government-issued photo ID from BOTH the third party and requesting student\nCheck made out to San Francisco State University\nArchive Transcript Costs\nIMPORTANT: Due to these records being archived, shipping times are subject to change. Please call (415)338-2350 or email records@sfsu.edu for more information.\nCost Breakdown\nShipping Speed\nAmount\nElectronic\nNot all archived records qualify for electronic ordering.\nFor more information, please call (415) 338-2350 or email\nrecords@sfsu.edu\n.\n$8.00\nIn Person Pickup\nFor orders made only on campus.\nSame-day pickup may not be possible; please call (415) 338-2350 or email\nrecords@sfsu.edu\nbefore coming in.\n$8.00\nDomestic, Regular Shipping (USPS)\n$10.50\nInternational, Regular Shipping (USPS)\n$13.40\nBeginning January 6, 2025, sales tax will apply to certain document requests according to federal, state, and local tax regulations. For more information, please click the link below.\nSales Tax Update on Credential Requests\nSF State Gateway\nReturn to Registrar Guides",
    "url": "https://registrar.sfsu.edu/transcripts",
    "domain": "registrar.sfsu.edu"
  },
  {
    "source": "https://registrar.sfsu.edu/verification",
    "category": "registrar_general",
    "title": "Verifications | Registrar's Office",
    "content": "Verifications\nLog into\nSF State Gateway\nNavigate to your\nLaunchPad\nSelect the\nStudent Center\ntile\nEnrollment Verification Certificate (Official)\nStudents can download an enrollment verification certificate using the National Student Clearinghouse MyHub. The enrollment verification certificate is official and can be used to verify your enrollment with third parties, such as employers and housing.\nNote:\nTranscripts cannot be ordered via MyHub. Transcripts must be ordered through\nParchment\n.\nCurrent students\nshould log in directly to the\nSFSU School Log In\n.\nFormer students\nwill need to create a\nSocial Log In\nusing either a LinkedIn or Google account.\nNote:\nEnrollment before 2009 may not be available digitally. Please contact the Registrar's Office at\nrecords@sfsu.edu\nfor other verification options.\nClick on the Enrollment History tile in the Dashboard.\nClick on the carrot to expand the Term.\nClick the Download Certificate button.\nUnder Download an Enrollment Certificate, select a School and Certificate Type. Note that Current Enrollment Certificate will produce the Term previously selected.\nClick the Download Certificate button.\nYour enrollment verification certificate will be available in your Downloads. If you open your certificate in a browser, save a copy to your computer. You can forward this certificate to third parties to officially verify your enrollment.\nStudent Center Verifications\nOpen the\nother academic...\ndrop-down menu\nSelect\nEnrollment Verification\nWhen asked to select\nprocessing options\n,\nselect:\nAllow to Print from My Browser\nfrom the first drop-down box.\nMark the check boxes for the academic information that should be included in the report.\nSelect the term that should be included in the report, or leave it blank for all terms.\nClick the\nSUBMIT\nbutton to generate the Enrollment Verification.\nTo print the results, click\nPRINTER FRIENDLY VERSION\nand print or save to a file.\nThe Registrar's Office will stamp and seal the form for free\nupon request\nby the student.\nThe official stamp and seal\nwill not be available until after the drop deadline\nof the current semester.\nApplied for Graduation Verification\nIf you have applied for graduation and need to verify your status, you can confirm your status through your Student Center.\nIn the Academics section, click the\nMy Academics\nlink.\nYour application status and expected graduation term are in the\nMy Program\nbox.\nEmployer & Third Party Requests\nVerification requests from employers or third parties for current enrollment or degrees are processed by the\nNational Student Clearinghouse (NSC)\n.\nContact the NSC By:\nPhone\n: (703) 742-4200\nWeb\n:\nwww.nslc.org\nSchool Code\n: 001154\nNotarized Verification Requests\nRequests requiring notarized verification cost\n$10.00 per letter\n.\nWe\ndo not\nprovide an Apostille or Certification from the California Secretary of State.\nWe\ndo provide\nthe needed material for SF State students and Alumni to obtain an Apostille or Certification from the California Secretary of State.\nVisit the\nCalifornia Secretary of State's site\nto find out how to obtain an Apostille or Certification once you have all the needed materials.\nPlease use the\nNotary Request\nform for further instruction.\nNotary Request Form\nAll Other Verification Requests\nIf the above options do not apply, then please email\nrecords@sfsu.edu\nthe following:\nStudents/Applicants\nFull Legal Name\nAttached\nRecords Release form\nfilled out by the Student/Applicant\nAnd a\nbrief\ndescription of the request\nEmail RECORDS Your Request\nSF State Gateway\nReturn to Registrar Guides",
    "url": "https://registrar.sfsu.edu/verification",
    "domain": "registrar.sfsu.edu"
  }
]